[
  {
    "SurahNumber": "34",
    "AyahNumber": "1",
    "NoteID": "3785",
    "Body": "All Creation declares His Praises, i.e., manifests His\\n\\t\\t\\t\\tMercy and Power, Goodness and Truth, all the sublime\\n\\t\\t\\t\\tattributes summed up in His Most Beautiful Names (vii.\\n\\t\\t\\t\\t180 and xvii 110 and notes). For man to contrmplate these\\n\\t\\t\\t\\tis in itself a Revelation. This sentiment opens five\\n\\t\\t\\t\\tSuras of the Qur-an evenly distributed, viz., i., vi.,\\n\\t\\t\\t\\txviii., xxxiv., and xxxv. Here the point most emphasised\\n\\t\\t\\t\\tis that His wisdom and mercy comprehend all things,\\n\\t\\t\\t\\textended in space or in time-here and everywhere, now and\\n\\t\\t\\t\\tevermore."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "2",
    "NoteID": "3786",
    "Body": "An ignorant man may think that water absorbed in the soil\\n\\t\\t\\t\\tor seed sown beneath the sod is lost, but it replenishes\\n\\t\\t\\t\\tnumerous rills, and streams, and feeds and sustains\\n\\t\\t\\t\\tnumerous roots and forms of life, and throws up all kinds\\n\\t\\t\\t\\tof vegetable life. So with things that come out of the\\n\\t\\t\\t\\tearth: who can count the myriad forms of herbs and trees\\n\\t\\t\\t\\tthat grow and perish, and yet sustain a continuous life\\n\\t\\t\\t\\tfor ages and ages? Yet these are symbolical of other\\n\\t\\t\\t\\tthings or entities beyond time or space, and beyond\\n\\t\\t\\t\\tphysical form. We see the birth and death of the animal\\n\\t\\t\\t\\tpart of man: When he is buried beneath the soil, the\\n\\t\\t\\t\\tignorant man thinks there is an end of him."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "2",
    "NoteID": "3787",
    "Body": "The vapours that rise from the earth and ascend to the\\n\\t\\t\\t\\tsky descend again as rain and snow and as symbols of\\n\\t\\t\\t\\tAllah's Mercy. So are the prayers of the devout and the\\n\\t\\t\\t\\tcall of those in agony for help and light, answered by\\n\\t\\t\\t\\tthe descent of mercy and guidance, hlep and light from\\n\\t\\t\\t\\tAllah. Do not forget that, just as there is the element\\n\\t\\t\\t\\tof Mercy, so there is an element of Justice and\\n\\t\\t\\t\\tPunishment."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "3",
    "NoteID": "3788",
    "Body": "The last two verses prepared us to realise the position\\n\\t\\t\\t\\tof Unbelievers in Allah's great Universe. They are the\\n\\t\\t\\t\\tdiscord in the universal harmony of Prayer and Praise.\\n\\t\\t\\t\\tTheir existence is due to the grant of a limited\\n\\t\\t\\t\\tfree-will, the Trust which the Unbelievers have betrayed\\n\\t\\t\\t\\t(see xxxiii. 72 and notes). But they must and will be\\n\\t\\t\\t\\teliminated: see verse 5 below. For there is nothing more\\n\\t\\t\\t\\tcertain in the world, physical, moral, and spiritual,\\n\\t\\t\\t\\tthan that every cause, great or small, must have its\\n\\t\\t\\t\\tcorresponding consequences."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "3",
    "NoteID": "3789",
    "Body": "The strongest emphasis and the most perfect assurance of\\n\\t\\t\\t\\tcertainty are indicated by reference to the authority of\\n\\t\\t\\t\\tAllah Himself, the Ruler of the Day of Judgment."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "3",
    "NoteID": "3790",
    "Body": "In the symbolical language of our own human experience, a\\n\\t\\t\\t\\trecord is more enduring than memory: in fact (if properly\\n\\t\\t\\t\\tpreserved) it is perpetual. If, further, it is expressed\\n\\t\\t\\t\\tin clear language, without any obscurity, it can always\\n\\t\\t\\t\\tbe read with perfect precision and without any doubt\\n\\t\\t\\t\\twhatever. Apply these qualities, free from human defect\\n\\t\\t\\t\\tto Allah's laws and decrees. They are unerring and\\n\\t\\t\\t\\tenduring. Everything, greater or small, will receive due\\n\\t\\t\\t\\trecognition-a Reward for Good and a Punishment for Evil."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "4",
    "NoteID": "3791",
    "Body": "\"Sustenance\": Spiritual in things spiritual, and physical\\n\\t\\t\\t\\tin things physical. It implies not only the satisfaction\\n\\t\\t\\t\\tof desire, but the provision of means for sustaining the\\n\\t\\t\\t\\tground won and for winning more ground in the march of\\n\\t\\t\\t\\tprogress."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "5",
    "NoteID": "3792",
    "Body": "Cf. xxii. 51. Allah's Plan cannot be frustrated. It is\\n\\t\\t\\t\\tthose who work against it, who will be eliminated and\\n\\t\\t\\t\\tdestroyed."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "6",
    "NoteID": "3793",
    "Body": "Against the doubts and vain imaginings of the Ignorant is\\n\\t\\t\\t\\tthe certainty of knowledge of the Englightened: that\\n\\t\\t\\t\\tAllah reveals Himself, and that His Revelation is true,\\n\\t\\t\\t\\tand leads to the Path of true Guidance. That Path is the\\n\\t\\t\\t\\tPath of Allah, Who, in His infinite Love and Mercy, is\\n\\t\\t\\t\\tWorthy of all Praise. It is possible to connect this with\\n\\t\\t\\t\\tthe \"Record Perspicuous\" in verse 3 above: 'it is\\n\\t\\t\\t\\tperspicuous...for the Englightened do see...'"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "7",
    "NoteID": "3794",
    "Body": "This is a taunt against the holy Prophet, and it is\\n\\t\\t\\t\\tapplicable to all who preach the doctrine of a Future\\n\\t\\t\\t\\tLife. How is it possible, say the Unbelievers, that when\\n\\t\\t\\t\\ta man's body is reduced to dust and scattered about, the\\n\\t\\t\\t\\tman should rise again and become a new Creation? They add\\n\\t\\t\\t\\tthat such a preacher is inventing a deliberate falsehood\\n\\t\\t\\t\\tor is demented."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "8",
    "NoteID": "3795",
    "Body": "The answer is: the Future Life is the truest of all\\n\\t\\t\\t\\tTruths; so far is the man who teaches it from being\\n\\t\\t\\t\\tdemented, that it is those who deny it, that lack\\n\\t\\t\\t\\tknowledge and are in real jeopardy for their souls; for\\n\\t\\t\\t\\tthey persecute Truth and must not only suffer defeat, but\\n\\t\\t\\t\\tgo farther and farther from Realities and thus suffer the\\n\\t\\t\\t\\tworst hallucination about the next world."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "NoteID": "3796",
    "Body": "The men who walk in spiritual darkness and laugh at a\\n\\t\\t\\t\\tHereafter have but to observe the Power of Allah in the\\n\\t\\t\\t\\tnature around them. He Who created the heavens and the\\n\\t\\t\\t\\tearth and sustains them can surely make a new Creation!\\n\\t\\t\\t\\tAnd the cosmic Laws which are so just and inevitable\\n\\t\\t\\t\\tshould surely give them an idea of the inexorable Justice\\n\\t\\t\\t\\tthat must redress all balance."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "NoteID": "3797",
    "Body": "Cf. xvi. 45, and n. 2071. Who are these puny\\n\\t\\t\\t\\tcreatures-sceptics that question the might and majesty of\\n\\t\\t\\t\\tAllah?"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "NoteID": "3798",
    "Body": "Cf. xxvi. 187. This was actually a challenge hurled at\\n\\t\\t\\t\\tShu'aib and a shower of ashes and cinders came from above\\n\\t\\t\\t\\tand overwhelmed the challengers!"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "10",
    "NoteID": "3799",
    "Body": "Cf. xxi. 79-80, and notes 2733-34. David had the gift of\\n\\t\\t\\t\\tsong and sacred music, and this is shown in his Psalms.\\n\\t\\t\\t\\tAll nature-hills and birds-sing and echo back the Praises\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "10",
    "NoteID": "3800",
    "Body": "Iron or steel is hard stuff: but in the hands of a\\n\\t\\t\\t\\tcraftsman it becomes soft and pliable, and with it can be\\n\\t\\t\\t\\tmade instruments for the defence of righteousness. These,\\n\\t\\t\\t\\tin the literal sense, are coats of mail, and defensive\\n\\t\\t\\t\\tarmour, and the manufacture of them is traditionally\\n\\t\\t\\t\\tattributed to David."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "11",
    "NoteID": "3801",
    "Body": "Coats of chain armour have to be made with cunning art,\\n\\t\\t\\t\\tif the chains are to fit into each other and the whole\\n\\t\\t\\t\\tgarment is to be worn in comfort in fierce warfare."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "11",
    "NoteID": "3802",
    "Body": "Note the transition from the singular, \"make them coats\\n\\t\\t\\t\\tof mail\", to the plural \"and work ye righteousness\". The\\n\\t\\t\\t\\tfirst is addressed to David, who was the artificer of\\n\\t\\t\\t\\tdefensive armour; and the second is addressed to him and\\n\\t\\t\\t\\this whole people. He made the armour, but it was to be\\n\\t\\t\\t\\tworn not only by him but all the warriors. But he and all\\n\\t\\t\\t\\this people were to be careful to see that they did not\\n\\t\\t\\t\\tdeviate from the paths of righteousness. Fighting is a\\n\\t\\t\\t\\tdangerous weapon and may well degenerate (as it so often\\n\\t\\t\\t\\tdoes) into mere violence. They were to see that this\\n\\t\\t\\t\\tshould not happen, and they were told that Allah was\\n\\t\\t\\t\\twatching over them all with the personal solicitude\\n\\t\\t\\t\\timplied in the singular pronoun \"I\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "12",
    "NoteID": "3803",
    "Body": "Cf. xxi. 81-82, n. 2736, and xxxviii. 36-38. See also\\n\\t\\t\\t\\txxvii. 38-39. The winds are swift and can cover in a\\n\\t\\t\\t\\tshort morning's or evening's flight the distance which it\\n\\t\\t\\t\\ttakes a whole month to cover on foot or by bullock cart.\\n\\t\\t\\t\\tIn our own day, with air speeds of 400 miles and more per\\n\\t\\t\\t\\thour, this seems a moderate statement."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "12",
    "NoteID": "3804",
    "Body": "In the Old Testament, II. Chronicles, Chapters iii., and\\n\\t\\t\\t\\tiv., are described the various costly materials with\\n\\t\\t\\t\\twhich Solomon's Temple was built, and it was furnished\\n\\t\\t\\t\\twith vessels, candle-sticks, lamps, censers, etc.\\n\\t\\t\\t\\t\"Solomon made all these vessels in great abundance: for\\n\\t\\t\\t\\tthe weight of the brass could not be found out\" (II.\\n\\t\\t\\t\\tChronicles, iv. 18)."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "12",
    "NoteID": "3805",
    "Body": "See xxvii. 17, and n. 3257."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "13",
    "NoteID": "3806",
    "Body": "Mihrab (Plural Maharib), translated \"arch\", may be\\n\\t\\t\\t\\tapplied to any fine, elevated, spacious architectural\\n\\t\\t\\t\\tstructure. As the reference here is to the Temple of\\n\\t\\t\\t\\tSolomon, the word \"arches\" is I think most appropriate.\\n\\t\\t\\t\\t\"Arches\" would be structural Ornaments in the Temple.\\n\\t\\t\\t\\tImages would be like the images of oxen and Cherubim\\n\\t\\t\\t\\tmentioned in II. Chronicles, iv. 3 and iii. 14; the\\n\\t\\t\\t\\tBasons (11. Chronicles iv. 22) were perhaps huge dishes\\n\\t\\t\\t\\tround which many men could sit together and eat,\\n\\t\\t\\t\\taccording to ancient Eastern custom, while the cooking\\n\\t\\t\\t\\tCauldrons or Pots (II. Chronicles, iv. 16), were fixed in\\n\\t\\t\\t\\tone place, being so large in capacity that they could not\\n\\t\\t\\t\\tbe moved about. Indian readers will get some idea of them\\n\\t\\t\\t\\tfrom the huge cooking Degs, which they use in the\\n\\t\\t\\t\\tfestivals."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "13",
    "NoteID": "3807",
    "Body": "The building of the Temple was a great event in Israelite\\n\\t\\t\\t\\thistory. They are asked to be thankful without which all\\n\\t\\t\\t\\tthat glory and power would be out of place, and it fell\\n\\t\\t\\t\\taway in a few generations, with the decline of the moral\\n\\t\\t\\t\\tspirit which was at its back."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "14",
    "NoteID": "3808",
    "Body": "This statement illustrates three points: (1) however\\n\\t\\t\\t\\tgreat and glorious human power and grandeur may be, it is\\n\\t\\t\\t\\tonly for a time, and it may fade away even before people\\n\\t\\t\\t\\tknow of its decline; (2) the most remarkable events may\\n\\t\\t\\t\\tbe brought to light, not by a flourish of trumpets, but\\n\\t\\t\\t\\tby a humble individual, unknown and unseen, who works\\n\\t\\t\\t\\timperceptibly and undermines even so strong a thing as\\n\\t\\t\\t\\tstaff, on which a great man may lean; (3) work done by\\n\\t\\t\\t\\tmen merely on the basis of brute Strength or fear, as in\\n\\t\\t\\t\\tthe case of the Jinns, will not endure. This is brought\\n\\t\\t\\t\\tup in strong contrast against the Power and Majesty of\\n\\t\\t\\t\\tAllah, which will endure, which cannot be sapped, and\\n\\t\\t\\t\\twhich can only be fully appreciated by a training of the\\n\\t\\t\\t\\twill and heart. In the same way, in David's story above,\\n\\t\\t\\t\\this mighty strength as a warrior (see ii. 251) and his\\n\\t\\t\\t\\tskill in making armour are only to be valued when used,\\n\\t\\t\\t\\tas it was used, in the service of Allah, in righteous\\n\\t\\t\\t\\tworks (xxxiv. 1 1)."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "14",
    "NoteID": "3809",
    "Body": "The Jinns looked upon their work as a Penalty, and so it\\n\\t\\t\\t\\tbecame to them. The people who worked at the Temple of\\n\\t\\t\\t\\tSolomon as the People of David worked and gloried in\\n\\t\\t\\t\\ttheir work as a thanksgiving to Allah, and their work\\n\\t\\t\\t\\tbecame sanctified. The Jinns knew nothing of hidden\\n\\t\\t\\t\\tsecrets; they only saw the obvious, and had not even the\\n\\t\\t\\t\\tsignificance of the little worm that slowly gnawed away\\n\\t\\t\\t\\tSolomon's staff."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "15",
    "NoteID": "3810",
    "Body": "This is the same city and territory in Yemen as is\\n\\t\\t\\t\\tmentioned in xxvii. 22: see note there as to its\\n\\t\\t\\t\\tlocation. There the period was the time of Solomon and\\n\\t\\t\\t\\tQueen Bilqis. Here it is some centuries later. It was\\n\\t\\t\\t\\tstill a happy and prosperous country, amply irrigated\\n\\t\\t\\t\\tfrom the Maarib dam. Its roads or perhaps its canals,\\n\\t\\t\\t\\twere skirted by gardens on both sides, right and left: at\\n\\t\\t\\t\\tany given point, you always saw two gardens. It produced\\n\\t\\t\\t\\tfruit, spices, and frankincense, and got the name of\\n\\t\\t\\t\\tAraby the Blest for that part of the country."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "15",
    "NoteID": "3811",
    "Body": "The land was fair to look upon; the people happy and\\n\\t\\t\\t\\tprosperous; and they enjoyed the blessings of Allah, Who\\n\\t\\t\\t\\tis Gracious and does not punish small human faults or\\n\\t\\t\\t\\tweaknesses."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "16",
    "NoteID": "3812",
    "Body": "Into that happy Garden of Eden in Arabia Felix (Araby the\\n\\t\\t\\t\\tBlest) came the insidious snake of Unfaith and\\n\\t\\t\\t\\tWrongdoing. Perhaps the people became arrogant of their\\n\\t\\t\\t\\tprosperity, or of their science, or of their skill in\\n\\t\\t\\t\\tirrigation engineering, in respect of the wonderful works\\n\\t\\t\\t\\tof the Dam which their ancestors had constructed. Perhaps\\n\\t\\t\\t\\tthey got broken up into rich and poor, privileged and\\n\\t\\t\\t\\tunprivileged, high-caste and low-caste, disregarding the\\n\\t\\t\\t\\tgifts and closing the opportunities given by Allah to all\\n\\t\\t\\t\\tHis creatures. Perhaps they broke the laws of the very\\n\\t\\t\\t\\tNature which fed and sustained them. The Nemesis came. It\\n\\t\\t\\t\\tmay have come suddenly, or it may have come slowly. The\\n\\t\\t\\t\\tpent-up waters of the eastern side of the Yemen highlands\\n\\t\\t\\t\\twere collected in a high lake confined by the Dam of\\n\\t\\t\\t\\tMaarib. A mighty flood came; the dam burst; and it has\\n\\t\\t\\t\\tnever been repaired since. This was a spectacular crisis:\\n\\t\\t\\t\\tit may have been preceded and followed by slow\\n\\t\\t\\t\\tdesiccation of the country."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "16",
    "NoteID": "3813",
    "Body": "\"Arim\" ( = Dams or Embankments) may have been a proper\\n\\t\\t\\t\\tnoun, or may simply mean the great earth-works fined with\\n\\t\\t\\t\\tstone, which formed the Maarib dam, of which traces still\\n\\t\\t\\t\\texist. The French traveller T.J. Arnaud saw the town and\\n\\t\\t\\t\\truins of the Dam of Maarib in 1843, and described its\\n\\t\\t\\t\\tgigantic works and its inscriptions: See Journal\\n\\t\\t\\t\\tAsiatique for January 1874: the account is in French. For\\n\\t\\t\\t\\ta secondary account in English, see W.B. Harris, Journey\\n\\t\\t\\t\\tThrough Yemen, Edinburgh, 1893. The dam as measured by\\n\\t\\t\\t\\tArnaud was two miles long and 120 ft. high. The date of\\n\\t\\t\\t\\tits destruction was somewhere about 120 A.D., though some\\n\\t\\t\\t\\tauthorities put it much later."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "16",
    "NoteID": "3814",
    "Body": "The flourishing \"Garden of Arabia\" was converted into a\\n\\t\\t\\t\\twaste. The luscious fruit trees became wild, or gave\\n\\t\\t\\t\\tplace to wild plants with bitter fruit. The feathery\\n\\t\\t\\t\\tleaved tamarisk, which is only good for twigs and\\n\\t\\t\\t\\twattle-work, replaced the fragrant plants and flowers.\\n\\t\\t\\t\\tWild and stunted kinds of thorny bushes, like the wild\\n\\t\\t\\t\\tLote-tree, which were good for neither fruit nor shade,\\n\\t\\t\\t\\tgrew in place of the pomegranates, the date-palms and the\\n\\t\\t\\t\\tgrape-vines. The Lote-tree belongs to the family\\n\\t\\t\\t\\tRhamnaceae, Zizyphus Spina Christi, of which (it is\\n\\t\\t\\t\\tsupposed) Christ's crown of thorns was made, allied to\\n\\t\\t\\t\\tthe Zizyphus Jujuba, or ber tree of India. Wild, it is\\n\\t\\t\\t\\tshrubby, thorny and useless. In cultivation it bears good\\n\\t\\t\\t\\tfruit, and some shade, and can be thornless, thus\\n\\t\\t\\t\\tbecoming a symbol of heavenly bliss: lvi. 28."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "17",
    "NoteID": "3815",
    "Body": "Kafur: intensive form: \"those who deliberately and\\n\\t\\t\\t\\tcontinuously reject Allah and are ungrateful for His\\n\\t\\t\\t\\tMercies, as shown by their constant wrong-doing."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "18",
    "NoteID": "3816",
    "Body": "An instance is now given of the sort of covetousness on\\n\\t\\t\\t\\tthe part of the people of Saba, which ruined their\\n\\t\\t\\t\\tprosperity and trade and cut their own throats. The old\\n\\t\\t\\t\\tFrankincense route was the great Highway (imam mubin xv.\\n\\t\\t\\t\\t79; sabil muqim, xv. 76) between Arabia and Syria.\\n\\t\\t\\t\\tThrough Syria it connected with the great and flourishing\\n\\t\\t\\t\\tKingdoms of the Euphrates and Tigris valleys on the one\\n\\t\\t\\t\\thand and Egypt on the other, and with the great Roman\\n\\t\\t\\t\\tEmpire round the Mediterranean. At the other end, through\\n\\t\\t\\t\\tthe Yemen Coast, the road connected, by sea transport,\\n\\t\\t\\t\\twith India, Malaya, and China. The Yemen-Syria road was\\n\\t\\t\\t\\tmuch frequented, and Madain Salih was one of the stations\\n\\t\\t\\t\\ton that route, and afterwards on the Pilgrim route: see\\n\\t\\t\\t\\tAppendix No: 4 to S. xxvi. Syria was the land on which\\n\\t\\t\\t\\tAllah \"had poured His blessings\", being a rich fertile\\n\\t\\t\\t\\tcountry, where Abraham had lived: it includes the Holy\\n\\t\\t\\t\\tLand of Palestine. The route was studded in the days of\\n\\t\\t\\t\\tits prosperity with many stations (cities) close to each\\n\\t\\t\\t\\tother, on which merchants could travel with ease and\\n\\t\\t\\t\\tsafety, \"by night and by day\". The close proximity of\\n\\t\\t\\t\\tstations prevented the inroads of highwaymen."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "19",
    "NoteID": "3817",
    "Body": "Said: in this and other places in the Qur-an, \"language\"\\n\\t\\t\\t\\tis used for thought or deed. The Commentators call it the\\n\\t\\t\\t\\t\"language of actual facts\" (zaban hal) as opposed to the\\n\\t\\t\\t\\t\"language of words\" (zaban qal)."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "19",
    "NoteID": "3818",
    "Body": "The covetous Saba people, in order to get more profit\\n\\t\\t\\t\\tfrom travellers' supplies by concentrating them on a few\\n\\t\\t\\t\\tstations which they could monopolise, tended to choke off\\n\\t\\t\\t\\ttraffic and ruin the big trade. Selfishness often runs\\n\\t\\t\\t\\tcounter to true self-interest. It is a historical fact\\n\\t\\t\\t\\tthat the great Yemen-Syria route in Arabia declined with\\n\\t\\t\\t\\tthe decline of Yemen. There were no doubt physical\\n\\t\\t\\t\\tcauses, but supreme above all were the moral causes, the\\n\\t\\t\\t\\tgrasping nature of the people, and their departure from\\n\\t\\t\\t\\tthe highest standards of righteousness."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "19",
    "NoteID": "3819",
    "Body": "The people of Saba were given every chance. They had\\n\\t\\t\\t\\tprosperity, skill, trade and commerce, and a healthy and\\n\\t\\t\\t\\tbeautiful country. They also had, apparently, great\\n\\t\\t\\t\\tvirtues, and as long as they remained true to their\\n\\t\\t\\t\\tvirtues, i.e., to the Law of Allah, they remained happy\\n\\t\\t\\t\\tand contented. But when they became covetous and selfish,\\n\\t\\t\\t\\tand became jealous of other people's prosperity instead\\n\\t\\t\\t\\tof rejoicing in it, they fell from grace and declined. It\\n\\t\\t\\t\\tmay be that the climate changed, the rainfall became\\n\\t\\t\\t\\tscantier, perhaps on account of the cutting down of hill\\n\\t\\t\\t\\tforests; trade routes changed, on account of the people\\n\\t\\t\\t\\tfalling off in the virtues that make men popular: behind\\n\\t\\t\\t\\tall the physical causes was the root-cause, that they\\n\\t\\t\\t\\tbegan to worship mammon, self, greed, or materialism.\\n\\t\\t\\t\\tThey fell into the snare of Satan. They gradually passed\\n\\t\\t\\t\\tout of history, and became only a name in a story. Moral:\\n\\t\\t\\t\\tit is only Allah's Mercy that can give true happiness or\\n\\t\\t\\t\\tprosperity, and happiness or prosperity is only a snare\\n\\t\\t\\t\\tunless used for the highest service of Allah and man."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "20",
    "NoteID": "3820",
    "Body": "Cf. xvii. 62. Satan out of arrogance had said, when he\\n\\t\\t\\t\\tasked for respite from the Most High; \"I will bring\\n\\t\\t\\t\\t(Adam's) descendants under my sway, all but a few.\" This\\n\\t\\t\\t\\twas now proved true on the Saba people. He had no power\\n\\t\\t\\t\\tto force them. It was their own will that went wrong and\\n\\t\\t\\t\\tput them into his power."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "21",
    "NoteID": "3821",
    "Body": "Might test: the word in the original is might know. It is\\n\\t\\t\\t\\tnot that Allah does not know all. Why does He want to\\n\\t\\t\\t\\ttest? It is in order to help us subjectively, to train\\n\\t\\t\\t\\tour will, to put us definitely the question, \"Will you\\n\\t\\t\\t\\tobey Allah or other than Allah?\" Cf. n. 467 to iii. 154."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "22",
    "NoteID": "3822",
    "Body": "Other objects of worship, such as Self, or Money, or\\n\\t\\t\\t\\tPower, or things we imagine will bring us luck or\\n\\t\\t\\t\\tprosperity, though they can do nothing of the kind."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "22",
    "NoteID": "3823",
    "Body": "The false gods have no power whatever either in heaven or\\n\\t\\t\\t\\ton earth, either in influencing our spiritual life or our\\n\\t\\t\\t\\tordinary worldly life. To suppose that they have some\\n\\t\\t\\t\\tshare, or that they can give some help to Allah, even\\n\\t\\t\\t\\tthough Allah is Supreme, is both false and blasphemous.\\n\\t\\t\\t\\tAllah is One and Supreme, without sharer, helper, or\\n\\t\\t\\t\\tequal."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "23",
    "NoteID": "3824",
    "Body": "Cf. xx. 109, n. 2634, where I have explained the two\\n\\t\\t\\t\\tpossible modes of interpretation. Each soul is\\n\\t\\t\\t\\tindividually and personally responsible. And if there is\\n\\t\\t\\t\\tany intercession, it can only be by Allah's gracious\\n\\t\\t\\t\\tpermission. For the Day of judgment will be a terrible\\n\\t\\t\\t\\tDay, or Day of Wrath (Dies Irae) according to the Latin\\n\\t\\t\\t\\thymn, when the purest souls will be stupefied at the\\n\\t\\t\\t\\tmanifestation of Allah's Power. See next note."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "23",
    "NoteID": "3825",
    "Body": "\"Their hearts\": the pronoun \"their\" is referred to the\\n\\t\\t\\t\\tangels nearest to Allah. On the Day of Judgment there\\n\\t\\t\\t\\twill be such an irresistible manifestation of Power that\\n\\t\\t\\t\\teven they will be silent for a while, and will scarcely\\n\\t\\t\\t\\trealise what is happening. They will question each other,\\n\\t\\t\\t\\tand only thus will they regain their bearings. Or \"their\"\\n\\t\\t\\t\\tmay refer to those who seek intercession."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "23",
    "NoteID": "3826",
    "Body": "In their mutual questionings they will realise that\\n\\t\\t\\t\\tAllah's Judgment, as always, is right and just."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "24",
    "NoteID": "3827",
    "Body": "There are six propositions introduced here with the word\\n\\t\\t\\t\\t\"Say\", at verses 22, 24, 25, 26, 27, and 30. They clearly\\n\\t\\t\\t\\texplain the doctrine of Unity (verse 22), the Mercy of\\n\\t\\t\\t\\tAllah (verse 24), man's Personal Responsibility (verse\\n\\t\\t\\t\\t25), the Final Justice of Allah (verse 26), Allah's Power\\n\\t\\t\\t\\tand Wisdom (verse 27), and the Inevitability of the\\n\\t\\t\\t\\tJudgment, by which true values will be restored (verse\\n\\t\\t\\t\\t30)."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "24",
    "NoteID": "3828",
    "Body": "Right and Wrong, Good and Evil, are incompatible, one\\n\\t\\t\\t\\twith another. In this matter we can make no compromise.\\n\\t\\t\\t\\tIt is true that in men there may be various degrees of\\n\\t\\t\\t\\tgood or evil mixed together, and we have to tolerate men\\n\\t\\t\\t\\tas our fellow-creatures, with all their faults and\\n\\t\\t\\t\\tshortcomings. But this does not mean that we can worship\\n\\t\\t\\t\\tAllah and Mammon together. Wrong is the negation of Right\\n\\t\\t\\t\\tas light is of darkness. Though there may be apparently\\n\\t\\t\\t\\tvarying depths of darkness, this is only due to the\\n\\t\\t\\t\\timperfection of our vision: it is varying strengths of\\n\\t\\t\\t\\tlight as perceived by our relative powers of sight. So we\\n\\t\\t\\t\\tmay perceive the Light of Allah in varying degrees\\n\\t\\t\\t\\taccording to our spiritual vision. But in simple\\n\\t\\t\\t\\tquestions of Right or Wrong, we are faced by the\\n\\t\\t\\t\\tCategorical Imperative."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "25",
    "NoteID": "3829",
    "Body": "Therefore do not persecute us, or bring personal animus\\n\\t\\t\\t\\tto bear on us. We must do our duty in declaring the\\n\\t\\t\\t\\tuniversal Message, which is for you as much as for us."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "26",
    "NoteID": "3830",
    "Body": "Human controversies are vain and inconclusive. If you put\\n\\t\\t\\t\\tyour trust in Allah and we put our trust in Allah, we\\n\\t\\t\\t\\tbelong to one Brotherhood, and we shall see the perfect\\n\\t\\t\\t\\tTruth finally when the Time comes."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "27",
    "NoteID": "3831",
    "Body": "Wisdom and Power only belong to Allah. If you put your\\n\\t\\t\\t\\ttrust in other things, they will fail you, because they\\n\\t\\t\\t\\tdo not exist-as objects of worship. All else that you set\\n\\t\\t\\t\\tyour hearts upon will and must fail you, because they\\n\\t\\t\\t\\tcannot in any wise be brought into rivalry with Allah."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "28",
    "NoteID": "3832",
    "Body": "Allah's Revelation, through the holy Prophet, was not\\n\\t\\t\\t\\tmeant for one family or tribe, one race or set of people.\\n\\t\\t\\t\\tIt was meant for all mankind, to whom, if they turn to\\n\\t\\t\\t\\tAllah, it is a Message of the glad tidings of His Mercy,\\n\\t\\t\\t\\tand if they do not turn to Him, it is a warning against\\n\\t\\t\\t\\tsin and the inevitable Punishment. That the Punishment\\n\\t\\t\\t\\tdoes not come immediately (as far as they perceive) is no\\n\\t\\t\\t\\treason for doubting it. It has been declared in clear and\\n\\t\\t\\t\\tunequivocal terms, and nothing can be more certain. Why\\n\\t\\t\\t\\tdelay? Why ask carping questions? Why not profit by the\\n\\t\\t\\t\\tMessage, turn to Allah in repentance, and bring forth the\\n\\t\\t\\t\\tfruits of righteousness?"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "30",
    "NoteID": "3833",
    "Body": "When that Day actually arrives, your period of probation\\n\\t\\t\\t\\twill have passed. It will be too late. Now is the time\\n\\t\\t\\t\\tfor action."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "31",
    "NoteID": "3834",
    "Body": "To the Pagans all scriptures are taboo, whether it be the\\n\\t\\t\\t\\tQur-an or any Revelation that came before it. The people\\n\\t\\t\\t\\tof the Book despised the Pagans, but in their arrogant\\n\\t\\t\\t\\tassumption of superiority, prevented them, by their\\n\\t\\t\\t\\texample, from accepting the latest and most universal\\n\\t\\t\\t\\tScripture when it came in the form of the Qur-an. This\\n\\t\\t\\t\\trelative position, of men who fancy themselves on their\\n\\t\\t\\t\\tknowledge, and men whom they depise but exploit and\\n\\t\\t\\t\\tmislead, always exists on this earth. I have mentioned\\n\\t\\t\\t\\tthe people of the Book and the Pagan Arabs merely by way\\n\\t\\t\\t\\tof illustration."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "31",
    "NoteID": "3835",
    "Body": "One disbelief is as bad as another. There is little to\\n\\t\\t\\t\\tchoose between them. But when the final account will be\\n\\t\\t\\t\\ttaken, there will be mutual recriminations between the\\n\\t\\t\\t\\tone and the other."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "31",
    "NoteID": "3836",
    "Body": "The Pagans will naturally say to the people of the Book:\\n\\t\\t\\t\\t\"You misled us; you had previous Revelations, and you\\n\\t\\t\\t\\tshould have known how Allah sent His Messengers; had it\\n\\t\\t\\t\\tnot been for your bad example, we should have received\\n\\t\\t\\t\\tAllah's Revelation and become Believers.\" Or the humble\\n\\t\\t\\t\\tfollowers will say this to their leaders, or those less\\n\\t\\t\\t\\tgifted will say to those by whom they were misled and\\n\\t\\t\\t\\texploited. The dichotomy is between such as pretentiously\\n\\t\\t\\t\\theld their heads high in the world and such as they\\n\\t\\t\\t\\tprofited by but held in contempt."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "32",
    "NoteID": "3837",
    "Body": "In the mutual reproaches between the misleaders and the\\n\\t\\t\\t\\tmisled ones, there will be a grain of truth on both\\n\\t\\t\\t\\tsides, and yet both were guilty in not realising their\\n\\t\\t\\t\\town personal responsibility."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "NoteID": "3838",
    "Body": "The more intelligent ones who exploit the weaker ones are\\n\\t\\t\\t\\tconstantly plotting night and day to keep the latter\\n\\t\\t\\t\\tignorant and under their thumb. They show them the ways\\n\\t\\t\\t\\tof Evil, because by that means they are more in their\\n\\t\\t\\t\\tpower."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "NoteID": "3839",
    "Body": "If all men worshipped the true God, and none but Him,\\n\\t\\t\\t\\tthey could not on the one hand be trampled upon, and on\\n\\t\\t\\t\\tthe other hand they could not be unjust. It is in the\\n\\t\\t\\t\\tworship of false ideals or false gods that alluring\\n\\t\\t\\t\\tstructures of fraud and injustice are built up."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "NoteID": "3840",
    "Body": "Cf. x. 54, and n. 1445. All these mutual recriminations\\n\\t\\t\\t\\twould be swallowed up in the general realisation of the\\n\\t\\t\\t\\tTruth by both sides in the Hereafter. They would be\\n\\t\\t\\t\\tprepared openly to declare their repentance, but it would\\n\\t\\t\\t\\tbe too late. The yoke of slavery to Evil will be on their\\n\\t\\t\\t\\tnecks. Allah's justice put it there, but what else could\\n\\t\\t\\t\\tit do? Their own sins will cry out against them and hold\\n\\t\\t\\t\\tthem under their yokes."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "34",
    "NoteID": "3841",
    "Body": "Whenever the Message of Allah comes, the vested interests\\n\\t\\t\\t\\trange themselves against it. Worldly power has made them\\n\\t\\t\\t\\tarrogant; worldly pleasures have deadened their\\n\\t\\t\\t\\tsensibility to Truth. They reject the Message because it\\n\\t\\t\\t\\tattacks their false position."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "35",
    "NoteID": "3842",
    "Body": "Their arrogance is openly based on their worldly power\\n\\t\\t\\t\\tand position, their family influence, and the strength of\\n\\t\\t\\t\\ttheir man-power. Turn back again to the contrast drawn\\n\\t\\t\\t\\tbetween the arrogant ones and those whom they despised,\\n\\t\\t\\t\\tin verses 31-33."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "36",
    "NoteID": "3843",
    "Body": "Provision (or Sustenance): good things of all kinds in\\n\\t\\t\\t\\tthis life, material goods as well as power,\\n\\t\\t\\t\\topportunities, influence, mental gifts, etc. These do not\\n\\t\\t\\t\\tnecessarily all go to the good, nor is their denial to be\\n\\t\\t\\t\\tinterpreted to mean that it is a withdrawal of Allah's\\n\\t\\t\\t\\tfavour. Very often the contrary is the case. Their\\n\\t\\t\\t\\tdistribution is in accordance with the Universal Plan and\\n\\t\\t\\t\\tPurpose, which is all-wise and all-good. But ignorant\\n\\t\\t\\t\\tpeople cannot understand this."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "37",
    "NoteID": "3844",
    "Body": "The true test of progress in spiritual life is to be\\n\\t\\t\\t\\tmeasured by other things than material wealth and\\n\\t\\t\\t\\tinfluence. What we have to ask ourselves is: are we the\\n\\t\\t\\t\\tleast bit nearer to Allah?"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "37",
    "NoteID": "3845",
    "Body": "Cf. xxx. 39. All worldly good is but a shadow that will\\n\\t\\t\\t\\tpass away. Its intrinsic and eternal value is small. But\\n\\t\\t\\t\\tthose who work righteousness in Faith are on the true\\n\\t\\t\\t\\tpath of self-development. The reward they will get will\\n\\t\\t\\t\\tbe infinitely more than their merits entitle them to. For\\n\\t\\t\\t\\tthey will partake of the boundless Bounties of Allah."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "37",
    "NoteID": "3846",
    "Body": "Their happiness will not only be great in quantity\\n\\t\\t\\t\\t(\"multiplied\"), but it will be of a specially sublime\\n\\t\\t\\t\\tquality (\"dwellings on high\"), and it will endure without\\n\\t\\t\\t\\tany chance of its loss or diminution (\"secure they\\n\\t\\t\\t\\treside\")."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "38",
    "NoteID": "3847",
    "Body": "Cf. xxxiv. 5, where the argument was urged that human\\n\\t\\t\\t\\tefforts to defeat Allah's Plan will only bring\\n\\t\\t\\t\\thumiliation to those who indulge in them. Here the\\n\\t\\t\\t\\targument is rounded off by the statement that such\\n\\t\\t\\t\\tefforts, besides their failure, will land them in an\\n\\t\\t\\t\\tabyss of punishment contrasted with the \"dwellings on\\n\\t\\t\\t\\thigh\" of the blessed ones."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "39",
    "NoteID": "3848",
    "Body": "Cf. xxxiv. 36 above, and n. 3843."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "39",
    "NoteID": "3849",
    "Body": "Even in the seeming inequality of distribution of the\\n\\t\\t\\t\\tgood things of life, Allah has a wise and merciful\\n\\t\\t\\t\\tpurpose; for nothing arises by chance. He is the best to\\n\\t\\t\\t\\tgive us, now and evermore, just those things which\\n\\t\\t\\t\\tsubserve our real needs and advance our inner\\n\\t\\t\\t\\tdevelopment."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "40",
    "NoteID": "3850",
    "Body": "Here we have the case of the worship of angels or\\n\\t\\t\\t\\tsupposed Powers of Allah, or supposed beneficent spirits\\n\\t\\t\\t\\tthat men turn to instead of worshipping the true God. In\\n\\t\\t\\t\\tfact these are mere names to the false worshippers. It is\\n\\t\\t\\t\\tnot the Good that they worship but the Evil, which leads\\n\\t\\t\\t\\tthem astray."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "41",
    "NoteID": "3851",
    "Body": "Wali in Arabic may mean Friend either in the sense of\\n\\t\\t\\t\\tProtector and Benefactor or in the sense of the Beloved.\\n\\t\\t\\t\\tThe tie of benevolence, confidence, and friendship is\\n\\t\\t\\t\\timplied, either active or passive. The angels first\\n\\t\\t\\t\\tproclaim their dependence on Allah and their need of His\\n\\t\\t\\t\\tprotection, and then disclaim any idea of their having\\n\\t\\t\\t\\tprotected or encouraged the false worshippers to worship\\n\\t\\t\\t\\tbeings other than Allah. They go further, and suggest\\n\\t\\t\\t\\tthat when men pretended to worship angels, they\\n\\t\\t\\t\\tworshipped, not angels, but Jinns. See next note."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "41",
    "NoteID": "3852",
    "Body": "Jinns: see vi. 100 and n. 929. The false worshippers\\n\\t\\t\\t\\tpretended to worship the bright and radiant angels of\\n\\t\\t\\t\\tgood, but in reality worshipped the dark and hidden\\n\\t\\t\\t\\tforces of evil,-in the life around them. They trusted and\\n\\t\\t\\t\\tbelieved in such forces of evil, although such forces of\\n\\t\\t\\t\\tevil had really no power."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "42",
    "NoteID": "3853",
    "Body": "The supposed \"rivals\" of Allah-the false things whereon\\n\\t\\t\\t\\tmen set their hopes and fears-will have no power whatever\\n\\t\\t\\t\\twhen true values are restored; and the Fire-the\\n\\t\\t\\t\\tPenalty-which they doubted or derided, will become the\\n\\t\\t\\t\\tdominating real thing in their experience."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "43",
    "NoteID": "3854",
    "Body": "Apart from the worship of Evil in the guise of the Powers\\n\\t\\t\\t\\tof Light, there is another form of false worship, which\\n\\t\\t\\t\\tdepends on ancestral tradition. \"Why\" it is said \"should\\n\\t\\t\\t\\twe not do as our fathers did?\" They reject a new prophet\\n\\t\\t\\t\\tof Truth simply because his teaching does not agree with\\n\\t\\t\\t\\tthe ways of their ancestors. The answer to this is given\\n\\t\\t\\t\\tin verse 44 below. But meanwhile the rejectors' objection\\n\\t\\t\\t\\tto new Truth is stated in three forms: (1) our ancestors\\n\\t\\t\\t\\tknew nothing of this; (2) the story of inspiration is\\n\\t\\t\\t\\tfalse; it is merely an invention; we do not believe in\\n\\t\\t\\t\\tinspiration; (3) when in some particular points, the new\\n\\t\\t\\t\\tTruth does work wonders in men's hearts, they account for\\n\\t\\t\\t\\tit by saying it is magic. The third objection is merely\\n\\t\\t\\t\\ttraditional. What is magic? If it was merely deception,\\n\\t\\t\\t\\tsurely the Truth has proved itself to be above deception.\\n\\t\\t\\t\\tThe second objection is answered by the fact that the\\n\\t\\t\\t\\tMessenger who comes with new spiritual Truth is\\n\\t\\t\\t\\tacknowledged to be truthful in other relations of life:\\n\\t\\t\\t\\twhy should he be false where his preaching brings him no\\n\\t\\t\\t\\tgain but much sorrow and persecution? For the ancestral\\n\\t\\t\\t\\tobjection see next note."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "44",
    "NoteID": "3855",
    "Body": "The ancestors (as in the case of the Arabs of the Times\\n\\t\\t\\t\\tof Ignorance) had received no revelation of the clear\\n\\t\\t\\t\\tkind which a messenger and a Book bring them. This is a\\n\\t\\t\\t\\treason for welcoming, not for rejecting new Truth."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "45",
    "NoteID": "3856",
    "Body": "Passing to Peoples before the immediate ancestors, the\\n\\t\\t\\t\\tPeople of the Book, or the People of Saba and 'Ad and\\n\\t\\t\\t\\tThamud, had received favours and gifts, power and wealth,\\n\\t\\t\\t\\tten times more than were enjoyed by the Pagan Quraish.\\n\\t\\t\\t\\tYet when they turned away from Allah's Truth, Allah\\n\\t\\t\\t\\tturned away from them, and what terrible consequences\\n\\t\\t\\t\\tdescended on them when they lost Allah's Grace! This\\n\\t\\t\\t\\tshould make everyone humble, not least the posterity of\\n\\t\\t\\t\\tMuhammad the Messenger if they forsake Allah's Truths!\\n\\t\\t\\t\\tFor they have received a higher Teaching!"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "46",
    "NoteID": "3857",
    "Body": "A crowd mentality is not the best for the perception of\\n\\t\\t\\t\\tthe final spiritual truths. For these, it is necessary\\n\\t\\t\\t\\tthat each soul should commune within itself with earnest\\n\\t\\t\\t\\tsincerity as before Allah: if it requires a Teacher, let\\n\\t\\t\\t\\tit seek out one, or it may be that it wants the\\n\\t\\t\\t\\tstrengthening of the inner convictions that dawn on it,\\n\\t\\t\\t\\tby the support of a sympathiser or friend. But careful\\n\\t\\t\\t\\tand heart-felt reflection is necessary to appraise the\\n\\t\\t\\t\\thigher Truths."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "46",
    "NoteID": "3858",
    "Body": "Note that in verses 46, 47, 48, 49 and 50, arguments are\\n\\t\\t\\t\\tsuggested to the Prophet, by which he can convince any\\n\\t\\t\\t\\tright-thinking man of his sincerity and truth. Here the\\n\\t\\t\\t\\targument is that he is not possessed or out of his mind.\\n\\t\\t\\t\\tIf he is different from ordinary men, it is because he\\n\\t\\t\\t\\thas to give a warning of a terrible spiritual danger to\\n\\t\\t\\t\\tthe men whom he loves but who will not understand his\\n\\t\\t\\t\\tMessage."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "47",
    "NoteID": "3859",
    "Body": "Cf. x. 72. The second argument is that he has nothing to\\n\\t\\t\\t\\tgain from them. His message is for their own good. He is\\n\\t\\t\\t\\twilling to suffer persecution and insult, because he has\\n\\t\\t\\t\\tto fulfil his mission from Allah."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "48",
    "NoteID": "3860",
    "Body": "Allah's Truth is so vast that no man in this life can\\n\\t\\t\\t\\tcompass the whole of it. But Allah in His mercy selects\\n\\t\\t\\t\\tHis servants on whom it is cast like a mantle. They see\\n\\t\\t\\t\\tenough to be able to teach their fellow men. It is\\n\\t\\t\\t\\tthrough that mantle-that mission received from Allah-that\\n\\t\\t\\t\\ta messenger can speak with authority to men, and this is\\n\\t\\t\\t\\this third argument."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "49",
    "NoteID": "3861",
    "Body": "The fourth argument is that the Truth is final: it does\\n\\t\\t\\t\\tnot come and go: it creates new situations and new\\n\\t\\t\\t\\tdevelopments, and if by chance it seems to be defeated\\n\\t\\t\\t\\tfor a time, it comes back and restores the true\\n\\t\\t\\t\\tbalance;-unlike Falsehood, which by its very nature is\\n\\t\\t\\t\\tdoomed to perish: xvii. 81. The Prophet's credentials are\\n\\t\\t\\t\\tknown by the test of Time. This was already becoming\\n\\t\\t\\t\\tapparent to discerning eyes when this Sura was revealed\\n\\t\\t\\t\\tin Makkah, but it became clear to the whole world with\\n\\t\\t\\t\\tthe story of Islam's progress in Madinah."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "50",
    "NoteID": "3862",
    "Body": "If it could possibly be supposed that the Prophet was a\\n\\t\\t\\t\\tself-deceived visionary, it would affect him only, and\\n\\t\\t\\t\\tcould not fail to appear in his personality. But in fact\\n\\t\\t\\t\\the was steady in his constancy and Faith, and he not only\\n\\t\\t\\t\\twent from strength to strength, but won the enduring and\\n\\t\\t\\t\\twhole-hearted love and devotion of his nearest and\\n\\t\\t\\t\\tdearest and of those who most came into contact with him.\\n\\t\\t\\t\\tHow was this possible, unless he had the Truth and the\\n\\t\\t\\t\\tinspiration of Allah behind him? This is the fifth and\\n\\t\\t\\t\\tlast argument in this passage."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "51",
    "NoteID": "3863",
    "Body": "After the arguments for the reality and triumph of Truth,\\n\\t\\t\\t\\twe are asked to contemplate the position of the opposers\\n\\t\\t\\t\\tof Truth when Truth is established. They will be struck\\n\\t\\t\\t\\twith terror: for Truth is all-compelling. They will wish\\n\\t\\t\\t\\tthey could get away from that position, but that would be\\n\\t\\t\\t\\timpossible. They will not be able to move far; they will\\n\\t\\t\\t\\tbe held fast to the consequences of their own earlier\\n\\t\\t\\t\\tconduct. They will be caught quite close to the point of\\n\\t\\t\\t\\ttheir departure from Truth."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "52",
    "NoteID": "3864",
    "Body": "They will now profess their faith in Truth, but of what\\n\\t\\t\\t\\tvalue will such profession be? Faith is a belief in\\n\\t\\t\\t\\tthings unseen: now everything is plain and open before\\n\\t\\t\\t\\tthem. The position in which they could have received\\n\\t\\t\\t\\tFaith is left far off behind them, when Truth was\\n\\t\\t\\t\\tstruggling and asked for help or asylum, and they\\n\\t\\t\\t\\tcruelly, arrogantly, insultingly repudiated Truth."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "53",
    "NoteID": "3865",
    "Body": "Not only did they reject the Truth of the Unseen (the\\n\\t\\t\\t\\ttrue Reality), but they spread all sorts of false and\\n\\t\\t\\t\\tmalicious insinuations at the preachers of Truth, calling\\n\\t\\t\\t\\tthem dishonest men, liars, hypocrites, and so on. They\\n\\t\\t\\t\\tdid it like a coward taking up a sneaking position far\\n\\t\\t\\t\\tfrom the fight and speeding arrows at a distant target."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "54",
    "NoteID": "3866",
    "Body": "What they desire is to suppress Truth and to indulge in\\n\\t\\t\\t\\tthe satisfaction of their own evil, selfish motives. They\\n\\t\\t\\t\\twill be baulked in both, and that itself will be their\\n\\t\\t\\t\\tanguish and punishment. That has always been the law in\\n\\t\\t\\t\\tthe eternal struggle between Right and Wrong. All\\n\\t\\t\\t\\tpartisans of such narrow cliques have always suffered the\\n\\t\\t\\t\\tsame fate."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "54",
    "NoteID": "3867",
    "Body": "Note that verses 51-54 are a powerful description of the\\n\\t\\t\\t\\tconflict between right and wrong, and may be understood\\n\\t\\t\\t\\tin many meanings. (1) The description applies to the\\n\\t\\t\\t\\tposition in the final Hereafter, as compared with the\\n\\t\\t\\t\\tposition in this life. (2) It applies to the position of\\n\\t\\t\\t\\ttriumphant Islam in Madinah and later as compared with\\n\\t\\t\\t\\tthe position of persecuted Islam in its early days in\\n\\t\\t\\t\\tMakkah. (3) It applies to the reversal of the position of\\n\\t\\t\\t\\tright and wrong at various phases of the world's history,\\n\\t\\t\\t\\tor of (4) individual history."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "54",
    "NoteID": "3868",
    "Body": "Cf. xiv. 9, and see n. 1884."
  }
]
