[
  {
    "SurahNumber": "59",
    "AyahNumber": "1",
    "NoteID": "5368",
    "Body": "This verse, introducing the Sura is identical with lvii.\\n\\t\\t\\t\\t1. introducing S. lvii. The theme of both is the\\n\\t\\t\\t\\twonderful working of Allah's Plan and Providence. In the\\n\\t\\t\\t\\tone case it referred to the conquest of Makkah and taught\\n\\t\\t\\t\\tthe lesson of humility. In this case it refers to the\\n\\t\\t\\t\\tdislodgment of the treacherous Banu Nadhir from their\\n\\t\\t\\t\\tnest of intrigue in the neighbourhood of Madinah\\n\\t\\t\\t\\tpractically without a blow. See next note."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "NoteID": "5369",
    "Body": "This refers to the Jewish tribe of the Banu Nadhi whose\\n\\t\\t\\t\\tintrigues and treachery nearly undid the Muslim cause\\n\\t\\t\\t\\tduring the perilous days of the battle of Uhud in\\n\\t\\t\\t\\tShawwal, A.H. 3. Four months after, in Rabi, 1. A.H. 4,\\n\\t\\t\\t\\tsteps were taken against them. They were asked to leave\\n\\t\\t\\t\\tthe strategic position which they occupied, about three\\n\\t\\t\\t\\tmiles south of Madinah, endangering the very existence of\\n\\t\\t\\t\\tthe Ummat in Madinah. At first they demurred, relying on\\n\\t\\t\\t\\ttheir fortresses and on their secret alliance with the\\n\\t\\t\\t\\tPagans of Makkah and the Hypocrites of Madinah. But when\\n\\t\\t\\t\\tthe Muslim army was gathered to punish them and actually\\n\\t\\t\\t\\tbesieged them for some days, their allies stirred not a\\n\\t\\t\\t\\tfinger in their aid, and they were wise enough to leave.\\n\\t\\t\\t\\tMost of them joined their brethren in Syria, which they\\n\\t\\t\\t\\twere permitted to do, after being disarmed. Some of them\\n\\t\\t\\t\\tjoined their brethren in Khaibar; see n. 3705 to xxxiii.\\n\\t\\t\\t\\t27. The Banu Nadhir richly deserved punishment, but their\\n\\t\\t\\t\\tlives were spared, and they were allowed to carry away\\n\\t\\t\\t\\ttheir goods and chattels."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "NoteID": "5370",
    "Body": "That is, without actual hostilities, and the shedding of\\n\\t\\t\\t\\tprecious Muslim blood."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "NoteID": "5371",
    "Body": "They had played a double game. Originally they were sworn\\n\\t\\t\\t\\tallies of the Madinah Muslims under the holy Prophet, but\\n\\t\\t\\t\\tthey secretly intrigued with the Makkah Pagans under Abu\\n\\t\\t\\t\\tSufyan and the Madinah Hypocrites. They even tried\\n\\t\\t\\t\\ttreacherously to take the life of the Prophet while he\\n\\t\\t\\t\\twas on a visit to them, breaking both the laws of\\n\\t\\t\\t\\thospitality and their own sworn alliance. They thought\\n\\t\\t\\t\\tthe Pagan Quraish of Makkah and the Hypocrites of Madinah\\n\\t\\t\\t\\twould help them, but they did not help them. On the\\n\\t\\t\\t\\tcontrary the eleven days siege showed them their own\\n\\t\\t\\t\\thelplessness. Their supplies were cut off; the exigencies\\n\\t\\t\\t\\tof the siege necessitated the destruction of their\\n\\t\\t\\t\\toutlying palm trees; and the unexpected turn in their\\n\\t\\t\\t\\tfortunes disheartened them. Their hearts were stack with\\n\\t\\t\\t\\tterror and they capitulated. But they laid waste their\\n\\t\\t\\t\\thomes before they left: see next note."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "NoteID": "5372",
    "Body": "Their lives were spared, and they were allowed ten days\\n\\t\\t\\t\\tin which to remove themselves, their families, and such\\n\\t\\t\\t\\tgoods as they could carry. In order to leave no\\n\\t\\t\\t\\thabitations for the Muslims they demolished their own\\n\\t\\t\\t\\thouses and laid waste their property, to complete the\\n\\t\\t\\t\\tdestruction which the operations of war had already\\n\\t\\t\\t\\tcaused at the hands of the besieging force of the\\n\\t\\t\\t\\tMuslims."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "3",
    "NoteID": "5373",
    "Body": "Banishment was a comparatively mild punishment for them,\\n\\t\\t\\t\\tbut the Providence of Allah had decreed that a chance\\n\\t\\t\\t\\tshould be given to them even though they were a\\n\\t\\t\\t\\ttreacherous foe. Within two years, their brethren the\\n\\t\\t\\t\\tBanu Quraiza showed that they had not profited by their\\n\\t\\t\\t\\texample, and had to be dealt with in another way: see\\n\\t\\t\\t\\txxxiii. 26 and notes."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "4",
    "NoteID": "5374",
    "Body": "The punishment of the Banu Nadhir was because in breaking\\n\\t\\t\\t\\ttheir plighted word with the Messenger and in actively\\n\\t\\t\\t\\tresisting Allah's Message and supporting the enemies of\\n\\t\\t\\t\\tthat Message, they rebelled against him. For such treason\\n\\t\\t\\t\\tand rebellion the punishment is severe, and yet in this\\n\\t\\t\\t\\tcase it was seasoned with Mercy."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "5",
    "NoteID": "5375",
    "Body": "The unnecessary cutting down of fruit trees or\\n\\t\\t\\t\\tdestruction of crops, or any wanton destruction whatever\\n\\t\\t\\t\\tin war, is forbidden by the law and practice of Islam.\\n\\t\\t\\t\\tBut some destruction may be necessary for putting\\n\\t\\t\\t\\tpressure on the enemy, and to that extent it is allowed.\\n\\t\\t\\t\\tBut as far as possible, consistently with that objective\\n\\t\\t\\t\\tof military operations, such trees should not be cut\\n\\t\\t\\t\\tdown. Both these principles are in accordance with the\\n\\t\\t\\t\\tDivine Will, and were followed by the Muslims in their\\n\\t\\t\\t\\texpedition."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "5",
    "NoteID": "5376",
    "Body": "The arrogance of the Banu Nadhir had to be humbled, and\\n\\t\\t\\t\\ttheir power for mischief destroyed."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "6",
    "NoteID": "5377",
    "Body": "Neither cavalry nor troops mounted on camels were\\n\\t\\t\\t\\temployed in the siege. In fact the enemy surrendered at\\n\\t\\t\\t\\tthe first onset. See lix. 2, and n. 5369 above."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "6",
    "NoteID": "5378",
    "Body": "Allah accomplishes His purpose in various ways, according\\n\\t\\t\\t\\tto Ms wise Will and Plan. In some cases a fight is\\n\\t\\t\\t\\tnecessary. In some cases the godly attain their objective\\n\\t\\t\\t\\tand overawe the forces of evil without actual fighting."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "7",
    "NoteID": "5379",
    "Body": "The Jews had originally come from outside Arabia, and\\n\\t\\t\\t\\tseized on the land near Madinah. They refused to adapt\\n\\t\\t\\t\\tthemselves to the people of Arabia, and were in fact a\\n\\t\\t\\t\\tthorn in the side of the genuine Arabs of Madinah. Their\\n\\t\\t\\t\\tdispossession is therefore a restoration of the land to\\n\\t\\t\\t\\tits original people. But the word \"Fai\" is here\\n\\t\\t\\t\\tunderstood in a technical sense, as meaning property\\n\\t\\t\\t\\tabandoned by the enemy or taken from him without a formal\\n\\t\\t\\t\\twar. In that sense it is distinguished from \"Anfal,\" or\\n\\t\\t\\t\\tspoils, taken after actual fighting, about which see\\n\\t\\t\\t\\tviii. 1 and 41."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "7",
    "NoteID": "5380",
    "Body": "\"The people of the townships\": the townships were the\\n\\t\\t\\t\\tJewish settlements round Madinah, of the Banu Nadhir, and\\n\\t\\t\\t\\tpossibly of other tribes. Cf. the \"townships\" mentioned\\n\\t\\t\\t\\tin lix. 14 below. The reference cannot be to the\\n\\t\\t\\t\\tWadi-ul-Qura (Valley of Towns), now Madain Salih, which\\n\\t\\t\\t\\twas subjugated after Khaibar and Fadak in A.H. 7, unless\\n\\t\\t\\t\\tthis verse is later than the rest of the Sara."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "7",
    "NoteID": "5381",
    "Body": "\"Belongs to Allah\": ie., to Allah's Cause; and the\\n\\t\\t\\t\\tbeneficiaries are further detailed. No shares are fixed;\\n\\t\\t\\t\\tthey depend upon circumstances, and are left to the\\n\\t\\t\\t\\tjudgement of the Leader. Compare a similar list of those\\n\\t\\t\\t\\tentitied to Charity, in ii. 177, but the two fists refer\\n\\t\\t\\t\\tto different circumstances and have different\\n\\t\\t\\t\\tbeneficiaries in addition to the portion common to both."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "8",
    "NoteID": "5382",
    "Body": "The Muhajir are those who forsook their homes and\\n\\t\\t\\t\\tproperty in Makkah in order to assist the holy Prophet in\\n\\t\\t\\t\\this migration to Madinah (Hijrat). Their devotion and\\n\\t\\t\\t\\tsincerity were proved beyond doubt by their self-denial,\\n\\t\\t\\t\\tand they were now to be rewarded."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "9",
    "NoteID": "5383",
    "Body": "This refers to the Ansar (the Helpers), the people of\\n\\t\\t\\t\\tMadinah who accepted Islam when it was persecuted in\\n\\t\\t\\t\\tMakkah, and who invited the holy Prophet to join them and\\n\\t\\t\\t\\tbecome their Leader in Madinah. The Hijrat was possible\\n\\t\\t\\t\\tbecause of their goodwill and their generous hospitality.\\n\\t\\t\\t\\tThey entertained the Prophet and all the refugees\\n\\t\\t\\t\\t(Muhajirs) who came with him. The most remarkable ties of\\n\\t\\t\\t\\tfull brotherhood were established between individual\\n\\t\\t\\t\\tmembers of the one group and the other. Until the Ummat\\n\\t\\t\\t\\tgot its own resources, the Helpers regularly gave and the\\n\\t\\t\\t\\tRefugees regularly received. The Helpers counted it a\\n\\t\\t\\t\\tprivilege to entertain the Refugees, and even the poor\\n\\t\\t\\t\\tvied with the rich in their spirit of self-sacrifice.\\n\\t\\t\\t\\tWhen the confiscated land and property of the Banu Nadhir\\n\\t\\t\\t\\twas divided, and the major portion was assigned to the\\n\\t\\t\\t\\trefugees, there was not the least jealousy on the part of\\n\\t\\t\\t\\tthe Helpers. They rejoiced in the good fortune of their\\n\\t\\t\\t\\tbrethren. And incidentally they were themselves relieved\\n\\t\\t\\t\\tof anxiety and responsibility on their behalf."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "10",
    "NoteID": "5384",
    "Body": "Those that came after them: the immediate meaning would\\n\\t\\t\\t\\trefer to later arrivals in Madinah or later accessions to\\n\\t\\t\\t\\tIslam, compared with the early Muhajirs. But the general\\n\\t\\t\\t\\tmeaning would include all future comers into the House of\\n\\t\\t\\t\\tIslam. They pray, not only for themselves, but for all\\n\\t\\t\\t\\ttheir brethren, and above all, they pray that their\\n\\t\\t\\t\\thearts may be purified of any desire or tendency to\\n\\t\\t\\t\\tdisparage the work or virtues of other Muslims or to feel\\n\\t\\t\\t\\tany jealousy on account of their successes or good\\n\\t\\t\\t\\tfortune."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "10",
    "NoteID": "5385",
    "Body": "Cf. vii. 43, and n. 1021."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "11",
    "NoteID": "5386",
    "Body": "The Jews of the Banu Nadhir had been assured by the\\n\\t\\t\\t\\tHypocrites of Madinah of their support to their cause.\\n\\t\\t\\t\\tThey had thought that their defection from the Prophet's\\n\\t\\t\\t\\tCause would so weaken that cause that they would save\\n\\t\\t\\t\\ttheir friends. But they never intended to undertake any\\n\\t\\t\\t\\tact involving self-sacrifice on their part; if they had\\n\\t\\t\\t\\thelped their Jewish friends, it was not likely that they\\n\\t\\t\\t\\twould have succeeded; and if they had actually gone to\\n\\t\\t\\t\\tthe fight; they had neither valour nor fervour to support\\n\\t\\t\\t\\tthem, and they would have fled ignominiously before the\\n\\t\\t\\t\\tdiscipline, earnestness, and Faith of the men of Islam."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "11",
    "NoteID": "5387",
    "Body": "For this actually happened. They never stirred a finger\\n\\t\\t\\t\\tfor the Jews, and they never intended to do so. And Allah\\n\\t\\t\\t\\tknows all their motives and secrets: cf. xlvii. 26, n.\\n\\t\\t\\t\\t4850."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "12",
    "NoteID": "5388",
    "Body": "All hopes founded on iniquity and treachery are vain and\\n\\t\\t\\t\\tillusory. There may be honour among thieves. But there is\\n\\t\\t\\t\\tno honour as between dishonest intriguers, and they are\\n\\t\\t\\t\\tnot likely to get any real help from any quarter."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "13",
    "NoteID": "5389",
    "Body": "Being Unbelievers they fear you more than they fear\\n\\t\\t\\t\\tAllah, because your valour they see, but in Allah they do\\n\\t\\t\\t\\tnot believe."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "14",
    "NoteID": "5390",
    "Body": "They have not sufficient self-confidence or clan to\\n\\t\\t\\t\\tsustain them in a fight except under material advantages\\n\\t\\t\\t\\tor defences. Even if they join forces, they have not\\n\\t\\t\\t\\tsufficient trust in each other to expose themselves to\\n\\t\\t\\t\\topen fighting."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "14",
    "NoteID": "5391",
    "Body": "'It may be that they have a strong fighting spirit among\\n\\t\\t\\t\\tthemselves, but they have no Cause to fight for and no\\n\\t\\t\\t\\tcommon objective to achieve. The Makkan Pagans want to\\n\\t\\t\\t\\tkeep their own unjust autocracy; the Madinah Hypocrites\\n\\t\\t\\t\\twish for their own domination in Madinah; and the Jews\\n\\t\\t\\t\\twant their racial superiority established over the Arabs,\\n\\t\\t\\t\\tof whose growing union and power they are jealous.' Their\\n\\t\\t\\t\\tpretended alliance could not stand the strain of either a\\n\\t\\t\\t\\tdefeat or a victory. If they had been wise, they would\\n\\t\\t\\t\\thave accepted the Cause of Unity, Faith, and Truth."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "15",
    "NoteID": "5392",
    "Body": "The immediate reference was probably to the Jewish\\n\\t\\t\\t\\tgoldsmith tribe of the Qainuqa, who were also settled in\\n\\t\\t\\t\\ta fortified township near Madinah. They were also\\n\\t\\t\\t\\tpunished and banished for their treachery, about a month\\n\\t\\t\\t\\tafter the battle of Badr, in which the Makkan Pagans had\\n\\t\\t\\t\\tsuffered a signal defeat, in Shawwal, A.H. 2. The Nadhir\\n\\t\\t\\t\\tevidently did not take that lesson to heart. The general\\n\\t\\t\\t\\tmeaning is that we must learn to be on our guard against\\n\\t\\t\\t\\tthe consequences of treachery and sin. No fortuitous\\n\\t\\t\\t\\talliances with other men of iniquity will save us."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "16",
    "NoteID": "5393",
    "Body": "An apt simile. Evil tempts man in all sort of ways, and\\n\\t\\t\\t\\tpresents seductive promises and alliances to delude him\\n\\t\\t\\t\\tinto the belief that he will be saved from the\\n\\t\\t\\t\\tconsequences. Satan says, \"Deny Allah\": which means not\\n\\t\\t\\t\\tmerely denial in words, but denial in acts, disobedience\\n\\t\\t\\t\\tof Allah's Law, deviation from the path of rectitude.\\n\\t\\t\\t\\tWhen the sinner gets well into the mire, Satan says\\n\\t\\t\\t\\tcynically: \"How can I help you against Allah? Don't you\\n\\t\\t\\t\\tsee I am afraid of Him? All our alliances and\\n\\t\\t\\t\\tunderstandings were moonshine. You must bear the\\n\\t\\t\\t\\tconsequences of your own folly.\""
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "18",
    "NoteID": "5394",
    "Body": "The \"fear of Allah\" is akin to love; for it means the\\n\\t\\t\\t\\tfear of offending Him or doing anything wrong that will\\n\\t\\t\\t\\tforfeit His Good Pleasure. This is Taqwa, which implies\\n\\t\\t\\t\\tself restraint, guarding ourselves from all sin, wrong,\\n\\t\\t\\t\\tand injustice, and the positive doing of good. See ii. 2,\\n\\t\\t\\t\\tand n. 26."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "18",
    "NoteID": "5395",
    "Body": "The positive side of Taqwa, or \"fear of Allah\" (see last\\n\\t\\t\\t\\tnote) is here emphasised. It is not merely a feeling or\\n\\t\\t\\t\\tan emotion: it is an act, a doing of things which become\\n\\t\\t\\t\\ta preparation and provision for the Hereafter,-the next\\n\\t\\t\\t\\tlife, which may be described as \"the morrow\" in relation\\n\\t\\t\\t\\tto the present Life, which is \"to-day\". A) The repetition\\n\\t\\t\\t\\temphasises both sides of Taqwa: \"let your soul fear to do\\n\\t\\t\\t\\twrong and let it do every act of righteousness; for Allah\\n\\t\\t\\t\\tobserves both your inner motives and your acts, and in\\n\\t\\t\\t\\tHis scheme of things everything will have its due\\n\\t\\t\\t\\tconsequences.\""
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "19",
    "NoteID": "5396",
    "Body": "To forget Allah is to forget the only Eternal Reality."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "20",
    "NoteID": "5397",
    "Body": "The others, the Companions of the Fire, will find their\\n\\t\\t\\t\\tlives wasted and nullified. Their capacities will be\\n\\t\\t\\t\\trendered inert and their wishes will end in futility."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "21",
    "NoteID": "5398",
    "Body": "There are two ideas associated in men's minds with a\\n\\t\\t\\t\\tmountain: one is its height, and the other that it is\\n\\t\\t\\t\\trocky, stony, hard, Now comes the metaphor. The\\n\\t\\t\\t\\tRevelation of Allah is so sublime that even the highest\\n\\t\\t\\t\\tmountains humble themselves before it. The Revelation is\\n\\t\\t\\t\\tso powerful and convincing that even the hard rock splits\\n\\t\\t\\t\\tasunder under it. Will man then be so arrogant as to\\n\\t\\t\\t\\tconsider himself superior to it, or so hard-hearted as\\n\\t\\t\\t\\tnot to be affected by its powerful Message? The answer is\\n\\t\\t\\t\\t\"No\" for unspoilt man; \"Yes\" for man when degraded by sin\\n\\t\\t\\t\\tto be the vilest of creatures."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "21",
    "NoteID": "5399",
    "Body": "Cf. vii. 143, and n. 1103, where, in the story of Moses,\\n\\t\\t\\t\\tthe Mount became as dust \"when the Lord manifested His\\n\\t\\t\\t\\tGlory\". Also cf. xxxiii. 72, and n. 3778, where the\\n\\t\\t\\t\\tmountains are mentioned as an emblem of stability, but as\\n\\t\\t\\t\\trefusing to accept the Trust (Amanat) because they felt\\n\\t\\t\\t\\tthemselves to be too humble to be equal to such a\\n\\t\\t\\t\\ttremendous Trust."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "22",
    "NoteID": "5400",
    "Body": "Here follows a passage of great sublimity, summing up the\\n\\t\\t\\t\\tattributes of Allah. In this verse, we have the general\\n\\t\\t\\t\\tattributes, which give us the fundamental basis on which\\n\\t\\t\\t\\twe can form some idea of Allah. We start with the\\n\\t\\t\\t\\tproposition that there is nothing else like Him. We think\\n\\t\\t\\t\\tof His Unity; all the varying and conflicting forces in\\n\\t\\t\\t\\tCreation are controlled by Him and look to Him, and we\\n\\t\\t\\t\\tcan never get a true idea of Him unless we understand the\\n\\t\\t\\t\\tmeaning of Unity. His knowledge extends to everything\\n\\t\\t\\t\\tseen and unseen, present and future, near and far, in\\n\\t\\t\\t\\tbeing and not in being: in fact these contrasts, which\\n\\t\\t\\t\\tapply to our knowledge, do not apply to Him. His Grace\\n\\t\\t\\t\\tand His Mercy are unbounded: see i. 1, and n. 19; and\\n\\t\\t\\t\\tunless we realise these, we can have no true conception\\n\\t\\t\\t\\tof our position in the working of His Will and Plan."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "NoteID": "5401",
    "Body": "This phrase is repeated from the last verse in order to\\n\\t\\t\\t\\tlead us to the contemplation of some other attributes of\\n\\t\\t\\t\\tAllah, after we have realised those which form our\\n\\t\\t\\t\\tfundamental conceptions of Allah. See the preceding and\\n\\t\\t\\t\\tthe following note."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "NoteID": "5402",
    "Body": "How can a translator reproduce the sublimity and the\\n\\t\\t\\t\\tcomprehensiveness of the magnificent Arabic words, which\\n\\t\\t\\t\\tmean so much in a single symbol? (1) \"The Sovereign\" in\\n\\t\\t\\t\\tour human language implies the one undisputed authority\\n\\t\\t\\t\\twhich is entitled to give commands and to receive\\n\\t\\t\\t\\tobedience, and which in fact receives obedience; the\\n\\t\\t\\t\\tpower which enforces law and justice. (2) Human authority\\n\\t\\t\\t\\tmay be misused, but in the title \"the Holy One\", we\\n\\t\\t\\t\\tpostulate a Being free from all stain or evil, and\\n\\t\\t\\t\\treplete with the highest Purity. (3) \"Salam\" has not only\\n\\t\\t\\t\\tthe idea of Peace as opposed to Conflict, but wholeness\\n\\t\\t\\t\\tas opposed to defects: hence our paraphrase \"Source of\\n\\t\\t\\t\\tPeace and Perfection\". (4) Mu-min, one who entertains\\n\\t\\t\\t\\tFaith, who gives Faith to others, who is never false to\\n\\t\\t\\t\\tthe Faith that others place in him: hence our paraphrase\\n\\t\\t\\t\\t\"Guardian of Faith\". (5) \"Preserver of Safety\"; guarding\\n\\t\\t\\t\\tall from danger, corruption, loss, etc.; the word is used\\n\\t\\t\\t\\tfor the Qur-an in v. 51. These are the attributes of\\n\\t\\t\\t\\tkindness and benevolence: in the next note are described\\n\\t\\t\\t\\tthe attributes of power."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "NoteID": "5403",
    "Body": "See last note. (6) Allah is not only good, but He can\\n\\t\\t\\t\\tcarry out His Will. (7) And if anything resists or\\n\\t\\t\\t\\topposes Him, His Will prevails. (8) For He is Supreme,\\n\\t\\t\\t\\tabove all things and creatures. Thus we come back to the\\n\\t\\t\\t\\tUnity with which we began in verse 22."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "NoteID": "5404",
    "Body": "Such being Allah's attributes of Goodness and Power, how\\n\\t\\t\\t\\tfoolish is it of men to worship anything else but Him?\\n\\t\\t\\t\\tWho can approach His glory and goodness?"
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "24",
    "NoteID": "5405",
    "Body": "Allah's attributes of Goodness and Power having been\\n\\t\\t\\t\\treferred to, we are now told of His creative energy, of\\n\\t\\t\\t\\twhich three aspects are here mentioned, as explained in\\n\\t\\t\\t\\tthe following note. The point is emphasised that He does\\n\\t\\t\\t\\tnot merely create and leave alone; He goes on fashioning,\\n\\t\\t\\t\\tevolving new forms and colours, and sustaining all the\\n\\t\\t\\t\\tenergies and capacities which He has put into His\\n\\t\\t\\t\\tCreation, according to various laws which He has\\n\\t\\t\\t\\testablished."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "24",
    "NoteID": "5406",
    "Body": "The act or acts of creation have various aspects, and the\\n\\t\\t\\t\\tvarious words used in this connection are summarised in\\n\\t\\t\\t\\tn. 120 to ii. 117, as supplemented by n. 916 to vi. 94\\n\\t\\t\\t\\tand n. 923 to vi. 98. Khalaqa is the general term for\\n\\t\\t\\t\\tcreation, and the Author of all Creation is Khaliq. Baraa\\n\\t\\t\\t\\timplies a process of evolving from previously created\\n\\t\\t\\t\\tmatter or state; the Author of this process is Bari-u,\\n\\t\\t\\t\\tthe Originator. Sawwara implies giving definite form or\\n\\t\\t\\t\\tcolour, so as to make a thing exactly suited to a given\\n\\t\\t\\t\\tend or object: hence the title Musawwir, Fashioner for\\n\\t\\t\\t\\tthis shows the completion of the visible stage of\\n\\t\\t\\t\\tcreation."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "24",
    "NoteID": "5407",
    "Body": "Cf. vii. 180, n. 1154; and xvii. 110, n. 2322."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "24",
    "NoteID": "5408",
    "Body": "Thus the argument of the Sura is rounded off on the same\\n\\t\\t\\t\\tnote as was struck at the beginning lix. 1. The first\\n\\t\\t\\t\\tverse and the last verse of the Sura are the same, except\\n\\t\\t\\t\\tas regards the tense of the verb sabbaha. In the first\\n\\t\\t\\t\\tverse it is the optative form of the preterite sabbaha:\\n\\t\\t\\t\\teverything declares the Glory of Allah! After the\\n\\t\\t\\t\\tillustrations given, the declaratory form of the aorist\\n\\t\\t\\t\\tis appropriate, yusabbihu: \"everything doth declare the\\n\\t\\t\\t\\tGlory of Allah'."
  }
]
