[
  {
    "SurahNumber": "83",
    "AyahNumber": "1",
    "NoteID": "6011",
    "Body": "\"Fraud\" must here be taken in a widely general sense. It\\n\\t\\t\\t\\tcovers giving short measure or short weight, but it\\n\\t\\t\\t\\tcovers much more than that. The next two verses make it\\n\\t\\t\\t\\tclear that it is the spirit of injustice that is\\n\\t\\t\\t\\tcondemned, giving too little and asking too much. This\\n\\t\\t\\t\\tmay be shown in commercial dealings, where a man exacts a\\n\\t\\t\\t\\thigher standard in his own favour than he is willing to\\n\\t\\t\\t\\tconcede as against him. In domestic or social matters an\\n\\t\\t\\t\\tindividual or group may ask for honour, or respect, or\\n\\t\\t\\t\\tservices which he or they are not willing to give on\\n\\t\\t\\t\\ttheir side in similar circumstances. It is worse than\\n\\t\\t\\t\\tone-sided selfishness: for it is double injustice. But it\\n\\t\\t\\t\\tis worst of all in religion or spiritual life: with what\\n\\t\\t\\t\\tface can a man ask for Mercy or Love from Allah when he\\n\\t\\t\\t\\tis unwilling to give it to his fellow-men? In one aspect\\n\\t\\t\\t\\tthis is a statement of the Golden Rule. 'Do as you would\\n\\t\\t\\t\\tbe done by'. But it is more completely expressed. You\\n\\t\\t\\t\\tmust give in full what it due from you, whether you\\n\\t\\t\\t\\texpect or wish to receive full consideration from the\\n\\t\\t\\t\\tother side or not."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "4",
    "NoteID": "6012",
    "Body": "Legal and social sanctions against Fraud depend for their\\n\\t\\t\\t\\tefficacy on whether there is a chance of being found out.\\n\\t\\t\\t\\tMoral and religious sanctions are of a different kind.\\n\\t\\t\\t\\t'Do you wish to degrade your own nature?' 'Do you not\\n\\t\\t\\t\\tconsider that there is a Day of Account before a Judge\\n\\t\\t\\t\\tWho knows all, and Who safeguards all interests, for He\\n\\t\\t\\t\\tis the Lord and Cherisher of the Worlds? Whether other\\n\\t\\t\\t\\tpeople know anything about your wrong or not, you are\\n\\t\\t\\t\\tguilty before Allah'."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "7",
    "NoteID": "6013",
    "Body": "This is a word from the same root as Sijn, a Prison. It\\n\\t\\t\\t\\trhymes with and is contrasted with Illiyin in verse 18\\n\\t\\t\\t\\tbelow. It is therefore understood by many Commentators to\\n\\t\\t\\t\\tbe a place, a Prison or a Dungeon in which the Wicked are\\n\\t\\t\\t\\tconfined pending their appearance before the\\n\\t\\t\\t\\tJudgment-Seat. The mention of the Iscribed Register in\\n\\t\\t\\t\\tverse 9 below may imply that Sijjin is the name of the\\n\\t\\t\\t\\tRegister of Black Deeds, though verse 9 may be elliptical\\n\\t\\t\\t\\tand may only describe the place by the significance of\\n\\t\\t\\t\\tits contents."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "9",
    "NoteID": "6014",
    "Body": "If we take Sijjin to be the Register itself, and not the\\n\\t\\t\\t\\tplace where it is kept, the Register itself is a sort of\\n\\t\\t\\t\\tPrison for those who do wrong. It is inscribed fully:\\n\\t\\t\\t\\ti.e., no one is omitted who ought to be there, and for\\n\\t\\t\\t\\tevery entry there is a complete record, so that there is\\n\\t\\t\\t\\tno escape for the sinner."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "11",
    "NoteID": "6015",
    "Body": "The fact of Personal Responsibility for each soul is so\\n\\t\\t\\t\\tundoubted that people who deny it are to be pitied, and\\n\\t\\t\\t\\twill indeed be in a most pitiable condition on the Day of\\n\\t\\t\\t\\tReckoning, and none but the most abandoned sinner can\\n\\t\\t\\t\\tdeny it, and he only denies it by playing with\\n\\t\\t\\t\\tFalsehoods."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "13",
    "NoteID": "6016",
    "Body": "Cf. vi. 25; lxviii. 15; etc. They scorn Truth and pretend\\n\\t\\t\\t\\tthat it is Falsehood."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "14",
    "NoteID": "6017",
    "Body": "The heart of man, as created by Allah, is pure and\\n\\t\\t\\t\\tunsullied. Every time that a man does an ill deed, it\\n\\t\\t\\t\\tmarks a stain or rust on his heart. But on repentance and\\n\\t\\t\\t\\tforgiveness, such stain is washed off. If there is no\\n\\t\\t\\t\\trepentance and forgiveness, the stains deepen and spread\\n\\t\\t\\t\\tmore and more, until the heart is scaled (ii. 7), and\\n\\t\\t\\t\\teventually the man dies a spiritual death. It is such\\n\\t\\t\\t\\tstains that stand in the way of his perceiving Truths\\n\\t\\t\\t\\twhich are obvious to others. That is why he mocks at\\n\\t\\t\\t\\tTruth and hugs Falsehood to his bosom."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "15",
    "NoteID": "6018",
    "Body": "The stain of evil deeds on their hearts sullies the\\n\\t\\t\\t\\tmirror of their hearts, so that it does not receive the\\n\\t\\t\\t\\tlight. At Judgment the true Light, the Glory of the Lord,\\n\\t\\t\\t\\tthe joy of the Righteous, will be hidden by veils from\\n\\t\\t\\t\\tthe eyes of the Sinful. Instead; the Fire of Punishment\\n\\t\\t\\t\\twill be to them the only reality which they will\\n\\t\\t\\t\\tperceive."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "18",
    "NoteID": "6019",
    "Body": "'Illiyin: the oblique form of the nominative Illiyun,\\n\\t\\t\\t\\twhich occurs in the next verse. It is in contrast to the\\n\\t\\t\\t\\tSijjin which occurs in verse 7 above, where see n. 6213.\\n\\t\\t\\t\\tLiterally, it means the 'High Places'. Applying the\\n\\t\\t\\t\\treasoning parallel to that which we applied to Sijjin, we\\n\\t\\t\\t\\tmay interpret it as the Place where is kept the Register\\n\\t\\t\\t\\tof the Righteous."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "20",
    "NoteID": "6020",
    "Body": "This repeats verse 9 above, where see n. 6014. But the\\n\\t\\t\\t\\tRegister is of the opposite kind, that of the Righteous.\\n\\t\\t\\t\\tIt contains every detail of the Righteous."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "21",
    "NoteID": "6021",
    "Body": "See lvi. 11, n. 5227; also n. 5223. Those Nearest to\\n\\t\\t\\t\\tAllah will be witnesses to this Righteous Record; or as\\n\\t\\t\\t\\tit may also be rendered, they will be present at the\\n\\t\\t\\t\\tRecord, and watch this Record."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "23",
    "NoteID": "6022",
    "Body": "Cf. xxxvi. 56."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "24",
    "NoteID": "6023",
    "Body": "Cf. lxxv. 22, and lxxvi. 11."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "25",
    "NoteID": "6024",
    "Body": "The Wine will be of the utmost purity and flavour, so\\n\\t\\t\\t\\tprecious that it will be protected with a seal, and the\\n\\t\\t\\t\\tseal itself will be of the costly material of musk, which\\n\\t\\t\\t\\tis most highly esteemed in the East for its perfume.\\n\\t\\t\\t\\tPerhaps a better interpretation of the \"seal\" is to take\\n\\t\\t\\t\\tit as implying the final effect of the drink: just as a\\n\\t\\t\\t\\tseal close a document, so the seal of the drink will be\\n\\t\\t\\t\\tthe final effect of the delicious perfume and flavour of\\n\\t\\t\\t\\tmusk, heightening the enjoyment and helping in the\\n\\t\\t\\t\\tdigestion."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "26",
    "NoteID": "6025",
    "Body": "If you understand true and lasting values, this is the\\n\\t\\t\\t\\tkind of pure Bliss to aspire for, and not the fleeting\\n\\t\\t\\t\\tenjoyments of this world, which always leave a sting\\n\\t\\t\\t\\tbehind."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "27",
    "NoteID": "6026",
    "Body": "Tasnim literally indicates height, fulness, opulence.\\n\\t\\t\\t\\tHere it is the name of a heavenly Fountain, whose drink\\n\\t\\t\\t\\tis superior to that of the Purest Wine. It is the nectar\\n\\t\\t\\t\\tdrunk by Those Nearest to Allah (n. 5227 to lvi. 11), but\\n\\t\\t\\t\\ta flavour of it will be given to all. See n. 5835 to\\n\\t\\t\\t\\tlxxvi. 5 (Kafur fountain), and n. 5849 to lxxvi. 17-18\\n\\t\\t\\t\\t(Salsabil)."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "32",
    "NoteID": "6027",
    "Body": "The wicked laugh at the righteous in this world in many\\n\\t\\t\\t\\tways: (1) They inwardly laugh at their Faith, because\\n\\t\\t\\t\\tthey feel themselves so superior. (2) In public places,\\n\\t\\t\\t\\twhen the righteous pass, they wink at each other and\\n\\t\\t\\t\\tinsult them. (3) In their own houses they run them down.\\n\\t\\t\\t\\t(4) Whenever and wherever they see them, they reproach\\n\\t\\t\\t\\tthem with being fools who have lost their way, when the\\n\\t\\t\\t\\tboot is really on the other leg. In the Hereafter all\\n\\t\\t\\t\\tthese tricks and falsehoods will be shown for what they\\n\\t\\t\\t\\tare, and the tables will be reversed."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "33",
    "NoteID": "6028",
    "Body": "But the wicked critics of the Righteous have no call in\\n\\t\\t\\t\\tany case to sit in judgment over them. Who set them as\\n\\t\\t\\t\\tKeepers or guardians over the Righteous? Let them look to\\n\\t\\t\\t\\ttheir own condition and future first."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "34",
    "NoteID": "6029",
    "Body": "The tables will then be reversed, and he laughs best who\\n\\t\\t\\t\\tlaughs last."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "35",
    "NoteID": "6030",
    "Body": "A repetition of verse 23 above, but with a different\\n\\t\\t\\t\\tshade of meaning. The Righteous on their raised couches\\n\\t\\t\\t\\twill be able to see all the true values restored in their\\n\\t\\t\\t\\town favour: but they will also see something else: they\\n\\t\\t\\t\\twill also see the arrogant braggarts brought low, who\\n\\t\\t\\t\\tbrought about their own downfall by their own actions."
  }
]
