[
  {
    "SurahNumber": "61",
    "AyahNumber": "1",
    "NoteID": "5431",
    "Body": "This verse is identical with lix. 1. The latter\\n\\t\\t\\t\\tillustrated the theme of the wonderful working of Allah's\\n\\t\\t\\t\\tprovidence in defeating the wiles of His enemies. Here\\n\\t\\t\\t\\tthe same theme is illustrated by showing the need for\\n\\t\\t\\t\\tunshaken discipline if we are to receive the help of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "2",
    "NoteID": "5432",
    "Body": "At Uhud there was some disobedience and therefore breach\\n\\t\\t\\t\\tof discipline. People had talked much, but had failed to\\n\\t\\t\\t\\tback up their resolution in words with firmness in\\n\\t\\t\\t\\taction. See n. 442 to iii. 121. But on all occasions when\\n\\t\\t\\t\\tmen's deeds are not commensurate with their words, their\\n\\t\\t\\t\\tconduct is odious in the sight of Allah, and it is only\\n\\t\\t\\t\\tdue to Allah's Mercy if they are saved from disaster."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "4",
    "NoteID": "5433",
    "Body": "A battle array, in which a large number of men stand,\\n\\t\\t\\t\\tmarch, or hold together against assault as if they were a\\n\\t\\t\\t\\tsolid wall, is a striking example of order, discipline,\\n\\t\\t\\t\\tcohesion, and courage. \"A solid cemented structure\" is\\n\\t\\t\\t\\teven a better simile than the usual \"solid wall\" as the\\n\\t\\t\\t\\t\"structure\" or building implies a more diversified\\n\\t\\t\\t\\torganisation held together in unity and strength, each\\n\\t\\t\\t\\tpart contributing strength in its own way, and the whole\\n\\t\\t\\t\\theld together not like a mass but like a living organism.\\n\\t\\t\\t\\tCf. also xxxvii. I and n. 4031."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "5",
    "NoteID": "5434",
    "Body": "The people of Moses often rebelled against him, vexed his\\n\\t\\t\\t\\tspirit, and insulted him. See xxxiii. 69, n. 3774, and\\n\\t\\t\\t\\t(in the Old Testament) Num xii. 1-13. They did it not\\n\\t\\t\\t\\tthrough ignorance, but from a selfish, perverse, and\\n\\t\\t\\t\\trebellious spirit, for which they received punishment.\\n\\t\\t\\t\\tThe Ummat of Islam should remember and take note of it,\\n\\t\\t\\t\\tand should avoid any deviation from the Law and Will of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "5",
    "NoteID": "5435",
    "Body": "The sinner's own will deviates, i.e., goes off from the\\n\\t\\t\\t\\tright way, and he does wrong. That means that he shuts\\n\\t\\t\\t\\toff Allah's grace. Allah then, after his repeated\\n\\t\\t\\t\\trebellion, withdraws the protecting Grace from him, and\\n\\t\\t\\t\\tthe sinner's heart is tainted: there is \"a disease in his\\n\\t\\t\\t\\theart\", which is the centre of his being: his spiritual\\n\\t\\t\\t\\tstate is ruined. Allah's guidance is withdrawn from him."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "5436",
    "Body": "The mission of Jesus was to his own people, the Jews. Cf.\\n\\t\\t\\t\\tMatt. x. 5-6. See also Matt. xv. 24: \"I am not sent but\\n\\t\\t\\t\\tto the lost sheep of Israel;\" also Matt. xv. 26: \"It is\\n\\t\\t\\t\\tnot meet to take the children's bread, and to cast it to\\n\\t\\t\\t\\tdogs.\""
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "5437",
    "Body": "Cf. Matt. v. 17."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "5438",
    "Body": "\"Ahmad\", or \"Muhammad\", the Praised One, is almost a\\n\\t\\t\\t\\ttranslation of the Greek word Periclytos. In the present\\n\\t\\t\\t\\tGospel of John. xiv. 16, xv. 26, and xvi. 7, the word\\n\\t\\t\\t\\t\"Comforter\" in the English version is for the Greek word\\n\\t\\t\\t\\t\"Paracletos\", which means \"Advocate\", \"one called to the\\n\\t\\t\\t\\thelp of another, a kind friend\", rather than \"Comforter\".\\n\\t\\t\\t\\tOur doctors contend that Paracleots is a corrupt reading\\n\\t\\t\\t\\tfor Periclytos, and that in their original saying of\\n\\t\\t\\t\\tJesus there was a prophecy of our holy Prophet Ahmad by\\n\\t\\t\\t\\tname. Even if we read Paraclete, it would apply to the\\n\\t\\t\\t\\tholy Prophet, who is \"a Mercy for all creatures\" (xxi.\\n\\t\\t\\t\\t107) and \"most kind and merciful to the Believers\" (ix.\\n\\t\\t\\t\\t128). See also n. 416 to iii. 81."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "5439",
    "Body": "Our holy Prophet was foretold in many ways; and when he\\n\\t\\t\\t\\tcame, he showed forth many Clear Signs, for his whole\\n\\t\\t\\t\\tlife from beginning to end was one vast miracle. He\\n\\t\\t\\t\\tfought and won against odds. Without learning from men he\\n\\t\\t\\t\\ttaught the highest wisdom. He melted hearts that were\\n\\t\\t\\t\\thard, and he strengthened hearts that were tender and\\n\\t\\t\\t\\trequired support. In all his sayings and doings men of\\n\\t\\t\\t\\tdiscernment could see the working of Allah's hand; yet\\n\\t\\t\\t\\tthe ignorant Unbelievers called it all Sorcery!-called\\n\\t\\t\\t\\tthat unreal which became the most solid fact of human\\n\\t\\t\\t\\thistory!"
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "7",
    "NoteID": "5440",
    "Body": "It is wrong in any case to uphold falsehoods and debasing\\n\\t\\t\\t\\tsuperstitions, but it is doubly wrong when these are put\\n\\t\\t\\t\\tforward in rivalry or opposition to the light of eternal\\n\\t\\t\\t\\tUnity and Harmony which is Islam. Allah sends His\\n\\t\\t\\t\\tguidance freely, but withdraws His Grace from those who\\n\\t\\t\\t\\twilfully do wrong."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "8",
    "NoteID": "5441",
    "Body": "Allah's Light is unquenchable. A foolish, ignorant person\\n\\t\\t\\t\\twho thinks of extinguishing it is like a rustic who wants\\n\\t\\t\\t\\tto blow out electric light as he might blow out a rush\\n\\t\\t\\t\\tcandle! \"With their mouths\" also implies the babble and\\n\\t\\t\\t\\tcackle of Ignorance against Allah's Truth. The more the\\n\\t\\t\\t\\tfoolish ones try to quench Allah's Light, the clearer it\\n\\t\\t\\t\\tshines, to shame them!"
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "9",
    "NoteID": "5442",
    "Body": "\"Over all religion\": in the singular: not over all other\\n\\t\\t\\t\\treligions, in the plural. There is really only one true\\n\\t\\t\\t\\tReligion, the Message of Allah submission to the Will of\\n\\t\\t\\t\\tAllah: this is called Islam. It was the religion preached\\n\\t\\t\\t\\tby Moses and Jesus; it was the religion of Abraham, Noah,\\n\\t\\t\\t\\tand all the prophets, by whatever name it may be called.\\n\\t\\t\\t\\tIf people corrupt that pure light, and call their\\n\\t\\t\\t\\treligions by different names, we must bear with them, and\\n\\t\\t\\t\\twe may allow the names for convenience. But Truth must\\n\\t\\t\\t\\tprevail over all. See also ix. 33, n. 1290, and lxviii.\\n\\t\\t\\t\\t28, n. 4912."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "10",
    "NoteID": "5443",
    "Body": "Tijarat: bargain, trade, traffic, transaction: something\\n\\t\\t\\t\\tgiven or done, in return for something which we desire to\\n\\t\\t\\t\\tget. What we give or do on our part is described in verse\\n\\t\\t\\t\\t11 below, and what we get is described in verse 12. It is\\n\\t\\t\\t\\ttruly a wonderful bargain: what we are asked to give is\\n\\t\\t\\t\\tso little; what we are promised in return is so much.\\n\\t\\t\\t\\tThere comes Allah's unbounded Bounty and Munificence. Cf.\\n\\t\\t\\t\\talso ix. 111, where the bargain is stated in another way."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "11",
    "NoteID": "5444",
    "Body": "It would indeed be a great and wonderful bargain to give\\n\\t\\t\\t\\tso little and get so much, if we only knew and understood\\n\\t\\t\\t\\tthe comparative value of things-the sacrifice of our\\n\\t\\t\\t\\tfleeting advantages for forgiveness, the love of Allah,\\n\\t\\t\\t\\tand eternal bliss."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "13",
    "NoteID": "5445",
    "Body": "The supreme Achievement has already been mentioned viz.;\\n\\t\\t\\t\\tthe Gardens of Eternity with Allah. But lest that seem\\n\\t\\t\\t\\ttoo remote or abstract for the understanding of men not\\n\\t\\t\\t\\tstrong in faith, another good news is mentioned which the\\n\\t\\t\\t\\tmen who first heard this Message could at once understand\\n\\t\\t\\t\\tand appreciate-\"which ye do love\": viz.: Help and\\n\\t\\t\\t\\tVictory. For all striving in a righteous Cause we get\\n\\t\\t\\t\\tAllah's help: and however much the odds against us may\\n\\t\\t\\t\\tbe, we are sure of victory with Allah's help. But all\\n\\t\\t\\t\\tlife is a striving or struggle,-the spiritual life even\\n\\t\\t\\t\\tmore than any other; and the final victory there is the\\n\\t\\t\\t\\tsame as the Garden of Eternity."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "14",
    "NoteID": "5446",
    "Body": "If we seek Allah's help, we must first help Allah's\\n\\t\\t\\t\\tCause, i.e., dedicate ourselves to Him entirely and\\n\\t\\t\\t\\twithout reserve. This was also the teaching of Jesus, as\\n\\t\\t\\t\\tmentioned in this verse."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "14",
    "NoteID": "5447",
    "Body": "See iii. 52, and n. 392; and for the Biblical reference,\\n\\t\\t\\t\\tsee the last note. The names of the twelve Disciples will\\n\\t\\t\\t\\tbe found in Matt. x. 2-4."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "14",
    "NoteID": "5448",
    "Body": "A portion of the Children of Israel-the one that really\\n\\t\\t\\t\\tcared for Truth-believed in Jesus and followed his\\n\\t\\t\\t\\tguidance. But the greater portion of them were hard\\n\\t\\t\\t\\thearted, and remained in their beaten track of formalism\\n\\t\\t\\t\\tand false racial pride. The majority seemed at first to\\n\\t\\t\\t\\thave the upper hand when they thought they had crucified\\n\\t\\t\\t\\tJesus and killed his Message. But they were soon brought\\n\\t\\t\\t\\tto their senses. Jerusalem was destroyed by Titus in A.D.\\n\\t\\t\\t\\t70 and the Jews have been scattered ever since. \"The\\n\\t\\t\\t\\tWandering Jew\" has become a bye-word in many literatures.\\n\\t\\t\\t\\tOn the other hand, those who followed Jesus permeated the\\n\\t\\t\\t\\tRoman Empire, brought many new races within their circle,\\n\\t\\t\\t\\tand through the Roman Empire, Christianity became the\\n\\t\\t\\t\\tpredominant religion of the world until the advent of\\n\\t\\t\\t\\tIslam. So is it promised to the people of Islam: they\\n\\t\\t\\t\\tmust prevail if they adhere to the Truth. Badr (A.H. 2)\\n\\t\\t\\t\\twas a landmark against Pagan Arabia; Qadisiya (A.H. 14)\\n\\t\\t\\t\\tand Madain (A.H. 16) against the might of Persia: Yarmuk\\n\\t\\t\\t\\t(A.H. 15) against the might of the Byzantine Empire in\\n\\t\\t\\t\\tChristian Syria; and Heliopolis (A.H. 19) against the\\n\\t\\t\\t\\tsame Empire in Christian Egypt and Africa. These were\\n\\t\\t\\t\\tsymbols in external events. The moral and spiritual\\n\\t\\t\\t\\tlandmarks are less tangible, and more gradual, but none\\n\\t\\t\\t\\tthe less real. Mark how the arrogance and power of\\n\\t\\t\\t\\tPriesthood have been quelled; how superstition and a\\n\\t\\t\\t\\tbelief in blind Fate have been checked; how the freedom\\n\\t\\t\\t\\tof human individuals has been reconciled with the\\n\\t\\t\\t\\tsanctity of marriage in the law of Divorce; how the civil\\n\\t\\t\\t\\tposition of women has been raised; how temperance and\\n\\t\\t\\t\\tsobriety have been identified with religion; what impetus\\n\\t\\t\\t\\thas been given to knowledge and experimental science; and\\n\\t\\t\\t\\thow economic reconstruction has been pioneered by\\n\\t\\t\\t\\trational schemes for the expenditure and distribution of\\n\\t\\t\\t\\twealth."
  }
]
