[
  {
    "SurahNumber": "113",
    "AyahNumber": "1",
    "NoteID": "6301",
    "Body": "In Allah's created world, there are all kinds of forces\\n\\t\\t\\t\\tand counter-forces, especially those put in motion by\\n\\t\\t\\t\\tbeings who have been endowed with some sort of will. The\\n\\t\\t\\t\\tforces of good may be compared to light, and those of\\n\\t\\t\\t\\tevil to darkness. Allah can cleave the depths of darkness\\n\\t\\t\\t\\tand produce light (vi. 96), and therefore we should cast\\n\\t\\t\\t\\toff fear and take refuge in divine guidance and goodness."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "1",
    "NoteID": "6302",
    "Body": "Falaq is the Dawn or Daybreak, the cleaving of darkness\\n\\t\\t\\t\\tand the manifestation of light. This may be understood in\\n\\t\\t\\t\\tvarious senses: (1) literally, when the darkness of the\\n\\t\\t\\t\\tnight is at its worst, rays of light pierce through and\\n\\t\\t\\t\\tproduce the dawn; (2) when the darkness of ignorance is\\n\\t\\t\\t\\tat its worst, the light of Allah pierces through the soul\\n\\t\\t\\t\\tand gives it enlightenment: xxiv. 35; (3) non-existence\\n\\t\\t\\t\\tis darkness, and life and activity may be typified by\\n\\t\\t\\t\\tlight. The author and source of all true light is Allah,\\n\\t\\t\\t\\tand if we seek Him, we are free from ignorance,\\n\\t\\t\\t\\tsuperstition, fear, and every kind of evil."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "2",
    "NoteID": "6303",
    "Body": "See n. 6301 above. Our trust in Allah is the refuge from\\n\\t\\t\\t\\tevery kind of fear and superstition, every kind of danger\\n\\t\\t\\t\\tand evil. Three special kinds of mischief are specified\\n\\t\\t\\t\\tin the next three verses, against which our best guard is\\n\\t\\t\\t\\tour trust in Allah, the Light of the heavens and the\\n\\t\\t\\t\\tearth. They are: (1) physical dangers, typified by\\n\\t\\t\\t\\tdarkness. (2) physical dangers within us, typified by\\n\\t\\t\\t\\tSecret Arts, and (3) physical dangers from without us,\\n\\t\\t\\t\\tresulting from a perverted will, which seeks to destroy\\n\\t\\t\\t\\tany good that we enjoy."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "3",
    "NoteID": "6304",
    "Body": "The darkness of the night, physical darkness, is a good\\n\\t\\t\\t\\ttype of physical dangers and difficulties. Many people\\n\\t\\t\\t\\tare afraid of physical darkness, and all are afraid of\\n\\t\\t\\t\\tphysical injuries, accidents, and calamities. We should\\n\\t\\t\\t\\tnot fear, but having taken reasonable precautions, trust\\n\\t\\t\\t\\tin Allah."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "4",
    "NoteID": "6305",
    "Body": "Those (feminine) who blow on knots', this having been a\\n\\t\\t\\t\\tfavourite form of witchcraft practised by perverted\\n\\t\\t\\t\\twomen. Such secret arts cause psychological terror. They\\n\\t\\t\\t\\tmay be what is called magic, or secret plottings, or the\\n\\t\\t\\t\\tdisplay of false and seductive charms (iii. 14), or the\\n\\t\\t\\t\\tspreading of false and secret rumours or slanders to\\n\\t\\t\\t\\tfrighten men or deter them from right action. There is\\n\\t\\t\\t\\tfraud in such things, but men are swayed by it. They\\n\\t\\t\\t\\tshould cast off fear and do their duty."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "5",
    "NoteID": "6306",
    "Body": "Malignant envy, translated into action, seeks to destroy\\n\\t\\t\\t\\tthe happiness or the material or spiritual good enjoyed\\n\\t\\t\\t\\tby other people. The best guard against it is trust in\\n\\t\\t\\t\\tAllah with purity of heart."
  }
]
