[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/057001",
        "Body":  "All that is in the heavens and the earth glorifieth Allah and He\n\t\t\tis the Mighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/057010",
        "Body":  "And what aileth you that ye spend not in the way of Allah, when\n\t\t\tunto Allah belongeth the inheritance of the heavens and the\n\t\t\tearth? Those who spent and fought before the victory are not upon\n\t\t\ta level (with the rest of you). Such are greater in rank than\n\t\t\tthose who spent and fought afterwards. Unto each hath Allah\n\t\t\tpromised good. And Allah is Informed of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/057011",
        "Body":  "Who is he that will lend unto Allah a goodly loan, that He may\n\t\t\tdouble it for him and his may be a rich reward?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/057012",
        "Body":  "On the day when thou (Muhammad) wilt see the believers, men and\n\t\t\twomen, their light shining forth before them and on their right\n\t\t\thands, (and wilt hear it said unto them): Glad news for you this\n\t\t\tday: Gardens underneath which rivers flow, wherein ye are\n\t\t\timmortal. That is the supreme triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/057013",
        "Body":  "On the day when the hypocritical men and the hypocritical women\n\t\t\twill say unto those who believe: Look on us that we may borrow\n\t\t\tfrom your light! it will be said: Go back and seek for light!\n\t\t\tThen there will separate them a wall wherein is a gate, the inner\n\t\t\tside whereof containeth mercy, while the outer side thereof is\n\t\t\ttoward the doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/057014",
        "Body":  "They will cry unto them (saying): Were we not with you? They will\n\t\t\tsay: Yea, verily; but ye tempted one another, and hesitated, and\n\t\t\tdoubted, and vain desires beguiled you till the ordinance of\n\t\t\tAllah came to pass; and the deceiver deceived you concerning\n\t\t\tAllah;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/057015",
        "Body":  "So this day no ransom can be taken from you nor from those who\n\t\t\tdisbelieved. Your home is the Fire; that is your patron, and a\n\t\t\thapless journey\u0027s end."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/057016",
        "Body":  "Is not the time ripe for the hearts of those who believe to\n\t\t\tsubmit to Allah\u0027s reminder and to the truth which is revealed,\n\t\t\tthat they become not as those who received the Scripture of old\n\t\t\tbut the term was prolonged for them and so their hearts were\n\t\t\thardened, and many of them are evil-livers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/057017",
        "Body":  "Know that Allah quickeneth the earth after its death. We have\n\t\t\tmade clear Our revelations for you, that haply ye may understand."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/057018",
        "Body":  "Lo! those who give alms, both men and women, and lend unto Allah\n\t\t\ta goodly loan, it will be doubled for them, and theirs will be a\n\t\t\trich reward."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/057019",
        "Body":  "And those who believe in Allah and His messengers, they are the\n\t\t\tloyal; and the martyrs are with their Lord; they have their\n\t\t\treward and their light; while as for those who disbelieve and\n\t\t\tdeny Our revelations, they are owners of hell fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/057002",
        "Body":  "His is the Sovereignty of the heavens and the earth; He\n\t\t\tquickeneth and He giveth death; and He is Able to do things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/057020",
        "Body":  "Know that the life of this world is only play, and idle talk, and\n\t\t\tpageantry, and boasting among you, and rivalry in respect of\n\t\t\twealth and children; as the likeness of vegetation after rain,\n\t\t\twhereof the growth is pleasing to the husbandman, but afterward\n\t\t\tit drieth up and thou seest it turning yellow then it becometh\n\t\t\tstraw. And in the Hereafter there is grievous punishment, and\n\t\t\t(also) forgiveness from Allah and His good pleasure, whereas the\n\t\t\tlife of the world is but matter of illusion."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/057021",
        "Body":  "Race one with another for forgiveness from your Lord and a Garden\n\t\t\twhereof the breadth is as the breadth of the heavens and the\n\t\t\tearth, which is in store for those who believe in Allah and His\n\t\t\tmessengers. Such is the bounty of Allah, which He bestoweth upon\n\t\t\twhom He will, and Allah is of infinite bounty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/057022",
        "Body":  "Naught of disaster befalleth in the earth or in yourselves but it\n\t\t\tis in a Book before We bring it into being--Lo! that is easy for\n\t\t\tAllah--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/057023",
        "Body":  "That ye grieve not for the sake of that which hath escaped you,\n\t\t\tnor yet exult because of that which hath been given. Allah loveth\n\t\t\tnot all prideful boasters,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/057024",
        "Body":  "Who hoard and who enjoin upon the people avarice. And whosoever\n\t\t\tturneth away, still Allah is the Absolute, the Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/057025",
        "Body":  "We verily sent Our messengers with clear proofs, and revealed\n\t\t\twith them the Scripture and the Balance, that mankind may observe\n\t\t\tright measure; and He revealed iron, wherein is mighty power and\n\t\t\t(many) uses for mankind, and that Allah may know him who helpeth\n\t\t\tHim and His messengers, though unseen. Lo! Allah is Strong,\n\t\t\tAlmighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/057026",
        "Body":  "And We verily sent Noah and Abraham and placed the Prophethood\n\t\t\tand the Scripture among their seed, and among them there is he\n\t\t\twho goeth right, but many of them are evil-livers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/057027",
        "Body":  "Then We caused Our messengers to follow in their footsteps; and\n\t\t\tWe caused Jesus, son of Mary, to follow, and gave him the Gospel,\n\t\t\tand placed compassion and mercy in the hearts of those who\n\t\t\tfollowed him. But monasticism they invented. We ordained it not\n\t\t\tfor them. Only seeking Allah\u0027s pleasure, and they observed it not\n\t\t\twith right observance. So We give those of them who believe their\n\t\t\treward, but many of them are evil-livers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/057028",
        "Body":  "O ye who believe! Be mindful of your duty to Allah and put faith\n\t\t\tin His messenger. He will give you twofold of His mercy and will\n\t\t\tappoint for you a light wherein ye shall walk, and will forgive\n\t\t\tyou. Allah is Forgiving, Merciful;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/057029",
        "Body":  "That the People of the Scripture may know that they control\n\t\t\tnaught of the bounty of Allah, but that the bounty is in Allah\u0027s\n\t\t\thand to give to whom He will. And Allah is of infinite bounty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/057003",
        "Body":  "He is the First and the Last, and the Outward and the Inward; and\n\t\t\tHe is Knower of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/057004",
        "Body":  "He it is Who created the heavens and the earth in Days; then He\n\t\t\tmounted the Throne. He knoweth all that entereth the earth and\n\t\t\tall that emergeth therefrom and all that cometh down from the sky\n\t\t\tand all that ascendeth therein; and He is with you wheresoever ye\n\t\t\tmay be. And Allah is Seer of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/057005",
        "Body":  "His is the Sovereignty of the heavens and the earth and, unto\n\t\t\tAllah (all) things are brought back."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/057006",
        "Body":  "He causeth the night to pass into the day, and He causeth the day\n\t\t\tto pass into the night, and He is Knower of all that is in the\n\t\t\tbreasts."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/057007",
        "Body":  "Believe in Allah and His messenger, and spend of that whereof He\n\t\t\thath made you trustees; and such of you as believe and spend\n\t\t\t(aright), theirs will be a great reward."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/057008",
        "Body":  "What aileth you that ye believe not in Allah, when the messenger\n\t\t\tcalleth you to believe in your Lord, and He hath already made a\n\t\t\tcovenant with you, if ye are believers?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "57",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/057009",
        "Body":  "He it is Who sendeth down clear revelations unto His slave, that\n\t\t\tHe may bring you forth from darkness unto light; and lo! for you,\n\t\t\tAllah is Full of Pity, Merciful."
    }
]
