[
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "1",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\r\\n\\t\\t\\t\\tHe said, \"Yahya ibn Yahya al-Laythi related to me from\r\\n\\t\\t\\t\\tMalik ibn Anas from Ibn Shihab that one day Umar ibn\r\\n\\t\\t\\t\\tAbdal-Aziz delayed the prayer. Urwa ibn az-Zubayr came\r\\n\\t\\t\\t\\tand told him that al-Mughira ibn Shuba had delayed the\r\\n\\t\\t\\t\\tprayer one day while he was in Kufa and Abu Masud\r\\n\\t\\t\\t\\tal-Ansari had come to him and said, 'What's this,\r\\n\\t\\t\\t\\tMughira? Don't you know that the angel Jibril came down\r\\n\\t\\t\\t\\tand prayed and the Messenger of Allah, may Allah bless\r\\n\\t\\t\\t\\thim and grant him peace, prayed.' Then he prayed again,\r\\n\\t\\t\\t\\tand the Messenger of Allah, may Allah bless him and grant\r\\n\\t\\t\\t\\thim peace, prayed. Then Jibril\r\\n\\t\\t\\t\\tsaid, 'This is what you have been ordered to do.'  Umar\r\\n\\t\\t\\t\\tibn Abd al-Aziz said, 'Be sure of what you relate, Urwa.\r\\n\\t\\t\\t\\tWas it definitely Jibril who established the time of the\r\\n\\t\\t\\t\\tprayer for the Messenger of Allah?' \" Urwa said, \"That's\r\\n\\t\\t\\t\\thow it was related to Bashir ibn Abi Masud al-Ansari by\r\\n\\t\\t\\t\\this father.\"\r\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "2",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tUrwa said that A'isha, the wife of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace used to pray asr while the\\n\\t\\t\\t\\tsunlight was pouring into her room, before the sun itself\\n\\t\\t\\t\\thad become visible (i.e. because it was still high in the\\n\\t\\t\\t\\tsky).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "3",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tAta ibn Yasar said, \"A man came to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, and asked\\n\\t\\t\\t\\thim about the time of the subh prayer. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, did not\\n\\t\\t\\t\\tanswer him, but in the morning he prayed subh at first\\n\\t\\t\\t\\tlight. The following morning he prayed subh when it was\\n\\t\\t\\t\\tmuch lighter, and then said, 'Where is the man who was\\n\\t\\t\\t\\tasking about the time of the prayer?' The man replied,\\n\\t\\t\\t\\t'Here I am, Messenger of Allah.' He said,'The time is\\n\\t\\t\\t\\tbetween these two.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "4",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAmra bint Abd ar-Rahman that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, used to pray subh and the women would leave\\n\\t\\t\\t\\twrapped in their garments and they could not yet be\\n\\t\\t\\t\\trecognised in the darkness.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "5",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar and from Busr ibn Said and from al-Araj-all\\n\\t\\t\\t\\tof whom related it from Abu Hurayra - that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Whoever manages to do a raka of subh before the sun has\\n\\t\\t\\t\\trisen has done subh in time, and whoever manages to do a\\n\\t\\t\\t\\traka of asr before the sun has set has done asr in time.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "6",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from the mawla\\n\\t\\t\\t\\tof Abdullah ibn Umar that Umar ibn al-Khattab wrote to\\n\\t\\t\\t\\this governors, saying, \"The most important of your\\n\\t\\t\\t\\taffairs in my view is the prayer. Whoever protects it and\\n\\t\\t\\t\\tobserves it carefully is protecting his deen, while\\n\\t\\t\\t\\twhoever is negligent about it will be even more negligent\\n\\t\\t\\t\\tabout other things.\" Then he added, \"Pray dhuhr any time\\n\\t\\t\\t\\tfrom when the afternoon shade is the length of your\\n\\t\\t\\t\\tforearm until the length of your shadow matches your\\n\\t\\t\\t\\theight. Pray asr when the sun is still pure white, so\\n\\t\\t\\t\\tthat a rider can travel two or three farsakhs before the\\n\\t\\t\\t\\tsun sets. Pray maghrib when the sun has set. Pray isha\\n\\t\\t\\t\\tany time from when the redness in the western sky has\\n\\t\\t\\t\\tdisappeared until a third of the night has passed - and a\\n\\t\\t\\t\\tperson who sleeps, may he have no rest, a person who\\n\\t\\t\\t\\tsleeps, may he have no rest. And pray subh when all the\\n\\t\\t\\t\\tstars are visible and like a haze in the sky.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "7",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\r\\n\\t\\t\\t\\tYahya related to me from Malik, from his uncle Abu Suhayl\r\\n\\t\\t\\t\\tfrom his father that Umar ibn al-Khattab wrote to Abu\r\\n\\t\\t\\t\\tMusa saying that he should pray dhuhr when the sun had\r\\n\\t\\t\\t\\tstarted to decline, asr when the sun was still pure white\r\\n\\t\\t\\t\\tbefore any yellowness had entered it maghrib when the sun\r\\n\\t\\t\\t\\thad set, and to delay isha as long as he did not sleep,\r\\n\\t\\t\\t\\tand to pray subh when the stars were all visible and like\r\\n\\t\\t\\t\\ta haze in the sky and to read in it two long suras from\r\\n\\t\\t\\t\\tthe mufassal.\r\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "8",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Umar ibn al-Khattab wrote to Abu Musa\\n\\t\\t\\t\\tal-Ashari that he should pray asr when the sun was still\\n\\t\\t\\t\\tpure white so that a man could ride threefarsakhs (before\\n\\t\\t\\t\\tmaghrib) and that he should pray isha during the first\\n\\t\\t\\t\\tthird of the night, or, if he delayed it, then up until\\n\\t\\t\\t\\tthe middle of the night, and he warned him not to be\\n\\t\\t\\t\\tforgetful.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "9",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Ziyad that\\n\\t\\t\\t\\tAbdullah ibn Rafi, the mawla of Umm Salama, the wife of\\n\\t\\t\\t\\tthe Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tasked Abu Hurayra about the time of the prayer. Abu\\n\\t\\t\\t\\tHurayra said, \"Let me tell you. Pray dhuhr when the\\n\\t\\t\\t\\tlength of your shadow matches your height, asr when your\\n\\t\\t\\t\\tshadow is twice your height, maghrib when the sun has\\n\\t\\t\\t\\tset, isha in the first third of the night, and subh in\\n\\t\\t\\t\\tthe very first light of dawn,\" i.e. when the dawn has\\n\\t\\t\\t\\tdefinitely come.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "10",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that Anas ibn Malik said, \"We would pray\\n\\t\\t\\t\\tasr and anyone who then went to the Bani Amr ibn Awf\\n\\t\\t\\t\\twould find them praying asr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "11",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Anas\\n\\t\\t\\t\\tibn Malik said, \"We would pray asr and anyone who then\\n\\t\\t\\t\\twent to Quba would arrive there while the sun was still\\n\\t\\t\\t\\thigh.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "12",
    "sectionHeading": "The Times of Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that al Qasim ibn Muhammad said, \"None of the\\n\\t\\t\\t\\tcompanions that I met prayed dhuhr until well after\\n\\t\\t\\t\\tnoon,\"(i.e.until when the sun had lost its fierceness).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "13",
    "sectionHeading": "The Time of the Jumua Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from his uncle Abu Suhayl\\n\\t\\t\\t\\tibn Malik that his father said, \"I used to see a carpet\\n\\t\\t\\t\\tbelonging to Aqil ibn Abi Talib spread out on the day of\\n\\t\\t\\t\\tjumua up to the west wall of the mosque. When the shadow\\n\\t\\t\\t\\tof the wall covered the whole carpet, Umar ibn al-Khattab\\n\\t\\t\\t\\twould come out and pray the jumua prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik, Abu Suhayl's father, added, \"We would then return\\n\\t\\t\\t\\tafter the jumua prayer and take our midday sleep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "14",
    "sectionHeading": "The Time of the Jumua Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amr ibn Yahya ibn\\n\\t\\t\\t\\tYahya al-Mazini from Ibn Abi Salit that Uthman ibn Affan\\n\\t\\t\\t\\tprayed jumua in Madina and asr in Malal (a place\\n\\t\\t\\t\\tseventeen miles from Madina).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"That was by praying jumua just past\\n\\t\\t\\t\\tmidday and then travelling fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "15",
    "sectionHeading": "Catching a Raka of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tSalama ibn Abdar-Rahman from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said \"Whoever catches a raka of the prayer has\\n\\t\\t\\t\\tcaught the prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "16",
    "sectionHeading": "Catching a Raka of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar ibn al-Khattab used to say, \"If the ruku has\\n\\t\\t\\t\\tpassed you by, so has the sajda.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "17",
    "sectionHeading": "Catching a Raka of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar and Zayd ibn Thabit used to say,\\n\\t\\t\\t\\t\"Whoever catches the ruku has caught the sajda.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "18",
    "sectionHeading": "Catching a Raka of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abu\\n\\t\\t\\t\\tHurayra used to say, \"Whoever catches the ruku has caught\\n\\t\\t\\t\\tthe sajda and whoever misses the recitation of the umm\\n\\t\\t\\t\\tal-Qur'an has missed much good.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "19",
    "sectionHeading": "Duluk ash-Shams and Ghasaq al-Layl",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Duluk ash-shams begins from when\\n\\t\\t\\t\\tthe sun passes the meridian.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "20",
    "sectionHeading": "Duluk ash-Shams and Ghasaq al-Layl",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Da'ud ibn al-Husayn\\n\\t\\t\\t\\tsaid that someone had told him Abdullah ibn Abbas used to\\n\\t\\t\\t\\tsay, \"Duluk ash-shams begins from when the sun passes the\\n\\t\\t\\t\\tmeridian. Ghasaq al-layl is the gathering of the night\\n\\t\\t\\t\\tand its darkness.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "21",
    "sectionHeading": "The Times of Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"If someone misses the asr\\n\\t\\t\\t\\tprayer it is as if he has suffered a great misfortune in\\n\\t\\t\\t\\this family and wealth .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "22",
    "sectionHeading": "The Times of Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tonce Umar ibn al-Khattab left after doing the asr prayer\\n\\t\\t\\t\\tand met a man who had not been there. Umar asked him what\\n\\t\\t\\t\\thad kept him from the prayer and eventhough the man gave\\n\\t\\t\\t\\ta good reason, Umar said, \"You have given yourself short\\n\\t\\t\\t\\tmeasure.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya added that Malik commented, \"It is said that\\n\\t\\t\\t\\teverything has a short measure and a full measure.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "23",
    "sectionHeading": "The Times of Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik thatYahya ibn Said used to\\n\\t\\t\\t\\tsay, \"Even if someone manages to pray before the time of\\n\\t\\t\\t\\tthe prayer has passed, the time that has passed him by is\\n\\t\\t\\t\\tmore important, or better, than his family and wealth.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"If the time for a prayer\\n\\t\\t\\t\\tcomes and a traveller delays a prayer through neglect or\\n\\t\\t\\t\\tforgetfulness until he reaches his family, he should do\\n\\t\\t\\t\\tthat prayer in full if he arrives within the time. But if\\n\\t\\t\\t\\the arrives when the time has past, he should do the\\n\\t\\t\\t\\ttravelling prayer. That way he only repays what he owes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I have found the people and men\\n\\t\\t\\t\\tof knowledge doing in our community.\" Malik explained\\n\\t\\t\\t\\tthat shafaq was the redness in the sky after the sun had\\n\\t\\t\\t\\tset, and said, \"When the redness has gone then the isha\\n\\t\\t\\t\\tprayer is due and you have left the time of maghrib.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "24",
    "sectionHeading": "The Times of Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that one time\\n\\t\\t\\t\\tAbdullah ibn Umar fainted and lost his senses and he did\\n\\t\\t\\t\\tnot make up the prayer.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"We consider that that was because, and\\n\\t\\t\\t\\tAllah knows best, the time had passed. Someone who\\n\\t\\t\\t\\trecovers within the time has to pray.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "25",
    "sectionHeading": "Sleeping Through the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, travelled by night on the\\n\\t\\t\\t\\tway back from Khaybar.Towards the end of the night he\\n\\t\\t\\t\\tstopped for a rest and told Bilal to stay awake to keep\\n\\t\\t\\t\\twatch for the subh prayer. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and his companions\\n\\t\\t\\t\\tslept. Bilal stayed on guard as long as was decreed for\\n\\t\\t\\t\\thim and then he leant against his riding camel facing the\\n\\t\\t\\t\\tdirection of the dawn and sleep overcame him and neither\\n\\t\\t\\t\\the nor the Messenger of Allah nor any of the party woke\\n\\t\\t\\t\\tup until the sun's rays had struck them. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\talarmed. Bilal excused himself, saying, \"Messenger of\\n\\t\\t\\t\\tAllah! The One who took your self was the One who took\\n\\t\\t\\t\\tmyself. \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, ordered the party to move on and so they\\n\\t\\t\\t\\troused thei r mounts and rode on a short distance. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, ordered Bilal to give the iqama and then led them\\n\\t\\t\\t\\tin the subh prayer. When he had finished he said, \"Anyone\\n\\t\\t\\t\\twho forgets a prayer should pray it when he remembers.\\n\\t\\t\\t\\tAllah theBlessed and Exalted says in His book, 'Establish\\n\\t\\t\\t\\tthe prayer to remember Me.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "26",
    "sectionHeading": "Sleeping Through the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Zayd ibn Aslam said,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, stopped for a rest one night on the way to\\n\\t\\t\\t\\tMakka and appointed Bilal to wake them up for the prayer.\\n\\t\\t\\t\\tBilal slept and everyone else slept and none of them woke\\n\\t\\t\\t\\tup until the sun had risen. When they did wake up they\\n\\t\\t\\t\\twere all alarmed. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, ordered them to ride out of the\\n\\t\\t\\t\\tvalley, saying that there was a shaytan in it. So they\\n\\t\\t\\t\\trode out of the valley and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, ordered them to\\n\\t\\t\\t\\tdismount and do wudu and he told Bilal either to call the\\n\\t\\t\\t\\tprayer or to give the iqama.TheMessenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, then led them in the\\n\\t\\t\\t\\tprayer. Noticing their uneasiness, he went to them and\\n\\t\\t\\t\\tsaid, 'O people! Allah seized our spirits (arwah) and if\\n\\t\\t\\t\\tHe had wished He would have returned them to us at a time\\n\\t\\t\\t\\tother than this. So if you sleep through the time for a\\n\\t\\t\\t\\tprayer or forget it and then are anxious about it, pray\\n\\t\\t\\t\\tit as if you were praying it in its time.' The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, turned\\n\\t\\t\\t\\tto Abu Bakr and said, 'Shaytan came to Bilal when he was\\n\\t\\t\\t\\tstanding in prayer and made him lie down and lulled him\\n\\t\\t\\t\\tto sleep like a small boy.' The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, then called Bilal\\n\\t\\t\\t\\tand told him the same as he had told Abu Bakr. Abu Bakr\\n\\t\\t\\t\\tdeclared, 'I bear witness that you are the Messenger of\\n\\t\\t\\t\\tAllah.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "27",
    "sectionHeading": "Prohibition against Doing the Prayer at the Hottest Hour of the Day",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Scorching heat is a\\n\\t\\t\\t\\tpart of the blast of Jahannam. So, when the heat is\\n\\t\\t\\t\\tfierce, delay the prayer until it gets cooler.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe added in explanation, \"The Fire complained to its Lord\\n\\t\\t\\t\\tand said, 'My Lord, part of me has eaten another part,'\\n\\t\\t\\t\\tso He allowed it two breaths in every year, a breath in\\n\\t\\t\\t\\twinter and a breath in summer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "28",
    "sectionHeading": "Prohibition against Doing the Prayer at the Hottest Hour of the Day",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to us from Abdullah ibn Yazid the mawla of\\n\\t\\t\\t\\tal-Aswad ibn Sufyan, from Abu Salama ibn Abd ar-Rahman\\n\\t\\t\\t\\tfrom Muhammad ibn Abd ar-Rahman ibn Thawban from Abu\\n\\t\\t\\t\\tHurayra that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"When the heat is fierce delay\\n\\t\\t\\t\\tthe prayer until it gets cooler, for scorching heat is a\\n\\t\\t\\t\\tpart of the blast of Jahannam.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe added, \"The Fire complained to its Lord, so He allowed\\n\\t\\t\\t\\tit two breaths in each year, a breath in winter and a\\n\\t\\t\\t\\tbreath in summer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "29",
    "sectionHeading": "Prohibition against Doing the Prayer at the Hottest Hour of the Day",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When the heat\\n\\t\\t\\t\\tis fierce, wait until it gets cooler before you do the\\n\\t\\t\\t\\tprayer, for scorching heat is from the blast of\\n\\t\\t\\t\\tJahannam.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t1.8 The Prohibition against Entering the Mosque Smelling\\n\\t\\t\\t\\tof Garlic and the Prohibition against covering the Mouth\\n\\t\\t\\t\\tin Prayer\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "30",
    "sectionHeading": "The Prohibition against Entering the Mosque Smelling of Garlic and the Prohibition against covering the Mouth in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Anyone who eats\\n\\t\\t\\t\\tthis plant should not come near our mosques. The smell of\\n\\t\\t\\t\\tthe garlic will offend us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "1",
    "hadithNumber": "31",
    "sectionHeading": "The Prohibition against Entering the Mosque Smelling of Garlic and the Prohibition against covering the Mouth in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Mujabbar that he used to see Salim ibn Abdullah pull\\n\\t\\t\\t\\tthe cloth away fiercely from the mouth of any man he saw\\n\\t\\t\\t\\tcovering his mouth while praying.\\n\\t\\t\\t</p>"
  }
]
