[
  {
    "SurahNumber": "39",
    "AyahNumber": "1",
    "NoteID": "4242",
    "Body": "In connection with Revelation two qualities of Allah are\\n\\t\\t\\t\\tmentioned: (1) that He is All-Powerful and can carry out\\n\\t\\t\\t\\tHis Will in spite of all opposition; and (2) that He is\\n\\t\\t\\t\\tfull of knowledge and wisdom. The first answers those who\\n\\t\\t\\t\\tquestion how Allah can send Revelation to man; the second\\n\\t\\t\\t\\texplains that true wisdom consists in carrying out\\n\\t\\t\\t\\tAllah's Will as revealed to us."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "3",
    "NoteID": "4243",
    "Body": "In the many Signs in Creation as described below, there\\n\\t\\t\\t\\tyet is a clear indication of the unity of Plan, pointing\\n\\t\\t\\t\\tto the Unity of the Creator. Worship or service is due to\\n\\t\\t\\t\\tnone but Him. And He wants exclusive and sincere\\n\\t\\t\\t\\tdevotion."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "3",
    "NoteID": "4244",
    "Body": "Worshippers of Idols or of deities other than Allah,\\n\\t\\t\\t\\te.g., saints or perhaps Wealth and Power, Science or\\n\\t\\t\\t\\tSelfish Desire, may pretend that these are symbols that\\n\\t\\t\\t\\tmay get them nearer to their self-development, nearer to\\n\\t\\t\\t\\tthe goal of their life, nearer to Allah, but they are\\n\\t\\t\\t\\taltogether on the wrong track."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "3",
    "NoteID": "4245",
    "Body": "This departure of theirs from true worship, this\\n\\t\\t\\t\\tdivergence from the right way, produces endless\\n\\t\\t\\t\\tdisputations and sects. Allah will judge between them.\\n\\t\\t\\t\\tBut if they are determined to go after falsehoods and\\n\\t\\t\\t\\tforget the gratitude and service which they owe to Allah,\\n\\t\\t\\t\\tand Allah alone, they are putting themselves on a Path\\n\\t\\t\\t\\twhere they will get no guidance. They are cutting\\n\\t\\t\\t\\tthemselves off from revealed Truth."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "4",
    "NoteID": "4246",
    "Body": "It is blasphemy to say that Allah begot a son. If that\\n\\t\\t\\t\\twere true, He should have had a wife (vi. 101), and His\\n\\t\\t\\t\\tson would have been of the same kind as Himself; whereas\\n\\t\\t\\t\\tAllah is one, with no one else like unto Him (cxii. 4).\\n\\t\\t\\t\\tBegetting is an animal act which goes with sex. How can\\n\\t\\t\\t\\tit be consistent with our conception of One Who is above\\n\\t\\t\\t\\tall Creatures? If such a blasphemous thought were\\n\\t\\t\\t\\tpossible, as that Allah wanted some one else to help Him,\\n\\t\\t\\t\\tHe could have chosen the best of His creatures instead of\\n\\t\\t\\t\\tlowering Himself to an animal act. But glory to Allah! He\\n\\t\\t\\t\\tis above such things! His Unity is the first thing that\\n\\t\\t\\t\\twe have to learn about Him. As He is Omnipotent, He\\n\\t\\t\\t\\trequires no creatures to help Him or bring other\\n\\t\\t\\t\\tcreatures to Him."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "5",
    "NoteID": "4247",
    "Body": "Cf. vi. 73, and n. 896."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "5",
    "NoteID": "4248",
    "Body": "His Power is equalled by His Mercy. Who can there be like\\n\\t\\t\\t\\tunto Him?"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "4249",
    "Body": "Cf. iv. 1, and n. 504."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "4250",
    "Body": "See vi. 143-4, where four kinds of cattle are mentioned\\n\\t\\t\\t\\tin pairs in connection with certain Arab superstitions\\n\\t\\t\\t\\twhich are there condemned. Here the, same four kinds are\\n\\t\\t\\t\\tmentioned as representative of domesticated cattle given\\n\\t\\t\\t\\tby Allah as useful to man. These are sheep, goats,\\n\\t\\t\\t\\tcamels, and oxen. In Arab idiom the horse is not included\\n\\t\\t\\t\\tamong \"cattle\". For the wisdom and goodness of Allah in\\n\\t\\t\\t\\tgranting man dominion over cattle, see xxxvi. 71-73."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "4251",
    "Body": "See xxii. 5, where the gradual physical growth of man in\\n\\t\\t\\t\\tseveral successive stages is mentioned as one of the\\n\\t\\t\\t\\tSigns of Allah's creative Power and cherishing care."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "4252",
    "Body": "The three veils of darkness which cover the unborn child\\n\\t\\t\\t\\tare: the caul or membrane, the womb, and the hollow in\\n\\t\\t\\t\\twhich the womb is enclosed."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "4253",
    "Body": "It is clear that you owe your very existence and your\\n\\t\\t\\t\\tmaintenance, growth, and preservation, to Allah; How is\\n\\t\\t\\t\\tit that you are turned away by chance things from Him?"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "7",
    "NoteID": "4254",
    "Body": "Allah is independent of all wants, and therefore man's\\n\\t\\t\\t\\tingratitude does not affect Allah. But Allah cares for\\n\\t\\t\\t\\tman, and therefore man's gratitude and service earn\\n\\t\\t\\t\\tAllah's Good Pleasure, and man's ingratitude and\\n\\t\\t\\t\\trebellion are displeasing to Allah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "7",
    "NoteID": "4255",
    "Body": "Cf. vi. 164. The account is between you and Allah. No one\\n\\t\\t\\t\\telse can take your burdens or carry your sins. Vicarious\\n\\t\\t\\t\\tatonement would be unjust. You have to return to Allah in\\n\\t\\t\\t\\tthe Hereafter. You will find that He knows all that you\\n\\t\\t\\t\\tdid in this life, and its full significance. He will\\n\\t\\t\\t\\texplain to you even better than you can understand\\n\\t\\t\\t\\tyourself; because all your secret hidden motives, which\\n\\t\\t\\t\\tyou sometimes tried to ignore yourself, are fully known\\n\\t\\t\\t\\tto Him."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "8",
    "NoteID": "4256",
    "Body": "Cf. x. 12. Trouble and adversity often bring a man to his\\n\\t\\t\\t\\tbearings. But if he is not firm and constant, he forgets\\n\\t\\t\\t\\tthe lessons which life is meant to teach him. As soon as\\n\\t\\t\\t\\the gets a little prosperity, he forgets that it is from\\n\\t\\t\\t\\tAllah, and attributes it to something which may only be a\\n\\t\\t\\t\\tsecondary cause, e.g., his own efforts or the Powers of\\n\\t\\t\\t\\tNature, or something which he has invented and made into\\n\\t\\t\\t\\ta god, e.g., idols or fate. Allah is the Ultimate Cause\\n\\t\\t\\t\\tof all things. To set up rivals to him in this way is not\\n\\t\\t\\t\\tonly wrong and degrading to the false worshipper himself,\\n\\t\\t\\t\\tbut misleads countless ignorant people, who may not be\\n\\t\\t\\t\\table to make allowances for the figures of speech or the\\n\\t\\t\\t\\tsymbolism by which subtler minds can explain away\\n\\t\\t\\t\\tfalsehoods."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "8",
    "NoteID": "4257",
    "Body": "Those who practise and those who teach evil and blasphemy\\n\\t\\t\\t\\tmay seem to flourish in this world. But their\\n\\t\\t\\t\\tsatisfaction will be of very short duration. They are\\n\\t\\t\\t\\ttreading all the while the Path that leads to the Fire of\\n\\t\\t\\t\\tPerdition."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "9",
    "NoteID": "4258",
    "Body": "Cf. iii. 113-117. It is a great thing when a man gets\\n\\t\\t\\t\\tinto the attitude of humble devotion to Allah. To him the\\n\\t\\t\\t\\thereafter is a real thing, and he prepares for it with\\n\\t\\t\\t\\tgood works. He does not build his hopes on the vanities\\n\\t\\t\\t\\tof this world, but on Allah's Grace and Mercy. Such a man\\n\\t\\t\\t\\tis \"endued with understanding\" and receives Allah's\\n\\t\\t\\t\\tMessage with fervour and alacrity. He is not to be\\n\\t\\t\\t\\tcompared with the cynic or the unbeliever, who knows\\n\\t\\t\\t\\tnothing of the real value of the inner life."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "9",
    "NoteID": "4259",
    "Body": "Cf. iii. 19."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "10",
    "NoteID": "4260",
    "Body": "The \"fear of Allah\" (Taqwa) is explained in n. 26 to ii.\\n\\t\\t\\t\\t2. Sec also n. 2912 to xxiii. 60. The fear of Allah is\\n\\t\\t\\t\\takin to love, for it means that we are afraid to\\n\\t\\t\\t\\tdisplease Him."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "10",
    "NoteID": "4261",
    "Body": "Cf. xxix. 56 and n. 3489. We must always do right. We\\n\\t\\t\\t\\tcannot plead that the circumstances in which we find\\n\\t\\t\\t\\tourselves force our hands. If our home conditions do not\\n\\t\\t\\t\\tallow us to act according to the Faith that is in us, we\\n\\t\\t\\t\\tmust be prepared to suffer ostracism or even exile."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "12",
    "NoteID": "4262",
    "Body": "Cf. vi. 14. \"The first\" need not necessarily be\\n\\t\\t\\t\\tchronological: it may also refer to the first rank in\\n\\t\\t\\t\\tzeal, and in readiness to suffer for the Cause."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "13",
    "NoteID": "4263",
    "Body": "Cf. vi. 15. The worst penalty in a spiritual sense is the\\n\\t\\t\\t\\tDispleasure of Allah, just as the highest achievement,\\n\\t\\t\\t\\tthe fulfilment of all desire, is the attainment of\\n\\t\\t\\t\\tAllah's Good Pleasure: vi. 16."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "15",
    "NoteID": "4264",
    "Body": "This is not a command or permission but a reproach and\\n\\t\\t\\t\\twarning. The address of the Prophet of Allah may be\\n\\t\\t\\t\\tparaphrased thus: 'Whatever happens I will follow the\\n\\t\\t\\t\\tcommand of Allah. He has revealed Himself, and I know\\n\\t\\t\\t\\tthat He is One, supreme over all creatures. Him alone\\n\\t\\t\\t\\twill I serve. Is there any so ignorant as to seek anyone\\n\\t\\t\\t\\telse? Let him do so and see the result. The loss will be\\n\\t\\t\\t\\this own. For he falls from Grace into Evil.'"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "15",
    "NoteID": "4265",
    "Body": "The cult of Evil results in the destruction of all that\\n\\t\\t\\t\\tis best and most valuable in us, as well as poisons all\\n\\t\\t\\t\\tthe affections which link us to our families, friends,\\n\\t\\t\\t\\tand people, in the Final Adjustment, which we call the\\n\\t\\t\\t\\tDay of Judgment."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "16",
    "NoteID": "4266",
    "Body": "The consequences of Sin when Judgment comes are aptly\\n\\t\\t\\t\\tfigured by Layers upon Layers of Fire, which hem in the\\n\\t\\t\\t\\tsinners above and below. It is also suggested that the\\n\\t\\t\\t\\tLayers, though of Fire, have something dark in them-the\\n\\t\\t\\t\\tscorching quality of Sin."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "16",
    "NoteID": "4267",
    "Body": "But Allah does not leave mankind without warning. Man has\\n\\t\\t\\t\\tbeen granted a limited amount of free-will, and in order\\n\\t\\t\\t\\tto help him in its right use, all the consequences of his\\n\\t\\t\\t\\taction are clearly explained to him. To those who will\\n\\t\\t\\t\\tlisten to Reason are given arguments which can be\\n\\t\\t\\t\\tapprehended by their own intelligence; to those who are\\n\\t\\t\\t\\tswayed by affections and emotion, an appeal is made in\\n\\t\\t\\t\\tthe name of the love of Allah; to those who understand\\n\\t\\t\\t\\tnothing but fear, the warning is conveyed by a portrayal\\n\\t\\t\\t\\tof the dreadful consequences of wrong-doing."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "17",
    "NoteID": "4268",
    "Body": "There is always the danger that Evil may seize us even if\\n\\t\\t\\t\\twe approach it out of mere curiosity. If we take an\\n\\t\\t\\t\\tinterest in it we may become its worshippers or slaves.\\n\\t\\t\\t\\tThe wise man eschews it altogether, and so he enrols\\n\\t\\t\\t\\tamong the Servants of Allah, and gets the good news of\\n\\t\\t\\t\\tHis Mercy and Good Pleasure."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "18",
    "NoteID": "4269",
    "Body": "The Commentators construe this clause in two alternative\\n\\t\\t\\t\\tways. (1) If \"word\" be taken as any word, the clause\\n\\t\\t\\t\\twould mean that good men listen to all that is said and\\n\\t\\t\\t\\tchoose the best of it. (2) If \"word\" be taken to mean\\n\\t\\t\\t\\tAllah's Word, it would mean that they should listen\\n\\t\\t\\t\\treverently to it, and where permissive and alternative\\n\\t\\t\\t\\tcourses are allowed for those who are not strong enough\\n\\t\\t\\t\\tto follow the higher course, those \"endued with\\n\\t\\t\\t\\tunderstanding\" should prefer to attempt the higher course\\n\\t\\t\\t\\tof conduct. For example, it is permitted (within limits)\\n\\t\\t\\t\\tto punish those who wrong us, but the nobler course is to\\n\\t\\t\\t\\trepel evil with good (xxiii. 96): we should try to follow\\n\\t\\t\\t\\tthe nobler course. I prefer the latter construction: it\\n\\t\\t\\t\\taccords better with my interpretation of the last verse:\\n\\t\\t\\t\\tsee n. 4268."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "19",
    "NoteID": "4270",
    "Body": "If a man is already steeped in sin and has rejected\\n\\t\\t\\t\\tAllah's Grace, how can we expect Revelation to work in\\n\\t\\t\\t\\this soul?"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "20",
    "NoteID": "4271",
    "Body": "Cf. xxix. 58, and xxxiv, 37. The idea of heaven here is\\n\\t\\t\\t\\tthat of a Home of sublimity and beauty, with a\\n\\t\\t\\t\\tpicturesque outlook, such as we would describe in this\\n\\t\\t\\t\\tlife by the type of a palace by gently-flowing streams.\\n\\t\\t\\t\\tThe mansions will also suggest generous space and\\n\\t\\t\\t\\tarchitectural beauty, tiers upon tiers piled one upon\\n\\t\\t\\t\\tanother."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "20",
    "NoteID": "4272",
    "Body": "Mi'ad: the time, place, and manner of the fulfilment of a\\n\\t\\t\\t\\tPromise. Allah's promise will be fulfilled in all\\n\\t\\t\\t\\tparticulars better than we can possibly imagine."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "21",
    "NoteID": "4273",
    "Body": "The circuit of water, by which the rain falls from the\\n\\t\\t\\t\\tclouds, is absorbed through the earth, and flows through\\n\\t\\t\\t\\trivers or underground streams to the sea, where it again\\n\\t\\t\\t\\trises as vapour and forms clouds, was explained in notes\\n\\t\\t\\t\\t3111-12 to xxv 53. Here our attention is drawn to one\\n\\t\\t\\t\\tportion of the process. The rain fructifies the soil and\\n\\t\\t\\t\\tthe seeds. Produce of various kinds is raised. The\\n\\t\\t\\t\\tharvest ripens and is gathered in. The plants wither, dry\\n\\t\\t\\t\\tup, and crumble away. Men and animals are fed. And the\\n\\t\\t\\t\\tcircuit starts again in another season. Here is a Sign of\\n\\t\\t\\t\\tthe Grace and Goodness of Allah, clear to those who\\n\\t\\t\\t\\tunderstand."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "22",
    "NoteID": "4274",
    "Body": "Those who listen to Allah's Message find at each stage\\n\\t\\t\\t\\tAllah's Grace helping them more and more to expand their\\n\\t\\t\\t\\tspiritual understanding and to receive Allah's light, so\\n\\t\\t\\t\\tthat they travel farther and farther to their Goal in the\\n\\t\\t\\t\\tPath of Truth and Righteousness. They are not to be\\n\\t\\t\\t\\tcompared to those who shut out Allah's Light from their\\n\\t\\t\\t\\thearts. See next note."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "22",
    "NoteID": "4275",
    "Body": "Just as there is spiritual progress for those who seek\\n\\t\\t\\t\\tAllah, so there is more and more spiritual retrogression\\n\\t\\t\\t\\tfor those who close their hearts to Allah. Their hearts\\n\\t\\t\\t\\tget hardened, and they allow less and less Allah's Grace\\n\\t\\t\\t\\tto penetrate within. But it is obvious that they flounder\\n\\t\\t\\t\\ton the Way, and cannot walk with the firm steps of those\\n\\t\\t\\t\\tof assured Faith."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "4276",
    "Body": "Is Mutashabih here to be understood in the same sense as\\n\\t\\t\\t\\tin iii. 7? See n. 347. The better opinion is that there\\n\\t\\t\\t\\tis a slightly different shade of meaning here, as\\n\\t\\t\\t\\tsuggested by the context. In the earlier passage, it was\\n\\t\\t\\t\\topposed to Muhkam: here it is contrasted or compared to\\n\\t\\t\\t\\tMathani. The root meaning is: 'having something similar;\\n\\t\\t\\t\\tworking by analogy or allegory, or parable; having its\\n\\t\\t\\t\\tparts consistent with each other'. The last meaning I\\n\\t\\t\\t\\tadopt here. The Qur-an was revealed in parts at different\\n\\t\\t\\t\\ttimes. And yet its parts all conform to each other. There\\n\\t\\t\\t\\tis no contradiction or inconsistency anywhere."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "4277",
    "Body": "Mathani: Cf. xv. 87, where we have translated\\n\\t\\t\\t\\t\"oft-repeated\": \"the seven oft- repeated (verses)\". See\\n\\t\\t\\t\\tn. 2008 to that passage. Here the meaning is similar, but\\n\\t\\t\\t\\tthe context gives a different colour to it, as is seen in\\n\\t\\t\\t\\tthe translation."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "4278",
    "Body": "The skin is the outer integument of the body. It receives\\n\\t\\t\\t\\tthe first shock from the impact of anything unusual, and\\n\\t\\t\\t\\tit trembles and its hair stands on end under excitement.\\n\\t\\t\\t\\tSo in spiritual matters the first stimulation from\\n\\t\\t\\t\\tAllah's Message is external. Those who receive Faith do\\n\\t\\t\\t\\tit as it were with tremor and not with apathy. But the\\n\\t\\t\\t\\tnext stage is that it penetrates their outer nature and\\n\\t\\t\\t\\tgoes right into their hearts. Their whole nature is\\n\\t\\t\\t\\t\"softened\" to receive the beneficent Message, and it\\n\\t\\t\\t\\ttransforms them through and through."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "4279",
    "Body": "\"Whom He pleases\" and \"leaves to stray\" are explained\\n\\t\\t\\t\\tfully in n. 2133 to xvi. 93. See also xiv. 4 and n. 1875."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "24",
    "NoteID": "4280",
    "Body": "The unrepentant Sinners will receive the full Penalty on\\n\\t\\t\\t\\tthe Day of Judgment. They will receive it full in the\\n\\t\\t\\t\\tface, i.e., their whole being will be affected by it.\\n\\t\\t\\t\\tTheir hands will be tied, and they cannot therefore use\\n\\t\\t\\t\\ttheir hands to ward off the Penalty of the Fire: in any\\n\\t\\t\\t\\tcase their hands will not have the power to ward it off.\\n\\t\\t\\t\\tAre such helpless people to be compared for a moment with\\n\\t\\t\\t\\tpeople who have received Grace and are therefore guarded\\n\\t\\t\\t\\tfrom all harm and danger? Certainly not. To the evil the\\n\\t\\t\\t\\tfruit of their deed, and to the good the grace of their\\n\\t\\t\\t\\tLord!"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "24",
    "NoteID": "4281",
    "Body": "That is, of all their misdeeds, all the evil which they\\n\\t\\t\\t\\tdid in the world."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "25",
    "NoteID": "4282",
    "Body": "Cf. xvi. 26. They will be punished from quarters or in\\n\\t\\t\\t\\tways they do not perceive. From their Unbelief and\\n\\t\\t\\t\\tRebellion they think they derive great advantages, but\\n\\t\\t\\t\\tthey suddenly find out, when too late, that that which\\n\\t\\t\\t\\tthey exulted in was the cause of their own undoing."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "26",
    "NoteID": "4283",
    "Body": "Cf. ii. 114. Sin often brings disgrace and humiliation in\\n\\t\\t\\t\\tthis life, but the greater and truer punishment is in the\\n\\t\\t\\t\\tHereafter. But men often do not know the inwardness of\\n\\t\\t\\t\\tthis matter. If they flourish here for a time, they think\\n\\t\\t\\t\\tthey will escape the real consequences in the Hereafter.\\n\\t\\t\\t\\tOr if they suffer little harm here, they think that will\\n\\t\\t\\t\\tmake up the Penalty, and they will escape the Hereafter.\\n\\t\\t\\t\\tBoth ideas are wrong."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "27",
    "NoteID": "4284",
    "Body": "Men can only understand high spiritual truths by parables\\n\\t\\t\\t\\tand similitudes and these are given abundantly in the\\n\\t\\t\\t\\tQur-an. The object is, not merely to tell stories, but to\\n\\t\\t\\t\\tteach lessons of spiritual wisdom."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "28",
    "NoteID": "4285",
    "Body": "Previous revelations had been in other languages. Now the\\n\\t\\t\\t\\trevelation was given in Arabia in Arabic itself, the\\n\\t\\t\\t\\tlanguage of the country which all could understand. And\\n\\t\\t\\t\\tit is a beautiful language, straight and flexible, and\\n\\t\\t\\t\\tfit to be the vehicle of sublime truths."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "28",
    "NoteID": "4286",
    "Body": "See xviii. I and n. 2326. Cf. also vii. 45, n. 1024; and\\n\\t\\t\\t\\txix. 36, n. 2488."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "29",
    "NoteID": "4287",
    "Body": "The difference between the creed of Polytheism and the\\n\\t\\t\\t\\tGospel of Unity is explained by the analogy of two men.\\n\\t\\t\\t\\tOne belongs to many masters; the masters disagree among\\n\\t\\t\\t\\tthemselves, and the poor man of many masters has to\\n\\t\\t\\t\\tsuffer from the quarrel of his many masters; it is an\\n\\t\\t\\t\\timpossible and unnatural position. The other serves only\\n\\t\\t\\t\\tone master, his master is good, and does all he can for\\n\\t\\t\\t\\this servant; the servant can concentrate his attention on\\n\\t\\t\\t\\this service; he is happy himself and his service is\\n\\t\\t\\t\\tefficiently performed. Can there be any doubt as to (1)\\n\\t\\t\\t\\twhich of them is the happier, and (2) which of them is in\\n\\t\\t\\t\\ta more natural position? No man can serve two, still less\\n\\t\\t\\t\\tnumerous, masters."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "29",
    "NoteID": "4288",
    "Body": "Allah is praised that He has put us, not under gods many\\n\\t\\t\\t\\tand lords many, but has, out of Hiis infinite Mercy,\\n\\t\\t\\t\\tallowed us direct approach to Him, the One, the True, the\\n\\t\\t\\t\\tEternal."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "30",
    "NoteID": "4289",
    "Body": "Even the prophets are not exempt from bodily death, much\\n\\t\\t\\t\\tless the righteous, but they live in their beneficent\\n\\t\\t\\t\\twork and the memories they leave behind them. All men\\n\\t\\t\\t\\thave to die, good and bad alike. But there is a life\\n\\t\\t\\t\\tafter death, and in that life all the unexplained things\\n\\t\\t\\t\\tabout which people dispute in this world will be made\\n\\t\\t\\t\\tclear in the presence of Allah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "31",
    "NoteID": "4290",
    "Body": "See last note."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "32",
    "NoteID": "4291",
    "Body": "When the creature deliberately adopts and utters\\n\\t\\t\\t\\tfalsehoods against his own Creator, in spite of the Truth\\n\\t\\t\\t\\tbeing brought, as it were, to his very door by Allah's\\n\\t\\t\\t\\tSigns, what offence can we imagine more heinous than\\n\\t\\t\\t\\tthis? In Christian theology this is the blasphemy\\n\\t\\t\\t\\t\"against the Holy Ghost\" spoken of in Matt. xii. 31-32:\\n\\t\\t\\t\\t\"whosoever speaketh a word against the Son of man\",\\n\\t\\t\\t\\t(Christ), \"it shall be forgiven him; but whosoever\\n\\t\\t\\t\\tspeaketh against the Holy Ghost, it shall not be forgiven\\n\\t\\t\\t\\thim, neither in this world, neither in the world to\\n\\t\\t\\t\\tcome\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "32",
    "NoteID": "4292",
    "Body": "Cf. iii. 151; xvi. 29."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "33",
    "NoteID": "4293",
    "Body": "This is true of the Prophet, and all Prophets of God and\\n\\t\\t\\t\\tall righteous persons. Any one who preaches the Truth and\\n\\t\\t\\t\\tbrings home Allah's Signs to men is performing the duty\\n\\t\\t\\t\\tof a right and noble life. In this he confirms the\\n\\t\\t\\t\\tteaching of all previous Prophets of Allah. Any one who\\n\\t\\t\\t\\tsupports and confirms such a teacher is also doing his\\n\\t\\t\\t\\tduty and on the right way."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "34",
    "NoteID": "4294",
    "Body": "At that stage their wills will have been purified. If an\\n\\t\\t\\t\\tearthly king gives a decoration, how much greater is the\\n\\t\\t\\t\\thonour when the investiture takes place by the king\\n\\t\\t\\t\\thimself personally?"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "35",
    "NoteID": "4295",
    "Body": "The conjunction (lam in Arabic, translated \"so that\")\\n\\t\\t\\t\\tindicates here the results, not the purpose. Allah's\\n\\t\\t\\t\\tReward is so bounteous, that if we truly and sincerely\\n\\t\\t\\t\\tput our will into His keeping, He will remove the\\n\\t\\t\\t\\tconsequences not only of our minor faults but of the\\n\\t\\t\\t\\tworst of our sins, and judge us according to the very\\n\\t\\t\\t\\tbest of our deeds."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "36",
    "NoteID": "4296",
    "Body": "The righteous man will find Allah enough for all the\\n\\t\\t\\t\\tprotection he needs, all the rest and peace he craves\\n\\t\\t\\t\\tfor, and all the happiness he can imagine. If Satans wish\\n\\t\\t\\t\\tto frighten him with false gods, he knows that that is\\n\\t\\t\\t\\tmere superstition. In the case of idols to whom worship\\n\\t\\t\\t\\tis paid, this is easily intelligible. But there are other\\n\\t\\t\\t\\tfalse gods which men worship,-wealth, position, power,\\n\\t\\t\\t\\tscience, selfish desire, and so on. The idea may occur to\\n\\t\\t\\t\\tthem: \"this is the right course, but what will men say?\"\\n\\t\\t\\t\\tor \"shall I lose my case if I tell the truth?\" or \"will\\n\\t\\t\\t\\tit ruin my chances if I denounce sin in high places?\" All\\n\\t\\t\\t\\tsuch false gods will only mislead and leave their victims\\n\\t\\t\\t\\tin the lurch. The worship of them will lose them the\\n\\t\\t\\t\\tMercy of Allah, which wants to guide and comfort all who\\n\\t\\t\\t\\tseek Allah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "37",
    "NoteID": "4297",
    "Body": "On the other hand if any one holds fast to Allah's Truth,\\n\\t\\t\\t\\tnothing can mislead or betray him."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "37",
    "NoteID": "4298",
    "Body": "Allah's Power can protect, and will defeat all plots\\n\\t\\t\\t\\tagainst His Will, as well as punish Evil when it gets\\n\\t\\t\\t\\tbeyond bounds."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "38",
    "NoteID": "4299",
    "Body": "Cf. xxix. 61; also n. 2927 to xxiii. 85. Most worshippers\\n\\t\\t\\t\\tof false gods are not either atheists or sceptics. They\\n\\t\\t\\t\\tadmit the existence of Allah but it has not come into\\n\\t\\t\\t\\ttheir hearts and souls: it has not been translated into\\n\\t\\t\\t\\ttheir lives. They run after false worship on account of\\n\\t\\t\\t\\tancestral custom or on account of their thoughtlessness\\n\\t\\t\\t\\tor false environment, or on account of their own selfish\\n\\t\\t\\t\\tdesires or limited outlook. To them is addressed the\\n\\t\\t\\t\\targument: 'Ultimately your false gods can do nothing for\\n\\t\\t\\t\\tyou: why not turn to the One True God, on Whom you\\n\\t\\t\\t\\tdepend, and Who can give you Grace and Mercy, Justice and\\n\\t\\t\\t\\tPunishment?'"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "38",
    "NoteID": "4300",
    "Body": "Cf. xxxiii. 17,"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "38",
    "NoteID": "4301",
    "Body": "Cf. xii. 67 and xiv. 12. Allah alone is He Who will and\\n\\t\\t\\t\\tcan discharge any trust put in Him. All other things will\\n\\t\\t\\t\\tfail. Therefore those who put their trust in anything\\n\\t\\t\\t\\tshould put their trust in Allah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "39",
    "NoteID": "4302",
    "Body": "Cf. xi. 121 and n. 1624-A."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "40",
    "NoteID": "4303",
    "Body": "Cf. xi, 93. The two clauses, about those who suffer a\\n\\t\\t\\t\\tPenalty of ignominy and those on whom descends a lasting\\n\\t\\t\\t\\tPenalty, apparently refer to the same persons in two\\n\\t\\t\\t\\tdifferent aspects: (1) they suffer shame, and (2) their\\n\\t\\t\\t\\tpunishment endures."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "41",
    "NoteID": "4304",
    "Body": "Revelation is sent by Allah through His messenger, but it\\n\\t\\t\\t\\tis for all. It is given in order that men and women may\\n\\t\\t\\t\\tbe taught Righteousness. It is given in Truth: there is\\n\\t\\t\\t\\tno pretence about it. It is for their own good. If they\\n\\t\\t\\t\\treject it and follow Evil, the loss is their own."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "41",
    "NoteID": "4305",
    "Body": "Allah's messengers do all they can to teach mankind. But\\n\\t\\t\\t\\tthey cannot force men's wills. If men reject their\\n\\t\\t\\t\\tteaching, the account of the rejecters is with Allah Cf.\\n\\t\\t\\t\\tvi. 107 and n. 935."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "42",
    "NoteID": "4306",
    "Body": "The mystery of life and death, sleep and dreams, is a\\n\\t\\t\\t\\tfascinating enigma, of which the solution is perhaps\\n\\t\\t\\t\\tbeyond the ken of man. A vast mass of superstition as\\n\\t\\t\\t\\twell as imaginative and psychological literature has\\n\\t\\t\\t\\tgrown up about it. But the simplest and truest religious\\n\\t\\t\\t\\tdoctrine is laid down here in a few words. In death we\\n\\t\\t\\t\\tsurrender our physical life, but our soul does not die;\\n\\t\\t\\t\\tit goes back to a plane of existence in which it is more\\n\\t\\t\\t\\tconscious of the realities of the spiritual world: \"Allah\\n\\t\\t\\t\\ttakes the soul\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "42",
    "NoteID": "4307",
    "Body": "Cf. vi. 60. What is sleep? As far as animal life is\\n\\t\\t\\t\\tconcerned, it is the cessation of the working of the\\n\\t\\t\\t\\tnervous system, though other animal functions, such as\\n\\t\\t\\t\\tdigestion, growth, and the circulation of the blood,\\n\\t\\t\\t\\tcontinue, possibly at a different pace. It is the repose\\n\\t\\t\\t\\tof the nervous system, and in this respect it is common\\n\\t\\t\\t\\tto man and animals, and perhaps even to plants, if, as is\\n\\t\\t\\t\\tprobable, plants have a nervous system. The mental\\n\\t\\t\\t\\tprocesses (and certainly volition) are also suspended in\\n\\t\\t\\t\\tsleep, except that in ordinary dreams there is a medley\\n\\t\\t\\t\\tof recollections, which often present vividly to our\\n\\t\\t\\t\\tconsciousness things that do not or cannot happen in\\n\\t\\t\\t\\tnature as we know it in our coordinated minds. But there\\n\\t\\t\\t\\tis another kind of dream which is rarer-one in which the\\n\\t\\t\\t\\tdreamer sees things as they actually happen, backwards or\\n\\t\\t\\t\\tforwards in time, or in which gifted individuals see\\n\\t\\t\\t\\tspiritual truths otherwise imperceptible to them. How can\\n\\t\\t\\t\\twe explain this? It is suggested that our soul or\\n\\t\\t\\t\\tpersonality,-that something which is above our animal\\n\\t\\t\\t\\tlife-is then in a plane of spiritual existence akin to\\n\\t\\t\\t\\tphysical death (see last note), when we are nearer to\\n\\t\\t\\t\\tAllah. In poetic imagery, Sleep is \"twin-brother to\\n\\t\\t\\t\\tDeath\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "42",
    "NoteID": "4308",
    "Body": "Sleep being twin-brother to Death, our souls are for the\\n\\t\\t\\t\\ttime being released from the bondage of the flesh. Allah\\n\\t\\t\\t\\ttakes them for the time being. If, as some do, we are to\\n\\t\\t\\t\\tdie peacefully in sleep, our soul does not come back to\\n\\t\\t\\t\\tthe physical body, and the latter decays and die. If we\\n\\t\\t\\t\\thave still some period of life to fulfil according to\\n\\t\\t\\t\\tAllah's decree, our soul comes back to the body, and we\\n\\t\\t\\t\\tresume our functions in this life."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "42",
    "NoteID": "4309",
    "Body": "If we contemplate these things, we can see more clearly\\n\\t\\t\\t\\tmany spiritual truths: e.g. (1) that our bodily life and\\n\\t\\t\\t\\tdeath are not the whole story of our existence; (2) that\\n\\t\\t\\t\\tin our bodily life we may be dead to the spiritual world,\\n\\t\\t\\t\\tand in our bodily death, may be our awakening to the\\n\\t\\t\\t\\tspiritual world; (3) that our nightly Sleep, besides\\n\\t\\t\\t\\tperforming the function of rest to our physical life,\\n\\t\\t\\t\\tgives us a foretaste of what we call death, which does\\n\\t\\t\\t\\tnot end our personality; and (4) that the Resurrection is\\n\\t\\t\\t\\tnot more wonderful than our daily rising from Sleep,\\n\\t\\t\\t\\t\"twin-brother to Death\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "43",
    "NoteID": "4310",
    "Body": "Let alone worship, men should not rely upon any power or\\n\\t\\t\\t\\tperson other than Allah to help them out or intercede for\\n\\t\\t\\t\\tthem. When it is idols, they are poor lifeless things\\n\\t\\t\\t\\twhich have obviously neither power nor intelligence. But\\n\\t\\t\\t\\teven prophets or saints or heroes have no power to\\n\\t\\t\\t\\tintercede except as Allah wills and permits. See next\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "44",
    "NoteID": "4311",
    "Body": "For Shafa'at (Intercession, Advocacy) see ii. 255; x. 3;\\n\\t\\t\\t\\txx. 109, n. 2634; and xxi. 28, n. 2688. It follows that\\n\\t\\t\\t\\tno one can intercede with Allah, except (1) by Allah's\\n\\t\\t\\t\\tpermission, and (2) for those who have prepared\\n\\t\\t\\t\\tthemselves by penitence for Allah's acceptance. Even in\\n\\t\\t\\t\\tearthly Courts, Advocacy is not permitted to any one; the\\n\\t\\t\\t\\tAdvocate must be granted the position of Advocate before\\n\\t\\t\\t\\the can plead before the judge. Nor can it be supposed\\n\\t\\t\\t\\tthat a plea for forgiveness or mercy can be put forward\\n\\t\\t\\t\\texcept on grounds recognised by equity and justice."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "44",
    "NoteID": "4312",
    "Body": "At all times, including our present life, all dominion\\n\\t\\t\\t\\tbelongs to Allah. At the End of the present plane of\\n\\t\\t\\t\\texistence, we shall be placed before Allah for Judgment.\\n\\t\\t\\t\\tCf. x. 4."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "45",
    "NoteID": "4313",
    "Body": "To evil ones, the mention of the exclusive service of\\n\\t\\t\\t\\tGood is hateful: they only rejoice when other motives are\\n\\t\\t\\t\\tadded, e.g., personal indulgence, ancestral custom, and\\n\\t\\t\\t\\tnumerous things in life which compete with Allah's Law in\\n\\t\\t\\t\\tthis world."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "46",
    "NoteID": "4314",
    "Body": "The mysteries of life and death, of worship and spiritual\\n\\t\\t\\t\\tgrowth, are matters of high moment, which it may be\\n\\t\\t\\t\\tdifficult for us to apprehend in this present life. It is\\n\\t\\t\\t\\tno use arguing about them and plunging in endless\\n\\t\\t\\t\\tcontroversies. The proper attitude is to appeal to Allah\\n\\t\\t\\t\\thumbly to accept our purified hearts and Faith, in the\\n\\t\\t\\t\\tfirm hope that everything which is now vague to us will\\n\\t\\t\\t\\tbe cleared up in the Hereafter, and to pray to Him for\\n\\t\\t\\t\\tHis guidance and mercy."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "47",
    "NoteID": "4315",
    "Body": "Cf. xiii. 18. Those who reject Allah's Message must\\n\\t\\t\\t\\trealise that the time will come when they will wish they\\n\\t\\t\\t\\thad sacrificed everything in the cause of Truth and\\n\\t\\t\\t\\tRighteousness. It will be too late then. Why not examine\\n\\t\\t\\t\\tthe matter seriously now and accept Allah's Grace and\\n\\t\\t\\t\\tLight?"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "47",
    "NoteID": "4316",
    "Body": "This something will be beyond anything they can conceive\\n\\t\\t\\t\\tof in this life. Just as the righteous will then attain a\\n\\t\\t\\t\\tbliss which no human imagination can conceive of now, so\\n\\t\\t\\t\\tthe unrighteous will be in a misery of which they can\\n\\t\\t\\t\\tform no conception now. See next note."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "48",
    "NoteID": "4317",
    "Body": "How humiliating it will be for them to realise that the\\n\\t\\t\\t\\tthings they used to mock at are realities all around\\n\\t\\t\\t\\tthem, and the things they were so eager to pursue are\\n\\t\\t\\t\\tmere falsehoods or vanities!"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "49",
    "NoteID": "4318",
    "Body": "Cf. xxx. 33 and n. 3545."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "49",
    "NoteID": "4319",
    "Body": "Cf. xxxix. 8 above."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "49",
    "NoteID": "4320",
    "Body": "Cf. xxxviii. 78, and n . 3408. Prosperity may be a trial\\n\\t\\t\\t\\tas much as adversity."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "51",
    "NoteID": "4321",
    "Body": "Cf. xvi. 34."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "51",
    "NoteID": "4322",
    "Body": "It is the same story through the ages. People laugh at\\n\\t\\t\\t\\tTruth, persecute Truth, and try to destroy Truth. But\\n\\t\\t\\t\\tAllah's Plan is never to be frustrated. It will be\\n\\t\\t\\t\\tcarried out, and only the enemies of Truth will\\n\\t\\t\\t\\taccomplish their own undoing. So it happened in Arabia:\\n\\t\\t\\t\\tso will it happen always and everywhere."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "52",
    "NoteID": "4323",
    "Body": "Cf. xxviii. 82. Allah's gifts are given to all men-to\\n\\t\\t\\t\\tsome in a greater degree than to others. But it is all\\n\\t\\t\\t\\tdone according to His wise Plan, for His Will is just and\\n\\t\\t\\t\\tlooks to the good of all creatures. No one should\\n\\t\\t\\t\\ttherefore be puffed up in prosperity or cast down in\\n\\t\\t\\t\\tadversity. Prosperity does not necessarily mean merit on\\n\\t\\t\\t\\tman's part, nor adversity the reverse. Thinking men bear\\n\\t\\t\\t\\tin mind the large Plan-which is visible in all Allah's\\n\\t\\t\\t\\tSigns."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "53",
    "NoteID": "4324",
    "Body": "Forgives all sins: i.e., on sincere repentance and\\n\\t\\t\\t\\tamendment of conduct."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "54",
    "NoteID": "4325",
    "Body": "The exhortation in brief is: 'Repent and work\\n\\t\\t\\t\\trighteousness, before it becomes too late'. No help will\\n\\t\\t\\t\\tcome to you when the Judgment is actually established and\\n\\t\\t\\t\\tyou stand before Allah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "55",
    "NoteID": "4326",
    "Body": "Cf. xxxix. 18, and n. 4269. Allah's Command meets the\\n\\t\\t\\t\\tweakness of His weakest servants, and only asks that His\\n\\t\\t\\t\\tservants should surrender their selfish will to Allah's\\n\\t\\t\\t\\tWill. In divine compassion, therefore, we are allowed to\\n\\t\\t\\t\\tdo just what we can, even though our standard should fall\\n\\t\\t\\t\\tshort of the highest standard. But our aim should be to\\n\\t\\t\\t\\tfollow the highest standard, and Allah's Grace will come\\n\\t\\t\\t\\tto our assistance. But we must do so in this life-and at\\n\\t\\t\\t\\tonce, as soon as the Word penetrates our mind or\\n\\t\\t\\t\\tunderstanding. We must not delay a moment, for the\\n\\t\\t\\t\\tJudgment may come at any time, suddenly, before we even\\n\\t\\t\\t\\tperceive where we are."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "56",
    "NoteID": "4327",
    "Body": "Many kinds of sighs and regrets will then assail us. In\\n\\t\\t\\t\\tthe first place, we shall see our shortcomings: we were\\n\\t\\t\\t\\tnegligent when we should have been serious: we mocked\\n\\t\\t\\t\\twhen we should have tried to learn and understand. But it\\n\\t\\t\\t\\twill be too late then to retrieve our position."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "57",
    "NoteID": "4328",
    "Body": "In the second place, we might be inclined to say, 'I wish\\n\\t\\t\\t\\tI had received warning or guidance'. But this would not\\n\\t\\t\\t\\tbe true, because the warning and guidance are being\\n\\t\\t\\t\\tconveyed in the clearest manner in Allah's Revelation.\\n\\t\\t\\t\\t\"that is the force of 'lest it should say'. It could have\\n\\t\\t\\t\\tsaid so, had it not seen that the objection is clearly\\n\\t\\t\\t\\tanticipated in the call to repent and in the warning\\n\\t\\t\\t\\tabout the Hereafter."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "58",
    "NoteID": "4329",
    "Body": "In the third place, when we stand face to face with the\\n\\t\\t\\t\\tPenalty of our own deeds, we might say, 'I wish I had\\n\\t\\t\\t\\tanother chance'. But not one, but many, chances are being\\n\\t\\t\\t\\tgiven, especially when we are told (verse 53 above):\\n\\t\\t\\t\\t'Despair not of the Mercy of Allah: for Allah forgives\\n\\t\\t\\t\\tall sins: for He is Oft-Forgiving, Most Merciful'. The\\n\\t\\t\\t\\tforce of 'lest it should say' here is the same as\\n\\t\\t\\t\\texplained in the last note."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "59",
    "NoteID": "4330",
    "Body": "The reply explains how all such pleas have been\\n\\t\\t\\t\\tanticipated and met. It was deliberate rejection that\\n\\t\\t\\t\\twill deserve and meet its consequences. It is further\\n\\t\\t\\t\\texplained that the motive of sin, as with Satan, was\\n\\t\\t\\t\\thaughtiness and Self."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "59",
    "NoteID": "4331",
    "Body": "Cf. ii. 34. The example of the arch-sinner illustrates\\n\\t\\t\\t\\twhat happens in a minor degree in every kind of sinner."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "60",
    "NoteID": "4332",
    "Body": "As spotless white is the symbol of purity, honour and\\n\\t\\t\\t\\ttruth, so black is the symbol of evil, disgrace, and\\n\\t\\t\\t\\tfalsehood. Perhaps \"black\" in connection with Hell also\\n\\t\\t\\t\\trefers to the scorching punishment of the Fire."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "60",
    "NoteID": "4333",
    "Body": "Cf. above, xxxix. 32, and n. 4292, where the subtle\\n\\t\\t\\t\\timplication of the interrogative form is explained."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "61",
    "NoteID": "4334",
    "Body": "Mafazat: place or state of safety or salvation, place or\\n\\t\\t\\t\\tstate of victory or achievement; accomplishment of wish\\n\\t\\t\\t\\tor desire. This contrasted against the frustration,\\n\\t\\t\\t\\tfailure, and perdition of the children of evil,-what may\\n\\t\\t\\t\\tbe called damnation in theological phrase."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "62",
    "NoteID": "4335",
    "Body": "Allah has not only created all the Worlds, but He\\n\\t\\t\\t\\tmaintains them and cares for them. He does not sit apart\\n\\t\\t\\t\\tfrom His world. Everything depends upon Him."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "63",
    "NoteID": "4336",
    "Body": "Allah has nothing to lose by the rebellion or\\n\\t\\t\\t\\tdisobedience of His creatures. It is they who lose,\\n\\t\\t\\t\\tbecause they go counter to their own nature, the\\n\\t\\t\\t\\tbeautiful mould in which Allah created them."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "64",
    "NoteID": "4337",
    "Body": "\"Order me\": there is great irony here. The Prophet of\\n\\t\\t\\t\\tAllah turns to his critics and says: \"You arrogate to\\n\\t\\t\\t\\tyourselves the right to order me how to worship! But who\\n\\t\\t\\t\\tare you? You are only ignorant men! My commission is from\\n\\t\\t\\t\\tAllah. It is the same as came to Prophets of Allah before\\n\\t\\t\\t\\tme in all ages, viz., (1) that the only Truth is in the\\n\\t\\t\\t\\tGospel of Unity; and (2) that if you worship other things\\n\\t\\t\\t\\tand turn away from Allah, your life will be wasted and\\n\\t\\t\\t\\tall your probation will have been of no account.\""
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "65",
    "NoteID": "4338",
    "Body": "The Message of Unity, renewed in Islam, has been the\\n\\t\\t\\t\\tMessage of Allah since the world began."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "65",
    "NoteID": "4339",
    "Body": "Cf. v. 6. False worship means that we run after fruitless\\n\\t\\t\\t\\tthings, and the main purpose of our spiritual lives is\\n\\t\\t\\t\\tlost."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "66",
    "NoteID": "4340",
    "Body": "To \"give thanks\" is to show by our conduct that we esteem\\n\\t\\t\\t\\tthe gifts of Allah and will use them in His service."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "67",
    "NoteID": "4341",
    "Body": "Cf. vi. 91, and n. 909; and xxii. 74. In running after\\n\\t\\t\\t\\tfalse gods or the powers of nature they have forgotten\\n\\t\\t\\t\\tthat all creatures are as nothing before Allah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "67",
    "NoteID": "4342",
    "Body": "See last note. The whole earth will be no more to Allah\\n\\t\\t\\t\\tthan a thing that a man might enclose in the hollow of\\n\\t\\t\\t\\this hand, nor will the heavens with their vast expanse be\\n\\t\\t\\t\\tmore than a scroll, which a man might roll up with his\\n\\t\\t\\t\\tright hand, the hand of power and action. Cf. xxi. 104,\\n\\t\\t\\t\\tand lxxxi. 1."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "68",
    "NoteID": "4343",
    "Body": "Saiqa implies the idea of a swoon, or loss of all\\n\\t\\t\\t\\tconsciousness of being: it implies a cessation of the\\n\\t\\t\\t\\tnormal functioning of the usual powers of life or\\n\\t\\t\\t\\tfeeling. With the first Trumpet of the Resurrection the\\n\\t\\t\\t\\twhole world will cease to be in the form and the\\n\\t\\t\\t\\trelations which we see now: there will be a new heaven\\n\\t\\t\\t\\tand a new earth, see xiv. 48, n. 1925; human souls will\\n\\t\\t\\t\\tfor the time being be dazed and lose all memory or\\n\\t\\t\\t\\tconsciousness of time or place or personality. With the\\n\\t\\t\\t\\tsecond one, they will stand in a new world; they will see\\n\\t\\t\\t\\twith clearer vision than ever before; and judgment will\\n\\t\\t\\t\\tproceed."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "69",
    "NoteID": "4344",
    "Body": "It will be a new Earth. All traces of injustice or\\n\\t\\t\\t\\tinequality, darkness or evil, will have gone. There will\\n\\t\\t\\t\\tbe the one universal Light, the Glory of Allah, which\\n\\t\\t\\t\\twill now illuminate all. Falsehood, pretence, and\\n\\t\\t\\t\\tillusion will have disappeared. Everything will be seen\\n\\t\\t\\t\\tin its true light."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "69",
    "NoteID": "4345",
    "Body": "It is in such a scene of Reality that Judgment will be\\n\\t\\t\\t\\theld. Before the Throne of Allah, the book of each man's\\n\\t\\t\\t\\tdeeds and motives will be placed wide open, which all may\\n\\t\\t\\t\\tsee; the Prophets and Preachers of Truth and the martyrs\\n\\t\\t\\t\\twho gave their lives or made their real sacrifices in the\\n\\t\\t\\t\\tcause of Truth, will be in the Court, to give evidence;\\n\\t\\t\\t\\tand the decision pronounced will be absolutely just, for\\n\\t\\t\\t\\tthe Judge will not only be just, but He will know every\\n\\t\\t\\t\\tfact and circumstance, and His wisdom will give due\\n\\t\\t\\t\\tweight to everything, great or small."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "70",
    "NoteID": "4346",
    "Body": "In an earthly court, a decision may possibly go wrong\\n\\t\\t\\t\\tbecause the judge is deceived; here no deceit or mistake\\n\\t\\t\\t\\twill be possible, for Allah knows all, and knows it\\n\\t\\t\\t\\tbetter than any one else can."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "71",
    "NoteID": "4347",
    "Body": "Groups: this is the word which gives the key-note to the\\n\\t\\t\\t\\tSura. If the soul does not stand to its own convictions\\n\\t\\t\\t\\tor search out the Truth by itself, it will be classed\\n\\t\\t\\t\\twith the crowds that go to Perdition!"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "71",
    "NoteID": "4348",
    "Body": "The Keepers may be supposed to be angels, who know\\n\\t\\t\\t\\tnothing of the conditions of evil on this earth, and are\\n\\t\\t\\t\\tsurprised at such crowds coming to the \"Evil Abode\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "71",
    "NoteID": "4349",
    "Body": "Cf. x. 33. The answer is perhaps given by other angels:\\n\\t\\t\\t\\t'yes; messengers were sent to them from among themselves,\\n\\t\\t\\t\\tto warn them and proclaim to them Mercy through\\n\\t\\t\\t\\trepentance; but the decree of Allah, which warned them of\\n\\t\\t\\t\\tpunishment, has now come true against them, for they\\n\\t\\t\\t\\trebelled and were haughty; they rejected Truth, Faith,\\n\\t\\t\\t\\tand Mercy!'"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "72",
    "NoteID": "4350",
    "Body": "As elsewhere, the root of Evil is pointed out to be in\\n\\t\\t\\t\\tself-love and arrogance. Cf. ii. 34, etc."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "73",
    "NoteID": "4351",
    "Body": "The righteous ones will also go in crowds, and not be\\n\\t\\t\\t\\talone. There is now a true sorting out. Verses 73-75 are\\n\\t\\t\\t\\tparallel in contrast to verses 71-72 above."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "73",
    "NoteID": "4352",
    "Body": "The angels in heaven are not surprised at the advent of\\n\\t\\t\\t\\tthe good and righteous souls. They are glad; they greet\\n\\t\\t\\t\\tthem with the salutation of Peace; they congratulate\\n\\t\\t\\t\\tthem; and they welcome them in."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "74",
    "NoteID": "4353",
    "Body": "This is said by the new arrivals in heaven. As is right,\\n\\t\\t\\t\\tthey begin with the Praises of Allah, which shows at once\\n\\t\\t\\t\\ttheir satisfaction and their gratitude."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "74",
    "NoteID": "4354",
    "Body": "In heritage: i.e. as our Portion. Cf. iii. 180, and n.\\n\\t\\t\\t\\t485; vi. 165, and n. 988. There is no question here of\\n\\t\\t\\t\\ttheir passing on any property to heirs. They are the\\n\\t\\t\\t\\tfinal possessors of Heaven for eternity, by the grace of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "75",
    "NoteID": "4355",
    "Body": "These are the opening words of the first Sura, and they\\n\\t\\t\\t\\tdescribe the atmosphere of the final Bliss in Heaven, in\\n\\t\\t\\t\\tthe light of the Countenance of their Lord, the Lord of\\n\\t\\t\\t\\tall!"
  }
]
