[
  {
    "SurahNumber": "15",
    "AyahNumber": "1",
    "Text": "Alif L'am Ra. These are the verses of the Divine Book, the\\n\\t\\t\\tGlorious Qur'an which makes the things clear."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "2",
    "Text": "The Day will come when the unbelievers will wish that they were\\n\\t\\t\\tMuslims."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "3",
    "Text": "Leave them alone to eat and enjoy themselves and be deluded by\\n\\t\\t\\tfalse hopes, for soon they will find out the Truth."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "4",
    "Text": "Never did We destroy a town whose term of life was not ordained\\n\\t\\t\\tbeforehand."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "5",
    "Text": "No people can forestall their doom, nor can they postpone it."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "6",
    "Text": "They say: \"O you to whom the reminder (The Qur'an) is being\\n\\t\\t\\trevealed! You are surely insane."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "7",
    "Text": "Why don't you bring us the angels, if you are of the truthful\\n\\t\\t\\tones?\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "8",
    "Text": "O Muhammad, tell them: \"We do not send down the angels except for\\n\\t\\t\\tjust cause (to execute Our scourge), and when they come, people\\n\\t\\t\\tare not given respite."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "9",
    "Text": "Surely We have revealed this reminder (The Qur'an); and We will\\n\\t\\t\\tsurely preserve it Ourself."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "10",
    "Text": "Certainly We sent Rasools before you among the early nations;"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "11",
    "Text": "but whenever a Rasool came to them, they mocked him."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "12",
    "Text": "Thus do We let doubt creep into the hearts of the criminals;"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "13",
    "Text": "that they do not believe in it (The Qur'an), despite the examples\\n\\t\\t\\tof the people who passed before them."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "14",
    "Text": "Even if we had opened a gate in Heaven and they ascend through it\\n\\t\\t\\tand keep on ascending,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "15",
    "Text": "still they would have said, 'Our eyes have been dazzled; rather\\n\\t\\t\\twe have been bewitched.'\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "16",
    "Text": "It is We who have decked the heavens with constellations and made\\n\\t\\t\\tthem good looking for the beholders;"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "17",
    "Text": "and We have guarded them from every accursed shaitan."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "18",
    "Text": "Any shaitan that steals a hearing, there follows him a fiery\\n\\t\\t\\tcomet."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "19",
    "Text": "We have spread out the earth and set mountains upon it; and\\n\\t\\t\\tcaused to grow every suitable thing therein,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "20",
    "Text": "and We provided therein means of sustenance for you and many\\n\\t\\t\\tother creatures to whom you do not provide."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "21",
    "Text": "There is nothing which is not in Our inexhaustible treasure and\\n\\t\\t\\tsent down in appropriate measure."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "22",
    "Text": "We send the fertilizing winds and send down water from the sky\\n\\t\\t\\tfor you to drink; it is not you who hold the storage of this\\n\\t\\t\\twealth."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "23",
    "Text": "Certainly it is We Who give life and cause to die, and We are the\\n\\t\\t\\tinheritors of all."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "24",
    "Text": "Certainly We have full knowledge of those who have gone before\\n\\t\\t\\tyou and certainly We know those who will come later."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "25",
    "Text": "Surely your Rabb will gather them together; surely He is Wise,\\n\\t\\t\\tKnowledgeable."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "26",
    "Text": "We created man from sounding clay, black mud moulded into shape;"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "27",
    "Text": "while before him We had created Jinn from smokeless fire."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "28",
    "Text": "Remember when your Rabb said to the angels: \"I am about to create\\n\\t\\t\\ta man from sounding clay, black mud moulded into shape;"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "29",
    "Text": "when I complete his moulding and breath into him of My spirit,\\n\\t\\t\\tkneel down and prostrate before him.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "30",
    "Text": "Accordingly the angels prostrated altogether,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "31",
    "Text": "except Iblees (The Satan); he refused to join those who\\n\\t\\t\\tprostrated."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "32",
    "Text": "Allah asked: \"O Iblees! What is the matter with you that you did\\n\\t\\t\\tnot join those who prostrated?\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "33",
    "Text": "He replied: \"It does not behoove me to prostrate myself to this\\n\\t\\t\\tman whom You have created from sounding clay, black mud moulded\\n\\t\\t\\tinto shape.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "34",
    "Text": "Allah said: \"Get out of here, you are accursed."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "35",
    "Text": "The curse will remain on you till the Day of Judgement.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "36",
    "Text": "At this Iblees requested: \"Rabb! Give me respite till the Day of\\n\\t\\t\\tResurrection.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "37",
    "Text": "Allah said: \"All right! You are given the respite"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "38",
    "Text": "till the Day of appointed time.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "39",
    "Text": "Iblees said: \"Rabb! Since You let me go astray, I will make evil\\n\\t\\t\\tfair-seeming to them on earth and I will seduce them all"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "40",
    "Text": "except those of them who are Your sincere devotees.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "41",
    "Text": "Allah said: \"This course of action is all right with Me"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "42",
    "Text": "- you will not have any authority over My devotees except those\\n\\t\\t\\tmisguided ones who follow you."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "43",
    "Text": "They will be all destined for Hell,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "44",
    "Text": "which has seven gates, each gate will be assigned to a separate\\n\\t\\t\\tgroup from among them.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "45",
    "Text": "The righteous will be in the midst of the gardens and fountains\\n\\t\\t\\tof paradise"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "46",
    "Text": "and it will be said to them: \"Enter into these in peace and\\n\\t\\t\\tsecurity.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "47",
    "Text": "We shall remove all hatred from their hearts - they will become\\n\\t\\t\\tlike brothers and sit on couches face to face."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "48",
    "Text": "No fatigue will touch them in there, not will they ever be asked\\n\\t\\t\\tto leave."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "49",
    "Text": "O Prophet! Tell My devotees that I am indeed the Forgiving, the\\n\\t\\t\\tMerciful;"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "50",
    "Text": "but at the same time My punishment is also the most painful\\n\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "51",
    "Text": "Tell them about the guests of Ibrahim (Abraham)."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "52",
    "Text": "They entered upon them and said: \"Peace be upon you!\" But he\\n\\t\\t\\treplied: \"Surely we are afraid of you.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "53",
    "Text": "They answered: \"Do not be afraid of us! We have come to you with\\n\\t\\t\\tgood news of a son endowed with knowledge.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "54",
    "Text": "He said: \"Are you giving me the good news of a son when I have\\n\\t\\t\\tbecome old? What kind of good news you are giving?\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "55",
    "Text": "They replied: \"We are giving you true good news; you should not\\n\\t\\t\\tbe of those who despair.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "56",
    "Text": "He said: \"Who would despair of the mercy of his Rabb except one\\n\\t\\t\\twho goes astray?\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "57",
    "Text": "Then he asked: \"On what expedition you have been sent, O\\n\\t\\t\\temissaries of Allah?\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "58",
    "Text": "They replied: \"We have been sent to punish a criminal nation,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "59",
    "Text": "with the exception of Lut's (Lot's) family; we will certainly\\n\\t\\t\\trescue them all"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "60",
    "Text": "except his wife, who, Allah says, has been destined to remain\\n\\t\\t\\twith those who will stay behind.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "61",
    "Text": "So when the emissaries came to the family of Lut,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "62",
    "Text": "he said: \" You appear to be strangers.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "63",
    "Text": "They said: \"We have come to you with that concerning which these\\n\\t\\t\\tpeople had doubts."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "64",
    "Text": "We have come to you with the Truth of Allah's decree and we are\\n\\t\\t\\ttelling you the truth."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "65",
    "Text": "You should, therefore, depart with your family during the last\\n\\t\\t\\thours of the night and you yourself should follow them at their\\n\\t\\t\\trear; let no one of you look back, keep on going where you are\\n\\t\\t\\tcommanded to go.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "66",
    "Text": "We informed him about this decree of Ours that the roots of the\\n\\t\\t\\tsinners of his city would be cut off by the morning."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "67",
    "Text": "The people of the town came rejoicing to the house of Lut when\\n\\t\\t\\tthey heard the news of those two young male visitors."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "68",
    "Text": "Lut said: \"They are my guests, so do not disgrace me."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "69",
    "Text": "Have fear of Allah and do not put me to shame.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "70",
    "Text": "They said: \"Have we not forbidden you to plead for the rest of\\n\\t\\t\\tthe world?\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "71",
    "Text": "He said: \"Here are my daughters, if you must act.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "72",
    "Text": "By your life, O Prophet Muhammad, they were madly blundering in\\n\\t\\t\\ttheir intoxication of lust!"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "73",
    "Text": "So the mighty blast overtook them at sunrise."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "74",
    "Text": "Thus We turned the town upside down and rained down on them\\n\\t\\t\\tbrimstones of baked clay."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "75",
    "Text": "Surely there are major lessons in this for those who investigate,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "76",
    "Text": "and this smitten town still lies right on the permanent highway\\n\\t\\t\\ton which the unbelievers travel during their business trips."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "77",
    "Text": "Indeed there is a sign in this for the true believers."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "78",
    "Text": "The people of Al-Aikah (the nation of Prophet Shu'aib) were also\\n\\t\\t\\twrongdoers."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "79",
    "Text": "So We inflicted retribution on them. The ruined towns of these\\n\\t\\t\\ttwo nations are lying on an open road."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "80",
    "Text": "The people of Hijr also denied their Rasool."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "81",
    "Text": "We gave them Our signs, but they ignored them."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "82",
    "Text": "They hewed their homes in the mountains for safety."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "83",
    "Text": "But the mighty blast seized them one morning."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "84",
    "Text": "And all their labor of building their homes through carving the rocks did not \r\\navail them.\r\\n"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "85",
    "Text": "We have not created the Heavens and the Earth, and all that lies between\r\\n them but to manifest the Truth.The Hour of Doom is sure to come, so overlook\r\\n their misbehavior in a gracious manner.\r\\n"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "86",
    "Text": "Surely your Rabb is the All-Knowing Creator."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "87",
    "Text": "We have given you the Seven Verses that are worthy of recitation\\n\\t\\t\\tover and over again (Surah Al-Fatiha) and the Glorious Qur'an."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "88",
    "Text": "Do not look at the worldly wealth which We have given to\\n\\t\\t\\tdifferent people among them, nor grieve at their condition. Leave\\n\\t\\t\\tthem alone, attend to the believers in kindness,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "89",
    "Text": "and tell the unbelievers: \"Surely I am only a plain Warner.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "90",
    "Text": "This warning is like the warning which We sent down to the\\n\\t\\t\\tschismatics,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "91",
    "Text": "the one who divided their Qur'an into separate parts, believing\\n\\t\\t\\tin some and denying others."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "92",
    "Text": "So by your Rabb! We will question them all"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "93",
    "Text": "about their doings."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "94",
    "Text": "Therefore, proclaim publicly what you are commanded and turn away\\n\\t\\t\\tfrom the mushrikin."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "95",
    "Text": "Surely We Ourself will suffice you against the scoffers;"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "96",
    "Text": "those who place other deities alongside Allah, will soon come to\\n\\t\\t\\tknow their folly."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "97",
    "Text": "We know that your heart is distressed by what they say against\\n\\t\\t\\tyou."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "98",
    "Text": "The cure of your heart's distress is that you should celebrate\\n\\t\\t\\tthe praises of your Rabb and be of those who prostrate themselves\\n\\t\\t\\tbefore Him,"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "99",
    "Text": "and worship your Rabb until there come to you which is certain\\n\\t\\t\\t(death)."
  }
]
