[
  {
    "SurahNumber": "70",
    "AyahNumber": "1",
    "NoteID": "5675",
    "Body": "Any one might ask. When will Judgment come? That question\\n\\t\\t\\t\\tusually implies doubt. The answer is: the knowledge of\\n\\t\\t\\t\\tTime is beyond man's comprehension. But there is\\n\\t\\t\\t\\tsomething which touches him closely and concerns his\\n\\t\\t\\t\\tconduct and his future welfare; and that is explained in\\n\\t\\t\\t\\tfour propositions. (1) Judgment is sure to come, and none\\n\\t\\t\\t\\tcan ward it off; (2) it will exact a dreadful Penalty\\n\\t\\t\\t\\tfrom Unbelievers, but the righteous have nothing to fear;\\n\\t\\t\\t\\t(3) it will be a Penalty from Allah, the Lord of both\\n\\t\\t\\t\\tJustice and Mercy; it will not be merely a blind calamity\\n\\t\\t\\t\\tof fate; and (4) further we are reminded of another title\\n\\t\\t\\t\\tof Allah, \"Lord of the Ways of Ascent\"; which means that\\n\\t\\t\\t\\tthough He sits high on Ms Throne of Glory, He is not\\n\\t\\t\\t\\tinaccessible, but in His infinite Mercy has provided ways\\n\\t\\t\\t\\tof ascent to Him; see next note."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "3",
    "NoteID": "5676",
    "Body": "Ma'arij: stair-ways, ways of ascent. In xliii. 33, the\\n\\t\\t\\t\\tword is used in its literal sense: \"silver stair-ways on\\n\\t\\t\\t\\twhich to go up\". Here there is a profound spiritual\\n\\t\\t\\t\\tmeaning. Can we reach up to Allah Most High? In His\\n\\t\\t\\t\\tinfinite grace He gives that privilege to angels. But the\\n\\t\\t\\t\\tway is not easy, nor can it be travelled in a day. See\\n\\t\\t\\t\\tthe next two notes."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "4",
    "NoteID": "5677",
    "Body": "Ruh: \"The Spirit\". Cf. lxxviii. 38, \"the Spirit and the\\n\\t\\t\\t\\tangels\"; and xcvii. 4, \"the angels and the Spirit\". In\\n\\t\\t\\t\\txvi. 2, we have translated Ruh by \"inspiration\". Some\\n\\t\\t\\t\\tCommentators understand the angel Gabriel by \"the\\n\\t\\t\\t\\tSpirit\". But I think a more general meaning is possible,\\n\\t\\t\\t\\tand fits the context better."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "4",
    "NoteID": "5678",
    "Body": "Cf. xxxii. 4-5, and notes 3632 and 3634"
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "5",
    "NoteID": "5679",
    "Body": "The prophet of Allah, persecuted and in trouble with the\\n\\t\\t\\t\\tworld, should yet hold Patience-not the sort of patience\\n\\t\\t\\t\\twhich goes with complaints expressed or suppressed, but\\n\\t\\t\\t\\tthe sort of patience that is content with the ordering of\\n\\t\\t\\t\\tAllah's world, for he believes and knows it to be good,\\n\\t\\t\\t\\tas did the holy Prophet Muhammad. Such a patience is akin\\n\\t\\t\\t\\tto Good pleasure, for it arises from the purest faith and\\n\\t\\t\\t\\ttrust in Allah."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "7",
    "NoteID": "5680",
    "Body": "The men of evil may see the just retribution for their\\n\\t\\t\\t\\tsins so far off that they doubt whether it would ever\\n\\t\\t\\t\\tcome. But in Allah's sight, and on the scale of the\\n\\t\\t\\t\\tUniversal Plan, it is quite near; for time as we know it\\n\\t\\t\\t\\thardly exists in the next world. It may come in this\\n\\t\\t\\t\\tlife; but it is bound to come eventually."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "8",
    "NoteID": "5681",
    "Body": "Cf. xviii. 29 (where the wrong-doer will have a drink\\n\\t\\t\\t\\tlike melted brass in Hell); and xliv. 45, (where his food\\n\\t\\t\\t\\twill be like molten brass). Here the appearance of the\\n\\t\\t\\t\\tsky is compared to molten brass, or, as some understand\\n\\t\\t\\t\\tit, like the dregs of oil. What is conveyed by the\\n\\t\\t\\t\\tmetaphor is that the beautiful blue sky will melt away."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "9",
    "NoteID": "5682",
    "Body": "Cf. ci. 5. where the metaphor of carded wool is used. The\\n\\t\\t\\t\\tmountains which seem so solid will be like flakes of wool\\n\\t\\t\\t\\tdriven by the carder's hand."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "10",
    "NoteID": "5683",
    "Body": "The world as we know it win have so completely passed\\n\\t\\t\\t\\taway that the landmarks in the heavens and on earth will\\n\\t\\t\\t\\talso have vanished. Not only that, but the human\\n\\t\\t\\t\\trelationships of mind and heart will have been\\n\\t\\t\\t\\ttransformed by sin into something ugly and dreadful. The\\n\\t\\t\\t\\tsinners will be so overcome with terror at the\\n\\t\\t\\t\\trealisation of their personal responsibility that they\\n\\t\\t\\t\\twill desert their most intimate friends, and indeed their\\n\\t\\t\\t\\tvery sight of each other will add to their agony."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "11",
    "NoteID": "5684",
    "Body": "The sinner will offer his children, his family, his\\n\\t\\t\\t\\tkinsmen, who had sheltered and protected him,-in fact\\n\\t\\t\\t\\teverything on earth that he could-as a ransom for\\n\\t\\t\\t\\thimself. Such would be his selfishness and his agony."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "14",
    "NoteID": "5685",
    "Body": "What would not the sinner give for his own deliverance!\\n\\t\\t\\t\\tBut nothing could save him. The Fire of Hell would be\\n\\t\\t\\t\\troaring for him!"
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "16",
    "NoteID": "5686",
    "Body": "It would be a Fire not only burning his body, but\\n\\t\\t\\t\\treaching right up to his brains and his understanding\\n\\t\\t\\t\\tand-as is said in civ. 7-his heart and affections also.\\n\\t\\t\\t\\tIn other words the Fire will burn into his inmost being."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "17",
    "NoteID": "5687",
    "Body": "The analysis of sin is given in four master-strokes, of\\n\\t\\t\\t\\twhich the first two refer to the will or psychology of\\n\\t\\t\\t\\tthe sinner, and the last two to the use he makes of the\\n\\t\\t\\t\\tgood things of this life. (1) Sin begins with turning\\n\\t\\t\\t\\tyour back to the Right, refusing to face it squarely,\\n\\t\\t\\t\\trunning away from it whether from cowardice or\\n\\t\\t\\t\\tindifference. (2) But Conscience and the sense of Right\\n\\t\\t\\t\\twill try to prevent the flight; the Grace of Allah will\\n\\t\\t\\t\\tmeet the sinner at all corners and try to reclaim him;\\n\\t\\t\\t\\tthe hardened sinner will deliberately turn away his face\\n\\t\\t\\t\\tfrom it, insult it, and reject it. (3) The result of this\\n\\t\\t\\t\\tpsychology will be that he will abandon himself to greed,\\n\\t\\t\\t\\tto the correction of riches, and the acquisition of\\n\\t\\t\\t\\tmaterial advantages to which he is not entitied; this may\\n\\t\\t\\t\\tinvolve hypocrisy, fraud, and crime. (4) Having acquired\\n\\t\\t\\t\\tthe material advantages, the next step will be to keep\\n\\t\\t\\t\\tothers out of them, to prevent hoarded wealth from\\n\\t\\t\\t\\tfructifying by circulation, to conceal it from envy or\\n\\t\\t\\t\\tspite. This is the spiritual Rake's Progress."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "19",
    "NoteID": "5688",
    "Body": "Man, according to the Plan of Allah, was to be in the\\n\\t\\t\\t\\tbest of moulds (xcv. 4). But in order to fulfil his high\\n\\t\\t\\t\\tdestiny he was given free-will to a limited extent. The\\n\\t\\t\\t\\twrong use of this free-will makes his nature weak (iv.\\n\\t\\t\\t\\t28), or hasty (xvii. 11), or unpatient, as here. That\\n\\t\\t\\t\\tbecomes his nature by his own act, but he is spoken of as\\n\\t\\t\\t\\tso created because of the capacities given to him in his\\n\\t\\t\\t\\tcreation."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "21",
    "NoteID": "5689",
    "Body": "In adversity he complains and gets into despair. In\\n\\t\\t\\t\\tprosperity he becomes arrogant and forgets other people's\\n\\t\\t\\t\\trights and his own shortcomings. Cf. xli. 49-50."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "22",
    "NoteID": "5690",
    "Body": "The description of those devoted to Prayer is given in a\\n\\t\\t\\t\\tnumber of clauses that follow, introduced by the words\\n\\t\\t\\t\\t\"Those who...\" \"Devoted to Prayer\" is here but another\\n\\t\\t\\t\\taspect of what is described elsewhere as the Faithful and\\n\\t\\t\\t\\tthe Righteous. Devotion to prayer does not mean merely a\\n\\t\\t\\t\\tcertain number of formal rites or prostrations. It means\\n\\t\\t\\t\\ta complete surrender of one's being to Allah. This means\\n\\t\\t\\t\\tan earnest approach to and realisation of Allah's\\n\\t\\t\\t\\tPresence (\"steadfastness in Prayer\"); acts of practical\\n\\t\\t\\t\\tand real charity; and attempt to read this life in terms\\n\\t\\t\\t\\tof the Hereafter; the seeking of the Peace of Allah and\\n\\t\\t\\t\\tavoidance of His displeasure; chastity; probity true and\\n\\t\\t\\t\\tfirm witness; and guarding the prayer. (verse 34)."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "25",
    "NoteID": "5691",
    "Body": "See n. 5001 to li. 19. True charity consists in finding\\n\\t\\t\\t\\tout those in real need, whether they ask or not. Most\\n\\t\\t\\t\\tfrequently those who ask are idle men who insolently wish\\n\\t\\t\\t\\tto live upon others. But all cases of those who ask\\n\\t\\t\\t\\tshould be duly investigated, in case a little timely help\\n\\t\\t\\t\\tmay set the erring on the way. But the man with wealth or\\n\\t\\t\\t\\ttalent or opportunity has the further responsibility of\\n\\t\\t\\t\\tsearching out those in need of his assistance, in order\\n\\t\\t\\t\\tto show that he holds all gifts in trust for the service\\n\\t\\t\\t\\tof his fellow- creatures."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "27",
    "NoteID": "5692",
    "Body": "A true fear of Allah is the fear of offending against His\\n\\t\\t\\t\\tholy Will and Law, and is therefore akin to the love of\\n\\t\\t\\t\\tAllah. It proceeds from the realisation that all true\\n\\t\\t\\t\\tpeace and tranquillity comes from attuning our will to\\n\\t\\t\\t\\tthe universal Will and that sin causes discord,\\n\\t\\t\\t\\tdisharmony, and displeasure,-another name for the Wrath\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "28",
    "NoteID": "5693",
    "Body": "I.e., that the punishment of sin may come suddenly at any\\n\\t\\t\\t\\ttime, when you least expect it."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "30",
    "NoteID": "5694",
    "Body": "Cf. iv. 24."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "32",
    "NoteID": "5695",
    "Body": "For obligations of trusts and covenants, express or\\n\\t\\t\\t\\timplied, see n. 682 to v. 1. They are just as sacred in\\n\\t\\t\\t\\tordinary everyday life as they are in special spiritual\\n\\t\\t\\t\\trelationships. In addition, our life itself, and such\\n\\t\\t\\t\\treason and talents as we possess, as well as our wealth\\n\\t\\t\\t\\tand possessions are trusts, of which we must fulfil the\\n\\t\\t\\t\\tduties punctiliously."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "33",
    "NoteID": "5696",
    "Body": "If we know any truth of any kind, to that we must bear\\n\\t\\t\\t\\twitness, as affecting the lives or interests of our\\n\\t\\t\\t\\tfellow-beings,-firmly, not half-heartedly, without fear\\n\\t\\t\\t\\tor favour, even if it causes loss or trouble to us, or if\\n\\t\\t\\t\\tit loses us friends or associates."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "34",
    "NoteID": "5697",
    "Body": "We began with \"steadfastness in prayer\" in verse 23\\n\\t\\t\\t\\tabove, and after a review of various aspects of the good\\n\\t\\t\\t\\tman's fife, close with the guarding of worship."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "36",
    "NoteID": "5698",
    "Body": "Before thee. The Unbelievers did not believe in a\\n\\t\\t\\t\\tHereafter. When the Bliss of the Hereafter was described,\\n\\t\\t\\t\\tas in the last verse, they ridiculed it and pretended to\\n\\t\\t\\t\\tbe running in for it as in a race. They are here rebuked\\n\\t\\t\\t\\tin the same tone of sarcasm."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "39",
    "NoteID": "5699",
    "Body": "The animal part of man is nothing to be proud of, and\\n\\t\\t\\t\\tthey know it. It is by spiritual effort, and long\\n\\t\\t\\t\\tpreparation through a good life that a man can rise above\\n\\t\\t\\t\\tthe mere animal part of him to his high dignity as a\\n\\t\\t\\t\\tspiritual being, and his noble destiny in the Hereafter."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "40",
    "NoteID": "5700",
    "Body": "For the form of adjuration, cf. lxix. 38, n. 5665; also\\n\\t\\t\\t\\tlvi. 75. Here the witness placed before us by Allah is\\n\\t\\t\\t\\tHis own power and glory manifested in the splendour of\\n\\t\\t\\t\\tsunrise and sunset at different points through the solar\\n\\t\\t\\t\\tyear."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "40",
    "NoteID": "5701",
    "Body": "See n. 4034 to xxxvii. 5. If Allah has such power in the\\n\\t\\t\\t\\twonderful phenomena of the rising of the sun at varying\\n\\t\\t\\t\\tpoints, repeated year after year, can you not see that He\\n\\t\\t\\t\\tcan easily substitute better men than you Unbelievers and\\n\\t\\t\\t\\tblasphemers?"
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "40",
    "NoteID": "5702",
    "Body": "The transition from the singular \"I\" to the plural \"We\"\\n\\t\\t\\t\\tmay be noted. See n. 56 to ii. 38."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "42",
    "NoteID": "5703",
    "Body": "Their talk, their scepticism, is vain, because all\\n\\t\\t\\t\\tspiritual evidence is against it; it is like the foolish\\n\\t\\t\\t\\tplay of people who do not think seriously. But the\\n\\t\\t\\t\\ttremendous Day of Judgment and Reality will come, as\\n\\t\\t\\t\\tdescribed in the next two verses."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "43",
    "NoteID": "5704",
    "Body": "Now there will be a definite Goal-post or Banner or\\n\\t\\t\\t\\tStandard of Truth fixed, which all must acknowledge. But\\n\\t\\t\\t\\tthey will acknowledge it in shame and dejection. For the\\n\\t\\t\\t\\ttime for their repentance and amendment will then have\\n\\t\\t\\t\\tpassed."
  }
]
