[
  {
    "SurahNumber": "51",
    "AyahNumber": "4",
    "NoteID": "1",
    "Body": "These symbolical epithets, consisting of adjectival\\n\\t\\t\\t\\tparticiples without any mention of the nouns which they\\n\\t\\t\\t\\tqualify, have been variously interpreted by the early\\n\\t\\t\\t\\tcommentators; but since there is a consensus of opinion\\n\\t\\t\\t\\tregarding the first of these participles - adh-dhariyat -\\n\\t\\t\\t\\tas denoting \"dust-scattering winds\", we may assume that\\n\\t\\t\\t\\tthe other three relate to different phases or\\n\\t\\t\\t\\tmanifestations of the same phenomenon (Razi) - namely, to\\n\\t\\t\\t\\tthe life-giving function of the combination of wind,\\n\\t\\t\\t\\tclouds and rain - pointing, symbolically, to the\\n\\t\\t\\t\\tmiraculous creation of life as such and, thus, to the\\n\\t\\t\\t\\texistence of a conscious, purposeful Creator."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "I.e., life after death."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "7",
    "NoteID": "3",
    "Body": "I.e., \"think of the Creator of this great universe and,\\n\\t\\t\\t\\thence, of your responsibility to Him\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "8",
    "NoteID": "4",
    "Body": "Lit., \"you are indeed in a discordant opinion (qawl)\",\\n\\t\\t\\t\\ti.e., as to whether or not there is life after death,\\n\\t\\t\\t\\twhether God exists, whether there is any truth in divine\\n\\t\\t\\t\\trevelation, and so forth."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "9",
    "NoteID": "5",
    "Body": "Lit., \"perversely turned away from this [truth] is he who\\n\\t\\t\\t\\tis made to lie\" - or, according to the Taj al-'Arus, \"he\\n\\t\\t\\t\\twho is perverted in his reason and opinion\", i.e., who is\\n\\t\\t\\t\\ta priori disposed to deceive himself: implying that\\n\\t\\t\\t\\tbelief in God and, hence, in life after death is inherent\\n\\t\\t\\t\\tin man's mind and feeling, and that, therefore, a\\n\\t\\t\\t\\tdeparture from this belief is but an outcome of\\n\\t\\t\\t\\tintellectual perversion."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "10",
    "NoteID": "6",
    "Body": "For this rendering of the expression qutila, see note [9]\\n\\t\\t\\t\\ton  74:19 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "10",
    "NoteID": "7",
    "Body": "Thus the Taj al-'Arus, explaining the deeper meaning of\\n\\t\\t\\t\\tal-kharrasun. \"That which they cannot ascertain\" is, in\\n\\t\\t\\t\\tthis context, synonymous with al-ghayb, \"the reality\\n\\t\\t\\t\\twhich is beyond the reach of human perception\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "13",
    "NoteID": "8",
    "Body": "This \"trial (fitnah) by the fire\" is in tune with several\\n\\t\\t\\t\\tQur'anic allusions to the effect that the otherworldly\\n\\t\\t\\t\\tsuffering described as \"hell\" is not to be eternal: see\\n\\t\\t\\t\\tin this connection note [114] on  6:128 , note [10] on\\n\\t\\t\\t\\t 40:12  and note [53] on  43:74 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "14",
    "NoteID": "9",
    "Body": "A reference to their one-time sarcastic demand that they\\n\\t\\t\\t\\tshould be punished for their rejection of the Qur'anic\\n\\t\\t\\t\\tmessage: cf. {6:57-58} and  8:32 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "16",
    "NoteID": "10",
    "Body": "Lit., \"before that [Day]\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "18",
    "NoteID": "11",
    "Body": "See note [10] on  3:17 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "19",
    "NoteID": "12",
    "Body": "Sc., \"but could not beg\" - and this applies to all living\\n\\t\\t\\t\\tcreatures, whether human beings or mute animals (Razi),\\n\\t\\t\\t\\tirrespective of whether the need is of a physical or an\\n\\t\\t\\t\\temotional nature."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "21",
    "NoteID": "13",
    "Body": "See note [3] on  45:4 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "22",
    "NoteID": "14",
    "Body": "I.e., both physical (rain) and spiritual (truth and\\n\\t\\t\\t\\tguidance)."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "23",
    "NoteID": "15",
    "Body": "Lit., \"even as you speak\" or \"are able to speak\": an\\n\\t\\t\\t\\tallusion to man's ability to think conceptually and to\\n\\t\\t\\t\\texpress himself - that is, to something of which man is\\n\\t\\t\\t\\tabsolutely, axiomatically conscious."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "24",
    "NoteID": "16",
    "Body": "This story (as well as the subsequent mention of what\\n\\t\\t\\t\\thappened to Lot's people and to the tribes of 'Ad and\\n\\t\\t\\t\\tThamud, of Moses and Pharaoh's people, and of Noah's\\n\\t\\t\\t\\tpeople) is connected with the preceding references to the\\n\\t\\t\\t\\t\"signs\", visible and conceptual, of God's existence and\\n\\t\\t\\t\\talmightiness and the inflexible moral causality apparent\\n\\t\\t\\t\\tin what the Qur'an describes as \"the way of God\" (sunnat\\n\\t\\t\\t\\tAllah). The story of Abraham's angelic guests appears\\n\\t\\t\\t\\talso in  11:69  ff. and - in a somewhat shorter version -\\n\\t\\t\\t\\tin  15:51  ff. as well."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "25",
    "NoteID": "17",
    "Body": "Lit., \"unknown people' - i.e., not realizing that they\\n\\t\\t\\t\\twere angels."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "28",
    "NoteID": "18",
    "Body": "See note [101] on  11:70 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "28",
    "NoteID": "19",
    "Body": "I.e., with prophethood (cf.  15:53 )."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "32",
    "NoteID": "20",
    "Body": "I.e., Lot's people."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "33",
    "NoteID": "21",
    "Body": "Lit., \"stones of clay\" - the noun \"clay\" (tin) is,\\n\\t\\t\\t\\taccording to Zamakhshari, identical with the term sijjil\\n\\t\\t\\t\\tmentioned in  11:82  and tentatively explained in the\\n\\t\\t\\t\\tcorresponding note [114] as signifiying \"chastisement\\n\\t\\t\\t\\tpre-ordained\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "34",
    "NoteID": "22",
    "Body": "For an explanation of this rendering of the term\\n\\t\\t\\t\\tmusrifin, see note [21] on  10:12 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "35",
    "NoteID": "23",
    "Body": "Lit., \"And then\", i.e., after the events described in\\n\\t\\t\\t\\t 11:77  ff. and  15:61  ff."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "36",
    "NoteID": "24",
    "Body": "I.e., Lot's family."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "37",
    "NoteID": "25",
    "Body": "I.e., in the utter destruction of Sodom and Gomorrah."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "38",
    "NoteID": "26",
    "Body": "The above interpolations are based on the consensus of\\n\\t\\t\\t\\tmost of the classical commentators regarding the phrase\\n\\t\\t\\t\\t\"And in Moses, too\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "40",
    "NoteID": "27",
    "Body": "This is an illustration of the Qur'anic doctrine that the\\n\\t\\t\\t\\tsuffering which is bound to befall an evildoer in this\\n\\t\\t\\t\\tworld or in the life to come, or in both, is but a\\n\\t\\t\\t\\tconsequence of his own doings."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "42",
    "NoteID": "28",
    "Body": "See {69:6-8}. For the story of the tribe of 'Ad as such,\\n\\t\\t\\t\\tsee second half of note [48] on  7:65 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "43",
    "NoteID": "29",
    "Body": "Cf.  11:65 . An outline of the story of the Thamud is\\n\\t\\t\\t\\tgiven in {7:73-79}."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "47",
    "NoteID": "30",
    "Body": "Lit., \"the sky\" or \"the heaven\", which in the Qur'an\\n\\t\\t\\t\\toften has the connotation of \"universe\" or, in the plural\\n\\t\\t\\t\\t(\"the heavens\"), of \"cosmic systems\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "47",
    "NoteID": "31",
    "Body": "See note [38] on the first part of  21:30 . The phrase\\n\\t\\t\\t\\tinna la-musi'un clearly foreshadows the modern notion of\\n\\t\\t\\t\\tthe \"expanding universe\" - that is, the fact that the\\n\\t\\t\\t\\tcosmos, though finite in extent, is continuously\\n\\t\\t\\t\\texpanding in space."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "48",
    "NoteID": "32",
    "Body": "I.e., in accordance with the requirements of the living\\n\\t\\t\\t\\torganisms that were to - and did - develop on it."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "49",
    "NoteID": "33",
    "Body": "Lit., \"of every thing have We created pairs\" - a phrase\\n\\t\\t\\t\\twhich is explained in note [18] on  36:36 ."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "49",
    "NoteID": "34",
    "Body": "Cf.  89:3  and the corresponding note [2]."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "51",
    "NoteID": "35",
    "Body": "Lit., \"do not set up any other deity\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "52",
    "NoteID": "36",
    "Body": "Lit., \"sorcerer\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "56",
    "NoteID": "37",
    "Body": "For a full discussion of the term jinn (\"invisible\\n\\t\\t\\t\\tbeings\"), see Appendix III. As pointed out by most of the\\n\\t\\t\\t\\tphilologists - and stressed by Razi in his comments on\\n\\t\\t\\t\\tthe above verse - this term includes also the angels,\\n\\t\\t\\t\\tsince they, too, are beings or forces \"concealed from\\n\\t\\t\\t\\tman's senses\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "56",
    "NoteID": "38",
    "Body": "Thus, the innermost purpose of the creation of all\\n\\t\\t\\t\\trational beings is their cognition (ma'rifah) of the\\n\\t\\t\\t\\texistence of God and, hence, their conscious willingness\\n\\t\\t\\t\\tto conform their own existence to whatever they may\\n\\t\\t\\t\\tperceive of His will and plan: and it is this twofold\\n\\t\\t\\t\\tconcept of cognition and willingness that gives the\\n\\t\\t\\t\\tdeepest meaning to what the Qur'an describes as \"worship\"\\n\\t\\t\\t\\t('ibadah). As the next verse shows, this spiritual call\\n\\t\\t\\t\\tdoes not arise from any supposed \"need\" on the part of\\n\\t\\t\\t\\tthe Creator, who is self-sufficient and infinite in His\\n\\t\\t\\t\\tpower, but is designed as an instrument for the inner\\n\\t\\t\\t\\tdevelopment of the worshipper, who, by the act of his\\n\\t\\t\\t\\tconscious self-surrender to the all-pervading Creative\\n\\t\\t\\t\\tWill, may hope to come closer to an understanding of that\\n\\t\\t\\t\\tWill and, thus, closer to God Himself."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "59",
    "NoteID": "39",
    "Body": "Implying that every act of evildoing bears the seed of\\n\\t\\t\\t\\tits own retribution either in this world or in the\\n\\t\\t\\t\\thereafter."
  }
]
