[
  {
    "SurahNumber": "5",
    "AyahNumber": "1",
    "NoteID": "682",
    "Body": "This line has been justly admired for its terseness and\\n\\t\\t\\t\\tcomprehensiveness. Obligations: 'uqud the Arabic word\\n\\t\\t\\t\\timplies so many things that a whole chapter of Commentary\\n\\t\\t\\t\\tcan be written on it. First, there are the divine\\n\\t\\t\\t\\tobligations that arise from our spiritual nature and our\\n\\t\\t\\t\\trelation to Allah. He created us and implanted in us the\\n\\t\\t\\t\\tfaculty of knowledge and foresight: besides the intuition\\n\\t\\t\\t\\tand reason which He gave us. He made Nature responsive to\\n\\t\\t\\t\\tour needs, and His Signs in Nature are so many lessons to\\n\\t\\t\\t\\tus in our own inner life; He further sent Messengers and\\n\\t\\t\\t\\tTeachers, for the guidance of our conduct in individual,\\n\\t\\t\\t\\tsocial, and public life. All these gifts create\\n\\t\\t\\t\\tcorresponding obligations which we must fulfil. But in\\n\\t\\t\\t\\tour own human and material life we undertake mutual\\n\\t\\t\\t\\tobligations express and implied. We make a promise: we\\n\\t\\t\\t\\tenter into a commercial or social contract; we enter into\\n\\t\\t\\t\\ta contract of marriage: we must faithfuly fulfil all\\n\\t\\t\\t\\tobligations in all these relationships. Our group or our\\n\\t\\t\\t\\tState enters into a treaty; every individual in that\\n\\t\\t\\t\\tgroup or State is bound to see that as far as lies in his\\n\\t\\t\\t\\tpower, such obligations are faithfully discharged. There\\n\\t\\t\\t\\tare tacit obligations; living in civil society, we must\\n\\t\\t\\t\\trespect its tacit conventions unless they are morally\\n\\t\\t\\t\\twrong, and in that case we must get out of such society.\\n\\t\\t\\t\\tThere are tacit obligations in the characters of host and\\n\\t\\t\\t\\tguest, wayfarer of companion, employer or employed, etc.,\\n\\t\\t\\t\\tetc., which every man of Faith must discharge\\n\\t\\t\\t\\tconscientiously. The man who deserts those who need him\\n\\t\\t\\t\\tand goes to pray in a desert is a coward who disregards\\n\\t\\t\\t\\this obligations. All these obligations are\\n\\t\\t\\t\\tinter-connected. Truth and fidelity are parts of religion\\n\\t\\t\\t\\tin all relations of life. This verse is numbered\\n\\t\\t\\t\\tseparately from the succeeding verses."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "1",
    "NoteID": "683",
    "Body": "That is, the exceptions named not only in the Qur-an but\\n\\t\\t\\t\\tin the Sunnah as well. See v. 3 below."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "1",
    "NoteID": "684",
    "Body": "Cf. v. 94-96. Hunting and the use of game are forbidden\\n\\t\\t\\t\\t\"while ye are hurumun,\" i.e., while ye are (1) in the\\n\\t\\t\\t\\tSacred Precincts, or (2) in the special pilgrim garb\\n\\t\\t\\t\\t(ihram), as to which see n. 212, ii. 196. In most cases\\n\\t\\t\\t\\tthe two amount to the same thing. The Sacred Precincts\\n\\t\\t\\t\\tare sanctuary both for man and beast."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "1",
    "NoteID": "685",
    "Body": "Allah's commands are not arbitrary. His Will is the\\n\\t\\t\\t\\tperfect Archetype or Plan of the world. Everything He\\n\\t\\t\\t\\twills has regard to His Plan, in which are reflected His\\n\\t\\t\\t\\tperfect wisdom and goodness."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "2",
    "NoteID": "686",
    "Body": "Cf. ii. 158, where Safa and Marwa are called \"Symbols\\n\\t\\t\\t\\t(sha'a'ir) of Allah\". Here the Symbols are everything\\n\\t\\t\\t\\tconnected with the Pilgrimage, viz., (1) the places (like\\n\\t\\t\\t\\tSafii and Marwa, or the Ka'ba or 'Arafat, etc.); (2) the\\n\\t\\t\\t\\trites and ceremonies prescribed; (3) prohibitions (such\\n\\t\\t\\t\\tas that of hunting, etc.); (4) the times and seasons\\n\\t\\t\\t\\tprescribed. There is spiritual and moral dimension in all\\n\\t\\t\\t\\tthese. See notes on ii. 158, ii. 194-200."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "2",
    "NoteID": "687",
    "Body": "The month of pilgrimage, or else, collectively, the four\\n\\t\\t\\t\\tsacred months (ix. 36), viz., Rajab (7th). Zul-qa'dah\\n\\t\\t\\t\\t(11th), Zul-hijjah (12th, the month of Pilgrimage), and\\n\\t\\t\\t\\tMuharram (the first of the year). In all these months War\\n\\t\\t\\t\\twas prohibited. Excepting Rajab the other three months\\n\\t\\t\\t\\tare consecutive."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "2",
    "NoteID": "688",
    "Body": "The immunity from attack or interference extended to the\\n\\t\\t\\t\\tanimals brought as offerings for sacrifice and the\\n\\t\\t\\t\\tgarlands or fillets or distinguishing marks which gave\\n\\t\\t\\t\\tthem immunity. They were treated as sacred symbols. And\\n\\t\\t\\t\\tof course every protection or immunity was enjoyed by the\\n\\t\\t\\t\\tPilgrims."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "2",
    "NoteID": "689",
    "Body": "This is the state opposite to that described in n. 684,\\n\\t\\t\\t\\ti.e., when ye have left the Sacred Precincts, and have\\n\\t\\t\\t\\tdoffed the special pilgrim garb, showing your return to\\n\\t\\t\\t\\tordinary life."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "2",
    "NoteID": "690",
    "Body": "See n. 205 to ii. 191. In the sixth year of the Hijra the\\n\\t\\t\\t\\tPagans, by way of hatred and persecution of the Muslims,\\n\\t\\t\\t\\thad prevented them from access to the Sacred Mosque. When\\n\\t\\t\\t\\tthe Muslims were re-established in Makkah, some of them\\n\\t\\t\\t\\twanted to retaliate. Passing from the immediate event to\\n\\t\\t\\t\\tthe general principle, we must not retaliate or return\\n\\t\\t\\t\\tevil for evil. The hatred of the wicked does not justify\\n\\t\\t\\t\\thostility on our part. We have to help each other in\\n\\t\\t\\t\\trighteousness and piety, not in perpetuating feuds of\\n\\t\\t\\t\\thatred and enmity. We may have to fight and put down\\n\\t\\t\\t\\tevil, but never in a spirit of malice or hatred, but\\n\\t\\t\\t\\talways in a spirit of justice and righteousness."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "3",
    "NoteID": "691",
    "Body": "Cf. ii. 173 and nn. 173 and 174. The prohibition of dead\\n\\t\\t\\t\\tmeat, blood, the flesh of swine, and that on which other\\n\\t\\t\\t\\tnames than that of Allah have been invoked, has been\\n\\t\\t\\t\\tthere explained."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "3",
    "NoteID": "692",
    "Body": "If an animal dies by strangling, or by a violent blow, or\\n\\t\\t\\t\\ta headlong fall, or by being gored to death, or by being\\n\\t\\t\\t\\tattacked by a wild animal, the presumption is that it\\n\\t\\t\\t\\tbecomes carrion, as the life-blood is congealed before\\n\\t\\t\\t\\tbeing taken out of the body. But the presumption can be\\n\\t\\t\\t\\trebutted. If the life-blood still flows and the solemn\\n\\t\\t\\t\\tmode of slaughter (zabh in the name of Allah is carried\\n\\t\\t\\t\\tout, it becomes lawful as food."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "3",
    "NoteID": "693",
    "Body": "This was also an idolatrous rite, different from that in\\n\\t\\t\\t\\twhich a sacrifice was devoted to a particular idol or a\\n\\t\\t\\t\\tfalse god."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "3",
    "NoteID": "694",
    "Body": "Gambling of all kinds is forbidden; ii. 291. A sort of\\n\\t\\t\\t\\tlottery or raffle practised by Pagan Arabs has been\\n\\t\\t\\t\\tdescribed in n. 241. Division of meat in this way is here\\n\\t\\t\\t\\tforbidden, as it is a form of gambling."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "4",
    "NoteID": "697",
    "Body": "The previous verse was negative; it defined what was not\\n\\t\\t\\t\\tlawful for food, viz., things gross, or disgusting, or\\n\\t\\t\\t\\tdedicated to superstition. This verse is positive: it\\n\\t\\t\\t\\tdefines what is lawful, viz., all things that are good\\n\\t\\t\\t\\tand pure."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "4",
    "NoteID": "698",
    "Body": "In the matter of the killing for meat, the general rule\\n\\t\\t\\t\\tis that the name of Allah, the true God should be\\n\\t\\t\\t\\tpronounced as a rite in order to call our attention to\\n\\t\\t\\t\\tthe fact that we do not take life thoughtlessly but\\n\\t\\t\\t\\tsolemnly for food, with the permission of Allah, to whom\\n\\t\\t\\t\\twe render the life back. The question of hunting is then\\n\\t\\t\\t\\traised. How can this solemn rite be performed when we\\n\\t\\t\\t\\tsend forth trained hawks, trained hounds, or trained\\n\\t\\t\\t\\tcheetahs or other animals trained for the chase? They\\n\\t\\t\\t\\tmust necessarily kill at some distance from their\\n\\t\\t\\t\\tmasters. Their game is legalised on these conditions: (1)\\n\\t\\t\\t\\tthat they are trained to kill, not merely for their own\\n\\t\\t\\t\\tappetite, or out of mere wantonness, but for their\\n\\t\\t\\t\\tmaster's food; the training implies that something of the\\n\\t\\t\\t\\tsolemnity which Allah has taught us in this matter goes\\n\\t\\t\\t\\tinto their action; and (2) we are to pronounce the name\\n\\t\\t\\t\\tof Allah over the quarry; this is interpreted to mean\\n\\t\\t\\t\\tthat the Takbir should be pronounced when the hawk or\\n\\t\\t\\t\\tdog, etc., is released to the quarry."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "5",
    "NoteID": "699",
    "Body": "The question is for food generally, such as is ordinarily\\n\\t\\t\\t\\t\"good and pure\": in the matter of meat it should be\\n\\t\\t\\t\\tkilled with some sort of solemnity analogous to that of\\n\\t\\t\\t\\tthe Takbir. The rules of Islam in this respect being\\n\\t\\t\\t\\tanalogous to those of the People of the Book, there is no\\n\\t\\t\\t\\tobjection to mutual recognition, as opposed to meat\\n\\t\\t\\t\\tkilled by Pagans with superstitious rites. In this\\n\\t\\t\\t\\trespect the Christian rule is the same: \"That ye abstain\\n\\t\\t\\t\\tfrom meats offered to idols, and from blood, and from\\n\\t\\t\\t\\tthings strangled, and from fornication.\" (Acts, xv. 29).\\n\\t\\t\\t\\tNotice the bracketing of fornication with things unlawful\\n\\t\\t\\t\\tto eat."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "5",
    "NoteID": "700",
    "Body": "Islam is not exclusive. Social intercourse, including\\n\\t\\t\\t\\tinter-marriage, is permitted with the People of the Book.\\n\\t\\t\\t\\tA Muslim man may marry a woman from their ranks on the\\n\\t\\t\\t\\tsame terms as he would marry a Muslim woman, i.e., he\\n\\t\\t\\t\\tmust give her an economic and moral status, and must not\\n\\t\\t\\t\\tbe actuated merely by motives of lust or physical desire.\\n\\t\\t\\t\\tA Muslim woman may not marry a non-Muslim man, because\\n\\t\\t\\t\\ther Muslim status would be affected; the wife ordinarily\\n\\t\\t\\t\\ttakes the nationality and status given by her husband's\\n\\t\\t\\t\\tlaw. Any man or woman, of any race or faith, may, on\\n\\t\\t\\t\\taccepting Islam, freely marry any Muslim woman or man,\\n\\t\\t\\t\\tprovided it be from motives of purity and chastity and\\n\\t\\t\\t\\tnot of lewdness."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "5",
    "NoteID": "701",
    "Body": "As always, food, cleanliness, social intercourse,\\n\\t\\t\\t\\tmarriage and other interests in life, are linked with our\\n\\t\\t\\t\\tduty to Allah and faith in Him. Duty and faith are for\\n\\t\\t\\t\\tour own benefit, here and in the Hereafter."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "6",
    "NoteID": "702",
    "Body": "These are the essentials of Wudhu, or ablutions\\n\\t\\t\\t\\tpreparatory to prayers, viz., (1) to bathe the whole face\\n\\t\\t\\t\\tin water, and (2) both hands and arms to the elbows, with\\n\\t\\t\\t\\t(3) a little rubbing of the head with water (as the head\\n\\t\\t\\t\\tis usually protected and comparatively clean), and (4)\\n\\t\\t\\t\\tthe bathing of the feet to the ankles. In -addition,\\n\\t\\t\\t\\tfollowing the practice of the Prophet, it is usual first\\n\\t\\t\\t\\tto wash the mouth, and the nose before proceeding with\\n\\t\\t\\t\\tthe face, etc."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "6",
    "NoteID": "703",
    "Body": "Cf. iv. 43 and n. 563. Ritual impurity arises from sex\\n\\t\\t\\t\\tpollution."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "6",
    "NoteID": "704",
    "Body": "This is Tayammum, or wiping with clean sand or earth\\n\\t\\t\\t\\twhere water is not available. I take it that this\\n\\t\\t\\t\\tsubstitute is permissible both for Wudhu and for a full\\n\\t\\t\\t\\tbath, in the circumstances mentioned."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "7",
    "NoteID": "705",
    "Body": "There is a particular and a general meaning. The\\n\\t\\t\\t\\tparticular meaning refers to the solemn Pledge and\\n\\t\\t\\t\\tCovenant taken by two groups of people at 'Aqaba, a\\n\\t\\t\\t\\tvalley near Mina, the first about fourteen months before\\n\\t\\t\\t\\tthe Hijra, and the second a little later. These were\\n\\t\\t\\t\\tPledges of fealty to the Messenger of Allah, comparable\\n\\t\\t\\t\\tto the Covenant under Mount Sinai taken in the time of\\n\\t\\t\\t\\tMoses (See 0. ii. 63 and n. 78). The general meaning has\\n\\t\\t\\t\\tbeen explained in n. 682 to v. 1: man is under a\\n\\t\\t\\t\\tspiritual obligation under an implied Covenant with\\n\\t\\t\\t\\tAllah: Allah has given man reason, judgment, the higher\\n\\t\\t\\t\\tfaculties of the soul, and even the position of\\n\\t\\t\\t\\tvicegerent on earth (ii. 30), and man is bound to serve\\n\\t\\t\\t\\tAllah faithfully-and obey His Will. That obedience begins\\n\\t\\t\\t\\twith cleanliness in bodily functions, food, etc. It goes\\n\\t\\t\\t\\ton to cleanliness of mind and thought, and culminates in\\n\\t\\t\\t\\tpurity of motives in the inmost recesses of his heart and\\n\\t\\t\\t\\tsoul."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "8",
    "NoteID": "706",
    "Body": "Cf. iv. 135."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "8",
    "NoteID": "707",
    "Body": "To do justice and act righteously in a favourable or\\n\\t\\t\\t\\tneutral atmosphere is meritorious enough, but the real\\n\\t\\t\\t\\ttest comes when you have to do justice to people who hate\\n\\t\\t\\t\\tyou or to whom you have an aversion. But no less is\\n\\t\\t\\t\\trequired of you by the higher moral law."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "11",
    "NoteID": "708",
    "Body": "In the life-time of the Prophet it happened again and\\n\\t\\t\\t\\tagain that the enemies of Islam stretched out their hands\\n\\t\\t\\t\\tagainst him, his people, and his teaching. The odds were,\\n\\t\\t\\t\\tfrom a worldy point of view, in their favour, but their\\n\\t\\t\\t\\thands were rendered inert and powerless because they were\\n\\t\\t\\t\\tfighting against the truth of Allah. So does it happen\\n\\t\\t\\t\\talways, now as it did then. True faith must take heart,\\n\\t\\t\\t\\tand at the same time humbly recognise Allah's favour and\\n\\t\\t\\t\\tmercy, and be grateful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "12",
    "NoteID": "709",
    "Body": "Cf. ii. 63 and n. 78, \"Moses... called for the elders of\\n\\t\\t\\t\\tthe people... and all the people answered together and\\n\\t\\t\\t\\tsaid. 'All that the Lord hath spoken we will do.' \"\\n\\t\\t\\t\\t(Exod. xix, 7-8). This was under the towering height of\\n\\t\\t\\t\\tMount Sinai. The chieftains or elders or leaders of the\\n\\t\\t\\t\\tpeople were selected, one from each of the twelve tribes\\n\\t\\t\\t\\t(see ii. 60 and n. 73). For census purposes the names of\\n\\t\\t\\t\\tthe elders of the tribes are given in Num. i. 4-16: they\\n\\t\\t\\t\\tare called \"every one the head of the house of his\\n\\t\\t\\t\\tfathers\". Later, twelve other \"heads of the Children of\\n\\t\\t\\t\\tIsrael\" were selected to spy out the land of Canaan:\\n\\t\\t\\t\\ttheir names are mentioned in Num. xiii. 1-16. See also,\\n\\t\\t\\t\\tbelow, v. 20-26 and notes."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "12",
    "NoteID": "710",
    "Body": "Cf. ii. 245, n. 276. The phrase means \"spending in the\\n\\t\\t\\t\\tcause of Allah\". Allah in His infinite grace looks upon\\n\\t\\t\\t\\tthis as a loan, for which He gives a recompense manifold."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "12",
    "NoteID": "711",
    "Body": "The path of rectitude: or the even way: see ii. 108. n.\\n\\t\\t\\t\\t109."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "13",
    "NoteID": "712",
    "Body": "Cursed them: that means that because of the breach of\\n\\t\\t\\t\\ttheir Covenant, Allah withdrew His overflowing Grace from\\n\\t\\t\\t\\tthem. The withdrawal of Grace made their hearts grow hard\\n\\t\\t\\t\\tin two ways: (1) they were no longer protected from the\\n\\t\\t\\t\\tassaults of evil, and (2) they became impervious even to\\n\\t\\t\\t\\tthe message of forgiveness and mercy which is open to all\\n\\t\\t\\t\\tAllah's creatures."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "13",
    "NoteID": "713",
    "Body": "Israel, when it lost Allah's grace as above, began to sin\\n\\t\\t\\t\\tagainst truth and religion in three ways: (1) they began\\n\\t\\t\\t\\tto misuse Scripture itself, by either taking words out of\\n\\t\\t\\t\\ttheir right meaning, or applying them to things for which\\n\\t\\t\\t\\tthey were never meant; (2) in doing so, they conveniently\\n\\t\\t\\t\\tforgot a part of the Message and purpose of Allah; and\\n\\t\\t\\t\\t(3) they invented new deceits to support the old ones."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "13",
    "NoteID": "714",
    "Body": "Cf. ii. 109 and n. 110, where I have explained the\\n\\t\\t\\t\\tdifferent shades of meaning in the words for\\n\\t\\t\\t\\t\"forgiveness.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "14",
    "NoteID": "715",
    "Body": "The Christian Covenant may be taken to be the charge\\n\\t\\t\\t\\twhich Jesus gave to his disciples, and which the\\n\\t\\t\\t\\tdisciples accepted, to welcome Ahmad (Q. lxi. 6).\\n\\t\\t\\t\\tGlimpses of this are to be found in the Gospel of St.\\n\\t\\t\\t\\tJohn even as it exists now (John xv. 26. xvi. 7). It is\\n\\t\\t\\t\\tthose who call themselves \"Christians\" who reject this.\\n\\t\\t\\t\\tTrue Christians have accepted it. The enmity between\\n\\t\\t\\t\\tthose who call themselves Christians and the Jews will\\n\\t\\t\\t\\tcontinue till the Last Day. A) The change from the First\\n\\t\\t\\t\\tPerson in the beginning of the verse to the Third Person\\n\\t\\t\\t\\there illustrates the change from the personal\\n\\t\\t\\t\\trelationship of the Covenant, to the impersonal operation\\n\\t\\t\\t\\tof Justice at Judgment. Cf. xxxv. 9."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "15",
    "NoteID": "716",
    "Body": "Mubin: I wish I could translate by a simpler word than\\n\\t\\t\\t\\t\"perspicuous\". But \"plain\" may mean unadorned, the\\n\\t\\t\\t\\topposite of beautiful, and this Book is among the most\\n\\t\\t\\t\\tbeautiful that it is the privilege of mankind to read.\\n\\t\\t\\t\\t\"Clear\" would be right as far as it means \"unambiguous,\\n\\t\\t\\t\\tself-evident, not involved in mysteries of origin,\\n\\t\\t\\t\\thistory, or meaning, one which every one can understand\\n\\t\\t\\t\\tas to the essentials necessary for him, without the\\n\\t\\t\\t\\tintervention of priests or privileged persons\". Mubin has\\n\\t\\t\\t\\tall these meanings, but it suggests, besides, some\\n\\t\\t\\t\\tquality of a shining light, by which we are able to make\\n\\t\\t\\t\\tthings clear, to distinguish the true from the false,\\n\\t\\t\\t\\tThis I think is suggested better by \"perspicuous\" than by\\n\\t\\t\\t\\tthe word \"clear\". Besides it is hardly good idiom to\\n\\t\\t\\t\\tspeak of \"a clear Book.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "17",
    "NoteID": "717",
    "Body": "The most honoured of the prophets of Allah are but men.\\n\\t\\t\\t\\tAll power belongs to Allah, and not to any man. Allah's\\n\\t\\t\\t\\tcreation may take many forms, but because in any\\n\\t\\t\\t\\tparticular form it is different from what we see daily\\n\\t\\t\\t\\taround us, it does not cease to be Creation, or to be\\n\\t\\t\\t\\tsubject to the power of Allah. No creature can be God."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "18",
    "NoteID": "718",
    "Body": "Sons of God: Cf. Job, xxxviii. 7; \"When the morning stars\\n\\t\\t\\t\\tsang together, and all the sons of God shouted for joy.\"\\n\\t\\t\\t\\tIn the 29th Psalm, 1st verse, the authorised Translation\\n\\t\\t\\t\\t\"O ye mighty\" should apparently be \"O ye sons of Elim\".\\n\\t\\t\\t\\tEl being a name of God, Cf. also Genesis, vi. 2: \"The\\n\\t\\t\\t\\tsons of God saw the daughters of men.\" Beloved: Cf.\\n\\t\\t\\t\\tPsalms, cxxvii, 2: \"He giveth his beloved sleep.\" If used\\n\\t\\t\\t\\tfiguratively, these and like words refer to the love of\\n\\t\\t\\t\\tAllah. Unfortunately, \"son\" used in a physical sense, or\\n\\t\\t\\t\\t\"beloved\" in an exclusive sense as if Allah loved only\\n\\t\\t\\t\\tthe Jews, make a mockery of religion."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "18",
    "NoteID": "719",
    "Body": "This refrain in the last verse negatives the idea of\\n\\t\\t\\t\\tsonship, and in this verse negatives the idea of an\\n\\t\\t\\t\\texclusive \"Beloved\". In both cases it means that Allah is\\n\\t\\t\\t\\tindependent of physical relationship or exclusive\\n\\t\\t\\t\\tpartiality,"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "19",
    "NoteID": "720",
    "Body": "The six hundred years (in round figures) between Christ\\n\\t\\t\\t\\tand Muhammad were truly the dark ages of the world.\\n\\t\\t\\t\\tReligion was corrupted: the standard of morals fell low:\\n\\t\\t\\t\\tmany false systems and heresies arose; and there was a\\n\\t\\t\\t\\tbreak in the succession of prophets until the advent of\\n\\t\\t\\t\\tMuhammand."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "20",
    "NoteID": "721",
    "Body": "There was a long line of patriarchs and prophets before\\n\\t\\t\\t\\tMoses, e.g., Abraham, Isaac, Ismail, Jacob, etc."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "20",
    "NoteID": "722",
    "Body": "From the slavery of Egypt the Children of Israel were\\n\\t\\t\\t\\tmade free and independent, and thus each man became as it\\n\\t\\t\\t\\twere a king, if only he had obeyed Allah and followed the\\n\\t\\t\\t\\tlead of Moses."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "20",
    "NoteID": "723",
    "Body": "Cf. Exod. xix. 5: \"Now, therefore, if ye will obey my\\n\\t\\t\\t\\tvoice indeed, and keep my covenant, then ye shall be a\\n\\t\\t\\t\\tpeculiar treasure unto me above all people.\" Israel was\\n\\t\\t\\t\\tchosen to be the vehicle of Allah's message, the highest\\n\\t\\t\\t\\thonour which any nation can receive."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "21",
    "NoteID": "724",
    "Body": "We now come to the events detailed in the 13th and 1th\\n\\t\\t\\t\\tchapters of the Book of Numbers in the Old Testament.\\n\\t\\t\\t\\tRead these as a Commentary, and examine a good map of the\\n\\t\\t\\t\\tSinai Peninsula, showing its connections with Egypt on\\n\\t\\t\\t\\tthe west, North-West Arabia on the east, and Palestine on\\n\\t\\t\\t\\tthe north-east. We may suppose that Israel crossed from\\n\\t\\t\\t\\tEgypt into the Peninsula somewhere near the northern\\n\\t\\t\\t\\textremity of the Gulf of Suez. Moses organised and\\n\\t\\t\\t\\tnumbered the people, and instituted the Priesthood. They\\n\\t\\t\\t\\twent south about 200 miles to Mount Sinai where the Torah\\n\\t\\t\\t\\twas received. Then, perhaps a hundred and fifty miles\\n\\t\\t\\t\\tnorth, was the desert of Paran, close to the southern\\n\\t\\t\\t\\tborders of Canaan. From the camp there twelve men were\\n\\t\\t\\t\\tsent to spy out the land, and they penetrated as far as\\n\\t\\t\\t\\tHebron, say about 150 miles north of their camp, about 20\\n\\t\\t\\t\\tmiles south of the future Jerusalem. They saw a rich\\n\\t\\t\\t\\tcountry, and brought from it pomegranates and figs and a\\n\\t\\t\\t\\tbunch of grapes so heavy that it had to be carried by two\\n\\t\\t\\t\\tmen on a staff. They came back and reported that the land\\n\\t\\t\\t\\twas rich, but the men there were too strong for them. The\\n\\t\\t\\t\\tpeople of Israel had no courage and no faith, and Moses\\n\\t\\t\\t\\tremonstrated with them."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "22",
    "NoteID": "725",
    "Body": "The people were not willing to follow the lead of Moses,\\n\\t\\t\\t\\tand were not willing to fight for their \"inheritance.\" In\\n\\t\\t\\t\\teffect they said: \"Turn out the enemy first, and then we\\n\\t\\t\\t\\tshall enter into possession.\" In Allah's Law we must work\\n\\t\\t\\t\\tand strive for what we wish to enjoy."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "23",
    "NoteID": "726",
    "Body": "Among those who returned after spying out the land were\\n\\t\\t\\t\\ttwo men who had faith and courage. They were Joshua and\\n\\t\\t\\t\\tCaleb. Joshua afterwards succeeded Moses in the\\n\\t\\t\\t\\tleadership after 40 years. These two men pleaded for an\\n\\t\\t\\t\\timmediate entry through the proper Gate, which I\\n\\t\\t\\t\\tunderstand to mean, \"after taking all due precautions and\\n\\t\\t\\t\\tmaking all due preparations\". Cf. ii.189 and n. 203. But\\n\\t\\t\\t\\tof course, they said, they must put their trust in Allah\\n\\t\\t\\t\\tfor victory."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "24",
    "NoteID": "727",
    "Body": "The advice of Joshua and Caleb, and the proposals of\\n\\t\\t\\t\\tMoses under divine instructions were unpalatable to the\\n\\t\\t\\t\\tcrowd, whose prejudices were further inflamed by the\\n\\t\\t\\t\\tother ten men who had gone with Joshua and Caleb. They\\n\\t\\t\\t\\tmade an \"evil report,\" and were frightened by the great\\n\\t\\t\\t\\tstature of the Canaanites. The crowd was in open\\n\\t\\t\\t\\trebellion, was prepared to stone Moses, Aaron, Joshua,\\n\\t\\t\\t\\tand Caleb, and return to Egypt. Their reply to Moses was\\n\\t\\t\\t\\tfull of irony, insolence, blasphemy, and cowardice. In\\n\\t\\t\\t\\teffect they said: \"You talk of your God and all that: go\\n\\t\\t\\t\\twith your God and fight there if you like: we shall sit\\n\\t\\t\\t\\there and watch.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "25",
    "NoteID": "728",
    "Body": "\"Moses and Aaron fell on their faces before all the\\n\\t\\t\\t\\tassembly of the congregation. \"(Num. xiv. 5). According\\n\\t\\t\\t\\tto the words in the Old Testament story, Allah said: \"I\\n\\t\\t\\t\\twill smite them with the pestilence, and disinherit\\n\\t\\t\\t\\tthem.\" (Num. xiv. 12). Moses prayed and interceded. But\\n\\t\\t\\t\\tas we are told here, (a spiritual touch not found in the\\n\\t\\t\\t\\tJewish story). Moses was careful to separate himself and\\n\\t\\t\\t\\this brother from the rebellion."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "26",
    "NoteID": "729",
    "Body": "The punishment of the rebellion of these stiff-necked\\n\\t\\t\\t\\tpeople, rebellion that was repeated \"these ten times\"\\n\\t\\t\\t\\t(Num. xiv. 22) and more, was that they were left to\\n\\t\\t\\t\\twander distractedly hither and thither through the\\n\\t\\t\\t\\twilderness for forty years. That generation was not to\\n\\t\\t\\t\\tsee the Holy Land. All those that were twenty years old\\n\\t\\t\\t\\tand upwards were to die in the wilderness: \"your\\n\\t\\t\\t\\tcarcasses shall fail in this wilderness.\" (Num. xiv. 29).\\n\\t\\t\\t\\tOnly those who were then children would reach the\\n\\t\\t\\t\\tPromised land. And so it happened. From the desert of\\n\\t\\t\\t\\tParan they wandered south, north, and east for forty\\n\\t\\t\\t\\tyears. From the head of what is now the Gulf of 'Aqaba,\\n\\t\\t\\t\\tthey travelled north, keeping to the east side of the\\n\\t\\t\\t\\tdepression of which the Dead Sea and the river Jordan are\\n\\t\\t\\t\\tportions. Forty years afterwards they crossed the Jordan\\n\\t\\t\\t\\topposite what is now Jericho, but by that time Moses,\\n\\t\\t\\t\\tAaron, and the whole of the elder generation had died."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "27",
    "NoteID": "730",
    "Body": "Literally; \"recite to them in truth the story\", etc. The\\n\\t\\t\\t\\tpoint is that the story in Gen. iv. 1-15 is a bare\\n\\t\\t\\t\\tnarrative, not including the lessons now to be enforced.\\n\\t\\t\\t\\tThe Prophet is told now to supply the truth of the\\n\\t\\t\\t\\tmatter, the details that will enforce the lessons."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "27",
    "NoteID": "731",
    "Body": "The two sons of Adam were Habil (in the English Bible,\\n\\t\\t\\t\\tAbel) and Qabil (in English, Cain). Cain was the elder,\\n\\t\\t\\t\\tand Abel the younger,-the righteous and innocent one.\\n\\t\\t\\t\\tPresuming on the right of the elder, Cain was puffed up\\n\\t\\t\\t\\twith arrogance and jealousy, which led him to commit the\\n\\t\\t\\t\\tcrime of murder. Among the Christians, Cain was the type\\n\\t\\t\\t\\tof the Jew as against Abel the Christian. The Jew tried\\n\\t\\t\\t\\tto kill Jesus and exterminate the Christian. In the same\\n\\t\\t\\t\\tway, as against Muhammad, the younger brother of the\\n\\t\\t\\t\\tSemitic family, Cain was the type of the Old Testament\\n\\t\\t\\t\\tand New Testament people, who tried to resist and kill\\n\\t\\t\\t\\tMuhammad and put down his people."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "29",
    "NoteID": "732",
    "Body": "My sin as well as thine. \"My sin\" has been interpreted as\\n\\t\\t\\t\\t\"the sin against me, in that thou slayest me\": in that\\n\\t\\t\\t\\tcase thy \"sin\" may mean either \"thy crime in committing a\\n\\t\\t\\t\\tmurder.\" or \"thy sin against thyself, for the crime\\n\\t\\t\\t\\tcauses real loss to thyself in the Hereafter.\" See the\\n\\t\\t\\t\\tlast clause of the next verse."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "29",
    "NoteID": "733",
    "Body": "Abel's speech is full of meaning. He is innocent and\\n\\t\\t\\t\\tGod-fearing. To the threat of death held out by the\\n\\t\\t\\t\\tother, he returns a calm reply, aimed at reforming the\\n\\t\\t\\t\\tother. \"Surely,\" he pleads, \"if your sacrifice was not\\n\\t\\t\\t\\taccepted, there was something wrong in you, for Allah is\\n\\t\\t\\t\\tjust and accepts the sacrifice of the righteous. If this\\n\\t\\t\\t\\tdoes not deter you, I am not going to retaliate, though\\n\\t\\t\\t\\tthere is as much power in me against you as you have\\n\\t\\t\\t\\tagainst me. I fear my Maker, for I know He cherishes all\\n\\t\\t\\t\\tHis Creation. Let me warn you that you are doing wrong. I\\n\\t\\t\\t\\tdo not intend even to resist, but do you know what the\\n\\t\\t\\t\\tconsequences will be to you? You will be in torment.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "30",
    "NoteID": "734",
    "Body": "The innocent unselfish pleading of the younger brother\\n\\t\\t\\t\\thad no effect, for the soul of the other was full of\\n\\t\\t\\t\\tpride, selfishness and jealousy. He committed the murder,\\n\\t\\t\\t\\tbut in doing so, ruined his own self."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "31",
    "NoteID": "735",
    "Body": "Sau-at may mean \"corpse\", with a suggestion of nakedness\\n\\t\\t\\t\\tand shame in two senses: (1) the sense of being exposed\\n\\t\\t\\t\\twithout burial, and (2) the sense of being insulted by\\n\\t\\t\\t\\tbeing violently deprived by the unwarranted murder, of\\n\\t\\t\\t\\tthe soul which inhabited it,- the soul, too, of a\\n\\t\\t\\t\\tbrother."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "31",
    "NoteID": "736",
    "Body": "The thought at last came home to the murderer. It was\\n\\t\\t\\t\\tdreadful indeed to slay any one-the more so as he was a\\n\\t\\t\\t\\tbrother, and an innocent righteous brother! But worse\\n\\t\\t\\t\\tstill, the murderer had not even the decency to bury the\\n\\t\\t\\t\\tcorpse, and of this simple duty he was reminded by a\\n\\t\\t\\t\\traven-a black bird usually held in contempt! His regret\\n\\t\\t\\t\\twas on that account. That was no true repentance."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "32",
    "NoteID": "737",
    "Body": "The story of Cain is referred to in a few graphic details\\n\\t\\t\\t\\tin order to tell the story of Israel. Israel rebelled\\n\\t\\t\\t\\tagainst Allah, slew and insulted righteous men who did\\n\\t\\t\\t\\tthem no harm but on the contrary came in all humility.\\n\\t\\t\\t\\tWhen Allah withdrew His favour from Israel because of its\\n\\t\\t\\t\\tsins and bestowed it on brother nation, the jealousy of\\n\\t\\t\\t\\tIsrael plunged it deeper into sin. To kill or seek to\\n\\t\\t\\t\\tkill an individual because he represents an ideal is to\\n\\t\\t\\t\\tkill all who upold the ideal. On the other hand, to save\\n\\t\\t\\t\\tan individual life in the same circumstances is to save a\\n\\t\\t\\t\\twhole community. What could be stronger condemnation of\\n\\t\\t\\t\\tindividual assassination and revenge?"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "33",
    "NoteID": "738",
    "Body": "For the double crime of treason against the State,\\n\\t\\t\\t\\tcombined with treason against Allah, as shown by overt\\n\\t\\t\\t\\tcrimes, four alternative punishments are mentioned, any\\n\\t\\t\\t\\tone of which is to be applied according to the crime\\n\\t\\t\\t\\tcommitted, viz., execution (cutting off of the head),\\n\\t\\t\\t\\tcrucifixion, maiming, or exile. These were features of\\n\\t\\t\\t\\tthe Criminal Law then and for centuries afterwards,\\n\\t\\t\\t\\texcept that tortures such as \"hanging, drawing, and\\n\\t\\t\\t\\tquartering\" in English Law, and piercing of eyes and\\n\\t\\t\\t\\tleaving the unfortunate victim exposed to a tropical sun,\\n\\t\\t\\t\\twhich was practised in Arabia, and all such tortures were\\n\\t\\t\\t\\tabolished. In any case sincere repentance before it was\\n\\t\\t\\t\\ttoo late was recognised as a ground for mercy."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "33",
    "NoteID": "739",
    "Body": "Understood to mean the right hand and the left foot."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "35",
    "NoteID": "740",
    "Body": "Taqwa here too might be translated \"fear of Allah\", but\\n\\t\\t\\t\\tthe very next clause shows that \"fear of Allah\" does not\\n\\t\\t\\t\\tmean \"fear\" in the ordinary sense, which would make you\\n\\t\\t\\t\\tavoid the object of fear. On the contrary the \"fear of\\n\\t\\t\\t\\tAllah\" is the intense desire to avoid everything that is\\n\\t\\t\\t\\tagainst His Will and Law. It is in fact duty to Allah,\\n\\t\\t\\t\\tfor we are told to seek ardently the means by which we\\n\\t\\t\\t\\tmay approach Him, and that can only be done by striving\\n\\t\\t\\t\\twith might and main for His cause."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "35",
    "NoteID": "741",
    "Body": "\"Prosper\" in the real sense, for that is all that\\n\\t\\t\\t\\tmatters, as the life of this world is brief and fleeting,\\n\\t\\t\\t\\tand of small account as against Eternity."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "38",
    "NoteID": "742",
    "Body": "Here we touch upon jurisprudence. The Canon Law jurists\\n\\t\\t\\t\\tare not unanimous as to the value of the property stolen,\\n\\t\\t\\t\\twhich would involve the penalty of the cutting off of the\\n\\t\\t\\t\\thand. The majority hold that petty thefts are exempt from\\n\\t\\t\\t\\tthis punishment. The general opinion is that only one\\n\\t\\t\\t\\thand should be cut off for the first theft, on the\\n\\t\\t\\t\\tprinciple that \"if thy hand or thy foot offend thee, cut\\n\\t\\t\\t\\tthem off, and cast them from thee\" (Matt. xviii. 8).\\n\\t\\t\\t\\tApparently in the age of Jesus thieves were crucified\\n\\t\\t\\t\\t(Matt. xxvii. 38)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "40",
    "NoteID": "743",
    "Body": "Punishment really does not belong to mortals, but to\\n\\t\\t\\t\\tAllah alone. Only, in order to keep civil society\\n\\t\\t\\t\\ttogether, and protect innocent people from crime, certain\\n\\t\\t\\t\\tprinciples are laid down on which people can build up\\n\\t\\t\\t\\ttheir criminal law. But we must always remember that\\n\\t\\t\\t\\tAllah not only punishes but forgives, and forgiveness is\\n\\t\\t\\t\\tthe attribute which is more prominently placed before us.\\n\\t\\t\\t\\tIt is not our wisdom that can really define the bounds of\\n\\t\\t\\t\\tforgiveness or punishment, but His Will or Plan, which is\\n\\t\\t\\t\\tthe true standard of righteousness and justice."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "41",
    "NoteID": "744",
    "Body": "Two classes of men are meant, viz., the Hypocrites and\\n\\t\\t\\t\\tthe Jews. For both of them Al-Mustafa laboured earnestly\\n\\t\\t\\t\\tand assiduously, and it must have been a cause of great\\n\\t\\t\\t\\tgrief and disappointment to him that some among them\\n\\t\\t\\t\\tshowed so much insincerity, cunning, and hardness of\\n\\t\\t\\t\\theart. These are types not yet extinct."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "41",
    "NoteID": "745",
    "Body": "There were men among the Jews who were eager to catch up\\n\\t\\t\\t\\tany lie against the Prophet. They had their ears open\\n\\t\\t\\t\\teven to tales from people who had never so much as come\\n\\t\\t\\t\\tnear to the Prophet. If we understand \"for\" instead of\\n\\t\\t\\t\\t\"to\" before \"others\" (for the Arabic word would bear both\\n\\t\\t\\t\\tmeanings), the sense will be: They are keen listeners or\\n\\t\\t\\t\\tspies for any lies they can catch; and they will act as\\n\\t\\t\\t\\tspies for others (their Rabbis, etc.) who are in the\\n\\t\\t\\t\\tbackground but to whom they carry false tales."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "41",
    "NoteID": "746",
    "Body": "Cf. v. 13. The addition of the words min badi here\\n\\t\\t\\t\\tsuggests the change of words from their right times as\\n\\t\\t\\t\\twell as places. They did not deal honestly with their\\n\\t\\t\\t\\tLaw, and misapplied it, by distorting the meaning. Or it\\n\\t\\t\\t\\tmay be that as tale-bearers they distorted the meaning by\\n\\t\\t\\t\\tmisrepresenting the context."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "42",
    "NoteID": "747",
    "Body": "Devouring anything forbidden: both in a literal and in a\\n\\t\\t\\t\\tfigurative sense. In the figurative sense, it would be:\\n\\t\\t\\t\\tthe taking of usury or bribes, or taking undue advantage\\n\\t\\t\\t\\tof people's weak position or their own fiduciary powers\\n\\t\\t\\t\\tto add to their own wealth."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "42",
    "NoteID": "748",
    "Body": "Where it is merely a trick to catch out the unwary, a\\n\\t\\t\\t\\tjust man may honourably decline to interfere in a cause\\n\\t\\t\\t\\tsubmitted to him, as also in a case where the parties are\\n\\t\\t\\t\\tnot honestly desirous of justice, but each hopes that\\n\\t\\t\\t\\tsome partiality will be shown to it."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "43",
    "NoteID": "749",
    "Body": "This is a searching question as to the motive of the Jews\\n\\t\\t\\t\\tin bringing their cases for decision to the Prophet. They\\n\\t\\t\\t\\tcame either (1) to ridicule whatever he said, or (2) to\\n\\t\\t\\t\\tdeceive him as to facts and snatch a favourable decision\\n\\t\\t\\t\\twhich was against equity. If their own Law did not suit\\n\\t\\t\\t\\ttheir selfish interests, they sometimes twisted it. But\\n\\t\\t\\t\\tMuhammad was always inflexible in his justice."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "44",
    "NoteID": "750",
    "Body": "Guidance, with reference to conduct, light, with\\n\\t\\t\\t\\treference to insight into the higher realms of the faith."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "44",
    "NoteID": "751",
    "Body": "Rabbani may, I think, be rightly translated by the Jewish\\n\\t\\t\\t\\ttitle of Rabbi for their learned men, Jewish learning is\\n\\t\\t\\t\\tidentified with Rabbinical literature. Ahbar is the\\n\\t\\t\\t\\tplural of hibr or habr, by which we may understand Jewish\\n\\t\\t\\t\\tDoctors of Law. Later the term was applied to those of\\n\\t\\t\\t\\tother religions."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "44",
    "NoteID": "752",
    "Body": "They were living witnesses to the truth of Scripture, and\\n\\t\\t\\t\\tcould testify that they had made it known to the people:\\n\\t\\t\\t\\tCf. ii. 143, and iv. 135."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "44",
    "NoteID": "753",
    "Body": "Two charges are made, against the Jews: (1) that even the\\n\\t\\t\\t\\tbooks which they had, they twisted in meaning, to suit\\n\\t\\t\\t\\ttheir own purposes, because they feared men rather than\\n\\t\\t\\t\\tAllah: (2) that what they had was but fragments of the\\n\\t\\t\\t\\toriginal Law given to Moses, mixed up with a lot of\\n\\t\\t\\t\\tsemi-historical and legendary matter, and some fine\\n\\t\\t\\t\\tpoetry. The Taurat mentioned in the Qur-an is not the Old\\n\\t\\t\\t\\tTestament as we have it: nor is it even the Pentateuch\\n\\t\\t\\t\\t(the first five books of the Old Testament, containing\\n\\t\\t\\t\\tthe Law embedded in a great deal of semi-historical and\\n\\t\\t\\t\\tlegendary narrative). See Appendix 11, on the Taurat\\n\\t\\t\\t\\t(printed at the end of this Sura)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "45",
    "NoteID": "754",
    "Body": "The retaliation is prescribed in three places in the\\n\\t\\t\\t\\tPentateuch, viz,. Exod. xxi, 23-25: Leviticus xxiv.\\n\\t\\t\\t\\t18-21, and Deut, xix. 21. The wording in the three\\n\\t\\t\\t\\tquotations is different, but in none of them is found the\\n\\t\\t\\t\\tadditional rider for mercy, as here. Note that in Matt.\\n\\t\\t\\t\\tv. 38. Jesus quotes the Old Law \"eye for eye,\" etc,, and\\n\\t\\t\\t\\tmodifies it in the direction of forgiveness, but the\\n\\t\\t\\t\\tQuranic injunction is more practical. Even where the\\n\\t\\t\\t\\tinjured one forgives, the State or Ruler is competent to\\n\\t\\t\\t\\ttake such action as is necessary for the preservation of\\n\\t\\t\\t\\tlaw and order in Society. For crime has a bearing that\\n\\t\\t\\t\\tgoes beyond the interests of the person injured: the\\n\\t\\t\\t\\tCommunity is affected: see Q. v. 32."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "45",
    "NoteID": "755",
    "Body": "This is not part of the Mosaic Law, but the teaching of\\n\\t\\t\\t\\tJesus and of Muhammad. Notice how the teaching of Jesus\\n\\t\\t\\t\\tis gradually introduced as leading up to the Qur-an."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "45",
    "NoteID": "756",
    "Body": "The seeming repetitions at the end of verses 47, 48 and\\n\\t\\t\\t\\t50 are not real repetitions. The significant words in the\\n\\t\\t\\t\\tthree cases are: Unbelievers, wrong-doers, and\\n\\t\\t\\t\\trebellious; and each fits the context. If the Jews tamper\\n\\t\\t\\t\\twith their books they are Unbelievers; if they give false\\n\\t\\t\\t\\tjudgments, they are wrong-doers. If the Christians follow\\n\\t\\t\\t\\tnot their light, they are rebellious."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "46",
    "NoteID": "757",
    "Body": "Guidance and light: see n. 750 above. For the meaning of\\n\\t\\t\\t\\tthe Gospel (Injil), see Appendix III, \"On the Injil\",\\n\\t\\t\\t\\t(printed at the end of this Sura)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "47",
    "NoteID": "758",
    "Body": "See n. 756 above."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "48",
    "NoteID": "759",
    "Body": "After the corruption of the older revelations, the Qur-an\\n\\t\\t\\t\\tcomes with a twofold purpose: (1) to confirm the true and\\n\\t\\t\\t\\toriginal Message, and (2) to guard it, or act as a check\\n\\t\\t\\t\\tto its interpretation. The Arabic word Muhaimin is very\\n\\t\\t\\t\\tcomprehensive in meaning. It means one who safeguards,\\n\\t\\t\\t\\twatches over, stands witness, preserves, and upholds. The\\n\\t\\t\\t\\tQur-an safeguards \"the Book\", for it has preserved within\\n\\t\\t\\t\\tit the teachings of all the former Books. It watches over\\n\\t\\t\\t\\tthese Books in the sense that it will not let their true\\n\\t\\t\\t\\tteachings to be lost. It supports and upholds these Books\\n\\t\\t\\t\\tin the sense that it corroborates the Word of Allah which\\n\\t\\t\\t\\thas remained intact in them. It stands a witness because\\n\\t\\t\\t\\tit bears testimony to the Word of Allah contained in\\n\\t\\t\\t\\tthese Books and helps to sort it out from the\\n\\t\\t\\t\\tinterpretations and commentaries of the people which were\\n\\t\\t\\t\\tmixed with it: what is confirmed by the Qur-an is the\\n\\t\\t\\t\\tWord of Allah and what is against it is that of the\\n\\t\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "48",
    "NoteID": "760",
    "Body": "Law: shir'at = rules of practical conduct. Open Way:\\n\\t\\t\\t\\tMinhaj = The guidance of the Prophet in all aspects of\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "48",
    "NoteID": "761",
    "Body": "By origin mankind were a single people or nation: iv. 1,\\n\\t\\t\\t\\tand ii. 213. That being so Allah could have kept us all\\n\\t\\t\\t\\talike, with one language, one kind of disposition, and\\n\\t\\t\\t\\tone set of physical conditions (including climate) to\\n\\t\\t\\t\\tlive in. But in His wisdom, He gives us diversity in\\n\\t\\t\\t\\tthese things, not only at any given time, but in\\n\\t\\t\\t\\tdifferent periods and ages. This tests our capacity for\\n\\t\\t\\t\\tUnity (Wahdaniyat) still more, and accentuates the need\\n\\t\\t\\t\\tof Unity and Islam."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "48",
    "NoteID": "762",
    "Body": "Men are wont to make conflicting claims regarding Allah,\\n\\t\\t\\t\\tthe ultimate destiny of man, and other questions of vital\\n\\t\\t\\t\\timportance. No matter how vehement and eloquent the\\n\\t\\t\\t\\tproponents of false doctrines might be, their efforts\\n\\t\\t\\t\\twill prove fruitless and it will be indisputably clear on\\n\\t\\t\\t\\tthe Day of Judgment as to who entertained false notions\\n\\t\\t\\t\\tand who cherished the truth."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "50",
    "NoteID": "763",
    "Body": "The Days of Ignorance were the days of tribalism, feuds\\n\\t\\t\\t\\tand selfish accentuation of differences in man. Those\\n\\t\\t\\t\\tdays are really not yet over. It is the mission of Islam\\n\\t\\t\\t\\tto take us away from that false mental attitude, towards\\n\\t\\t\\t\\tthe true attitude of Unity. If our Faith is certain (and\\n\\t\\t\\t\\tnot merely a matter of words), Allah will guide us to\\n\\t\\t\\t\\tthat Unity."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "51",
    "NoteID": "764",
    "Body": "That is, look not to them for help and comfort. They are\\n\\t\\t\\t\\tmore likely to combine against you than to help you. And\\n\\t\\t\\t\\tthis happened more than once in the lifetime of the\\n\\t\\t\\t\\tProphet, and in after-ages again and again. He who\\n\\t\\t\\t\\tassociates with them and shares their counsels must be\\n\\t\\t\\t\\tcounted as of them. The trimmer loses whichever way the\\n\\t\\t\\t\\twheel of fortune turns."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "52",
    "NoteID": "765",
    "Body": "Cf. ii. 10."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "53",
    "NoteID": "766",
    "Body": "The Hypocrites, while matters were doubtful, pretended to\\n\\t\\t\\t\\tbe with Muslims, but were in league with their enemies.\\n\\t\\t\\t\\tWhen matters came to a decision and Allah granted victory\\n\\t\\t\\t\\tto Islam, their position was awkward. They were not only\\n\\t\\t\\t\\tdisowned by the Muslims, but the Muslims could well say\\n\\t\\t\\t\\tin reproach to their enemies: \"Are these the men who\\n\\t\\t\\t\\tswore friendship for you? What was their friendship worth\\n\\t\\t\\t\\tto you? Where are they now?\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "54",
    "NoteID": "767",
    "Body": "As \"most men are rebellious\" (v. 49), it is inevitable\\n\\t\\t\\t\\tthat there should be apostates even from such a religion\\n\\t\\t\\t\\tof reason and common-sense as Islam. But here is a\\n\\t\\t\\t\\twarning to the Muslim body that they should not repeat\\n\\t\\t\\t\\tthe history of the Jews, and become so self-satisfied or\\n\\t\\t\\t\\tarrogant as to depart from the spirit of Allah's\\n\\t\\t\\t\\tteaching. If they do, the loss will be their own. Allah's\\n\\t\\t\\t\\tbounty is not confined to one group or section of\\n\\t\\t\\t\\thumanity. He can always raise up people who will follow\\n\\t\\t\\t\\tthe true spirit of Islam. That spirit is defined in two\\n\\t\\t\\t\\tways: first in general terms; they will love Allah and\\n\\t\\t\\t\\tAllah will love them; and secondly, by specific signs;\\n\\t\\t\\t\\tamongst the Brethren, their attitude will be that of\\n\\t\\t\\t\\thumility, but to wrong-doers they will offer no\\n\\t\\t\\t\\tmealy-mouthed compromises; they will always strive and\\n\\t\\t\\t\\tfight for truth and right; they will know no fear, either\\n\\t\\t\\t\\tphysical, or that more insidious form, which says; \"What\\n\\t\\t\\t\\twill people say if we act thus? They are too great in\\n\\t\\t\\t\\tmind to be haunted by any such thought. For, as the next\\n\\t\\t\\t\\tverse says, their friends are Allah, His Prophet, and His\\n\\t\\t\\t\\tpeople, the people who judge rightly, without fear or\\n\\t\\t\\t\\tfavour."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "57",
    "NoteID": "768",
    "Body": "It is not right that we should be in intimate association\\n\\t\\t\\t\\twith those to whom religion is either a subject of\\n\\t\\t\\t\\tmockery or at best is nothing but a plaything. They may\\n\\t\\t\\t\\tbe amused, or they may have other motives for encouraging\\n\\t\\t\\t\\tyou. But your association with them will sap the\\n\\t\\t\\t\\tearnestness of your Faith, and make you cynical and\\n\\t\\t\\t\\tinsincere."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "59",
    "NoteID": "769",
    "Body": "There is the most biting irony in this and the next\\n\\t\\t\\t\\tverse, You People of the Book! Do you hate us because we\\n\\t\\t\\t\\tbelieve in Allah and not only our scripture, but yours\\n\\t\\t\\t\\talso? Perhaps you hate us because we obey and you are in\\n\\t\\t\\t\\trebellion against Allah! Why hate us? There are worse\\n\\t\\t\\t\\tthings than our obedience and our Faith. Shall I tell you\\n\\t\\t\\t\\tsome of them? Our test will be: what treatment Allah\\n\\t\\t\\t\\tmeted out to the things I mention. Who were the people\\n\\t\\t\\t\\twho incurred the curse of Allah? (See Deut. xi. 28, and\\n\\t\\t\\t\\txxviii. 15-68: and numerous passages like Hosea viii. 14,\\n\\t\\t\\t\\tand ix- 1). Who provoked Allah's wrath? (See numerous\\n\\t\\t\\t\\tpassages like Deut. i. 34: Matt. iii. 7). Who forsook\\n\\t\\t\\t\\tAllah, and worshipped evil? (See Jeremiah, xvi. 11-13).\\n\\t\\t\\t\\tThat is your record. Is that why you hate us?'"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "60",
    "NoteID": "770",
    "Body": "For apes see Q. ii. 65. For men possessed by devils, and\\n\\t\\t\\t\\tthe devils being sent into swine, see Matt. viii. 28-32."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "62",
    "NoteID": "771",
    "Body": "Eating of things forbidden: may be construed in a literal\\n\\t\\t\\t\\tor a figurative sense. From its juxtaposition with sin\\n\\t\\t\\t\\tand hatred, it is better to construe it in a figurative\\n\\t\\t\\t\\tsense, as referring to their fraudulent misappropriations\\n\\t\\t\\t\\tof other people's property or trust property. \"Eating\" is\\n\\t\\t\\t\\tused in v. 66 below in the general sense of enjoyment and\\n\\t\\t\\t\\thappiness."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "64",
    "NoteID": "772",
    "Body": "Cf. v. 12. and ii. 245, for a \"beautiful loan to Allah\",\\n\\t\\t\\t\\tand iii. 181, for the blasphemous taunt, \"Then Allah is\\n\\t\\t\\t\\tpoor!\" It is another form of the taunt to say, \"Then\\n\\t\\t\\t\\tAllah's hands are tied up. He is close-fisted. He does\\n\\t\\t\\t\\tnot give!\" This blasphemy is repudiated. On the contrary,\\n\\t\\t\\t\\tboundless is Allah's bounty, and He gives, as it were,\\n\\t\\t\\t\\twith both hands outstretched,-a figure of speech for\\n\\t\\t\\t\\tunbounded liberality."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "64",
    "NoteID": "773",
    "Body": "Their jealousy-because Al-Mustafa is chosen for Allah's\\n\\t\\t\\t\\tMessage-is so great that it only confirms and strengthens\\n\\t\\t\\t\\ttheir rebellion and blasphemy."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "64",
    "NoteID": "774",
    "Body": "Cf. v. 14. where the eternal warring of the Christian\\n\\t\\t\\t\\tsects, among themselves and against the Jews, is referred\\n\\t\\t\\t\\tto. The reference is to the whole of the People of the\\n\\t\\t\\t\\tBook, Jews and Christians-their internal squabbles and\\n\\t\\t\\t\\ttheir external disputes, quarrels, and wars."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "64",
    "NoteID": "775",
    "Body": "The argument of the whole verse may be thus stated. The\\n\\t\\t\\t\\tJews blaspheme and mock, and because of their jealousy,\\n\\t\\t\\t\\tthe more they are taught, the more obstinate they become\\n\\t\\t\\t\\tin their rebellion. But what good will it do to them?\\n\\t\\t\\t\\tTheir selfishness and spite sow quarrels among\\n\\t\\t\\t\\tthemselves, which will not be healed till the Day of\\n\\t\\t\\t\\tJudgment. When they stir up wars, especially against the\\n\\t\\t\\t\\tinnocent, Allah's Mercy is poured down like a flood of\\n\\t\\t\\t\\twater to extinguish them. But their wickedness continues\\n\\t\\t\\t\\tto devise ever new mischief. And Allah loves not mischief\\n\\t\\t\\t\\tor those who do mischief."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "66",
    "NoteID": "776",
    "Body": "To eat (akala) is a very comprehensive word, and denotes\\n\\t\\t\\t\\tenjoyment generally, physical, social, mental and moral,\\n\\t\\t\\t\\tand spiritual. \"To eat what is forbidden\" in verses 62\\n\\t\\t\\t\\tand 63 referred to taking unlawful profit, from usury or\\n\\t\\t\\t\\ttrust funds or in other ways. Here \"eating\" would seem to\\n\\t\\t\\t\\tmean receiving satisfaction or happiness in this life as\\n\\t\\t\\t\\twell as in the life to come. \"From above them\" may refer\\n\\t\\t\\t\\tto heavenly or spiritual satifaction, and \"from below\\n\\t\\t\\t\\ttheir feet\" to earthly satisfaction. But it is better to\\n\\t\\t\\t\\ttake the words as a general idiom, and understand\\n\\t\\t\\t\\t\"satisfaction or happiness from every side.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "67",
    "NoteID": "777",
    "Body": "Muhammad had many difficulties to contend with, many\\n\\t\\t\\t\\tenemies and dangers to avoid. Hismission must be\\n\\t\\t\\t\\tfulfilled. And he must-as he did-go forward and proclaim\\n\\t\\t\\t\\tthat Message and fulfil his mission, trusting to Allah\\n\\t\\t\\t\\tfor protection, and unconcerned if people who had lost\\n\\t\\t\\t\\tall sense of right rejected it or threatened him."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "68",
    "NoteID": "778",
    "Body": "In v. 26, Moses was told not to sorrow over a rebellious\\n\\t\\t\\t\\tpeople. Here Muhammad is told not to sorrow over people\\n\\t\\t\\t\\twithout Faith. The second situation is even more trying\\n\\t\\t\\t\\tthan the first. Rebellion may be a passing phase. Want of\\n\\t\\t\\t\\tfaith is an attitude of mind that is well-nigh hopeless.\\n\\t\\t\\t\\tYet the Prophet patiently reasoned with them and bore\\n\\t\\t\\t\\ttheir taunts and insults. If, the argument runs, you do\\n\\t\\t\\t\\tnot believe in anything, even in the things that you may\\n\\t\\t\\t\\tbe expected to believe in, how can you receive in Faith\\n\\t\\t\\t\\tAllah's Message that has come in another form? In fact\\n\\t\\t\\t\\tyour jealousy adds to your obstinacy and unbelief."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "69",
    "NoteID": "779",
    "Body": "Here, as in Sura Al-Baqarah (ii. 62), the Qur-an\\n\\t\\t\\t\\tunderscores the importance of true and genuine faith,\\n\\t\\t\\t\\twhich is to be judged by a sincere belief in Allah and\\n\\t\\t\\t\\tman's accountability to Him backed by a righteous conduct\\n\\t\\t\\t\\trather than by mere forms or labels. At both the places\\n\\t\\t\\t\\tit repudiates the false claims of the People of the Book\\n\\t\\t\\t\\tthat they had a special relationship with Allah for they\\n\\t\\t\\t\\twere the children of Abraham; that they were a chosen\\n\\t\\t\\t\\tpeople with special privileges, and no matter what they\\n\\t\\t\\t\\tdid, their high status would remain unaffected. Here this\\n\\t\\t\\t\\tfalse notion is refuted and the People of the Book are\\n\\t\\t\\t\\tbeing reminded that it is through sincere belief and\\n\\t\\t\\t\\trighteous conduct rather than pretentious claims that man\\n\\t\\t\\t\\tcan win his Lord's pleasure and achieve ultimate success.\\n\\t\\t\\t\\tThe verse does not purport to lay down an exhaustive list\\n\\t\\t\\t\\tof the articles of faith. Nor does it seek to spell out\\n\\t\\t\\t\\tthe essentials of a genuine belief in Allah, which has no\\n\\t\\t\\t\\tmeaning unless it is accompanied by belief in His\\n\\t\\t\\t\\tProphets for it is through their agency alone that we\\n\\t\\t\\t\\tknow Allah's Will and can abide by it in our practical\\n\\t\\t\\t\\tlives. This is especially true of His final Prophet,\\n\\t\\t\\t\\tMuhammad (peace be on him) whose message is universal,\\n\\t\\t\\t\\tand not confined to any particular group or section of\\n\\t\\t\\t\\thumanity. Belief in the Prophethood of Muhammad (peace be\\n\\t\\t\\t\\ton him) is thus an integral part and a logical corollary\\n\\t\\t\\t\\tof belief in Allah. Moreover, it is also an essential\\n\\t\\t\\t\\ttest of genuineness of such belief. This becomes clear\\n\\t\\t\\t\\twhen the verse is read in conjunction with other relevant\\n\\t\\t\\t\\tverses of the Qur-an. See, for instance, iv. 170, v. 15,\\n\\t\\t\\t\\t19, vii. 157, 158, xxi. 107, xxv. I, xxxiii, 40, lxi. 6.\\n\\t\\t\\t\\tSee also ii. 40, iii. 31-32, iv. 150-151."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "70",
    "NoteID": "780",
    "Body": "Cf. ii. 87, and n. 91."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "71",
    "NoteID": "781",
    "Body": "That is, they turned away their eyes from Allah's Signs\\n\\t\\t\\t\\tand they turned a deaf ear to Allah's Message."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "72",
    "NoteID": "782",
    "Body": "Cf. Matt. iv. 10, where Christ rebukes Satan for desiring\\n\\t\\t\\t\\tthe worship of other than Allah: John xx. 17, where\\n\\t\\t\\t\\tChrist says to Mary Magdalene, \"Go unto my brethren, and\\n\\t\\t\\t\\tsay unto them, I ascend unto my Father and your Father;\\n\\t\\t\\t\\tand to my God and your God.\" Cf. also Luke xviii. 19,\\n\\t\\t\\t\\twhere Christ rebukes a certain ruler for calling him Good\\n\\t\\t\\t\\tMaster: \"Why callest thou me good? None is good, save\\n\\t\\t\\t\\tOne, that is, Allah.\" In Mark xii. 25 Jesus says: \"The\\n\\t\\t\\t\\tfirst of all the commandments is, Hear O Israel; the Lord\\n\\t\\t\\t\\tour God is One Lord.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "75",
    "NoteID": "783",
    "Body": "She never claimed that she was a mother of God, or that\\n\\t\\t\\t\\ther son was God. She was a pious virtuous woman."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "75",
    "NoteID": "784",
    "Body": "Note how logically the argument has led up from Jewish\\n\\t\\t\\t\\tback-slidings and want of faith, to blasphemies\\n\\t\\t\\t\\tassociated with the names of Jesus and Mary, and in the\\n\\t\\t\\t\\tfollowing verses to the worship of senseless stocks and\\n\\t\\t\\t\\tstones. Allah is One; His Message is one; yet how\\n\\t\\t\\t\\tpeople's perversity transforms truth into falsehood,\\n\\t\\t\\t\\treligion into superstition!"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "77",
    "NoteID": "785",
    "Body": "Excess, as opposed to moderation and reason, is the\\n\\t\\t\\t\\tsimplest test by which a hypocrite or a selfish man who\\n\\t\\t\\t\\t\"trades\" on religion, is known from a sincere, pious, and\\n\\t\\t\\t\\ttruly religious man. Excess means that truth is sometimes\\n\\t\\t\\t\\tconcealed or trampled upon, that the fashions of\\n\\t\\t\\t\\tancestors or contemporaries are copied or overdone, and\\n\\t\\t\\t\\tAllah's name is dishonoured by blasphemies or the setting\\n\\t\\t\\t\\tup of false gods or fetishes, or that good (or even bad)\\n\\t\\t\\t\\tmen are deified and worshipped. The true path is the even\\n\\t\\t\\t\\tpath, the path of rectitude. (Cf. ii. 108, and v. 12)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "78",
    "NoteID": "786",
    "Body": "The Psalms of David have several passages of imprecations\\n\\t\\t\\t\\tagainst the wicked. Cf- Psalms cix 17-18; lxxviii. 21-22\\n\\t\\t\\t\\t(\"Therefore the Lord heard this and was wroth; so a fire\\n\\t\\t\\t\\twas kindled against Jacob, and anger also came up against\\n\\t\\t\\t\\tIsrael; because they believed not in God, and trusted not\\n\\t\\t\\t\\tin His salvation\"); Psalms lxix. 22-28, and Psalms v. 10."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "78",
    "NoteID": "787",
    "Body": "Cf. Matt- xxiii, 33 (\"Ye serpents, ye generation of\\n\\t\\t\\t\\tvipers, how can ye escape the damnation of Hell?); also\\n\\t\\t\\t\\tMatt. xii. 34."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "79",
    "NoteID": "788",
    "Body": "There are bad men in every community, but if leaders\\n\\t\\t\\t\\tconnive at the misdeeds of the commonalty,-and even\\n\\t\\t\\t\\tworse, if leaders themsevles share in the misdeeds, as\\n\\t\\t\\t\\thappened with the Pharisees and Scribes against whom\\n\\t\\t\\t\\tJesus spoke out, then that community is doomed."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "82",
    "NoteID": "789",
    "Body": "The meaning is not that they merely call themselves\\n\\t\\t\\t\\tChristians, but that they were such sincere Christians\\n\\t\\t\\t\\tthat they appreciated Muslim virtues, as did the\\n\\t\\t\\t\\tAbyssinians to whom Muslim refugees went during the\\n\\t\\t\\t\\tpersecution in Makkah."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "82",
    "NoteID": "790",
    "Body": "Qissis: I have translated as \"devoted to learning,\"\\n\\t\\t\\t\\tfollowing the Commentators. it seems to be a foreign\\n\\t\\t\\t\\tword, possibly Abyssinian rather than Syriac, as the\\n\\t\\t\\t\\treference seems to be to the Abyssinian Christians. Their\\n\\t\\t\\t\\treal devotion to learning and the renunciation of the\\n\\t\\t\\t\\tworld by the Monastic Orders are contrasted with the\\n\\t\\t\\t\\thypocrisy and arrogance of the Pharisees and Scribes."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "87",
    "NoteID": "791",
    "Body": "In pleasures that are good and lawful the crime is\\n\\t\\t\\t\\texcess. There is no merit merely in abstention or\\n\\t\\t\\t\\tasceticism, though the humility or unselfishness that may\\n\\t\\t\\t\\tgo with asceticism may have its value. In v. 82,\\n\\t\\t\\t\\tChristian monks are praised for particular virtues,\\n\\t\\t\\t\\tthough here and elsewhere monasticism is disapproved of.\\n\\t\\t\\t\\tUse Allah's gifts of all kinds with gratitude, but excess\\n\\t\\t\\t\\tis not approved of by Allah."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "89",
    "NoteID": "792",
    "Body": "Vows of penance or abstention may sometimes be futile, or\\n\\t\\t\\t\\teven stand in the way of really good or virtuous act. See\\n\\t\\t\\t\\tii. 224-226, and notes. The general principles\\n\\t\\t\\t\\testablished are: (1) take no futile oaths; (2) use not\\n\\t\\t\\t\\tAllah's name, literally or in intention, to fetter\\n\\t\\t\\t\\tyourself against doing a lawful or good act: (3) keep to\\n\\t\\t\\t\\tyour solemn oaths to the utmost of your ability; (4)\\n\\t\\t\\t\\twhere you are unable to do so, expiate your failure by\\n\\t\\t\\t\\tfeeding or clothing the poor, or obtaining some one's\\n\\t\\t\\t\\tfreedom, or if you have not the means, by fasting. This\\n\\t\\t\\t\\tis from a spiritual aspect."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "90",
    "NoteID": "793",
    "Body": "Cf. ii. 219, and notes 240 and 241."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "90",
    "NoteID": "794",
    "Body": "Cf. v. 3. The stones there referred to were stone altars\\n\\t\\t\\t\\tor stone columns on which oil was poured for\\n\\t\\t\\t\\tconsecration, or slabs on which meat was sacrificed to\\n\\t\\t\\t\\tidols. Any idolatrous or superstitious practices are here\\n\\t\\t\\t\\tcondemned. The ansab were objects of worship, and were\\n\\t\\t\\t\\tcommon in Arabia before Islam. See Renan, \"History of\\n\\t\\t\\t\\tIsrael\", Chapter iv, and Corpus Inscriptionum\\n\\t\\t\\t\\tSemiticarum. Part 1. p. 154: Illustrations Nos. 123 and\\n\\t\\t\\t\\t123 bis are Phoenician columns of that kind, found in\\n\\t\\t\\t\\tMalta."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "90",
    "NoteID": "795",
    "Body": "Cf. v. 3. The arrows there referred to were used for the\\n\\t\\t\\t\\tdivision of meat by a sort of lottery or rate. But arrows\\n\\t\\t\\t\\twere also used for divination, i.e., for ascertaining\\n\\t\\t\\t\\tlucky or unlucky moments, or learning the wishes of the\\n\\t\\t\\t\\theathen gods, as to whether men should undertake certain\\n\\t\\t\\t\\tactions or not. All superstitions are condemned."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "92",
    "NoteID": "796",
    "Body": "We are asked to obey the commands of Allah (which are\\n\\t\\t\\t\\talways reasonable), instead of following superstitions\\n\\t\\t\\t\\t(which are irrational), or seeking undue stimulation in\\n\\t\\t\\t\\tintoxicants or undue advantage in gambling. To some there\\n\\t\\t\\t\\tmay be temporary excitement or pleasure in these, but\\n\\t\\t\\t\\tthat is not the way either of prosperity or piety."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "92",
    "NoteID": "797",
    "Body": "Cf. v. 67. Both the worldly and the spiritual aspects of\\n\\t\\t\\t\\tloss are pointed out. Can Allah's Message do more?"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "93",
    "NoteID": "798",
    "Body": "There is a subtle symphony in what appears at first sight\\n\\t\\t\\t\\tto be a triple repetition. The relation of such simple\\n\\t\\t\\t\\tregulations as those of food, or game, or the reverence\\n\\t\\t\\t\\tdue to a sacred place or sacred institution, has to be\\n\\t\\t\\t\\texplained vis-a-vis man's higher duties. Baidhawi is\\n\\t\\t\\t\\tright in classifying such duties under three heads; those\\n\\t\\t\\t\\tdue to Allah, those due from a man to himself (his\\n\\t\\t\\t\\tself-respect), and those due to other creatures of Allah.\\n\\t\\t\\t\\tOr perhaps all duties have this threefold aspect. The\\n\\t\\t\\t\\tfirst may be called Believing or Faith; the second,\\n\\t\\t\\t\\tGuarding ourselves from evil, or Conscience: and the\\n\\t\\t\\t\\tthird, doing good or Righteousness. But the simplest\\n\\t\\t\\t\\tphysical rules, e.g., those about eating, cleanliness,\\n\\t\\t\\t\\tetc., if they are good, refer also to the higher aspects.\\n\\t\\t\\t\\tIf we eat bad food, we hurt ourselves, we cause offence\\n\\t\\t\\t\\tto our neighbours, and we disobey Allah. If we have faith\\n\\t\\t\\t\\tand righteousness, are we likely to be wanting in\\n\\t\\t\\t\\tconscience? If we have conscience and faith, are we\\n\\t\\t\\t\\tlikely to fail in righteousness? If we have conscience\\n\\t\\t\\t\\tand righteousness, what can be their foundation but\\n\\t\\t\\t\\tfaith? All three manifest themselves in a willing\\n\\t\\t\\t\\tobedience to Allah, and love for Him. We realise His love\\n\\t\\t\\t\\tin loving and doing good to His creatures, and our love\\n\\t\\t\\t\\tfor Him is meaningless without such good."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "94",
    "NoteID": "799",
    "Body": "Literally, \"know\" Cf. iii. 166, and iii, 154, n. 467.\\n\\t\\t\\t\\tGame is forbidden in the Sacred Precincts."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "95",
    "NoteID": "800",
    "Body": "See v. 1, and n. 684. The pilgrim garb, Ihram, has been\\n\\t\\t\\t\\texplained in n. 212, ii. 196."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "95",
    "NoteID": "801",
    "Body": "Intentional breach will be prevented, if possible, by\\n\\t\\t\\t\\tprevious action. If in some case the preventive action is\\n\\t\\t\\t\\tnot effective, the penalty is prescribed. The penalty is\\n\\t\\t\\t\\tin three alternatives: an equivalent animal should be\\n\\t\\t\\t\\tbrought to the Ka'ba for sacrifice; if so, the meat would\\n\\t\\t\\t\\tbe distributed to the poor; or the poor must be fed, with\\n\\t\\t\\t\\tgrain or money, according to the value of the animal if\\n\\t\\t\\t\\tone had been sacrificed: or the offender must fast as\\n\\t\\t\\t\\tmany days as the number of the poor who would have been\\n\\t\\t\\t\\tfed under the second alternative. Probably the last\\n\\t\\t\\t\\talternative would only be open if the offender is too\\n\\t\\t\\t\\tpoor to afford the first or second, but on this point\\n\\t\\t\\t\\tCommentators are not agreed. The \"equivalent animal\" in\\n\\t\\t\\t\\tthe first alternative would be a domestic animal of\\n\\t\\t\\t\\tsimilar value or weight in meat or of similar shape\\n\\t\\t\\t\\t(e.g., goat to antelope), as adjudged by two just men on\\n\\t\\t\\t\\tthe spot. The alternatives about the penalty and its\\n\\t\\t\\t\\tremission (\"Allah forgives what is past\") or exaction\\n\\t\\t\\t\\texplain the last two lines of the verse: being \"Exalted\\n\\t\\t\\t\\tand Lord of Retribution\", Allah can remit or regulate\\n\\t\\t\\t\\taccording to His just laws."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "96",
    "NoteID": "802",
    "Body": "Water-game: i.e., game found in water, e.g., fish, etc.\\n\\t\\t\\t\\t\"Water\" includes sea, river, lake, pond, etc."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "97",
    "NoteID": "803",
    "Body": "The Sacred or Prohibited Months are explained in n. 209.\\n\\t\\t\\t\\tii. 194, and n. 687, v. 2."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "97",
    "NoteID": "804",
    "Body": "See v. 2 and n. 688."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "97",
    "NoteID": "805",
    "Body": "All sorts of people from all parts of the earth gather\\n\\t\\t\\t\\tduring the Pilgrimage. They must not think that they are\\n\\t\\t\\t\\tstrangers, that nobody knows them, and that they may\\n\\t\\t\\t\\tbehave as they like. It is the House of Allah, and He has\\n\\t\\t\\t\\tsupreme knowledge of all things, of all thoughts, and all\\n\\t\\t\\t\\tmotives. As the next verse says, while He is\\n\\t\\t\\t\\tOft-forgiving, Most Merciful. He is also strict in\\n\\t\\t\\t\\tenforcing respect for His ordinances."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "100",
    "NoteID": "806",
    "Body": "Cf. ii. 204. People often judge by quantity rather than\\n\\t\\t\\t\\tquality. They are dazzled by numbers: their hearts are\\n\\t\\t\\t\\tcaptured by what they see everywhere around them. But the\\n\\t\\t\\t\\tman of understanding and discrimination judges by a\\n\\t\\t\\t\\tdifferent standard. He knows that good and bad things are\\n\\t\\t\\t\\tnot to be lumped together, and carefully chooses the\\n\\t\\t\\t\\tbest, which may be the scarcest, and avoids the bad,\\n\\t\\t\\t\\tthough evil may meet him at every step."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "101",
    "NoteID": "807",
    "Body": "Many secrets are wisely hidden from us. If the future\\n\\t\\t\\t\\twere known to us, we need not necessarily be happy. In\\n\\t\\t\\t\\tmany cases we should be miserable. If the inner meaning\\n\\t\\t\\t\\tof some of the things we see before our eyes were\\n\\t\\t\\t\\tdisclosed to us, it might cause a lot of mischief.\\n\\t\\t\\t\\tAllah's Message, in so far as it is necessary for shaping\\n\\t\\t\\t\\tour conduct, is plain and open to us. But there are many\\n\\t\\t\\t\\tthings too deep for us to understand, either individually\\n\\t\\t\\t\\tor collectively. It would be foolish to pry into them, as\\n\\t\\t\\t\\tsome people tried to do in the time of the Prophet. Where\\n\\t\\t\\t\\ta matter is mentioned in the Qur-an, we can reverently\\n\\t\\t\\t\\task for its meaning. That is not forbidden. But we should\\n\\t\\t\\t\\tnever pass the bounds of (1) our own capacity to\\n\\t\\t\\t\\tunderstand, (2) the time and occasion when we ask\\n\\t\\t\\t\\tquestions, and (3) the part of the Universal Plan which\\n\\t\\t\\t\\tit is Allah's purpose to reveal to us."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "102",
    "NoteID": "808",
    "Body": "For example, the merely fractious questions asked of\\n\\t\\t\\t\\tMoses by the Jews: ii. 68- 71. They showed that they had\\n\\t\\t\\t\\tno faith. When foolish questions are asked, and there is\\n\\t\\t\\t\\tno answer, it also shakes the faith of the foolish ones."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "103",
    "NoteID": "809",
    "Body": "A number of Arab Pagan superstitions are referred to. The\r\\n\\t\\t\\t\\tPagan mind, not understanding the hidden secrets of\r\\n\\t\\t\\t\\tnature, attributed certain phenomena to divine anger and\r\\n\\t\\t\\t\\twere assailed by superstitious fears which haunted their\r\\n\\t\\t\\t\\tlives. If a she-camel or other female domestic animal had\r\\n\\t\\t\\t\\ta large number of young, she (or one of her offspring)\r\\n\\t\\t\\t\\thad her ear slit and she was dedicated to a god: such an\r\\n\\t\\t\\t\\tanimal was a bahira. On return in safety from a journey,\r\\n\\t\\t\\t\\tor on recovery from an illness a she-camel was similarly\r\\n\\t\\t\\t\\tdedicated and let loose for free pasture: she was called\r\\n\\t\\t\\t\\ta saiba. Where an animal bore twins, certain sacrifices\r\\n\\t\\t\\t\\tor dedications were made to idols: an animal so dedicated\r\\n\\t\\t\\t\\twas a wasila. A stallion-camel dedicated to the gods by\r\\n\\t\\t\\t\\tcertain rites was a ham. The particular examples lead to\r\\n\\t\\t\\t\\tthe general truth: that superstition is due to ignorance,\r\\n\\t\\t\\t\\tand is degrading to men and dishonouring to Allah."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "104",
    "NoteID": "810",
    "Body": "Cf. ii. 170. Where a Messenger of Truth comes to teach us\\n\\t\\t\\t\\tthe better way, it is foolish to say: \"What our ancestors\\n\\t\\t\\t\\tdid is good enough for us.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "105",
    "NoteID": "811",
    "Body": "The unity of the one Judge will do perfect justice to\\n\\t\\t\\t\\teach one's conduct, however different in form it may have\\n\\t\\t\\t\\tappeared in this world."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "106",
    "NoteID": "812",
    "Body": "Ordinarily this oath should be decisive, and the matter\\n\\t\\t\\t\\tmust rest here. But if it gets known that the oath was\\n\\t\\t\\t\\tfalse, other evidence may be taken as in the next verse."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "107",
    "NoteID": "813",
    "Body": "Istahaqqa = Deserved having something (good or evil)\\n\\t\\t\\t\\tattributed to one; hence the alternative meanings: (1)\\n\\t\\t\\t\\tcommitted or was guilty (of a sin): (2) had or claimed a\\n\\t\\t\\t\\tlawful right (to property). The procedure was followed in\\n\\t\\t\\t\\tan actual case in the Prophet's life-time. A man from\\n\\t\\t\\t\\tMadinah died abroad, having made over his goods, to two\\n\\t\\t\\t\\tfriends, to be delivered to his designated heirs in\\n\\t\\t\\t\\tMadinah. They, however, kept back a valuable silver cup.\\n\\t\\t\\t\\tWhen this was found out, oaths were taken from those who\\n\\t\\t\\t\\tknew, and justice was done."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "109",
    "NoteID": "814",
    "Body": "A scene of the Day of Reckoning is put before us in\\n\\t\\t\\t\\tgraphic words, showing the responsibility and the\\n\\t\\t\\t\\tlimitations of the Prophets of Allah, sent to preach His\\n\\t\\t\\t\\tMessage to men, with special reference to the Message of\\n\\t\\t\\t\\tJesus. The Messengers are sent to preach the Truth. What\\n\\t\\t\\t\\tfantastic forms the Message takes in men's reactions to\\n\\t\\t\\t\\tit was beyond their knowledge, at the time, and beyond\\n\\t\\t\\t\\ttheir responsibility."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "815",
    "Body": "In a solemn scene before the Court of Judgment, Jesus is\\n\\t\\t\\t\\tasked to recount all the mercies and favours shown to\\n\\t\\t\\t\\thim, so that his followers should become ashamed of their\\n\\t\\t\\t\\tingratitude in corrupting that Message, when they could\\n\\t\\t\\t\\thave done so much in profiting by its purity and\\n\\t\\t\\t\\tspiritual truth. This argument continues to the end of\\n\\t\\t\\t\\tthe Sura."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "816",
    "Body": "Cf. ii. 87, and iii. 62, n. 401."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "817",
    "Body": "Cf. iii. 46, and n. 388."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "818",
    "Body": "Cf. iii. 48."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "820",
    "Body": "Note how the words \"by My leave\" are repeated with each\\n\\t\\t\\t\\tmiracle to emphasize the fact that they arose, not out of\\n\\t\\t\\t\\tthe power or will of Jesus, but by the leave and will and\\n\\t\\t\\t\\tpower of Allah, who is supreme over Jesus as He is over\\n\\t\\t\\t\\tall other mortals."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "821",
    "Body": "The Jews were seeking to take the life of Jesus long\\n\\t\\t\\t\\tbefore their final attempt to crucify him: see Luke iv.\\n\\t\\t\\t\\t28-29. Their attempt to crucify him was also foiled,\\n\\t\\t\\t\\taccording to the teaching we have received: Q. iv. 157."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "822",
    "Body": "According to Luke (xi. 15), when Christ performed the\\n\\t\\t\\t\\tmiracle of casting out devils, the Jews said he did it\\n\\t\\t\\t\\tthrough the chief of the devils. i.e., they accused him\\n\\t\\t\\t\\tof black magic. No such miracle of casting out devils is\\n\\t\\t\\t\\tmentioned in the Qur-an. But Moses, Jesus. and Muhammad\\n\\t\\t\\t\\twere all accused of magic and sorcery, by those who could\\n\\t\\t\\t\\tfind no other explanation of Allah's power."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "111",
    "NoteID": "823",
    "Body": "\"Thou\" refers to Jesus, who is being addressed by his\\n\\t\\t\\t\\tDisciples. Cf. iii. 52."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "111",
    "NoteID": "824",
    "Body": "Before or after Muhammad's life on this earth, all who\\n\\t\\t\\t\\tbowed to Allah's Will were Muslims, and their religion is\\n\\t\\t\\t\\tIslam. Cf. iii, 52, and n. 392."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "112",
    "NoteID": "825",
    "Body": "The request of the Disciples savours a little of (1) want\\n\\t\\t\\t\\tof faith, (2) too much attention to physical food, and\\n\\t\\t\\t\\t(3) a childish desire for miracles or Signs. All these\\n\\t\\t\\t\\tthree can be proved from the Canonical Gospels. (1) Simon\\n\\t\\t\\t\\tPeter, quite early in the story, asked Jesus to depart\\n\\t\\t\\t\\tfrom him, as he (Simon) was a sinful man (Luke v. 8). The\\n\\t\\t\\t\\tsame Peter afterwards denied his Master three times\\n\\t\\t\\t\\tshamelessly when the Master was in the power of his\\n\\t\\t\\t\\tenemies. And one of the Disciples (Judas) actually\\n\\t\\t\\t\\tbetrayed Jesus. (2) Even in the Canonical Gospels, so\\n\\t\\t\\t\\tmany of the miracles are concerned with food and drink,\\n\\t\\t\\t\\te.g., the turning of the water into wine (John, ii,\\n\\t\\t\\t\\t1-11); the conversion of five loaves and two small fishes\\n\\t\\t\\t\\tinto food for 5,000 men (John vi. 5-13), this being the\\n\\t\\t\\t\\tonly miracle recorded in all the four Gospels; the\\n\\t\\t\\t\\tmiraculous number of fishes caught for food (Luke V.\\n\\t\\t\\t\\t4-11); the cursing of the fig tree because it had no\\n\\t\\t\\t\\tfruit (Matt. xxi. 18-19); the allegory of eating Christ's\\n\\t\\t\\t\\tflesh and drinking his blood (John vi. 53-57). (3)\\n\\t\\t\\t\\tBecause the Samaritans would not receive Jesus into their\\n\\t\\t\\t\\tvillage, the Disciples James and John wanted a fire to\\n\\t\\t\\t\\tcome down from heaven and consume them (Luke ix. 54)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "114",
    "NoteID": "826",
    "Body": "The words of the Prayer seem to suggest the Last Supper.\\n\\t\\t\\t\\tCf. also the vision of Peter in \"The Acts of the\\n\\t\\t\\t\\tApostles.\" x. 9-16."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "114",
    "NoteID": "827",
    "Body": "As in Islam, so in Christ's Prayer, sustenance should be\\n\\t\\t\\t\\ttaken for both physical and spiritual strength,\\n\\t\\t\\t\\tespecially the latter. \"Give us this day our daily bread\"\\n\\t\\t\\t\\tseems the rendering of a literalist whose attention was\\n\\t\\t\\t\\tfixed too much on bread."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "115",
    "NoteID": "828",
    "Body": "It is a wicked generation that asks for Signs and\\n\\t\\t\\t\\tMiracles. Usually they are not vouchsafed. But where they\\n\\t\\t\\t\\tare, the responsibility of those who ask for them is\\n\\t\\t\\t\\tincreased. If, after that, they reject faith, invent\\n\\t\\t\\t\\tlies, and go after false gods or false ideals, their\\n\\t\\t\\t\\tpenalty will be worse than that of other people. How this\\n\\t\\t\\t\\tworks out practically among those who call themselves\\n\\t\\t\\t\\tChristians is exemplified in such books as the late Mr.\\n\\t\\t\\t\\tW.T. Stead's \"If Christ Came to Chicago?\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "116",
    "NoteID": "829",
    "Body": "Jesus disclaims here any knowledge of the sort of things\\n\\t\\t\\t\\tthat are attributed to him by those who take his name.\\n\\t\\t\\t\\tThe worship of Mary, though repudiated by the\\n\\t\\t\\t\\tProtestants, was widely spread in the earlier churches,\\n\\t\\t\\t\\tboth in the East and the West."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "117",
    "NoteID": "831",
    "Body": "Jesus here acknowledges that he was mortal, and that his\\n\\t\\t\\t\\tknowledge was limited like that of a mortal."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "118",
    "NoteID": "832",
    "Body": "A Master can justly punish His servants for disobedience:\\n\\t\\t\\t\\tno one can say Him nay, for He is high above all. But if\\n\\t\\t\\t\\tHe chooses to forgive. He in His wisdom sees things that\\n\\t\\t\\t\\twe mortals cannot see. This is the limit of intercession\\n\\t\\t\\t\\tthat men of God can make on behalf of sinners."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "119",
    "NoteID": "833",
    "Body": "Fauz = Felicity, happiness, achievement, salvation, the\\n\\t\\t\\t\\tattainment or fulfilment of desires. What a beautiful\\n\\t\\t\\t\\tdefinition of salvation or the end of life!-that we\\n\\t\\t\\t\\tshould win Allah's good pleasure and that we should reach\\n\\t\\t\\t\\tthe stage at which His good pleasure is all-in-all to us."
  }
]
