[
  {
    "SurahNumber": "2",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Regarding the possible significance of the single letters\\n\\t\\t\\t\\tcalled al-muqatta'at, which occur at the beginning of\\n\\t\\t\\t\\tsome surahs of the Qur'an, see Appendix II, where the\\n\\t\\t\\t\\tvarious theories bearing on this subject are discussed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "The conventional translation of muttaqi as \"God-fearing\"\\n\\t\\t\\t\\tdoes not adequately render the positive content of this\\n\\t\\t\\t\\texpression - namely, the awareness of His all-presence\\n\\t\\t\\t\\tand the desire to mould one's existence in the light of\\n\\t\\t\\t\\tthis awareness; while the interpretation adopted by some\\n\\t\\t\\t\\ttranslators, \"one who guards himself against evil\" or\\n\\t\\t\\t\\t\"one who is careful of his duty\", does not give more than\\n\\t\\t\\t\\tone particular aspect of the concept of\\n\\t\\t\\t\\tGod-consciousness."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Al-ghayb (commonly, and erroneously, translated as \"the\\n\\t\\t\\t\\tUnseen\") is used in the Qur'an to denote all those\\n\\t\\t\\t\\tsectors or phases of reality which lie beyond the range\\n\\t\\t\\t\\tof human perception and cannot, therefore, be proved or\\n\\t\\t\\t\\tdisproved by scientific observation or even adequately\\n\\t\\t\\t\\tcomprised within the accepted categories of speculative\\n\\t\\t\\t\\tthought: as, for instance, the existence of God and of a\\n\\t\\t\\t\\tdefinite purpose underlying the universe, life after\\n\\t\\t\\t\\tdeath, the real nature of time, the existence of\\n\\t\\t\\t\\tspiritual forces and their inter-action, and so forth.\\n\\t\\t\\t\\tOnly a person who is convinced that the ultimate reality\\n\\t\\t\\t\\tcomprises far more than our observable environment can\\n\\t\\t\\t\\tattain to belief in God and, thus, to a belief that life\\n\\t\\t\\t\\thas meaning and purpose. By pointing out that it is \"a\\n\\t\\t\\t\\tguidance for those who believe in the existence of that\\n\\t\\t\\t\\twhich is beyond human perception\", the Qur'an says, in\\n\\t\\t\\t\\teffect, that it will - of necessity - remain a closed\\n\\t\\t\\t\\tbook to all whose minds cannot accept this fundamental\\n\\t\\t\\t\\tpremise."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "Ar-rizq (\"provision of sustenance\") applies to all that\\n\\t\\t\\t\\tmay be of benefit to man, whether it be concrete (like\\n\\t\\t\\t\\tfood, property, offspring, etc.) or abstract (like\\n\\t\\t\\t\\tknowledge, piety, etc.). The \"spending on others\" is\\n\\t\\t\\t\\tmentioned here in one breath with God-consciousness and\\n\\t\\t\\t\\tprayer because it is precisely in such selfless acts that\\n\\t\\t\\t\\ttrue piety comes to its full fruition. It should be borne\\n\\t\\t\\t\\tin mind that the verb anfaqa (lit., \"he spent\") is always\\n\\t\\t\\t\\tused in the Qur'an to denote spending freely on, or as a\\n\\t\\t\\t\\tgift to, others, whatever the motive may be."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "This is a reference to one of the fundamental doctrines\\n\\t\\t\\t\\tof the Qur'an: the doctrine of the historical continuity\\n\\t\\t\\t\\tof divine revelation. Life - so the Qur'an teaches us -\\n\\t\\t\\t\\tis not a series of unconnected jumps but a continuous,\\n\\t\\t\\t\\torganic process: and this law applies also to the life of\\n\\t\\t\\t\\tthe mind, of which man's religious experience (in its\\n\\t\\t\\t\\tcumulative sense) is a part. Thus, the religion of the\\n\\t\\t\\t\\tQur'an can be properly understood only against the\\n\\t\\t\\t\\tbackground of the great monotheistic faiths which\\n\\t\\t\\t\\tpreceded it, and which, according to Muslim belief,\\n\\t\\t\\t\\tculminate and achieve their final formulation in the\\n\\t\\t\\t\\tfaith of Islam."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "In contrast with the frequently occurring term al-kafirun\\n\\t\\t\\t\\t(\"those who deny the truth\"), the use of the past tense\\n\\t\\t\\t\\tin alladhina kafaru indicates conscious intent, and is,\\n\\t\\t\\t\\ttherefore, appropriately rendered as \"those who are bent\\n\\t\\t\\t\\ton denying the truth\". This interpretation is supported\\n\\t\\t\\t\\tby many commentators, especially Zamakhshari (who, in his\\n\\t\\t\\t\\tcommentary on this verse, uses the expression, \"those who\\n\\t\\t\\t\\thave deliberately resolved upon their kufr\"). Elsewhere\\n\\t\\t\\t\\tin the Qur'an such people are spoken of as having \"hearts\\n\\t\\t\\t\\twith which they fail to grasp the truth, and eyes with\\n\\t\\t\\t\\twhich they fail to see, and ears with which they fail to\\n\\t\\t\\t\\thear\" ( 7:179 ). - For an explanation of the terms kufr\\n\\t\\t\\t\\t(\"denial of the truth\"), kafir (\"one who denies the\\n\\t\\t\\t\\ttruth\"), etc., see note [4] on  74:10 , where this\\n\\t\\t\\t\\tconcept appears for the first time in Qur'anic\\n\\t\\t\\t\\trevelation."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "A reference to the natural law instituted by God, whereby\\n\\t\\t\\t\\ta person who persistently adheres to false beliefs and\\n\\t\\t\\t\\trefuses to listen to the voice of truth gradually loses\\n\\t\\t\\t\\tthe ability to perceive the truth, \"so that finally, as\\n\\t\\t\\t\\tit were, a seal is set upon his heart\" (Raghib). Since it\\n\\t\\t\\t\\tis God who has instituted all laws of nature - which, in\\n\\t\\t\\t\\ttheir aggregate, are called sunnat Allah (\"the way of\\n\\t\\t\\t\\tGod\") - this \"sealing\" is attributed to Him: but it is\\n\\t\\t\\t\\tobviously a consequence of man's free choice and not an\\n\\t\\t\\t\\tact of \"predestination\". Similarly, the suffering which,\\n\\t\\t\\t\\tin the life to come, is in store for those who during\\n\\t\\t\\t\\ttheir life in this world have wilfully remained deaf and\\n\\t\\t\\t\\tblind to the truth, is a natural consequence of their\\n\\t\\t\\t\\tfree choice - just as happiness in the life to come is\\n\\t\\t\\t\\tthe natural consequence of man's endeavour to attain to\\n\\t\\t\\t\\trighteousness and inner illumination. It is in this sense\\n\\t\\t\\t\\tthat the Qur'anic references to God's \"reward\" and\\n\\t\\t\\t\\t\"punishment\" must be understood."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "I.e., before God and man - and to themselves. It is\\n\\t\\t\\t\\tgenerally assumed that the people to whom this passage\\n\\t\\t\\t\\talludes in the first instance are the hypocrites of\\n\\t\\t\\t\\tMedina who, during the early years after the hijrah,\\n\\t\\t\\t\\toutwardly professed their adherence to Islam while\\n\\t\\t\\t\\tremaining inwardly unconvinced of the truth of Muhammad's\\n\\t\\t\\t\\tmessage. However, as is always the case with Qur'anic\\n\\t\\t\\t\\tallusions to contemporary or historical events, the above\\n\\t\\t\\t\\tand the following verses have a general, timeless import\\n\\t\\t\\t\\tinasmuch as they refer to all people who are prone to\\n\\t\\t\\t\\tdeceive themselves in order to evade a spiritual\\n\\t\\t\\t\\tcommitment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "12",
    "NoteID": "9",
    "Body": "It would seem that this is an allusion to people who\\n\\t\\t\\t\\toppose any \"intrusion\" of religious considerations into\\n\\t\\t\\t\\tthe realm of practical affairs, and thus - often\\n\\t\\t\\t\\tunwittingly, thinking that they are \"but improving\\n\\t\\t\\t\\tthings\" - contribute to the moral and social confusion\\n\\t\\t\\t\\treferred to in the subsequent verse."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "14",
    "NoteID": "10",
    "Body": "Lit., \"their satans\" (shayatin, pl. of shaytan). In\\n\\t\\t\\t\\taccordance with ancient Arabic usage, this term often\\n\\t\\t\\t\\tdenotes people \"who, through their insolent persistence\\n\\t\\t\\t\\tin evildoing (tamarrud), have become like satans\"\\n\\t\\t\\t\\t(Zamakhshari): an interpretation of the above verse\\n\\t\\t\\t\\taccepted by most of the commentators. However, the term\\n\\t\\t\\t\\tshaytan - which is derived from the verb shatana, \"he was\\n\\t\\t\\t\\t[or \"became\"] remote [from all that is good and true]\"\\n\\t\\t\\t\\t(Lisan al-'Arab, Taj al-'Arus) - is often used in the\\n\\t\\t\\t\\tQur'an to describe the \"satanic\" (i.e., exceedingly evil)\\n\\t\\t\\t\\tpropensities in man's own soul, and especially all\\n\\t\\t\\t\\timpulses which run counter to truth and morality\\n\\t\\t\\t\\t(Raghib)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "15",
    "NoteID": "11",
    "Body": "Lit., \"God will mock at them\". My rendering is in\\n\\t\\t\\t\\tconformity with the generally accepted interpretation of\\n\\t\\t\\t\\tthis phrase."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "20",
    "NoteID": "12",
    "Body": "The obvious implication is: \"but He does not will this\" -\\n\\t\\t\\t\\tthat is, He does not preclude the possibility that \"those\\n\\t\\t\\t\\twho have taken error in exchange for guidance\" may one\\n\\t\\t\\t\\tday perceive the truth and mend their ways. The\\n\\t\\t\\t\\texpression \"their hearing and their sight\" is obviously a\\n\\t\\t\\t\\tmetonym for man's instinctive ability to discern between\\n\\t\\t\\t\\tgood and evil and, hence, for his moral responsibility. -\\n\\t\\t\\t\\tIn the parable of the \"people who kindle a fire\" we have,\\n\\t\\t\\t\\tI believe, an allusion to some people's exclusive\\n\\t\\t\\t\\treliance on what is termed the \"scientific approach\" as a\\n\\t\\t\\t\\tmeans to illumine and explain all the imponderables of\\n\\t\\t\\t\\tlife and faith, and the resulting arrogant refusal to\\n\\t\\t\\t\\tadmit that anything could be beyond the reach of man's\\n\\t\\t\\t\\tintellect. This \"overweening arrogance\", as the Qur'an\\n\\t\\t\\t\\tterms it, unavoidably exposes its devotees - and the\\n\\t\\t\\t\\tsociety dominated by them - to the lightning of\\n\\t\\t\\t\\tdisillusion which \"well-nigh takes away their sight\",\\n\\t\\t\\t\\ti.e., still further weakens their moral perception and\\n\\t\\t\\t\\tdeepens their \"terror of death\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "22",
    "NoteID": "13",
    "Body": "Lit., \"do not give God any compeers\" (andad, pl. of\\n\\t\\t\\t\\tnidd). There is full agreement among all commentators\\n\\t\\t\\t\\tthat this term implies any object of adoration to which\\n\\t\\t\\t\\tsome or all of God's qualities are ascribed, whether it\\n\\t\\t\\t\\tbe conceived as a deity \"in its own right\" or a saint\\n\\t\\t\\t\\tsupposedly possessing certain divine or semi-divine\\n\\t\\t\\t\\tpowers. This meaning can be brought out only by a free\\n\\t\\t\\t\\trendering of the above phrase."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "23",
    "NoteID": "14",
    "Body": "I.e., the message of which the doctrine of God's oneness\\n\\t\\t\\t\\tand uniqueness is the focal point. By the use of the word\\n\\t\\t\\t\\t\"doubt\" (rayb), this passage is meant to recall the\\n\\t\\t\\t\\topening sentence of this surah: \"This divine writ - let\\n\\t\\t\\t\\tthere be no doubt about it...\", etc. The gradualness of\\n\\t\\t\\t\\trevelation is implied in the grammatical form nazzalna -\\n\\t\\t\\t\\twhich is important in this context inasmuch as the\\n\\t\\t\\t\\topponents of the Prophet argued that the Qur'an could not\\n\\t\\t\\t\\tbe of divine origin because it was being revealed\\n\\t\\t\\t\\tgradually, and not in one piece (Zamakhshari)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "23",
    "NoteID": "15",
    "Body": "Lit., \"come forward with a surah like it, and call upon\\n\\t\\t\\t\\tyour witnesses other than God\" - namely, \"to attest that\\n\\t\\t\\t\\tyour hypothetical literary effort could be deemed equal\\n\\t\\t\\t\\tto any part of the Qur'an.\" This challenge occurs in two\\n\\t\\t\\t\\tother places as well ( 10:38  and  11:13 , in which\\n\\t\\t\\t\\tlatter case the unbelievers are called upon to produce\\n\\t\\t\\t\\tten chapters of comparable merit); see also  17:88 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "24",
    "NoteID": "16",
    "Body": "This evidently denotes all objects of worship to which\\n\\t\\t\\t\\tmen turn instead of God - their powerlessness and\\n\\t\\t\\t\\tinefficacy being symbolized by the lifelessness of stones\\n\\t\\t\\t\\t- while the expression \"human beings\" stands here for\\n\\t\\t\\t\\thuman actions deviating from the way of truth (cf. Manar\\n\\t\\t\\t\\tI, 197): the remembrance of all of which is bound to\\n\\t\\t\\t\\tincrease the sinner's suffering in the hereafter,\\n\\t\\t\\t\\treferred to in the Qur'an as \"hell\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "25",
    "NoteID": "17",
    "Body": "Lit., \"something resembling it\". Various interpretations,\\n\\t\\t\\t\\tsome of them of an esoteric and highly speculative\\n\\t\\t\\t\\tnature, have been given to this passage. For the manner\\n\\t\\t\\t\\tin which I have translated it I am indebted to Muhammad\\n\\t\\t\\t\\t'Abduh (in Manar I, 232 f.), who interprets the phrase,\\n\\t\\t\\t\\t\"It is this that in days of yore was granted to us as our\\n\\t\\t\\t\\tsustenance\" as meaning: \"It is this that we have been\\n\\t\\t\\t\\tpromised during our life on earth as a requital for faith\\n\\t\\t\\t\\tand righteous deeds.\" In other words, man's actions and\\n\\t\\t\\t\\tattitudes in this world will be mirrored in their\\n\\t\\t\\t\\t\"fruits\", or consequences, in the life to come - as has\\n\\t\\t\\t\\tbeen expressed elsewhere in the Qur'an in the verses,\\n\\t\\t\\t\\t\"And he who shall have done an atom's weight of good,\\n\\t\\t\\t\\tshall behold it; and he who shall have done an atom's\\n\\t\\t\\t\\tweight of evil, shall behold it\" ({99:7-8}). As regards\\n\\t\\t\\t\\tthe reference to \"spouses\" in the next sentence, it is to\\n\\t\\t\\t\\tbe noted that the term zawj (of which azwaj is the\\n\\t\\t\\t\\tplural) signifies either of the two components of a\\n\\t\\t\\t\\tcouple - that is, the male as well as the female."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "26",
    "NoteID": "18",
    "Body": "Lit., \"something above it\", i.e., relating to the quality\\n\\t\\t\\t\\tof smallness stressed here - as one would say,\\n\\t\\t\\t\\t\"such-and-such a person is the lowest of people, and even\\n\\t\\t\\t\\tmore than that\" (Zamakhshari). The reference to \"God's\\n\\t\\t\\t\\tparables\", following as it does immediately upon a\\n\\t\\t\\t\\tmention of the gardens of paradise and the suffering\\n\\t\\t\\t\\tthrough hell-fire in the life to come, is meant to bring\\n\\t\\t\\t\\tout the allegorical nature of this imagery."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "27",
    "NoteID": "19",
    "Body": "The \"bond with God\" (conventionally translated as \"God's\\n\\t\\t\\t\\tcovenant\") apparently refers here to man's moral\\n\\t\\t\\t\\tobligation to use his inborn gifts - intellectual as well\\n\\t\\t\\t\\tas physical - in the way intended for them by God. The\\n\\t\\t\\t\\t\"establishment\" of this bond arises from the faculty of\\n\\t\\t\\t\\treason which, if properly used, must lead man to a\\n\\t\\t\\t\\trealization of his own weakness and dependence on a\\n\\t\\t\\t\\tcausative power and, thus, to a gradual cognition of\\n\\t\\t\\t\\tGod's will with reference to his own behaviour. This\\n\\t\\t\\t\\tinterpretation of the \"bond with God\" seems to be\\n\\t\\t\\t\\tindicated by the fact that there is no mention of any\\n\\t\\t\\t\\tspecific \"covenant\" in either the preceding or the\\n\\t\\t\\t\\tsubsequent verses of the passage under consideration. The\\n\\t\\t\\t\\tdeliberate omission of any explanatory reference in this\\n\\t\\t\\t\\tconnection suggests that the expression \"bond with God\"\\n\\t\\t\\t\\tstands for something that is rooted in the human\\n\\t\\t\\t\\tsituation as such, and can, therefore, be perceived\\n\\t\\t\\t\\tinstinctively as well as through conscious experience:\\n\\t\\t\\t\\tnamely, that innate relationship with God which makes Him\\n\\t\\t\\t\\t\"closer to man than his neck-vein\" ( 50:16 ). For an\\n\\t\\t\\t\\texplanation of the subsequent reference to \"what God has\\n\\t\\t\\t\\tbidden to be joined\", see surah {13}, note [43]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "29",
    "NoteID": "20",
    "Body": "The term sama' (\"heaven\" or \"sky\") is applied to anything\\n\\t\\t\\t\\tthat is spread like a canopy above any other thing. Thus,\\n\\t\\t\\t\\tthe visible skies which stretch like a vault above the\\n\\t\\t\\t\\tearth and form, as it were, its canopy, are called sama':\\n\\t\\t\\t\\tand this is the primary meaning of this term in the\\n\\t\\t\\t\\tQur'an; in a wider sense, it has the connotation of\\n\\t\\t\\t\\t\"cosmic system\". As regards the \"seven heavens\", it is to\\n\\t\\t\\t\\tbe borne in mind that in Arabic usage - and apparently in\\n\\t\\t\\t\\tother Semitic languages as well - the number \"seven\" is\\n\\t\\t\\t\\toften synonymous with \"several\" (see Lisan al-'Arab),\\n\\t\\t\\t\\tjust as \"seventy\" or \"seven hundred\" often means many or\\n\\t\\t\\t\\t\"very many\" (Taj al-'Arus). This, taken together with the\\n\\t\\t\\t\\taccepted linguistic definition that \"every sama' is a\\n\\t\\t\\t\\tsama' with regard to what is below it\" (Raghib), may\\n\\t\\t\\t\\texplain the \"seven heavens\" as denoting the multiplicity\\n\\t\\t\\t\\tof cosmic systems. - For my rendering of thumma, at the\\n\\t\\t\\t\\tbeginning of this sentence, as \"and\", see surah {7},\\n\\t\\t\\t\\tfirst part of note [43]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "30",
    "NoteID": "21",
    "Body": "The interjection \"lo\" seems to be the only adequate\\n\\t\\t\\t\\trendering, in this context, of the particle idh, which is\\n\\t\\t\\t\\tusually - and without sufficient attention to its varying\\n\\t\\t\\t\\tuses in Arabic construction - translated as \"when\".\\n\\t\\t\\t\\tAlthough the latter rendering is often justified, idh is\\n\\t\\t\\t\\talso used to indicate \"the sudden, or unexpected,\\n\\t\\t\\t\\toccurrence of a thing\" (cf. Lane I, 39), or a sudden turn\\n\\t\\t\\t\\tin the discourse. The subsequent allegory, relating as it\\n\\t\\t\\t\\tdoes to the faculty of reason implanted in man, is\\n\\t\\t\\t\\tlogically connected with the preceding passages."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "30",
    "NoteID": "22",
    "Body": "Lit., \"establish on earth a successor\" or a\\n\\t\\t\\t\\t\"vice-gerent\". The term khalifah - derived from the verb\\n\\t\\t\\t\\tkhalafa, \"he succeeded [another]\" - is used in this\\n\\t\\t\\t\\tallegory to denote man's rightful supremacy on earth,\\n\\t\\t\\t\\twhich is most suitably rendered by the expression \"he\\n\\t\\t\\t\\tshall inherit the earth\" (in the sense of being given\\n\\t\\t\\t\\tpossession of it). See also  6:165 ,  27:62  and  35:39 ,\\n\\t\\t\\t\\twhere all human beings are spoken of as khala'if al-ard."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "31",
    "NoteID": "23",
    "Body": "Lit., \"all the names\". The term ism (\"name\") implies,\\n\\t\\t\\t\\taccording to all philologists, an expression \"conveying\\n\\t\\t\\t\\tthe knowledge [of a thing]...applied to denote a\\n\\t\\t\\t\\tsubstance or an accident or an attribute, for the purpose\\n\\t\\t\\t\\tof distinction\" (Lane IV, 1435): in philosophical\\n\\t\\t\\t\\tterminology, a \"concept\". From this it may legitimately\\n\\t\\t\\t\\tbe inferred that the \"knowledge of all the names\" denotes\\n\\t\\t\\t\\there man's faculty of logical definition and, thus, of\\n\\t\\t\\t\\tconceptual thinking. That by \"Adam\" the whole human race\\n\\t\\t\\t\\tis meant here becomes obvious from the preceding\\n\\t\\t\\t\\treference, by the angels, to \"such as will spread\\n\\t\\t\\t\\tcorruption on earth and will shed blood\", as well as from\\n\\t\\t\\t\\t 7:11 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "31",
    "NoteID": "24",
    "Body": "Namely, that it was they who, by virtue of their purity,\\n\\t\\t\\t\\twere better qualified to \"inherit the earth\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "34",
    "NoteID": "25",
    "Body": "To show that, by virtue of his ability to think\\n\\t\\t\\t\\tconceptually, man is superior in this respect even to the\\n\\t\\t\\t\\tangels."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "34",
    "NoteID": "26",
    "Body": "For an explanation of the name of the Fallen Angel, see surah 7, note 10. The fact of\r\\n this \"rebellion\", repeatedly stressed in the Qur'an, has led some of the commentators to\r\\n the conclusion that he could not have been one of the angels, since these are incapable\r\\n of sinning: \"they do not bear themselves with false pride... and they do whatever they\r\\n are bidden to do\" (16:49-50). As against this, other commentators point to the Qur'anic\r\\n phrasing of God's command to the angels and of Iblis' refusal to obey, which makes it\r\\n absolutely clear that at the time of that command he was indeed one of the heavenly host.\r\\n Hence, we must assume that his \"rebellion\" has a purely symbolic significance and is,\r\\n in reality, the outcome of a specific function assigned to him by God\r\\n (see note 31 on 15:41). "
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "35",
    "NoteID": "27",
    "Body": "Lit., \"the garden\". There is a considerable difference of\\n\\t\\t\\t\\topinion among the commentators as to what is meant here\\n\\t\\t\\t\\tby \"garden\": a garden in the earthly sense, or the\\n\\t\\t\\t\\tparadise that awaits the righteous in the life to come,\\n\\t\\t\\t\\tor some special garden in the heavenly regions? According\\n\\t\\t\\t\\tto some of the earliest commentators (see Manar I, 277),\\n\\t\\t\\t\\tan earthly abode is here alluded to - namely, an\\n\\t\\t\\t\\tenvironment of perfect ease, happiness and innocence. In\\n\\t\\t\\t\\tany case, this story of Adam is obviously one of the\\n\\t\\t\\t\\tallegories referred to in  3:7 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "35",
    "NoteID": "28",
    "Body": "This tree is alluded to elsewhere in the Qur'an\\n\\t\\t\\t\\t( 20:120 ) as \"the tree of life eternal\", and in the\\n\\t\\t\\t\\tBible (Genesis ii, 9) as \"the tree of life\" and \"the tree\\n\\t\\t\\t\\tof knowledge of good and evil\". For a tentative\\n\\t\\t\\t\\texplanation of this allegory, see note [106] on  20:120 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "36",
    "NoteID": "29",
    "Body": "Lit., \"brought them out of what they had been in\": i.e.,\\n\\t\\t\\t\\tby inducing them to eat the fruit of the forbidden tree."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "36",
    "NoteID": "30",
    "Body": "With this sentence, the address changes from the\\n\\t\\t\\t\\thitherto-observed dual form to the plural: a further\\n\\t\\t\\t\\tindication that the moral of the story relates to the\\n\\t\\t\\t\\thuman race as a whole. See also surah {7}, note [16]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "40",
    "NoteID": "31",
    "Body": "This passage connects directly with the preceding\\n\\t\\t\\t\\tpassages in that it refers to the continuous guidance\\n\\t\\t\\t\\tvouchsafed to man through divine revelation. The\\n\\t\\t\\t\\treference to the children of Israel at this point, as in\\n\\t\\t\\t\\tso many other places in the Qur'an, arises from the fact\\n\\t\\t\\t\\tthat their religious beliefs represented an earlier phase\\n\\t\\t\\t\\tof the monotheistic concept which culminates in the\\n\\t\\t\\t\\trevelation of the Qur'an."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "41",
    "NoteID": "32",
    "Body": "A reference to the persistent Jewish belief that they\\n\\t\\t\\t\\talone among all nations have been graced by divine\\n\\t\\t\\t\\trevelation. The \"trifling gain\" is their conviction that\\n\\t\\t\\t\\tthey are \"God's chosen people\" - a claim which the Qur'an\\n\\t\\t\\t\\tconsistently refutes."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "42",
    "NoteID": "33",
    "Body": "By \"overlaying the truth with falsehood\" is meant the\\n\\t\\t\\t\\tcorrupting of the Biblical text, of which the Qur'an\\n\\t\\t\\t\\tfrequently accuses the Jews (and which has since been\\n\\t\\t\\t\\testablished by objective textual criticism), while the\\n\\t\\t\\t\\t\"suppression of the truth\" refers to their disregard or\\n\\t\\t\\t\\tdeliberately false interpretation of the words of Moses\\n\\t\\t\\t\\tin the Biblical passage, \"The Lord thy God will raise up\\n\\t\\t\\t\\tunto thee a prophet from the midst of thee, of thy\\n\\t\\t\\t\\tbrethren, like unto me; unto him ye shall hearken\"\\n\\t\\t\\t\\t(Deuteronomy xviii, 15), and the words attributed to God\\n\\t\\t\\t\\tHimself, \"I will raise them up a prophet from among thy\\n\\t\\t\\t\\tbrethren, like unto thee, and will put My words in his\\n\\t\\t\\t\\tmouth\" (Deuteronomy xviii, 18). The \"brethren\" of the\\n\\t\\t\\t\\tchildren of Israel are obviously the Arabs, and\\n\\t\\t\\t\\tparticularly the musta'ribah (\"Arabianized\") group among\\n\\t\\t\\t\\tthem, which traces its descent to Ishmael and Abraham:\\n\\t\\t\\t\\tand since it is to this group that the Arabian Prophet's\\n\\t\\t\\t\\town tribe, the Quraysh, belonged, the above Biblical\\n\\t\\t\\t\\tpassages must be taken as referring to his advent."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "43",
    "NoteID": "34",
    "Body": "In Islamic Law, zakah denotes an obligatory tax,\\n\\t\\t\\t\\tincumbent on Muslims, which is meant to purify a person's\\n\\t\\t\\t\\tcapital and income from the taint of selfishness (hence\\n\\t\\t\\t\\tthe name). The proceeds of this tax are to be spent\\n\\t\\t\\t\\tmainly, but not exclusively, on the poor. Whenever,\\n\\t\\t\\t\\ttherefore, this term bears the above legal implication, I\\n\\t\\t\\t\\ttranslate it as \"the purifying dues\". Since, however, in\\n\\t\\t\\t\\tthis verse it refers to the children of Israel and\\n\\t\\t\\t\\tobviously implies only acts of charity towards the poor,\\n\\t\\t\\t\\tit is more appropriate to translate it as \"almsgiving\" or\\n\\t\\t\\t\\t\"charity\". I have also adopted this latter rendering in\\n\\t\\t\\t\\tall instances where the term zakah, though relating to\\n\\t\\t\\t\\tMuslims, does not apply specifically to the obligatory\\n\\t\\t\\t\\ttax as such (e.g., in  73:20 , where this term appears\\n\\t\\t\\t\\tfor the first time in the chronology of revelation)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "48",
    "NoteID": "35",
    "Body": "The \"taking of ransom ('adl)\" is an obvious allusion to\\n\\t\\t\\t\\tthe Christian doctrine of vicarious redemption as well as\\n\\t\\t\\t\\tto the Jewish idea that \"the chosen people\" - as the Jews\\n\\t\\t\\t\\tconsidered themselves - would be exempt from punishment\\n\\t\\t\\t\\ton the Day of Judgment. Both these ideas are\\n\\t\\t\\t\\tcategorically refuted in the Qur'an."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "49",
    "NoteID": "36",
    "Body": "See Exodus i, 15-16, 22."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "52",
    "NoteID": "37",
    "Body": "The story of the golden calf is dealt with at greater\\n\\t\\t\\t\\tlength in  7:148  ff. and  20:85  ff. Regarding the\\n\\t\\t\\t\\tcrossing of the Red Sea, to which verse {50} above\\n\\t\\t\\t\\talludes, see {20:77-78} and {26:63-66}, as well as the\\n\\t\\t\\t\\tcorresponding notes. The forty nights (and days) which\\n\\t\\t\\t\\tMoses spent on Mount Sinai are mentioned again in\\n\\t\\t\\t\\t 7:142 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "53",
    "NoteID": "38",
    "Body": " Muhammad 'Abduh amplifies the above interpretation of al-furqan (adopted by Tabari,\r\\n Zamakhshari and other great commentators) by maintaining that it applies also to \"human\r\\n reason, which enables us to distinguish the true from the false\" (Manar III, 160),\r\\n apparently basing this wider interpretation on 8:41, where the battle of Badr is described\r\\n as yawm al-furqan (\"the day on which the true was distinguished from the false\"). While\r\\n the term furgdn is often used in the Qur'an to describe one or another of the revealed\r\\n scriptures, and particularly the Qur'an itself, it has undoubtedly also the connotation\r\\n pointed out by 'Abduh: for instance, in 8:29, where it clearly refers to the faculty of\r\\n moral valuation which distinguishes every human being who is truly conscious of God. "
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "54",
    "NoteID": "39",
    "Body": "Lit., \"kill yourselves\" or, according to some\\n\\t\\t\\t\\tcommentators, \"kill one another\". This literal\\n\\t\\t\\t\\tinterpretation (probably based on the Biblical account in\\n\\t\\t\\t\\tExodus xxxii, 26-28) is not, however, convincing in view\\n\\t\\t\\t\\tof the immediately preceding call to repentance and the\\n\\t\\t\\t\\tsubsequent statement that this repentance was accepted by\\n\\t\\t\\t\\tGod. I incline, therefore, to the interpretation given by\\n\\t\\t\\t\\t'Abd al-Jabbar (quoted by Razi in his commentary on this\\n\\t\\t\\t\\tverse) to the effect that the expression \"kill\\n\\t\\t\\t\\tyourselves\" is used here in a metaphorical sense\\n\\t\\t\\t\\t(majazan), i.e., \"mortify yourselves\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "55",
    "NoteID": "40",
    "Body": "The Qur'an does not state what form this \"thunderbolt of\\n\\t\\t\\t\\tpunishment\" (as-sa'iqah) took. The lexicographers give\\n\\t\\t\\t\\tvarious interpretations to this word, but all agree on\\n\\t\\t\\t\\tthe element of vehemence and suddenness inherent in it\\n\\t\\t\\t\\t(see Lane IV, 1690)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "56",
    "NoteID": "41",
    "Body": "Lit., \"after your death\". The expression mawt does not\\n\\t\\t\\t\\talways denote physical death. Arab philologists - e.g.,\\n\\t\\t\\t\\tRaghib - explain the verb mata (lit., \"he died\") as\\n\\t\\t\\t\\thaving, in certain contexts, the meaning of \"he became\\n\\t\\t\\t\\tdeprived of sensation, dead as to the senses\"; and\\n\\t\\t\\t\\toccasionally as \"deprived of the intellectual faculty,\\n\\t\\t\\t\\tintellectually dead\"; and sometimes even as \"he slept\"\\n\\t\\t\\t\\t(see Lane VII, 2741)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "58",
    "NoteID": "42",
    "Body": "The word qaryah primarily denotes a \"village\" or \"town\",\\n\\t\\t\\t\\tbut is also used in the sense of \"land\". Here it\\n\\t\\t\\t\\tapparently refers to Palestine."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "58",
    "NoteID": "43",
    "Body": "This interpretation of the word hittah is recorded by\\n\\t\\t\\t\\tmost of the lexicographers (cf. Lane II, 592) on the\\n\\t\\t\\t\\tbasis of what many Companions of the Prophet said about\\n\\t\\t\\t\\tit (for the relevant quotations, see Ibn Kathir in his\\n\\t\\t\\t\\tcommentary on this verse). Thus, the children of Israel\\n\\t\\t\\t\\twere admonished to take possession of the promised land\\n\\t\\t\\t\\t(\"enter the gate\") in a spirit of humility (lit.,\\n\\t\\t\\t\\t\"prostrating yourselves\"), and not to regard it as\\n\\t\\t\\t\\tsomething that was \"due\" to them."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "59",
    "NoteID": "44",
    "Body": "According to several Traditions (extensively quoted by\\n\\t\\t\\t\\tIbn Kathir), they played, with a derisive intent, upon\\n\\t\\t\\t\\tthe word hittah, substituting for it something irrelevant\\n\\t\\t\\t\\tor meaningless. Muhammad 'Abduh, however, is of the\\n\\t\\t\\t\\topinion that the \"saying\" referred to in verse {58} is\\n\\t\\t\\t\\tmerely a metaphor for an attitude of mind demanded of\\n\\t\\t\\t\\tthem, and that, correspondingly, the \"substitution\"\\n\\t\\t\\t\\tsignifies here a wilful display of arrogance in disregard\\n\\t\\t\\t\\tof God's command (see Manar I,324 f.)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "60",
    "NoteID": "45",
    "Body": "I.e., according to their tribal divisions."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "61",
    "NoteID": "46",
    "Body": "I.e., \"Would you exchange your freedom for the paltry\\n\\t\\t\\t\\tcomforts which you enjoyed in your Egyptian captivity?\"\\n\\t\\t\\t\\tIn the course of their wanderings in the desert of Sinai,\\n\\t\\t\\t\\tmany Jews looked back with longing to the comparative\\n\\t\\t\\t\\tsecurity of their life in Egypt, as has been explicitly\\n\\t\\t\\t\\tstated in the Bible (Numbers xi), and is, moreover,\\n\\t\\t\\t\\tevident from Moses' allusion to it in the next sentence\\n\\t\\t\\t\\tof the above Qur'anic passage."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "61",
    "NoteID": "47",
    "Body": "The verb habata means, literally, \"he went down a\\n\\t\\t\\t\\tdeclivity\"; it is also used figuratively in the sense of\\n\\t\\t\\t\\tfalling from dignity and becoming mean and abject (cf.\\n\\t\\t\\t\\tLane VIII, 2876). Since the bitter exclamation of Moses\\n\\t\\t\\t\\tcannot be taken literally, both of the above meanings of\\n\\t\\t\\t\\tthe verb may be combined in this context and agreeably\\n\\t\\t\\t\\ttranslated as \"go back in shame to Egypt\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "61",
    "NoteID": "48",
    "Body": "This passage obviously refers to a later phase of Jewish\\n\\t\\t\\t\\thistory. That the Jews actually did kill some of their\\n\\t\\t\\t\\tprophets is evidenced, for instance, in the story of John\\n\\t\\t\\t\\tthe Baptist, as well as in the more general accusation\\n\\t\\t\\t\\tuttered, according to the Gospel, by Jesus: \"O Jerusalem,\\n\\t\\t\\t\\tJerusalem, thou that killest the prophets, and stonest\\n\\t\\t\\t\\tthem which are sent unto thee\" (Matthew xxiii, 37). See\\n\\t\\t\\t\\talso Matthew xxiii, 34-35, Luke xi, 51 - both of which\\n\\t\\t\\t\\trefer to the murder of Zachariah - and I Thessalonians\\n\\t\\t\\t\\tii, 15. The implication of continuity in, or persistent\\n\\t\\t\\t\\trepetition of, their wrongdoing transpires from the use\\n\\t\\t\\t\\tof the auxiliary verb kana in this context."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "62",
    "NoteID": "49",
    "Body": "The Sabians seem to have been a monotheistic religious\\n\\t\\t\\t\\tgroup intermediate between Judaism and Christianity.\\n\\t\\t\\t\\tTheir name (probably derived from the Aramaic verb\\n\\t\\t\\t\\ttsebha', \"he immersed himself [in water]\") would indicate\\n\\t\\t\\t\\tthat they were followers of John the Baptist - in which\\n\\t\\t\\t\\tcase they could be identified with the Mandaeans, a\\n\\t\\t\\t\\tcommunity which to this day is to be found in 'Iraq. They\\n\\t\\t\\t\\tare not to be confused with the so-called \"Sabians of\\n\\t\\t\\t\\tHarran\", a gnostic sect which still existed in the early\\n\\t\\t\\t\\tcenturies of Islam, and which may have deliberately\\n\\t\\t\\t\\tadopted the name of the true Sabians in order to obtain\\n\\t\\t\\t\\tthe advantages accorded by the Muslims to the followers\\n\\t\\t\\t\\tof every monotheistic faith."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "62",
    "NoteID": "50",
    "Body": "The above passage - which recurs in the Qur'an several\\n\\t\\t\\t\\ttimes - lays down a fundamental doctrine of Islam. With a\\n\\t\\t\\t\\tbreadth of vision unparalleled in any other religious\\n\\t\\t\\t\\tfaith, the idea of \"salvation\" is here made conditional\\n\\t\\t\\t\\tupon three elements only: belief in God, belief in the\\n\\t\\t\\t\\tDay of Judgment, and righteous action in life. The\\n\\t\\t\\t\\tstatement of this doctrine at this juncture - that is, in\\n\\t\\t\\t\\tthe midst of an appeal to the children of Israel - is\\n\\t\\t\\t\\twarranted by the false Jewish belief that their descent\\n\\t\\t\\t\\tfrom Abraham entitles them to be regarded as \"God's\\n\\t\\t\\t\\tchosen people\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "63",
    "NoteID": "51",
    "Body": "Lit., \"and We raised the mountain (at-tur) above you\":\\n\\t\\t\\t\\ti.e., letting the lofty mountain bear witness, as it\\n\\t\\t\\t\\twere, to their solemn pledge, spelled out in verse {83}\\n\\t\\t\\t\\tbelow. Throughout my translation of the Qur'an, I am\\n\\t\\t\\t\\trendering the expression at-tur as \"Mount Sinai\", since\\n\\t\\t\\t\\tit is invariably used in this sense alone."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "66",
    "NoteID": "52",
    "Body": "For the full story of the Sabbath-breakers, and the\\n\\t\\t\\t\\tmetaphorical allusion to \"apes\", see {7:163-166}. The\\n\\t\\t\\t\\texpression ma bayna yadayha, rendered here as \"their\\n\\t\\t\\t\\ttime\", is explained in surah {3}, note [3]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "67",
    "NoteID": "53",
    "Body": "As is evident from verse {72}, the story related in this\\n\\t\\t\\t\\tand the subsequent passages almost certainly refers to\\n\\t\\t\\t\\tthe Mosaic law which ordains that in certain cases of\\n\\t\\t\\t\\tunresolved murder a cow should be sacrificed, and the\\n\\t\\t\\t\\telders of the town or village nearest to the place of the\\n\\t\\t\\t\\tmurder should wash their hands over it and declare, \"Our\\n\\t\\t\\t\\thands have not shed this blood, neither have our eyes\\n\\t\\t\\t\\tseen it\" - whereupon the community would be absolved of\\n\\t\\t\\t\\tcollective responsibility. For the details of this Old\\n\\t\\t\\t\\tTestament ordinance, see Deuteronomy xxi, 1-9."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "67",
    "NoteID": "54",
    "Body": "Lit., \"lest I be one of the ignorant\". The imputation of\\n\\t\\t\\t\\tmockery was obviously due to the fact that Moses\\n\\t\\t\\t\\tpromulgated the above ordinance in very general terms,\\n\\t\\t\\t\\twithout specifying any details."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "71",
    "NoteID": "55",
    "Body": "I.e., their obstinate desire to obtain closer and closer\\n\\t\\t\\t\\tdefinitions of the simple commandment revealed to them\\n\\t\\t\\t\\tthrough Moses had made it almost impossible for them to\\n\\t\\t\\t\\tfulfil it. In his commentary on this passage, Tabari\\n\\t\\t\\t\\tquotes the following remark of Ibn 'Abbas: \"If [in the\\n\\t\\t\\t\\tfirst instance] they had sacrificed any cow chosen by\\n\\t\\t\\t\\tthemselves, they would have fulfilled their duty; but\\n\\t\\t\\t\\tthey made it complicated for themselves, and so God made\\n\\t\\t\\t\\tit complicated for them.\" A similar view has been\\n\\t\\t\\t\\texpressed, in the same context, by Zamakhshari. It would\\n\\t\\t\\t\\tappear that the moral of this story points to an\\n\\t\\t\\t\\timportant problem of all (and, therefore, also of\\n\\t\\t\\t\\tIslamic) religious jurisprudence: namely, the\\n\\t\\t\\t\\tinadvisability of trying to elicit additional details in\\n\\t\\t\\t\\trespect of any religious law that had originally been\\n\\t\\t\\t\\tgiven in general terms - for, the more numerous and\\n\\t\\t\\t\\tmultiform such details become, the more complicated and\\n\\t\\t\\t\\trigid becomes the law. This point has been acutely\\n\\t\\t\\t\\tgrasped by Rashid Rida', who says in his commentary on\\n\\t\\t\\t\\tthe above Qur'anic passage (see Manar I, 345 f.): \"Its\\n\\t\\t\\t\\tlesson is that one should not pursue one's [legal]\\n\\t\\t\\t\\tinquiries in such a way as to make laws more\\n\\t\\t\\t\\tcomplicated.... This was how the early generations [of\\n\\t\\t\\t\\tMuslims] visualized the problem. They did not make things\\n\\t\\t\\t\\tcomplicated for themselves - and so, for them, the\\n\\t\\t\\t\\treligious law (din) was natural, simple and liberal in\\n\\t\\t\\t\\tits straightforwardness. But those who came later added\\n\\t\\t\\t\\tto it [certain other] injunctions which they had deduced\\n\\t\\t\\t\\tby means of their own reasoning (ijtihad); and they\\n\\t\\t\\t\\tmultiplied those [additional] injunctions to such an\\n\\t\\t\\t\\textent that the religious law became a heavy burden on\\n\\t\\t\\t\\tthe community.\" For the sociological reason why the\\n\\t\\t\\t\\tgenuine ordinances of Islamic Law - that is, those which\\n\\t\\t\\t\\thave been prima facie laid down as such in the Qur'an and\\n\\t\\t\\t\\tthe teachings of the Prophet - are almost always devoid\\n\\t\\t\\t\\tof details, I would refer the reader to my book State and\\n\\t\\t\\t\\tGovernment in Islam (pp. 11 ff. and passim). The\\n\\t\\t\\t\\timportance of this problem, illustrated in the above\\n\\t\\t\\t\\tstory of the cow - and correctly grasped by the Prophet's\\n\\t\\t\\t\\tCompanions - explains why this surah has been entitled\\n\\t\\t\\t\\t\"The Cow\". (See also  5:101  and the corresponding notes\\n\\t\\t\\t\\t[120-123].)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "72",
    "NoteID": "56",
    "Body": "See note [53] above. The use of the plural \"you\" implies\\n\\t\\t\\t\\tthe principle of collective, communal responsibility\\n\\t\\t\\t\\tstipulated by Mosaic Law in cases of murder by a person\\n\\t\\t\\t\\tor persons unknown. God's bringing the guilt to light\\n\\t\\t\\t\\tobviously refers to the Day of Judgment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "73",
    "NoteID": "57",
    "Body": "The phrase idribuhu bi-ba'diha can be literally\\n\\t\\t\\t\\ttranslated as \"strike him [or \"it\"] with something of her\\n\\t\\t\\t\\t[or \"it\"]\" - and this possibility has given rise to the\\n\\t\\t\\t\\tfanciful assertion by many commentators that the children\\n\\t\\t\\t\\tof Israel were commanded to strike the corpse of the\\n\\t\\t\\t\\tmurdered man with some of the flesh of the sacrificed\\n\\t\\t\\t\\tcow, whereupon he was miraculously restored to life and\\n\\t\\t\\t\\tpointed out his murderer! Neither the Qur'an, nor any\\n\\t\\t\\t\\tsaying of the Prophet, nor even the Bible offers the\\n\\t\\t\\t\\tslightest warrant for this highly imaginative\\n\\t\\t\\t\\texplanation, which must, therefore, be rejected - quite\\n\\t\\t\\t\\tapart from the fact that the pronoun hu in idribuhu has a\\n\\t\\t\\t\\tmasculine gender, while the noun nafs (here translated as\\n\\t\\t\\t\\t\"human being\") is feminine in gender: from which it\\n\\t\\t\\t\\tfollows that the imperative idribuhu cannot possibly\\n\\t\\t\\t\\trefer to nafs. On the other hand, the verb daraba (lit.,\\n\\t\\t\\t\\t\"he struck\") is very often used in a figurative or\\n\\t\\t\\t\\tmetonymic sense, as, for instance, in the expression\\n\\t\\t\\t\\tdaraba fi 'l-ard (\"he journeyed on earth\"), or daraba\\n\\t\\t\\t\\t'sh-shay' bi'sh-shay' (\"he mixed one thing with another\\n\\t\\t\\t\\tthing\"), or daraba mathal (\"he coined a similitude\" or\\n\\t\\t\\t\\t\"propounded a parable\" or \"gave an illustration\"), or\\n\\t\\t\\t\\t'ala darb wahid (\"similarly applied\" or \"in the same\\n\\t\\t\\t\\tmanner\"), or duribat 'alayhim adh-dhillah (\"humiliation\\n\\t\\t\\t\\twas imposed on them\" or \"applied to them\"), and so forth.\\n\\t\\t\\t\\tTaking all this into account, I am of the opinion that\\n\\t\\t\\t\\tthe imperative idribuhu occurring in the above Qur'anic\\n\\t\\t\\t\\tpassage must be translated as \"apply it\" or \"this\"\\n\\t\\t\\t\\t(referring, in this context, to the principle of communal\\n\\t\\t\\t\\tresponsibility). As for the feminine pronoun ha in\\n\\t\\t\\t\\tba'diha (\"some of it\"), it must necessarily relate to the\\n\\t\\t\\t\\tnearest preceding feminine noun - that is, to the nafs\\n\\t\\t\\t\\tthat has been murdered, or the act of murder itself about\\n\\t\\t\\t\\twhich (fiha) the community disagreed. Thus, the phrase\\n\\t\\t\\t\\tidribuhu bi-ba'diha may be suitably rendered as \"apply\\n\\t\\t\\t\\tthis [principle] to some of those [cases of unresolved\\n\\t\\t\\t\\tmurder]\": for it is obvious that the principle of\\n\\t\\t\\t\\tcommunal responsibility for murder by a person or persons\\n\\t\\t\\t\\tunknown can be applied only to some and not to all such\\n\\t\\t\\t\\tcases."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "73",
    "NoteID": "58",
    "Body": "Lit., \"God gives life to the dead and shows you His\\n\\t\\t\\t\\tmessages\" (i.e., He shows His will by means of such\\n\\t\\t\\t\\tmessages or ordinances). The figurative expression \"He\\n\\t\\t\\t\\tgives life to the dead\" denotes the saving of lives, and\\n\\t\\t\\t\\tis analogous to that in  5:32 . In this context it refers\\n\\t\\t\\t\\tto the prevention of bloodshed and the killing of\\n\\t\\t\\t\\tinnocent persons (Manar I, 351), be it through individual\\n\\t\\t\\t\\tacts of revenge, or in result of an erroneous judicial\\n\\t\\t\\t\\tprocess based on no more than vague suspicion and\\n\\t\\t\\t\\tpossibly misleading circumstantial evidence."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "74",
    "NoteID": "59",
    "Body": "For an explanation of this allusion, see  7:143 . The\\n\\t\\t\\t\\tsimile of \"the rocks from which streams gush forth\" or\\n\\t\\t\\t\\t\"from which water issues\" serves to illustrate its\\n\\t\\t\\t\\topposite, namely, dryness and lack of life, and is thus\\n\\t\\t\\t\\tan allusion to the spiritual barrenness with which the\\n\\t\\t\\t\\tQur'an charges the children of Israel."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "75",
    "NoteID": "60",
    "Body": "Here the Muslims are addressed. In the early period of\\n\\t\\t\\t\\tIslam - and especially after their exodus to Medina,\\n\\t\\t\\t\\twhere many Jews were then living - the Muslims expected\\n\\t\\t\\t\\tthat the Jews, with their monotheistic beliefs, would be\\n\\t\\t\\t\\tthe first to rally to the message of the Qur'an: a hope\\n\\t\\t\\t\\tthat was disappointed because the Jews regarded their own\\n\\t\\t\\t\\treligion as a kind of national heritage reserved to the\\n\\t\\t\\t\\tchildren of Israel alone, and did not believe in the\\n\\t\\t\\t\\tnecessity - or possibility - of a new revelation."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "75",
    "NoteID": "61",
    "Body": "Cf. Jeremiah xxiii, 26- \"Ye have perverted the words of\\n\\t\\t\\t\\tthe living God\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "76",
    "NoteID": "62",
    "Body": "Lit., \"before [or \"in the sight of\"] your Sustainer\".\\n\\t\\t\\t\\tMost of the commentators (e.g., Zamakhshari, Baghawi,\\n\\t\\t\\t\\tRazi) agree in that the expression \"your Sustainer\"\\n\\t\\t\\t\\tstands here for \"that which your Sustainer has revealed\",\\n\\t\\t\\t\\tnamely, the Biblical prophecy relating to the coming of a\\n\\t\\t\\t\\tprophet \"from among the brethren\" of the children of\\n\\t\\t\\t\\tIsrael, and that, therefore, the above phrase implies an\\n\\t\\t\\t\\targument on the basis of the Jews' own scriptures. (See\\n\\t\\t\\t\\talso note [33] above.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "78",
    "NoteID": "63",
    "Body": "In this case, the Old Testament."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "79",
    "NoteID": "64",
    "Body": "The reference here is to the scholars responsible for\\n\\t\\t\\t\\tcorrupting the text of the Bible and thus misleading\\n\\t\\t\\t\\ttheir ignorant followers. The \"trifling gain\" is their\\n\\t\\t\\t\\tfeeling of pre-eminence as the alleged \"chosen people\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "80",
    "NoteID": "65",
    "Body": "According to popular Jewish belief, even the sinners from\\n\\t\\t\\t\\tamong the children of Israel will suffer only very\\n\\t\\t\\t\\tlimited punishment in the life to come, and will be\\n\\t\\t\\t\\tquickly reprieved by virtue of their belonging to \"the\\n\\t\\t\\t\\tchosen people\": a belief which the Qur'an rejects."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "83",
    "NoteID": "66",
    "Body": "In the preceding passages, the children of Israel have\\n\\t\\t\\t\\tbeen reminded of the favours that were bestowed on them.\\n\\t\\t\\t\\tNow, however, the Qur'an reminds them of the fact that\\n\\t\\t\\t\\tthe way of righteousness has indeed been shown to them by\\n\\t\\t\\t\\tmeans of explicit social and moral injunctions: and this\\n\\t\\t\\t\\treminder flows directly from the statement that the human\\n\\t\\t\\t\\tcondition in the life to come depends exclusively on the\\n\\t\\t\\t\\tmanner of one's life in this world, and not on one's\\n\\t\\t\\t\\tdescent."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "83",
    "NoteID": "67",
    "Body": "See note [34] above."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "83",
    "NoteID": "68",
    "Body": "The Old Testament contains many allusions to the\\n\\t\\t\\t\\twaywardness and stubborn rebelliousness of the children\\n\\t\\t\\t\\tof Israel - e.g., Exodus xxxii, 9, xxxiii, 3, xxxiv, 9;\\n\\t\\t\\t\\tDeuteronomy ix, 6-8,23-24,27."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "85",
    "NoteID": "69",
    "Body": "This is a reference to the conditions prevailing at\\n\\t\\t\\t\\tMedina at the time of the Prophet's hijrah. The two Arab\\n\\t\\t\\t\\ttribes of Medina - Al-Aws and Khazraj - were in\\n\\t\\t\\t\\tpre-Islamic times permanently at war with one another;\\n\\t\\t\\t\\tand out of the three Jewish tribes living there - the\\n\\t\\t\\t\\tBanu Qaynuqa', Banu 'n-Nadir and Banu Qurayzah - the\\n\\t\\t\\t\\tfirst-named two were allied with Khazraj, while the third\\n\\t\\t\\t\\twas allied with Al-Aws. Thus, in the course of their\\n\\t\\t\\t\\twarfare, Jew would kill Jew in alliance with pagans\\n\\t\\t\\t\\t(\"aiding one another in sin and hatred\"): a twofold crime\\n\\t\\t\\t\\tfrom the viewpoint of Mosaic Law. Nevertheless, they\\n\\t\\t\\t\\twould subsequently ransom their mutual captives in\\n\\t\\t\\t\\tobedience to that very same Law - and it is this glaring\\n\\t\\t\\t\\tinconsistency to which the Qur'an alludes in the next\\n\\t\\t\\t\\tsentence."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "87",
    "NoteID": "70",
    "Body": "Lit., \"We caused him to be followed, after his time, by\\n\\t\\t\\t\\t[all] the other apostles\": a stress upon the continuous\\n\\t\\t\\t\\tsuccession of prophets among the Jews (see Tabari,\\n\\t\\t\\t\\tZamakhshari, Razi, Ibn Kathir), which fact deprives them\\n\\t\\t\\t\\tof any excuse of ignorance."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "87",
    "NoteID": "71",
    "Body": "This rendering of ruh al-qudus (lit., \"the spirit of\\n\\t\\t\\t\\tholiness\") is based on the recurring use in the Qur'an of\\n\\t\\t\\t\\tthe term ruh in the sense of \"divine inspiration\". It is\\n\\t\\t\\t\\talso recorded that the Prophet invoked the blessing of\\n\\t\\t\\t\\tthe ruh al-qudus on his Companion, the poet Hassan ibn\\n\\t\\t\\t\\tThabit (Bukhari, Muslim, Abu Da'ud and Tirmidhi): just as\\n\\t\\t\\t\\tthe Qur'an ( 58:22 ) speaks of all believers as being\\n\\t\\t\\t\\t\"strengthened by inspiration (ruh) from Him\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "87",
    "NoteID": "72",
    "Body": "Lit., \"and some you are slaying\". The change from the\\n\\t\\t\\t\\tpast tense observed throughout this sentence to the\\n\\t\\t\\t\\tpresent tense in the verb taqtulun (\"you are slaying\") is\\n\\t\\t\\t\\tmeant to express a conscious intent in this respect and,\\n\\t\\t\\t\\tthus, a persistent, ever-recurring trait in Jewish\\n\\t\\t\\t\\thistory (Manar I, 377), to which also the New Testament\\n\\t\\t\\t\\trefers (Matthew xxiii, 34-35, 37), and I Thessalonians\\n\\t\\t\\t\\tii, 15)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "88",
    "NoteID": "73",
    "Body": "Lit., \"our hearts are repositories [of knowledge]\" - an\\n\\t\\t\\t\\tallusion to the boast of the Jews that in view of the\\n\\t\\t\\t\\treligious knowledge which they already possess, they are\\n\\t\\t\\t\\tin no need of any further preaching (Ibn Kathir, on the\\n\\t\\t\\t\\tauthority of Ibn 'Abbas; identical explanations are\\n\\t\\t\\t\\tmentioned by Tabari and Zamakhshari)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "88",
    "NoteID": "74",
    "Body": "I.e., all their beliefs are centred on themselves and\\n\\t\\t\\t\\ttheir alleged \"exceptional\" status in the sight of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "90",
    "NoteID": "75",
    "Body": "I.e., out of envy that God should bestow revelation upon\\n\\t\\t\\t\\tanyone but a descendant of Israel - in this particular\\n\\t\\t\\t\\tinstance, upon the Arabian Prophet, Muhammad."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "91",
    "NoteID": "76",
    "Body": "A reference to their assertion that they believe in what\\n\\t\\t\\t\\thas been revealed to them - i.e., the Law of Moses, which\\n\\t\\t\\t\\tobviously prohibits the killing not only of prophets but\\n\\t\\t\\t\\tof any innocent human being. See also the concluding\\n\\t\\t\\t\\tsentences of verses {61} and {87}, and the corresponding\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "93",
    "NoteID": "77",
    "Body": "It is obvious that they did not actually utter these\\n\\t\\t\\t\\twords; their subsequent behaviour, however, justifies the\\n\\t\\t\\t\\tabove metonymical expression."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "93",
    "NoteID": "78",
    "Body": "Lit., \"into their hearts has been instilled the calf\\n\\t\\t\\t\\tbecause of their denial of the truth\": i.e., as soon as\\n\\t\\t\\t\\tthey turned away from the genuine message propounded by\\n\\t\\t\\t\\tMoses, they fell into worshipping material goods,\\n\\t\\t\\t\\tsymbolized by the \"golden calf\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "94",
    "NoteID": "79",
    "Body": "An allusion to the Jewish belief that paradise is\\n\\t\\t\\t\\treserved for the children of Israel alone (cf. verse\\n\\t\\t\\t\\t{111} of this surah)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "98",
    "NoteID": "80",
    "Body": "According to several authentic Traditions, some of the\\n\\t\\t\\t\\tlearned men from among the Jews of Medina described\\n\\t\\t\\t\\tGabriel as \"the enemy of the Jews\", and this for three\\n\\t\\t\\t\\treasons: firstly, all the prophecies of the misfortune\\n\\t\\t\\t\\twhich was to befall the Jews in the course of their early\\n\\t\\t\\t\\thistory were said to have been transmitted to them by\\n\\t\\t\\t\\tGabriel, who thus became in their eyes a \"harbinger of\\n\\t\\t\\t\\tevil\" (in contrast to the angel Michael, whom they\\n\\t\\t\\t\\tregarded as a bearer of happy predictions and, therefore,\\n\\t\\t\\t\\tas their \"friend\"); secondly, because the Qur'an states\\n\\t\\t\\t\\trepeatedly that it was Gabriel who conveyed its message\\n\\t\\t\\t\\tto Muhammad, whereas the Jews were of the opinion that\\n\\t\\t\\t\\tonly a descendant of Israel could legitimately claim\\n\\t\\t\\t\\tdivine revelation; and, thirdly, because the Qur'an -\\n\\t\\t\\t\\trevealed through Gabriel - abounds in criticism of\\n\\t\\t\\t\\tcertain Jewish beliefs and attitudes and describes them\\n\\t\\t\\t\\tas opposed to the genuine message of Moses. (For details\\n\\t\\t\\t\\tof these Traditions, see Tabari, Zamakhshari, Baghawi,\\n\\t\\t\\t\\tRazi, Baydawi, Ibn Kathir.) As regards my rendering of ma\\n\\t\\t\\t\\tbayna yadayhi in verse {97} as \"whatever there still\\n\\t\\t\\t\\tremains of earlier revelations\", see surah {3}, note [3]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "101",
    "NoteID": "81",
    "Body": "The divine writ referred to here is the Torah. By\\n\\t\\t\\t\\tdisregarding the prophecies relating to the coming of the\\n\\t\\t\\t\\tArabian Prophet, contained in Deuteronomy xviii, 15, 18\\n\\t\\t\\t\\t(see note [33] above), the Jews rejected, as it were, the\\n\\t\\t\\t\\twhole of the revelation granted to Moses (Zamakhshari;\\n\\t\\t\\t\\talso 'Abduh in Manar I, 397)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "102",
    "NoteID": "82",
    "Body": "The expression ash-shayatin, here rendered as \"the evil\\n\\t\\t\\t\\tones\", apparently refers to human beings, as has been\\n\\t\\t\\t\\tpointed out by Tabari, Razi, etc., but may also allude to\\n\\t\\t\\t\\tthe evil, immoral impulses within man's heart (see note\\n\\t\\t\\t\\t[10] on verse {14} of this surah). The above parenthetic\\n\\t\\t\\t\\tsentence constitutes the Qur'anic refutation of the\\n\\t\\t\\t\\tBiblical statement that Solomon had been guilty of\\n\\t\\t\\t\\tidolatrous practices (see I Kings xi, 1-10), as well as\\n\\t\\t\\t\\tof the legend that he was the originator of the magic\\n\\t\\t\\t\\tarts popularly associnted with his name."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "112",
    "NoteID": "82",
    "Body": "The expression ash-shayatin, here rendered as \"the evil\\n\\t\\t\\t\\tones\", apparently refers to human beings, as has been\\n\\t\\t\\t\\tpointed out by Tabari, Razi, etc., but may also allude to\\n\\t\\t\\t\\tthe evil, immoral impulses within man's heart (see note\\n\\t\\t\\t\\t[10] on verse {14} of this surah). The above parenthetic\\n\\t\\t\\t\\tsentence constitutes the Qur'anic refutation of the\\n\\t\\t\\t\\tBiblical statement that Solomon had been guilty of\\n\\t\\t\\t\\tidolatrous practices (see I Kings xi, 1-10), as well as\\n\\t\\t\\t\\tof the legend that he was the originator of the magic\\n\\t\\t\\t\\tarts popularly associnted with his name."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "102",
    "NoteID": "83",
    "Body": "This \"declaration\" circumscribes, metonymically, man's\\n\\t\\t\\t\\tmoral duty to reject every attempt at \"sorcery\" inasmuch\\n\\t\\t\\t\\tas - irrespective of whether it succeeds or fails - it\\n\\t\\t\\t\\taims at subverting the order of nature as instituted by\\n\\t\\t\\t\\tGod. - As regards the designation of Harut and Marut,\\n\\t\\t\\t\\tmost of the readings of the Qur'an give the spelling\\n\\t\\t\\t\\tmalakayn (\"the two angels\"); but it is authentically\\n\\t\\t\\t\\trecorded (see Tabari, Zamakhshari, Baghawi, Razi, etc.)\\n\\t\\t\\t\\tthat the great Companion of the Prophet, Ibn 'Abbas, as\\n\\t\\t\\t\\twell as several learned men of the next generation -\\n\\t\\t\\t\\te.g., Al-Hasan al-Basri, Abu 'l-Aswad and Ad-Dahhak -\\n\\t\\t\\t\\tread it as malikayn (\"the two kings\"). I myself incline\\n\\t\\t\\t\\tto the latter reading; but since the other is more\\n\\t\\t\\t\\tgenerally accepted, I have adopted it here. Some of the\\n\\t\\t\\t\\tcommentators are of the opinion that, whichever of the\\n\\t\\t\\t\\ttwo readings is followed, it ought to be taken in a\\n\\t\\t\\t\\tmetaphorical sense, namely, \"the two kingly persons\", or\\n\\t\\t\\t\\t\"the two angelic persons\": in this they rely on a saying\\n\\t\\t\\t\\tof Ibn 'Abbas to the effect that Harut and Marut were\\n\\t\\t\\t\\t\"two men who practiced sorcery in Babylon\" (Baghawi; see\\n\\t\\t\\t\\talso Manar I, 402). At any rate, it is certain that from\\n\\t\\t\\t\\tvery ancient times Babylon was reputed to be the home of\\n\\t\\t\\t\\tmagic arts, symbolized in the legendary persons - perhaps\\n\\t\\t\\t\\tkings - Harut and Marut; and it is to this legend that\\n\\t\\t\\t\\tthe Qur'an refers with a view to condemning every attempt\\n\\t\\t\\t\\tat magic and sorcery, as well as all preoccupation with\\n\\t\\t\\t\\toccult sciences in general."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "102",
    "NoteID": "84",
    "Body": "The above passage does not raise the question as to\\n\\t\\t\\t\\twhether there is an objective truth in the occult\\n\\t\\t\\t\\tphenomena loosely described as \"magic\", or whether they\\n\\t\\t\\t\\tare based on self-deception. The intent here is no more\\n\\t\\t\\t\\tand no less than to warn man that any attempt at\\n\\t\\t\\t\\tinfluencing the course of events by means which - at\\n\\t\\t\\t\\tleast in the mind of the person responsible for it - have\\n\\t\\t\\t\\ta \"supernatural\" connotation is a spiritual offence, and\\n\\t\\t\\t\\tmust inevitably result in a most serious damage to their\\n\\t\\t\\t\\tauthor's spiritual status."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "104",
    "NoteID": "85",
    "Body": "This admonition, addressed in the first instance to the\\n\\t\\t\\t\\tcontemporaries of the Prophet, has - as so often in the\\n\\t\\t\\t\\tQur'an - a connotation that goes far beyond the\\n\\t\\t\\t\\thistorical circumstances that gave rise to it. The\\n\\t\\t\\t\\tCompanions were called upon to approach the Prophet with\\n\\t\\t\\t\\trespect and to subordinate their personal desires and\\n\\t\\t\\t\\texpectations to the commandments of the Faith revealed\\n\\t\\t\\t\\tthrough him: and this injunction remains valid for every\\n\\t\\t\\t\\tbeliever and for all times."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "105",
    "NoteID": "86",
    "Body": "I.e., revelation - which is the highest good. The\\n\\t\\t\\t\\tallusion here is to the unwillingness of the Jews and the\\n\\t\\t\\t\\tChristians to admit that revelation could have been\\n\\t\\t\\t\\tbestowed on any community but their own."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "106",
    "NoteID": "87",
    "Body": "The principle laid down in this passage - relating to the\\n\\t\\t\\t\\tsupersession of the Biblical dispensation by that of the\\n\\t\\t\\t\\tQur'an - has given rise to an erroneous interpretation by\\n\\t\\t\\t\\tmany Muslim theologians. The word ayah (\"message\")\\n\\t\\t\\t\\toccurring in this context is also used to denote a\\n\\t\\t\\t\\t\"verse\" of the Qur'an (because every one of these verses\\n\\t\\t\\t\\tcontains a message). Taking this restricted meaning of\\n\\t\\t\\t\\tthe term ayah, some scholars conclude from the above\\n\\t\\t\\t\\tpassage that certain verses of the Qur'an have been\\n\\t\\t\\t\\t\"abrogated\" by God's command before the revelation of the\\n\\t\\t\\t\\tQur'an was completed. Apart from the fancifulness of this\\n\\t\\t\\t\\tassertion - which calls to mind the image of a human\\n\\t\\t\\t\\tauthor correcting, on second thought, the proofs of his\\n\\t\\t\\t\\tmanuscript, deleting one passage and replacing it with\\n\\t\\t\\t\\tanother - there does not exist a single reliable\\n\\t\\t\\t\\tTradition to the effect that the Prophet ever declared a\\n\\t\\t\\t\\tverse of the Qur'an to have been \"abrogated\". At the root\\n\\t\\t\\t\\tof the so-called \"doctrine of abrogation\" may lie the\\n\\t\\t\\t\\tinability of some of the early commentators to reconcile\\n\\t\\t\\t\\tone Qur'anic passage with another: a difficulty which was\\n\\t\\t\\t\\tovercome by declaring that one of the verses in question\\n\\t\\t\\t\\thad been \"abrogated\". This arbitrary procedure explains\\n\\t\\t\\t\\talso why there is no unanimity whatsoever among the\\n\\t\\t\\t\\tupholders of the \"doctrine of abrogation\" as to which,\\n\\t\\t\\t\\tand how many, Qur'an-verses have been affected by it;\\n\\t\\t\\t\\tand, furthermore, as to whether this alleged abrogation\\n\\t\\t\\t\\timplies a total elimination of the verse in question from\\n\\t\\t\\t\\tthe context of the Qur'an, or only a cancellation of the\\n\\t\\t\\t\\tspecific ordinance or statement contained in it. In\\n\\t\\t\\t\\tshort, the \"doctrine of abrogation\" has no basis whatever\\n\\t\\t\\t\\tin historical fact, and must be rejected. On the other\\n\\t\\t\\t\\thand, the apparent difficulty in interpreting the above\\n\\t\\t\\t\\tQur'anic passage disappears immediately if the term ayah\\n\\t\\t\\t\\tis understood, correctly, as \"message\", and if we read\\n\\t\\t\\t\\tthis verse in conjunction with the preceding one, which\\n\\t\\t\\t\\tstates that the Jews and the Christians refuse to accept\\n\\t\\t\\t\\tany revelation which might supersede that of the Bible:\\n\\t\\t\\t\\tfor, if read in this way, the abrogation relates to the\\n\\t\\t\\t\\tearlier divine messages and not to any part of the Qur'an\\n\\t\\t\\t\\titself."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "108",
    "NoteID": "88",
    "Body": "Lit., \"whoever takes a denial of the truth in exchange\\n\\t\\t\\t\\tfor belief\" - i.e., whoever refuses to accept the\\n\\t\\t\\t\\tinternal evidence of the truth of the Qur'anic message\\n\\t\\t\\t\\tand demands, instead, an \"objective\" proof of its divine\\n\\t\\t\\t\\torigin (Manar I, 416 f.). - That which was \"asked of\\n\\t\\t\\t\\tMoses aforetime\" was the demand of the children of Israel\\n\\t\\t\\t\\tto \"see God face to face\" (cf.  2:55 ). The expression\\n\\t\\t\\t\\trendered by me as \"the Apostle who has been sent unto\\n\\t\\t\\t\\tyou\" reads, literally, \"your Apostle\", and obviously\\n\\t\\t\\t\\trefers to the Prophet Muhammad, whose message supersedes\\n\\t\\t\\t\\tthe earlier revelations."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "111",
    "NoteID": "89",
    "Body": "This connects with verse {109} above: \"Many among the\\n\\t\\t\\t\\tfollowers of earlier revelation would like to bring you\\n\\t\\t\\t\\tback to denying the truth\", etc."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "111",
    "NoteID": "90",
    "Body": "Lit., \"produce your evidence\" - i.e., \"from your own\\n\\t\\t\\t\\tscriptures\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "112",
    "NoteID": "91",
    "Body": "Lit., \"who surrenders his face unto God\". Since the face\\n\\t\\t\\t\\tof a person is the most expressive part of his body, it\\n\\t\\t\\t\\tis used in classical Arabic to denote one's whole\\n\\t\\t\\t\\tpersonality, or whole being. This expression, repeated in\\n\\t\\t\\t\\tthe Qur'an several times, provides a perfect definition\\n\\t\\t\\t\\tof islam, which - derived from the root-verb aslama, \"he\\n\\t\\t\\t\\tsurrendered himself\" - means \"self-surrender [to God]\":\\n\\t\\t\\t\\tand it is in this sense that the terms islam and muslim\\n\\t\\t\\t\\tare used throughout the Qur'an. (For a full discussion of\\n\\t\\t\\t\\tthis concept, see my note on  68:35 , where the\\n\\t\\t\\t\\texpression muslim occurs for the first time in the\\n\\t\\t\\t\\tchronological order of revelation.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "112",
    "NoteID": "92",
    "Body": "Thus, according to the Qur'an, salvation is not reserved for any particular \"denomination\",\r\\n but is open to everyone who consciously realizes the oneness of God, surrenders himself\r\\n to His will and, by living righteously, gives practical effect to this spiritual attitude. "
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "113",
    "NoteID": "93",
    "Body": "An allusion to all who assert that only the followers of\\n\\t\\t\\t\\ttheir own denomination shall partake of God's grace in\\n\\t\\t\\t\\tthe hereafter."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "113",
    "NoteID": "94",
    "Body": "In other words, \"God will confirm the truth of what was\\n\\t\\t\\t\\ttrue [in their respective beliefs] and show the falseness\\n\\t\\t\\t\\tof what was false [therein]\" (Muhammad 'Abduh in Manar I,\\n\\t\\t\\t\\t428). The Qur'an maintains throughout that there is a\\n\\t\\t\\t\\tsubstantial element of truth in all faiths based on\\n\\t\\t\\t\\tdivine revelation, and that their subsequent divergencies\\n\\t\\t\\t\\tare the result of \"wishful beliefs\" ( 2:111 ) and of a\\n\\t\\t\\t\\tgradual corruption of the original teachings. (See also\\n\\t\\t\\t\\t{22:67-69}.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "114",
    "NoteID": "95",
    "Body": "It is one of the fundamental principles of Islam that\r\\n\\t\\t\\t\\tevery religion which has belief in God as its focal point\r\\n\\t\\t\\t\\tmust be accorded full respect, however much one may\r\\n\\t\\t\\t\\tdisagree with its particular tenets. Thus, the Muslims\r\\n\\t\\t\\t\\tare under an obligation to honour and protect any house\r\\n\\t\\t\\t\\tof worship dedicated to God, whether it be a mosque or a\r\\n\\t\\t\\t\\tchurch or a synagogue (cf. the second paragraph of\r\\n\\t\\t\\t\\t 22:40 ); and any attempt to prevent the followers of\r\\n\\t\\t\\t\\tanother faith from worshipping God according to their own\r\\n\\t\\t\\t\\trites is condemned by the Qur'an as a sacrilege. A\r\\n\\t\\t\\t\\tstriking illustration of this principle is forthcoming\r\\n\\t\\t\\t\\tfrom the Prophet's treatment of the deputation from\r\\n\\t\\t\\t\\tChristian Najran in the year 10 H. They were given free\r\\n\\t\\t\\t\\taccess to the Prophet's mosque, and with his full consent\r\\n\\t\\t\\t\\tcelebrated their religious rites there, although their\r\\n\\t\\t\\t\\tadoration of Jesus as \"the son of God\" and of Mary as\r\\n\\t\\t\\t\\t\"the mother of God\" was fundamentally at variance with\r\\n\\t\\t\\t\\tIslamic beliefs (see Ibn Sa'd I/1, 84 f.)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "116",
    "NoteID": "96",
    "Body": "I.e., far from any imperfection such as would be implied\\n\\t\\t\\t\\tin the necessity (or logical possibility) of having\\n\\t\\t\\t\\t\"progeny\" either in a literal or a metaphorical sense.\\n\\t\\t\\t\\tThe expression subhana - applied exclusively to God -\\n\\t\\t\\t\\tconnotes His utter remoteness from any imperfection and\\n\\t\\t\\t\\tany similarity, however tenuous, with any created being\\n\\t\\t\\t\\tor thing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "118",
    "NoteID": "97",
    "Body": "I.e., people who were not able to perceive the intrinsic\\n\\t\\t\\t\\ttruth of the messages conveyed to them by the prophets,\\n\\t\\t\\t\\tbut rather insisted on a miraculous \"demonstration\" that\\n\\t\\t\\t\\tthose messages really came from God, and thus failed to\\n\\t\\t\\t\\tbenefit from them. - This verse obviously connects with\\n\\t\\t\\t\\tverse {108} above and, thus, refers to the objections of\\n\\t\\t\\t\\tthe Jews and the Christians to the message of the Qur'an.\\n\\t\\t\\t\\t(See also note [29] on  74:52 .)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "121",
    "NoteID": "98",
    "Body": "Or: \"apply themselves to it with true application\" -\\n\\t\\t\\t\\ti.e., try to absorb its meaning and to understand its\\n\\t\\t\\t\\tspiritual design."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "123",
    "NoteID": "99",
    "Body": "See  2:48 . In the above context, this refers,\\n\\t\\t\\t\\tspecifically, to the belief of the Jews that their\\n\\t\\t\\t\\tdescent from Abraham would \"ransom\" them on the Day of\\n\\t\\t\\t\\tJudgment - a belief which is refuted in the next verse."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "124",
    "NoteID": "100",
    "Body": "The classical commentators have indulged in much\\n\\t\\t\\t\\tspeculation as to what these commandments (kalimat, lit.,\\n\\t\\t\\t\\t\"words\") were. Since, however, the Qur'an does not\\n\\t\\t\\t\\tspecify them, it must be presumed that what is meant here\\n\\t\\t\\t\\tis simply Abraham's complete submission to whatever\\n\\t\\t\\t\\tcommandments he received from God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "124",
    "NoteID": "101",
    "Body": "This passage, read in conjunction with the two preceding\\n\\t\\t\\t\\tverses, refutes the contention of the children of Israel\\n\\t\\t\\t\\tthat by virtue of their descent from Abraham, whom God\\n\\t\\t\\t\\tmade \"a leader of men\", they are \"God's chosen people\".\\n\\t\\t\\t\\tThe Qur'an makes it clear that the exalted status of\\n\\t\\t\\t\\tAbraham was not something that would automatically confer\\n\\t\\t\\t\\ta comparable status on his physical descendants, and\\n\\t\\t\\t\\tcertainly not on the sinners among them."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "125",
    "NoteID": "102",
    "Body": "The Temple (al-bayt) - lit., \"the House [of Worship]\" -\\n\\t\\t\\t\\tmentioned here is the Ka'bah in Mecca. In other places\\n\\t\\t\\t\\tthe Qur'an speaks of it as \"the Ancient Temple\" (al-bayt\\n\\t\\t\\t\\tal-'atiq), and frequently also as \"the Inviolable House\\n\\t\\t\\t\\tof Worship\" (al-masjid al-haram). Its prototype is said\\n\\t\\t\\t\\tto have been built by Abraham as the first temple ever\\n\\t\\t\\t\\tdedicated to the One God (see  3:96 ), and which for this\\n\\t\\t\\t\\treason has been instituted as the direction of prayer\\n\\t\\t\\t\\t(qiblah) for all Muslims, and as the goal of the annually\\n\\t\\t\\t\\trecurring pilgrimage (hajj). It is to be noted that even\\n\\t\\t\\t\\tin pre-Islamic times the Ka'bah was associated with the\\n\\t\\t\\t\\tmemory of Abraham, whose personality had always been in\\n\\t\\t\\t\\tthe foreground of Arabian thought. According to very\\n\\t\\t\\t\\tancient Arabian traditions, it was at the site of what\\n\\t\\t\\t\\tlater became Mecca that Abraham, in order to placate\\n\\t\\t\\t\\tSarah, abandoned his Egyptian bondwoman Hagar and their\\n\\t\\t\\t\\tchild Ishmael after he had brought them there from\\n\\t\\t\\t\\tCanaan. This is by no means improbable if one bears in\\n\\t\\t\\t\\tmind that for a camel-riding bedouin (and Abraham was\\n\\t\\t\\t\\tcertainly one) a journey of twenty or even thirty days\\n\\t\\t\\t\\thas never been anything out of the ordinary. At first\\n\\t\\t\\t\\tglance, the Biblical statement (Genesis xii, 14) that it\\n\\t\\t\\t\\twas \"in the wilderness of Beersheba\" (i.e., in the\\n\\t\\t\\t\\tsouthernmost tip of Palestine) that Abraham left Hagar\\n\\t\\t\\t\\tand Ishmael would seem to conflict with the Qur'anic\\n\\t\\t\\t\\taccount. This seeming contradiction, however, disappears\\n\\t\\t\\t\\tas soon as we remember that to the ancient, town-dwelling\\n\\t\\t\\t\\tHebrews the term \"wilderness of Beersheba\" comprised all\\n\\t\\t\\t\\tthe desert regions south of Palestine, including the\\n\\t\\t\\t\\tHijaz. It was at the place where they had been abandoned\\n\\t\\t\\t\\tthat Hagar and Ishmael, after having discovered the\\n\\t\\t\\t\\tspring which is now called the Well of Zamzam, eventually\\n\\t\\t\\t\\tsettled; and it may have been that very spring which in\\n\\t\\t\\t\\ttime induced a wandering group of bedouin families\\n\\t\\t\\t\\tbelonging to the South-Arabian (Qahtani) tribe of Jurhum\\n\\t\\t\\t\\tto settle there. Ishmael later married a girl of this\\n\\t\\t\\t\\ttribe, and so became the progenitor of the musta'ribah\\n\\t\\t\\t\\t(\"Arabianized\") tribes - thus called on account of their\\n\\t\\t\\t\\tdescent from a Hebrew father and a Qahtani mother. As for\\n\\t\\t\\t\\tAbraham, he is said to have often visited Hagar and\\n\\t\\t\\t\\tIshmael; and it was on the occasion of one of these\\n\\t\\t\\t\\tperiodic visits that he, aided by Ishmael, erected the\\n\\t\\t\\t\\toriginal structure of the Ka'bah. (For more detailed\\n\\t\\t\\t\\taccounts of the Abrahamic tradition, see Bukhari's Sahih,\\n\\t\\t\\t\\tKitab al-'Ilm, Tabari's Ta'rikh al-Umam, Ibn Sa'd, Ibn\\n\\t\\t\\t\\tHisham, Mas'udi's Muruj adh-Dhahab, Yaqut's Mu'jam\\n\\t\\t\\t\\tal-Buldan, and other early Muslim historians.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "125",
    "NoteID": "103",
    "Body": "This may refer to the immediate vicinity of the Ka'bah\\n\\t\\t\\t\\tor, more probably (Manar I, 461 f.), to the sacred\\n\\t\\t\\t\\tprecincts (haram) surrounding it. The word amn (lit.,\\n\\t\\t\\t\\t\"safety\") denotes in this context a sanctuary for all\\n\\t\\t\\t\\tliving beings."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "125",
    "NoteID": "104",
    "Body": "The seven-fold circumambulation (tawaf) of the Ka'bah is\\n\\t\\t\\t\\tone of the rites of the pilgrimage, symbolically\\n\\t\\t\\t\\tindicating that all human actions and endeavours ought to\\n\\t\\t\\t\\thave the idea of God and His oneness for their centre."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "128",
    "NoteID": "105",
    "Body": "The expression \"our offspring\" indicates Abraham's progeny through his first-born son,\r\\n Ishmael, and is an indirect reference to the Prophet Muhammad, who descended from the latter. "
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "129",
    "NoteID": "106",
    "Body": "Lit., \"within them\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "133",
    "NoteID": "107",
    "Body": "I.e. \"In the religious traditions to which you adhere\".\\n\\t\\t\\t\\tIt is to be noted that the conjunction am which stands at\\n\\t\\t\\t\\tthe beginning of this sentence is not always used in the\\n\\t\\t\\t\\tinterrogative sense (\"is it that...?\"): sometimes - and\\n\\t\\t\\t\\tespecially when it is syntactically unconnected with the\\n\\t\\t\\t\\tpreceding sentence, as in this case - it is an equivalent\\n\\t\\t\\t\\tof bal (\"rather\", or \"nay, but\"), and has no\\n\\t\\t\\t\\tinterrogative connotation."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "133",
    "NoteID": "108",
    "Body": "In classical Arabic, as in ancient Hebrew usage, the term\\n\\t\\t\\t\\tab (\"father\") was applied not only to the direct male\\n\\t\\t\\t\\tparent but also to grandfathers and even more distant\\n\\t\\t\\t\\tancestors, as well as to paternal uncles: which explains\\n\\t\\t\\t\\twhy Ishmael, who was Jacob's uncle, is mentioned in this\\n\\t\\t\\t\\tcontext. Since he was the first-born of Abrahams sons,\\n\\t\\t\\t\\this name precedes that of Isaac."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "134",
    "NoteID": "109",
    "Body": "Lit., \"you will not be asked about what they did\". This\\n\\t\\t\\t\\tverse, as well as verse {141} below, stresses the\\n\\t\\t\\t\\tfundamental Islamic tenet of individual responsibility,\\n\\t\\t\\t\\tand denies the Jewish idea of their being \"the chosen\\n\\t\\t\\t\\tpeople\" by virtue of their descent, as well as - by\\n\\t\\t\\t\\timplication - the Christian doctrine of an \"original sin\"\\n\\t\\t\\t\\twith which all human beings are supposedly burdened\\n\\t\\t\\t\\tbecause of Adam's fall from grace."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "135",
    "NoteID": "110",
    "Body": "The expression hanif is derived from the verb hanafa,\\n\\t\\t\\t\\twhich literally means \"he inclined [towards a right state\\n\\t\\t\\t\\tor tendency]\" (cf. Lane II, 658). Already in pre-Islamic\\n\\t\\t\\t\\ttimes, this term had a definitely monotheistic\\n\\t\\t\\t\\tconnotation, and was used to describe a man who turned\\n\\t\\t\\t\\taway from sin and worldliness and from all dubious\\n\\t\\t\\t\\tbeliefs, especially idol-worship; and tahannuf denoted\\n\\t\\t\\t\\tthe ardent devotions, mainly consisting of long vigils\\n\\t\\t\\t\\tand prayers, of the unitarian God-seekers of pre-Islamic\\n\\t\\t\\t\\ttimes. Many instances of this use of the terms hanif and\\n\\t\\t\\t\\ttahannuf occur in the verses of pre-Islamic poets, e.g.,\\n\\t\\t\\t\\tUmayyah ibn Abi's-Salt and Jiran al-'Awd (cf. Lisan\\n\\t\\t\\t\\tal-'Arab, art. hanafa)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "136",
    "NoteID": "111",
    "Body": "Lit., \"the grandchildren\" (al-asbat, sing. sibt) - a term\\n\\t\\t\\t\\tused in the Qur'an to describe, in the first instance,\\n\\t\\t\\t\\tAbraham's, Isaac's and Jacob's immediate descendants,\\n\\t\\t\\t\\tand, consequently, the twelve tribes which evolved from\\n\\t\\t\\t\\tthis ancestry."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "136",
    "NoteID": "112",
    "Body": "I.e., \"we regard them all as true prophets of God\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "139",
    "NoteID": "113",
    "Body": "I.e., about God's will regarding the succession of\\n\\t\\t\\t\\tprophethood and man's ultimate salvation. The Jews\\n\\t\\t\\t\\tbelieve that prophethood was a privilege granted to the\\n\\t\\t\\t\\tchildren of Israel alone, while the Christians maintain\\n\\t\\t\\t\\tthat Jesus - who, too, descended from the children of\\n\\t\\t\\t\\tIsrael - was God's final manifestation on earth; and each\\n\\t\\t\\t\\tof these two denominations claims that salvation is\\n\\t\\t\\t\\treserved to its followers alone (see  2:111  and {135}).\\n\\t\\t\\t\\tThe Qur'an refutes these ideas by stressing, in the next\\n\\t\\t\\t\\tsentence, that God is the Lord of all mankind, and that\\n\\t\\t\\t\\tevery individual will be judged on the basis of his own\\n\\t\\t\\t\\tbeliefs and his own behaviour alone."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "140",
    "NoteID": "114",
    "Body": "Regarding the term asbat (rendered here as well as in\\n\\t\\t\\t\\tverse {136} as \"descendants\"), see note [111] above. In\\n\\t\\t\\t\\tthe above words the Qur'an alludes to the fact that the\\n\\t\\t\\t\\tconcept of \"Jewry\" came into being many centuries after\\n\\t\\t\\t\\tthe time of the Patriarchs, and even long after the time\\n\\t\\t\\t\\tof Moses, while the concepts of \"Christianity\" and\\n\\t\\t\\t\\t\"Christians\" were unknown in Jesus' time and represent\\n\\t\\t\\t\\tlater developments."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "140",
    "NoteID": "115",
    "Body": "A reference to the Biblical prediction of the coming of\\n\\t\\t\\t\\tthe Prophet Muhammad (see note [33] on verse {42} of this\\n\\t\\t\\t\\tsurah), which effectively contradicts the\\n\\t\\t\\t\\tJudaeo-Christian claim that all true prophets, after the\\n\\t\\t\\t\\tPatriarchs, belonged to the children of Israel."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "142",
    "NoteID": "116",
    "Body": "Before his call to prophethood, and during the early\\n\\t\\t\\t\\tMeccan period of his ministry, the Prophet - and his\\n\\t\\t\\t\\tcommunity with him - used to turn in prayer towards the\\n\\t\\t\\t\\tKa'bah. This was not prompted by any specific revelation,\\n\\t\\t\\t\\tbut was obviously due to the fact that the Ka'bah -\\n\\t\\t\\t\\talthough it had in the meantime been filled with various\\n\\t\\t\\t\\tidols to which the pre-Islamic Arabs paid homage - was\\n\\t\\t\\t\\talways regarded as the first temple ever dedicated to the\\n\\t\\t\\t\\tOne God (cf.  3:96 ). Since he was aware of the sanctity\\n\\t\\t\\t\\tof Jerusalem - the other holy centre of the unitarian\\n\\t\\t\\t\\tfaith - the Prophet prayed, as a rule, before the\\n\\t\\t\\t\\tsouthern wall of the Ka'bah, towards the north, so as to\\n\\t\\t\\t\\tface both the Ka'bah and Jerusalem. After the exodus to\\n\\t\\t\\t\\tMedina he continued to pray northwards, with only\\n\\t\\t\\t\\tJerusalem as his qiblah (direction of prayer). About\\n\\t\\t\\t\\tsixteen months after his arrival at Medina, however, he\\n\\t\\t\\t\\treceived a revelation (verses {142-150} of this surah)\\n\\t\\t\\t\\twhich definitively established the Ka'bah as the qiblah\\n\\t\\t\\t\\tof the followers of the Qur'an. This \"abandonment\" of\\n\\t\\t\\t\\tJerusalem obviously displeased the Jews of Medina, who\\n\\t\\t\\t\\tmust have felt gratified when they saw the Muslims\\n\\t\\t\\t\\tpraying towards their holy city; and it is to them that\\n\\t\\t\\t\\tthe opening sentence of this passage refers. If one\\n\\t\\t\\t\\tconsiders the matter from the historical point of view,\\n\\t\\t\\t\\tthere had never been any change in the divine\\n\\t\\t\\t\\tcommandments relating to the qiblah: there had simply\\n\\t\\t\\t\\tbeen no ordinance whatever in this respect before verses\\n\\t\\t\\t\\t{142-150} were revealed. Their logical connection with\\n\\t\\t\\t\\tthe preceding passages, which deal, in the main, with\\n\\t\\t\\t\\tAbraham and his creed, lies in the fact that it was\\n\\t\\t\\t\\tAbraham who erected the earliest structure of the temple\\n\\t\\t\\t\\twhich later came to be known as the Ka'bah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "142",
    "NoteID": "117",
    "Body": "Or: \"He guides onto a straight way him that wills [to be\\n\\t\\t\\t\\tguided]\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "118",
    "Body": "Lit., \"middlemost community\" - i.e., a community that\\n\\t\\t\\t\\tkeeps an equitable balance between extremes and is\\n\\t\\t\\t\\trealistic in its appreciation of man's nature and\\n\\t\\t\\t\\tpossibilities, rejecting both licentiousness and\\n\\t\\t\\t\\texaggerated asceticism. In tune with its oft-repeated\\n\\t\\t\\t\\tcall to moderation in every aspect of life, the Qur'an\\n\\t\\t\\t\\texhorts the believers not to place too great an emphasis\\n\\t\\t\\t\\ton the physical and material aspects of their lives, but\\n\\t\\t\\t\\tpostulates, at the same time, that man's urges and\\n\\t\\t\\t\\tdesires relating to this \"life of the flesh\" are\\n\\t\\t\\t\\tGod-willed and, therefore, legitimate. On further\\n\\t\\t\\t\\tanalysis, the expression \"a community of the middle way\"\\n\\t\\t\\t\\tmight be said to summarize, as it were, the Islamic\\n\\t\\t\\t\\tattitude towards the problem of man's existence as such:\\n\\t\\t\\t\\ta denial of the view that there is an inherent conflict\\n\\t\\t\\t\\tbetween the spirit and the flesh, and a bold affirmation\\n\\t\\t\\t\\tof the natural, God-willed unity in this twofold aspect\\n\\t\\t\\t\\tof human life. This balanced attitude, peculiar to Islam,\\n\\t\\t\\t\\tflows directly from the concept of God's oneness and,\\n\\t\\t\\t\\thence, of the unity of purpose underlying all His\\n\\t\\t\\t\\tcreation: and thus, the mention of the \"community of the\\n\\t\\t\\t\\tmiddle way\" at this place is a fitting introduction to\\n\\t\\t\\t\\tthe theme of the Ka'bah, a symbol of God's oneness."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "119",
    "Body": "I.e., \"that your way of life be an example to all\\n\\t\\t\\t\\tmankind, just as the Apostle is an example to you\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "120",
    "Body": "I.e., \"whom He has given understanding\" (Razi). The \"hard\\n\\t\\t\\t\\ttest\" (kabirah) consisted in the fact that ever since\\n\\t\\t\\t\\ttheir exodus to Medina the Muslims had become accustomed\\n\\t\\t\\t\\tto praying towards Jerusalem - associated in their minds\\n\\t\\t\\t\\twith the teachings of most of the earlier prophets\\n\\t\\t\\t\\tmentioned in the Qur'an - and were now called upon to\\n\\t\\t\\t\\tturn in their prayers towards the Ka'bah, which at that\\n\\t\\t\\t\\ttime (in the second year after the hijrah) was still used\\n\\t\\t\\t\\tby the pagan Quraysh as a shrine dedicated to the worship\\n\\t\\t\\t\\tof their numerous idols. As against this, the Qur'an\\n\\t\\t\\t\\tstates that true believers would not find it difficult to\\n\\t\\t\\t\\tadopt the Ka'bah once again as their qiblah: they would\\n\\t\\t\\t\\tinstinctively realize the divine wisdom underlying this\\n\\t\\t\\t\\tcommandment which established Abraham's Temple as a\\n\\t\\t\\t\\tsymbol of God's oneness and a focal point of the\\n\\t\\t\\t\\tideological unity of Islam. (See also note [116] above.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "145",
    "NoteID": "121",
    "Body": "Lit., \"every sign (ayah)\", i.e., of its being a revealed\\n\\t\\t\\t\\tcommandment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "147",
    "NoteID": "122",
    "Body": "This refers, in the first instance, to the fact that the\r\\n\\t\\t\\t\\tKa'bah was Abraham's qiblah, as well as to the Biblical\r\\n\\t\\t\\t\\tprophecies relating to Ishmael as the progenitor of a\r\\n\\t\\t\\t\\t\"great nation\" (Genesis xxi, 13 and 18) from whom a\r\\n\\t\\t\\t\\tprophet \"like unto Moses\" would one day arise: for it was\r\\n\\t\\t\\t\\tthrough Ishmael's descendant, the Arabian Prophet, that\r\\n\\t\\t\\t\\tthe commandment relating to the qiblah was revealed.\r\\n\\t\\t\\t\\t(Regarding the still more explicit predictions of the\r\\n\\t\\t\\t\\tfuture advent of the Prophet Muhammad, forthcoming from\r\\n\\t\\t\\t\\tthe canonical Gospels, see  61:6  and the corresponding\r\\n\\t\\t\\t\\tnote.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "148",
    "NoteID": "123",
    "Body": "Lit., \"everyone has a direction...\", etc. Almost all of\\n\\t\\t\\t\\tthe classical commentators, from the Companions of the\\n\\t\\t\\t\\tProphet downwards, interpret this as a reference to the\\n\\t\\t\\t\\tvarious religious communities and their different modes\\n\\t\\t\\t\\tof \"turning towards God\" in worship. Ibn Kathir, in his\\n\\t\\t\\t\\tcommentary on this verse, stresses its inner resemblance\\n\\t\\t\\t\\tto the phrase occurring in  5:48 : \"unto every one of you\\n\\t\\t\\t\\thave We appointed a [different] law and way of life\". The\\n\\t\\t\\t\\tstatement that \"every community faces a direction of its\\n\\t\\t\\t\\town\" in its endeavour to express its submission to God\\n\\t\\t\\t\\timplies, firstly, that at various times and in various\\n\\t\\t\\t\\tcircumstances man's desire to approach God in prayer has\\n\\t\\t\\t\\ttaken different forms (e.g., Abraham's choice of the\\n\\t\\t\\t\\tKa'bah as his qiblah, the Jewish concentration on\\n\\t\\t\\t\\tJerusalem, the eastward orientation of the early\\n\\t\\t\\t\\tChristian churches, and the Qur'anic commandment relating\\n\\t\\t\\t\\tto the Ka'bah); and, secondly, that the direction of\\n\\t\\t\\t\\tprayer - however important its symbolic significance may\\n\\t\\t\\t\\tbe - does not represent the essence of faith as such:\\n\\t\\t\\t\\tfor, as the Qur'an says, \"true piety does not consist in\\n\\t\\t\\t\\tturning your faces towards the east or the west\"\\n\\t\\t\\t\\t( 2:177 ), and, \"God's is the east and the west\" ( 2:115 \\n\\t\\t\\t\\tand {142}). Consequently, the revelation which\\n\\t\\t\\t\\testablished the Ka'bah as the qiblah of the Muslims\\n\\t\\t\\t\\tshould not be a matter of contention for people of other\\n\\t\\t\\t\\tfaiths, nor a cause of their disbelief in the truth of\\n\\t\\t\\t\\tthe Qur'anic revelation as such (Manar II, 21 f.)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "150",
    "NoteID": "124",
    "Body": "Lit., \"except such among them as are bent upon\\n\\t\\t\\t\\twrongdoing\" (regarding the intent implied in the use of\\n\\t\\t\\t\\tthe past tense in expressions like alladhina zalamu or\\n\\t\\t\\t\\talladhina kafaru, see note [6] on verse {6} of this\\n\\t\\t\\t\\tsurah). The Qur'an stresses repeatedly that the Muslims\\n\\t\\t\\t\\tare true followers of Abraham. This claim, however, might\\n\\t\\t\\t\\thave been open to objection so long as they prayed in a\\n\\t\\t\\t\\tdirection other than Abraham's qiblah, the Ka'bah. The\\n\\t\\t\\t\\testablishment of the latter as the qiblah of the\\n\\t\\t\\t\\tfollowers of the Qur'an would invalidate any such\\n\\t\\t\\t\\targument and would leave it only to \"those who are bent\\n\\t\\t\\t\\tupon wrongdoing\" (in this case, distorting the truth) to\\n\\t\\t\\t\\tchallenge the message of the Qur'an on these grounds."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "155",
    "NoteID": "125",
    "Body": "Lit., \"with something\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "158",
    "NoteID": "126",
    "Body": "Lit., \"God's symbols\". The space between the two low\\n\\t\\t\\t\\toutcrops of rock called As-Safa and Al-Marwah, situated\\n\\t\\t\\t\\tin Mecca in the immediate vicinity of the Ka'bah, is said\\n\\t\\t\\t\\tto have been the scene of Hagar's suffering when Abraham,\\n\\t\\t\\t\\tfollowing God's command, abandoned her and their infant\\n\\t\\t\\t\\tson Ishmael in the desert (see note [102] above).\\n\\t\\t\\t\\tDistraught with thirst and fearing for the life of her\\n\\t\\t\\t\\tchild, Hagar ran to and fro between the two rocks and\\n\\t\\t\\t\\tfervently prayed to God for succour: and, finally, her\\n\\t\\t\\t\\treliance on God and her patience were rewarded by the\\n\\t\\t\\t\\tdiscovery of a spring - existing to this day and known as\\n\\t\\t\\t\\tthe Well of Zamzam - which saved the two from death\\n\\t\\t\\t\\tthrough thirst. It was in remembrance of Hagar's extreme\\n\\t\\t\\t\\ttrial, and of her trust in God, that As-Safa and\\n\\t\\t\\t\\tAl-Marwah had come to be regarded, even in pre-Islamic\\n\\t\\t\\t\\ttimes, as symbols of faith and patience in adversity: and\\n\\t\\t\\t\\tthis explains their mention in the context of the\\n\\t\\t\\t\\tpassages which deal with the virtues of patience and\\n\\t\\t\\t\\ttrust in God (Razi)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "158",
    "NoteID": "127",
    "Body": "It is in commemoration of Hagar's running in distress\\n\\t\\t\\t\\tbetween As-Safa and Al-Marwah that the Mecca pilgrims are\\n\\t\\t\\t\\texpected to walk, at a fast pace, seven times between\\n\\t\\t\\t\\tthese two hillocks. Because of the fact that in\\n\\t\\t\\t\\tpre-Islamic times certain idols had been standing there,\\n\\t\\t\\t\\tsome of the early Muslims were reluctant to perform a\\n\\t\\t\\t\\trite which seemed to them to be associated with recent\\n\\t\\t\\t\\tidolatry (Razi, on the authority of Ibn 'Abbas). The\\n\\t\\t\\t\\tabove verse served to reassure them on this score by\\n\\t\\t\\t\\tpointing out that this symbolic act of remembrance was\\n\\t\\t\\t\\tmuch older than the idolatry practiced by the pagan\\n\\t\\t\\t\\tQuraysh."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "158",
    "NoteID": "128",
    "Body": "From the phrase \"if one does more good than he is bound\\n\\t\\t\\t\\tto do\", read in conjunction with \"no wrong does he\\n\\t\\t\\t\\twho...\" (or, more literally, \"there shall be no blame\\n\\t\\t\\t\\tupon him who...\"), some of the great Islamic scholars -\\n\\t\\t\\t\\te.g., Imam Abu Hanifah - conclude that the walking to and\\n\\t\\t\\t\\tfro between As-Safa and Al-Marwah is not one of the\\n\\t\\t\\t\\tobligatory rites of pilgrimage but rather a\\n\\t\\t\\t\\tsupererogatory act of piety (see Zamakhshari and Razi).\\n\\t\\t\\t\\tMost scholars, however, hold the view that it is an\\n\\t\\t\\t\\tintegral part of the pilgrimage."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "159",
    "NoteID": "129",
    "Body": "Lit., \"whom all who reject will reject\" - i.e., all\\n\\t\\t\\t\\trighteous persons who are able to judge moral issues.\\n\\t\\t\\t\\tGod's rejection (la'nah) denotes \"exclusion from His\\n\\t\\t\\t\\tgrace\" (Manar II, 50). In classical Arabic usage, the\\n\\t\\t\\t\\tprimary meaning of la'nah is equivalent to ib'ad\\n\\t\\t\\t\\t(\"estrangement\" or \"banishment\"); in the terminology of\\n\\t\\t\\t\\tthe Qur'an, it signifies \"rejection from all that is\\n\\t\\t\\t\\tgood\" (Lisan al-'Arab). According to Ibn 'Abbas and\\n\\t\\t\\t\\tseveral outstanding scholars of the next generation, the\\n\\t\\t\\t\\tdivine writ mentioned here is the Bible; thus, the above\\n\\t\\t\\t\\tverse refers to the Jews and the Christians."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "164",
    "NoteID": "130",
    "Body": "This passage is one of the many in which the Qur'an\\n\\t\\t\\t\\tappeals to \"those who use their reason\" to observe the\\n\\t\\t\\t\\tdaily wonders of nature, including the evidence of man's\\n\\t\\t\\t\\town ingenuity (\"the ships that speed through the sea\"),\\n\\t\\t\\t\\tas so many indications of a conscious, creative Power\\n\\t\\t\\t\\tpervading the universe."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "165",
    "NoteID": "131",
    "Body": "Lit., \"there are among the people such as take [to\\n\\t\\t\\t\\tworshipping] compeers beside God\". Regarding the term\\n\\t\\t\\t\\tandad, see note [13] on verse {22} of this surah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "165",
    "NoteID": "132",
    "Body": "Lit., \"when they see the suffering\" (or \"chastisement\")."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "166",
    "NoteID": "133",
    "Body": "Lit., \"followed\" - i.e., as saints or alleged \"divine\\n\\t\\t\\t\\tpersonalities\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "166",
    "NoteID": "134",
    "Body": "Asbab (sing. sabab) denotes, in its primary meaning,\\n\\t\\t\\t\\t\"ties\" or \"attachments\", and in a tropical sense, \"means\\n\\t\\t\\t\\t[towards any end]\" (cf. Lisan al-'Arab, and Lane IV,\\n\\t\\t\\t\\t1285). In the above context, asbab obviously refers to\\n\\t\\t\\t\\tmeans of salvation, and may thus be rendered as \"hopes\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "167",
    "NoteID": "135",
    "Body": "Lit., \"Would that there were a return for us\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "167",
    "NoteID": "136",
    "Body": "Sc., back to the life of this world, with a second chance\\n\\t\\t\\t\\tbefore them (Manar II, 81)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "169",
    "NoteID": "137",
    "Body": "This refers to an arbitrary attribution to God of\\n\\t\\t\\t\\tcommandments or prohibitions in excess of what has been\\n\\t\\t\\t\\tclearly ordained by Him (Zamakhshari). Some of the\\n\\t\\t\\t\\tcommentators (e.g., Muhammad 'Abduh in Manar II, 89 f.)\\n\\t\\t\\t\\tinclude within this expression the innumerable supposedly\\n\\t\\t\\t\\t\"legal\" injunctions which, without being clearly\\n\\t\\t\\t\\twarranted by the wording of the Qur'an or an authentic\\n\\t\\t\\t\\tTradition, have been obtained by individual Muslim\\n\\t\\t\\t\\tscholars through subjective methods of deduction and then\\n\\t\\t\\t\\tput forward as \"God's ordinances\". The connection between\\n\\t\\t\\t\\tthis passage and the preceding ones is obvious. In verses\\n\\t\\t\\t\\t{165-167} the Qur'an speaks of those \"who choose to\\n\\t\\t\\t\\tbelieve in beings that supposedly rival God\": and this\\n\\t\\t\\t\\timplies also a false attribution, to those beings, of a\\n\\t\\t\\t\\tright to issue quasi-religious ordinances of their own,\\n\\t\\t\\t\\tas well as an attribution of religious validity to\\n\\t\\t\\t\\tcustoms sanctioned by nothing but ancient usage (see next\\n\\t\\t\\t\\tverse)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "171",
    "NoteID": "138",
    "Body": "This is a very free rendering of the elliptic sentence\\n\\t\\t\\t\\twhich, literally, reads thus: \"The parable of those who\\n\\t\\t\\t\\tare bent on denying the truth is as that of him who cries\\n\\t\\t\\t\\tunto what hears nothing but a cry and a call.\" The verb\\n\\t\\t\\t\\tna'qa is mostly used to describe the inarticulate cry\\n\\t\\t\\t\\twith which the shepherd drives his flock."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "173",
    "NoteID": "139",
    "Body": "I.e., all that has been dedicated or offered in sacrifice\\n\\t\\t\\t\\tto an idol or a saint or a person considered to be\\n\\t\\t\\t\\t\"divine\". For a more comprehensive enumeration of the\\n\\t\\t\\t\\tforbidden kinds of flesh, see  5:3 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "174",
    "NoteID": "140",
    "Body": "This term is used here in its generic sense, comprising\r\\n\\t\\t\\t\\tboth the Qur'an and the earlier revelations."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "176",
    "NoteID": "141",
    "Body": "Lit., \"has been bestowing\". Since the form nazzala\\n\\t\\t\\t\\timplies gradualness and continuity in the process of\\n\\t\\t\\t\\trevelation, it can best be rendered by the use of the\\n\\t\\t\\t\\tpresent tense."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "176",
    "NoteID": "142",
    "Body": "Lit., \"who hold discordant views about the divine writ\" -\\n\\t\\t\\t\\ti.e., either suppressing or rejecting parts of it, or\\n\\t\\t\\t\\tdenying its divine origin altogether (Razi)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "143",
    "Body": "Thus, the Qur'an stresses the principle that mere\\n\\t\\t\\t\\tcompliance with outward forms does not fulfil the\\n\\t\\t\\t\\trequirements of piety. The reference to the turning of\\n\\t\\t\\t\\tone's face in prayer in this or that direction flows from\\n\\t\\t\\t\\tthe passages which dealt, a short while ago, with the\\n\\t\\t\\t\\tquestion of the qiblah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "144",
    "Body": "In this context, the term \"revelation\" (al-kitab)\\n\\t\\t\\t\\tcarries, according to most of the commentators, a generic\\n\\t\\t\\t\\tsignificance: it refers to the fact of divine revelation\\n\\t\\t\\t\\tas such. As regards belief in angels, it is postulated\\n\\t\\t\\t\\there because it is through these spiritual beings or\\n\\t\\t\\t\\tforces (belonging to the realm of al-ghayb, i.e., the\\n\\t\\t\\t\\treality which is beyond the reach of human perception)\\n\\t\\t\\t\\tthat God reveals His will to the prophets and, thus, to\\n\\t\\t\\t\\tmankind at large."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "145",
    "Body": "The expression ibn as-sabil (lit., \"son of the road\")\\n\\t\\t\\t\\tdenotes any person who is far from his home, and\\n\\t\\t\\t\\tespecially one who, because of this circumstance, does\\n\\t\\t\\t\\tnot have sufficient means of livelihood at his disposal\\n\\t\\t\\t\\t(cf. Lane IV, 1302). In its wider sense it describes a\\n\\t\\t\\t\\tperson who, for any reason whatsoever, is unable to\\n\\t\\t\\t\\treturn home either temporarily or permanently: for\\n\\t\\t\\t\\tinstance, a political exile or refugee."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "146",
    "Body": "Ar-raqabah (of which ar-riqab is the plural) denotes,\\n\\t\\t\\t\\tliterally, \"the neck\", and signifies also the whole of a\\n\\t\\t\\t\\thuman person. Metonymically, the expression fi 'r-riqab\\n\\t\\t\\t\\tdenotes \"in the cause of freeing human beings from\\n\\t\\t\\t\\tbondage\", and applies to both the ransoming of captives\\n\\t\\t\\t\\tand the freeing of slaves. By including this kind of\\n\\t\\t\\t\\texpenditure within the essential acts of piety, the\\n\\t\\t\\t\\tQur'an implies that the freeing of people from bondage -\\n\\t\\t\\t\\tand, thus, the abolition of slavery - is one of the\\n\\t\\t\\t\\tsocial objectives of Islam. At the time of the revelation\\n\\t\\t\\t\\tof the Qur'an, slavery was an established institution\\n\\t\\t\\t\\tthroughout the world, and its sudden abolition would have\\n\\t\\t\\t\\tbeen economically impossible. In order to obviate this\\n\\t\\t\\t\\tdifficulty, and at the same time to bring about an\\n\\t\\t\\t\\teventual abolition of all slavery, the Qur'an ordains in\\n\\t\\t\\t\\t 8:67  that henceforth only captives taken in a just war\\n\\t\\t\\t\\t(jihad) may be kept as slaves. But even with regard to\\n\\t\\t\\t\\tpersons enslaved in this or - before the revelation of\\n\\t\\t\\t\\t 8:67  - in any other way, the Qur'an stresses the great\\n\\t\\t\\t\\tmerit inherent in the freeing of slaves, and stipulates\\n\\t\\t\\t\\tit as a means of atonement for various transgressions\\n\\t\\t\\t\\t(see, e.g.,  4:92 ,  5:89 ,  58:3 ). In addition, the\\n\\t\\t\\t\\tProphet emphatically stated on many occasions that, in\\n\\t\\t\\t\\tthe sight of God, the unconditional freeing of a human\\n\\t\\t\\t\\tbeing from bondage is among the most praiseworthy acts\\n\\t\\t\\t\\twhich a Muslim could perform. (For a critical discussion\\n\\t\\t\\t\\tand analysis of all the authentic Traditions bearing on\\n\\t\\t\\t\\tthis problem, see Nayl al-Awtar VI, 199 ff.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "147",
    "Body": "After having pointed out that true piety does not consist\r\\n\\t\\t\\t\\tin mere adherence to outward forms and rites, the Qur'an\r\\n\\t\\t\\t\\topens, as it were, a new chapter relating to the problem\r\\n\\t\\t\\t\\tof man's behaviour. Just as piety cannot become effective\r\\n\\t\\t\\t\\twithout righteous action, individual righteousness cannot\r\\n\\t\\t\\t\\tbecome really effective in the social sense unless there\r\\n\\t\\t\\t\\tis agreement within the community as to the social rights\r\\n\\t\\t\\t\\tand obligations of its members: in other words, as to the\r\\n\\t\\t\\t\\tpractical laws which should govern the behaviour of the\r\\n\\t\\t\\t\\tindividual within the society and the society's attitude\r\\n\\t\\t\\t\\ttowards the individual and his actions. This is the\r\\n\\t\\t\\t\\tinnermost reason why legislation plays so great a role\r\\n\\t\\t\\t\\twithin the ideology of Islam, and why the Qur'an\r\\n\\t\\t\\t\\tconsistently intertwines its moral and spiritual\r\\n\\t\\t\\t\\texhortation with ordinances relating to practical aspects\r\\n\\t\\t\\t\\tof social life. Now one of the main problems facing any\r\\n\\t\\t\\t\\tsociety is the safeguarding of the lives and the\r\\n\\t\\t\\t\\tindividual security of its members: and so it is\r\\n\\t\\t\\t\\tunderstandable that laws relating to homicide and its\r\\n\\t\\t\\t\\tpunishment are dealt with prominently at this place. (It\r\\n\\t\\t\\t\\tshould be borne in mind that \"The Cow\" was the first\r\\n\\t\\t\\t\\tsurah revealed in Medina, that is, at the time when the\r\\n\\t\\t\\t\\tMuslim community had just become established as an\r\\n\\t\\t\\t\\tindependent social entity.) As for the term qisas\r\\n\\t\\t\\t\\toccurring at the beginning of the above passage, it must\r\\n\\t\\t\\t\\tbe pointed out that - according to all the classical\r\\n\\t\\t\\t\\tcommentators - it is almost synonymous with musawah,\r\\n\\t\\t\\t\\ti.e., \"making a thing equal [to another thing]\": in this\r\\n\\t\\t\\t\\tinstance, making the punishment equal (or appropriate) to\r\\n\\t\\t\\t\\tthe crime - a meaning which is best rendered as \"just\r\\n\\t\\t\\t\\tretribution\" and not (as has been often, and erroneously,\r\\n\\t\\t\\t\\tdone) as \"retaliation\". Seeing that the Qur'an speaks\r\\n\\t\\t\\t\\there of \"cases of killing\" (fi 'l-qatla, lit., \"in the\r\\n\\t\\t\\t\\tmatter of the killed\") in general, and taking into\r\\n\\t\\t\\t\\taccount that this expression covers all possible cases of\r\\n\\t\\t\\t\\thomicide - premeditated murder, murder under extreme\r\\n\\t\\t\\t\\tprovocation, culpable homicide, accidental manslaughter,\r\\n\\t\\t\\t\\tand so forth - it is obvious that the taking of a life\r\\n\\t\\t\\t\\tfor a life (implied in the term \"retaliation\") would not\r\\n\\t\\t\\t\\tin every case correspond to the demands of equity. (This\r\\n\\t\\t\\t\\thas been made clear, for instance, in  4:92 , where legal\r\\n\\t\\t\\t\\trestitution for unintentional homicide is dealt with.)\r\\n\\t\\t\\t\\tRead in conjunction with the term \"just retribution\"\r\\n\\t\\t\\t\\twhich introduces this passage, it is clear that the\r\\n\\t\\t\\t\\tstipulation \"the free for the free, the slave for the\r\\n\\t\\t\\t\\tslave, the woman for the woman\" cannot - and has not been\r\\n\\t\\t\\t\\tintended to - be taken in its literal, restrictive sense:\r\\n\\t\\t\\t\\tfor this would preclude its application to many cases of\r\\n\\t\\t\\t\\thomicide, e.g., the killing of a free man by a slave, or\r\\n\\t\\t\\t\\tof a woman by a man, or vice-versa. Thus, the above\r\\n\\t\\t\\t\\tstipulation must be regarded as an example of the\r\\n\\t\\t\\t\\telliptical mode of expression (ijaz) so frequently\r\\n\\t\\t\\t\\temployed in the Qur'an, and can have but one meaning,\r\\n\\t\\t\\t\\tnamely: \"if a free man has committed the crime, the free\r\\n\\t\\t\\t\\tman must be punished; if a slave has committed the\r\\n\\t\\t\\t\\tcrime...\", etc. - in other words, whatever the status of\r\\n\\t\\t\\t\\tthe guilty person, he or she (and he or she alone) is to\r\\n\\t\\t\\t\\tbe punished in a manner appropriate to the crime."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "148",
    "Body": "Lit., \"and he to whom [something] is remitted by his\r\\n\\t\\t\\t\\tbrother\". There is no linguistic justification whatever\r\\n\\t\\t\\t\\tfor attributing - as some of the commentators have done -\r\\n\\t\\t\\t\\tthe pronoun \"his\" to the victim and, thus, for assuming\r\\n\\t\\t\\t\\tthat the expression \"brother\" stands for the victim's\r\\n\\t\\t\\t\\t\"family\" or \"blood relations\". The pronoun \"his\" refers,\r\\n\\t\\t\\t\\tunquestionably, to the guilty person; and since there is\r\\n\\t\\t\\t\\tno reason for assuming that by \"his brother\" a real\r\\n\\t\\t\\t\\tbrother is meant, we cannot escape the conclusion that it\r\\n\\t\\t\\t\\tdenotes here \"his brother in faith\" or \"his fellow-man\" -\r\\n\\t\\t\\t\\tin either of which terms the whole community is included.\r\\n\\t\\t\\t\\tThus, the expression \"if something is remitted to a\r\\n\\t\\t\\t\\tguilty person by his brother\" (i.e., by the community or\r\\n\\t\\t\\t\\tits legal organs) may refer either to the establishment\r\\n\\t\\t\\t\\tof mitigating circumstances in a case of murder, or to\r\\n\\t\\t\\t\\tthe finding that the case under trial falls within the\r\\n\\t\\t\\t\\tcategories of culpable homicide or manslaughter - in\r\\n\\t\\t\\t\\twhich cases no capital punishment is to be exacted and\r\\n\\t\\t\\t\\trestitution is to be made by the payment of an indemnity\r\\n\\t\\t\\t\\tcalled diyyah (see  4:92 ) to the relatives of the\r\\n\\t\\t\\t\\tvictim. In consonance with the oft-recurring Qur'anic\r\\n\\t\\t\\t\\texhortation to forgiveness and forbearance, the\r\\n\\t\\t\\t\\t\"remission\" mentioned above may also (and especially in\r\\n\\t\\t\\t\\tcases of accidental manslaughter) relate to a partial or\r\\n\\t\\t\\t\\teven total waiving of any claim to indemnification."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "149",
    "Body": "Lit., \"and restitution to him in a goodly manner\", it\\n\\t\\t\\t\\tbeing understood that the pronoun in ilayhi (\"to him\")\\n\\t\\t\\t\\trefers to the \"brother in faith\" or \"fellow-man\"\\n\\t\\t\\t\\tmentioned earlier in this sentence. The word ada' (here\\n\\t\\t\\t\\ttranslated as \"restitution\") denotes an act of acquitting\\n\\t\\t\\t\\toneself of a duty or a debt (cf. Lane I, 38), and stands\\n\\t\\t\\t\\there for the act of legal reparation imposed on the\\n\\t\\t\\t\\tguilty person. This reparation or restitution is to be\\n\\t\\t\\t\\tmade \"in a goodly manner\" - by taking into account the\\n\\t\\t\\t\\tsituation of the accused and, on the latter's part, by\\n\\t\\t\\t\\tacquitting himself of his obligation willingly and\\n\\t\\t\\t\\tsincerely (cf. Manar II, 129)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "150",
    "Body": "Lit., \"after this\" - i.e., after the meaning of what\\n\\t\\t\\t\\tconstitutes \"just retribution\" (qisas) has been made\\n\\t\\t\\t\\tclear in the above ordinance (Razi)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "179",
    "NoteID": "151",
    "Body": "I.e., \"there is a safeguard for you, as a community, so\r\\n\\t\\t\\t\\tthat you might be able to live in security, as God wants\r\\n\\t\\t\\t\\tyou to live\". Thus, the objective of qisas is the protection\r\\n\\t\\t\\t\\tof the society, and not \"revenge\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "180",
    "NoteID": "152",
    "Body": "The word khayr occurring in this sentence denotes \"much\\n\\t\\t\\t\\twealth\" and not simply \"property\": and this explains the\\n\\t\\t\\t\\tinjunction that one who leaves much wealth behind should\\n\\t\\t\\t\\tmake bequests to particularly deserving members of his\\n\\t\\t\\t\\tfamily in addition to - and preceding the distribution of\\n\\t\\t\\t\\t- the legally-fixed shares mentioned in {4:11-12}. This\\n\\t\\t\\t\\tinterpretation of khayr is supported by sayings of\\n\\t\\t\\t\\t'A'ishah and 'Ali ibn Abi Talib, both of them referring\\n\\t\\t\\t\\tto this particular verse (cf. Zamakhshari and Baydawi)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "181",
    "NoteID": "153",
    "Body": "Lit., \"and as for him who alters it\" - i.e., after the\\n\\t\\t\\t\\ttestator's death - \"after having heard it, the sin\\n\\t\\t\\t\\tthereof is only upon those who alter it\": that is, not on\\n\\t\\t\\t\\tanyone who may have unwittingly benefited by this\\n\\t\\t\\t\\talteration. It is to be noted that the verb sami'a (lit.,\\n\\t\\t\\t\\t\"he heard\") has also the connotation of \"he came to\\n\\t\\t\\t\\tknow\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "182",
    "NoteID": "154",
    "Body": "Lit., \"between them\" - i.e., a settlement overriding the\\n\\t\\t\\t\\ttestamentary provisions which, by common consent of the\\n\\t\\t\\t\\tparties concerned, are considered unjust."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "184",
    "NoteID": "155",
    "Body": "I.e., during the twenty-nine or thirty days of Ramadan,\\n\\t\\t\\t\\tthe ninth month of the Islamic lunar calendar (see next\\n\\t\\t\\t\\tverse). It consists of a total abstention from food,\\n\\t\\t\\t\\tdrink and sexual intercourse from dawn until sunset. As\\n\\t\\t\\t\\tthe Qur'an points out, fasting has been widely practiced\\n\\t\\t\\t\\tat all times of man's religious history. The extreme\\n\\t\\t\\t\\trigour and the long duration of the Islamic fast - which\\n\\t\\t\\t\\tis incumbent on every healthy adult, man or woman -\\n\\t\\t\\t\\tfulfils, in addition to the general aim of spiritual\\n\\t\\t\\t\\tpurification, a threefold purpose: (1) to commemorate the\\n\\t\\t\\t\\tbeginning of the Qur'anic revelation, which took place in\\n\\t\\t\\t\\tthe month of Ramadan about thirteen years before the\\n\\t\\t\\t\\tProphet's exodus to Medina; (2) to provide an exacting\\n\\t\\t\\t\\texercise of self-discipline; and (3) to make everyone\\n\\t\\t\\t\\trealize, through his or her own experience, how it feels\\n\\t\\t\\t\\tto be hungry and thirsty, and thus to gain a true\\n\\t\\t\\t\\tappreciation of the needs of the poor."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "184",
    "NoteID": "156",
    "Body": "This phrase has been subject to a number of conflicting\\n\\t\\t\\t\\tand sometimes highly laboured interpretations. My\\n\\t\\t\\t\\trendering is based on the primary meaning of alladhina\\n\\t\\t\\t\\tyutiqunahu (\"those who are capable of it\" or \"are able to\\n\\t\\t\\t\\tdo it\" or \"can afford it\"), with the pronoun hu relating\\n\\t\\t\\t\\tto the act of \"feeding a needy person\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "184",
    "NoteID": "157",
    "Body": "Some commentators are of the opinion that this refers to\\n\\t\\t\\t\\ta voluntary feeding of more than one needy person, or to\\n\\t\\t\\t\\tfeeding the needy for more than the number of days\\n\\t\\t\\t\\trequired by the above ordinance. Since, however, the\\n\\t\\t\\t\\tremaining part of the sentence speaks of the benefits of\\n\\t\\t\\t\\tfasting as such, it is more probable that \"doing more\\n\\t\\t\\t\\tgood than one is bound to do\" refers, in this context, to\\n\\t\\t\\t\\tsupererogatory fasting (such as the Prophet sometimes\\n\\t\\t\\t\\tundertook) apart from the obligatory one during the month\\n\\t\\t\\t\\tof Ramadan."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "185",
    "NoteID": "158",
    "Body": "Lit., \"witnesses\" or \"is present in\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "159",
    "Body": "Lit., \"deceived\" or \"defrauded yourselves [in this\r\\n\\t\\t\\t\\trespect]\": an allusion to the idea prevalent among the\r\\n\\t\\t\\t\\tearly Muslims, before the revelation of this verse, that\r\\n\\t\\t\\t\\tduring the period of fasting all sexual intercourse\r\\n\\t\\t\\t\\tshould be avoided, even at night-time, when eating and\r\\n\\t\\t\\t\\tdrinking are allowed (Razi). The above verse removed this\r\\n\\t\\t\\t\\tmisconception."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "160",
    "Body": "Lit., \"and seek that which God has ordained for you\": an\\n\\t\\t\\t\\tobvious stress on the God-willed nature of sexual life."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "161",
    "Body": "Lit., \"the white line of dawn from the black line [of\\n\\t\\t\\t\\tnight]\". According to all Arab philologists, the \"black\\n\\t\\t\\t\\tline\" (al-khayt al-aswad) signifies \"the blackness of\\n\\t\\t\\t\\tnight\" (Lane II, 831); and the expression al-khaytan\\n\\t\\t\\t\\t(\"the two lines\" or \"streaks\") denotes \"day and night\"\\n\\t\\t\\t\\t(Lisan al-'Arab)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "162",
    "Body": "It was the practice of the Prophet to spend several days\r\\n\\t\\t\\t\\tand nights during Ramadan - and occasionally also at\r\\n\\t\\t\\t\\tother times - in the mosque, devoting himself to prayer\r\\n\\t\\t\\t\\tand meditation to the exclusion of all worldly\r\\n\\t\\t\\t\\tactivities; and since he advised his followers as well to\r\\n\\t\\t\\t\\tdo this from time to time, seclusion in a mosque for the\r\\n\\t\\t\\t\\tsake of meditation, called i'tikaf, has become a\r\\n\\t\\t\\t\\trecognized - though optional - mode of devotion among\r\\n\\t\\t\\t\\tMuslims, especially during the last ten days of Ramadan."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "188",
    "NoteID": "163",
    "Body": "Lit., \"and do not throw it to the judges\" - i.e., with a\\n\\t\\t\\t\\tview to being decided by them contrary to what is right\\n\\t\\t\\t\\t(Zamakhshari, Baydawi)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "188",
    "NoteID": "164",
    "Body": "Lit., \"a part of [other] people's possessions\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "189",
    "NoteID": "165",
    "Body": "The reference, at this stage, to lunar months arises from\\n\\t\\t\\t\\tthe fact that the observance of several of the religious\\n\\t\\t\\t\\tobligations instituted by Islam - like the fast of\\n\\t\\t\\t\\tRamadan, or the pilgrimage to Mecca (which is dealt with\\n\\t\\t\\t\\tin verses {196-203}) - is based on the lunar calendar, in\\n\\t\\t\\t\\twhich the months rotate through the seasons of the solar\\n\\t\\t\\t\\tyear. This fixation on the lunar calendar results in a\\n\\t\\t\\t\\tcontinuous variation of the seasonal circumstances in\\n\\t\\t\\t\\twhich those religious observances are performed (e.g.,\\n\\t\\t\\t\\tthe length of the fasting-period between dawn and sunset,\\n\\t\\t\\t\\theat or cold at the time of the fast or the pilgrimage),\\n\\t\\t\\t\\tand thus in a corresponding, periodical increase or\\n\\t\\t\\t\\tdecrease of the hardship involved. In addition to this,\\n\\t\\t\\t\\treckoning by lunar months has a bearing on the tide and\\n\\t\\t\\t\\tebb of the oceans, as well as on human physiology (e.g.,\\n\\t\\t\\t\\ta woman's monthly courses - a subject dealt with later on\\n\\t\\t\\t\\tin this surah)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "189",
    "NoteID": "166",
    "Body": "I.e., true piety does not consist in approaching\r\\n\\t\\t\\t\\tquestions of faith through a \"back door\", as it were -\r\\n\\t\\t\\t\\tthat is, through mere observance of the forms and periods\r\\n\\t\\t\\t\\tset for the performance of various religious duties (cf.\r\\n\\t\\t\\t\\t 2:177 ). However important these forms and time-limits\r\\n\\t\\t\\t\\tmay be in themselves, they do not fulfil their real\r\\n\\t\\t\\t\\tpurpose unless every act is approached through its\r\\n\\t\\t\\t\\tspiritual \"front door\", that is, through\r\\n\\t\\t\\t\\tGod-consciousness. Since, metonymically, the word bab\r\\n\\t\\t\\t\\t(\"door\") signifies \"a means of access to, or of\r\\n\\t\\t\\t\\tattainment of, a thing\" (see Lane I, 272), the metaphor\r\\n\\t\\t\\t\\tof \"entering a house through its door\" is often used in\r\\n\\t\\t\\t\\tclassical Arabic to denote a proper approach to a problem\r\\n\\t\\t\\t\\t(Razi)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "190",
    "NoteID": "167",
    "Body": "This and the following verses lay down unequivocally that\\n\\t\\t\\t\\tonly self-defence (in the widest sense of the word) makes\\n\\t\\t\\t\\twar permissible for Muslims. Most of the commentators\\n\\t\\t\\t\\tagree in that the expression la ta'tadu signifies, in\\n\\t\\t\\t\\tthis context, \"do not commit aggression\"; while by\\n\\t\\t\\t\\tal-mu'tadin \"those who commit aggression\" are meant. The\\n\\t\\t\\t\\tdefensive character of a fight \"in God's cause\" - that\\n\\t\\t\\t\\tis, in the cause of the ethical principles ordained by\\n\\t\\t\\t\\tGod - is, moreover, self-evident in the reference to\\n\\t\\t\\t\\t\"those who wage war against you\", and has been still\\n\\t\\t\\t\\tfurther clarified in  22:39  - \"permission [to fight] is\\n\\t\\t\\t\\tgiven to those against whom war is being wrongfully\\n\\t\\t\\t\\twaged\" - which, according to all available Traditions,\\n\\t\\t\\t\\tconstitutes the earliest (and therefore fundamental)\\n\\t\\t\\t\\tQur'anic reference to the question of jihad, or holy war\\n\\t\\t\\t\\t(see Tabari and Ibn Kathir in their commentaries on\\n\\t\\t\\t\\t 22:39 ). That this early, fundamental principle of\\n\\t\\t\\t\\tself-defence as the only possible justification of war\\n\\t\\t\\t\\thas been maintained throughout the Qur'an is evident from\\n\\t\\t\\t\\t 60:8 , as well as from the concluding sentence of\\n\\t\\t\\t\\t 4:91 , both of which belong to a later period than the\\n\\t\\t\\t\\tabove verse."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "191",
    "NoteID": "168",
    "Body": "In view of the preceding ordinance, the injunction \"slay\\n\\t\\t\\t\\tthem wherever you may come upon them\" is valid only\\n\\t\\t\\t\\twithin the context of hostilities already in progress\\n\\t\\t\\t\\t(Razi), on the understanding that \"those who wage war\\n\\t\\t\\t\\tagainst you\" are the aggressors or oppressors (a war of\\n\\t\\t\\t\\tliberation being a war \"in God's cause\"). The\\n\\t\\t\\t\\ttranslation, in this context, of fitnah as \"oppression\"\\n\\t\\t\\t\\tis justified by the application of this term to any\\n\\t\\t\\t\\taffliction which may cause man to go astray and to lose\\n\\t\\t\\t\\this faith in spiritual values (cf. Lisan al-'Arab)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "191",
    "NoteID": "169",
    "Body": "This reference to warfare in the vicinity of Mecca is due\\n\\t\\t\\t\\tto the fact that at the time of the revelation of this\\n\\t\\t\\t\\tverse the Holy City was still in the possession of the\\n\\t\\t\\t\\tpagan Quraysh, who were hostile to the Muslims. However -\\n\\t\\t\\t\\tas is always the case with historical references in the\\n\\t\\t\\t\\tQur'an - the above injunction has a general import, and\\n\\t\\t\\t\\tis valid for all times and circumstances."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "193",
    "NoteID": "170",
    "Body": "Lit., \"and religion belongs to God [alone]\" - i.e., until\\n\\t\\t\\t\\tGod can be worshipped without fear of persecution, and\\n\\t\\t\\t\\tnone is compelled to bow down in awe before another human\\n\\t\\t\\t\\tbeing. (See also  22:40 .) The term din is in this\\n\\t\\t\\t\\tcontext more suitably translated as \"worship\" inasmuch as\\n\\t\\t\\t\\tit comprises here both the doctrinal and the moral\\n\\t\\t\\t\\taspects of religion: that is to say, man's faith as well\\n\\t\\t\\t\\tas the obligations arising from that faith."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "194",
    "NoteID": "171",
    "Body": "This is a free rendering of the phrase \"the sacred month\\n\\t\\t\\t\\tfor the sacred month\", which is interpreted by all\\n\\t\\t\\t\\tcommentators in the sense given above. The \"sacred\\n\\t\\t\\t\\tmonths\" during which, according to ancient Arab custom,\\n\\t\\t\\t\\tall fighting was deemed utterly wrong, were the first,\\n\\t\\t\\t\\tseventh, eleventh and twelfth months of the lunar\\n\\t\\t\\t\\tcalendar."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "194",
    "NoteID": "172",
    "Body": "Thus, although the believers are enjoined to fight back\\n\\t\\t\\t\\twhenever they are attacked, the concluding words of the\\n\\t\\t\\t\\tabove verse make it clear that they must, when fighting,\\n\\t\\t\\t\\tabstain from all atrocities, including the killing of\\n\\t\\t\\t\\tnon-combatants."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "195",
    "NoteID": "173",
    "Body": "I.e., \"you might bring about your own destruction by\\n\\t\\t\\t\\twithholding your personal and material contribution to\\n\\t\\t\\t\\tthis common effort\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "174",
    "Body": "The Mecca pilgrimage (hajj) takes place once a year, in\\n\\t\\t\\t\\tthe month of Dhu 'l-Hijjah, whereas a pious visit\\n\\t\\t\\t\\t('umrah) may be performed at any time. In both hajj and\\n\\t\\t\\t\\t'umrah, the pilgrims are required to walk seven times\\n\\t\\t\\t\\taround the Ka'bah and seven times between As-Safa and\\n\\t\\t\\t\\tAl-Marwah (see notes [127] and [128] above); in the\\n\\t\\t\\t\\tcourse of the hajj, they must, in addition, attend the\\n\\t\\t\\t\\tgathering on the plain of 'Arafat on the 9th of Dhu\\n\\t\\t\\t\\t'l-Hijjah (see note [182] below). Irrespective of whether\\n\\t\\t\\t\\tthey are performing a full hajj or only an 'umrah, the\\n\\t\\t\\t\\tpilgrims must refrain from cutting or even trimming the\\n\\t\\t\\t\\thair on their heads from the time they enter the state of\\n\\t\\t\\t\\tpilgrimage (ihram) until the end of the pilgrimage,\\n\\t\\t\\t\\trespectively the pious visit. As mentioned in the\\n\\t\\t\\t\\tsequence, persons who are ill or suffer from an ailment\\n\\t\\t\\t\\twhich necessitates the cutting or shaving of one's hair\\n\\t\\t\\t\\tare exempted from this prohibition."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "175",
    "Body": "Lit., \"until the offering has reached its destination\" -\\n\\t\\t\\t\\ti.e., in time or in place; according to Razi, the time of\\n\\t\\t\\t\\tsacrifice is meant here, namely, the conclusion of the\\n\\t\\t\\t\\tpilgrimage, when those who participate in the hajj are\\n\\t\\t\\t\\texpected - provided they can afford it - to sacrifice a\\n\\t\\t\\t\\tsheep, a goat, or the like, and to distribute most of its\\n\\t\\t\\t\\tflesh in charity."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "176",
    "Body": "The expression idha amantum (lit., \"when you are safe\")\\n\\t\\t\\t\\trefers here to safety both from external dangers (e.g.,\\n\\t\\t\\t\\twar) and from illness, and is, therefore, best rendered\\n\\t\\t\\t\\tas \"hale and secure\" - the implication being that the\\n\\t\\t\\t\\tperson concerned is in a position, and intends, to\\n\\t\\t\\t\\tparticipate in the pilgrimage."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "177",
    "Body": "This relates to an interruption, for the sake of personal\\n\\t\\t\\t\\tcomfort, of the state of pilgrimage (ihram) during the\\n\\t\\t\\t\\ttime intervening between the completion of an 'umrah and\\n\\t\\t\\t\\tthe performance of the hajj (cf. Manar II, 222). The\\n\\t\\t\\t\\tpilgrim who takes advantage of this facility is obliged\\n\\t\\t\\t\\tto sacrifice an animal (see note [175] above) at the\\n\\t\\t\\t\\ttermination of the pilgrimage or, alternatively, to fast\\n\\t\\t\\t\\tfor ten days."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "178",
    "Body": "Lit., \"whose people are not present at the Inviolable\\n\\t\\t\\t\\tHouse of Worship\" - i.e., do not permanently reside\\n\\t\\t\\t\\tthere: for, obviously, the inhabitants of Mecca cannot\\n\\t\\t\\t\\tremain permanently in the state of ihram."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "179",
    "Body": "This refers not merely to a possible violation of the\\n\\t\\t\\t\\tsanctity of the pilgrimage but also, in a more general\\n\\t\\t\\t\\tway, to all deliberate violations of God's ordinances."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "197",
    "NoteID": "180",
    "Body": "Lit., \"in the well-known months\". Since the hajj\\n\\t\\t\\t\\tculminates in one particular month (namely, Dhu\\n\\t\\t\\t\\t'l-Hijjah), the plural apparently refers to its annual\\n\\t\\t\\t\\trecurrence. It should, however, be noted that some\\n\\t\\t\\t\\tcommentators understand it as referring to the last three\\n\\t\\t\\t\\tmonths of the lunar year."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "198",
    "NoteID": "181",
    "Body": "I.e., by trading while in the state of ihram. Muhammad\\n\\t\\t\\t\\t'Abduh points out (in Manar II, 231) that the endeavour\\n\\t\\t\\t\\t\"to obtain any bounty from your Sustainer\" implies\\n\\t\\t\\t\\tGod-consciousness and, therefore, constitutes a kind of\\n\\t\\t\\t\\tworship - provided, of course, that this endeavour does\\n\\t\\t\\t\\tnot conflict with any other, more prominent religious\\n\\t\\t\\t\\trequirement."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "198",
    "NoteID": "182",
    "Body": "The gathering of all pilgrims on the plain of 'Arafat,\\n\\t\\t\\t\\teast of Mecca, takes place on the 9th of Dhu 'l-Hijjah\\n\\t\\t\\t\\tand constitutes the climax of the pilgrimage. The\\n\\t\\t\\t\\tpilgrims are required to remain until sunset on that\\n\\t\\t\\t\\tplain, below the hillock known as Jabal ar-Rahmah (\"the\\n\\t\\t\\t\\tMount of Grace\") - a symbolic act meant to bring to mind\\n\\t\\t\\t\\tthat ultimate gathering on Resurrection Day, when every\\n\\t\\t\\t\\tsoul will await God's judgment. Immediately after sunset,\\n\\t\\t\\t\\tthe multitudes of pilgrims move back in the direction of\\n\\t\\t\\t\\tMecca, stopping overnight at a place called Muzdalifah,\\n\\t\\t\\t\\tthe \"holy place\" referred to in the next clause of this\\n\\t\\t\\t\\tsentence."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "198",
    "NoteID": "183",
    "Body": "Lit., \"and remember Him as He has guided you, although\\n\\t\\t\\t\\tbefore that you had indeed been among those who go\\n\\t\\t\\t\\tastray\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "199",
    "NoteID": "184",
    "Body": "Lit., \"surge onward in multitudes whence the people surge\\n\\t\\t\\t\\tonward in multitudes\": thus the pilgrims are called upon\\n\\t\\t\\t\\tto submerge their individualities, at that supreme moment\\n\\t\\t\\t\\tof the pilgrimage, in the consciousness of belonging to a\\n\\t\\t\\t\\tcommunity of people who are all equal before God, with no\\n\\t\\t\\t\\tbarrier of race or class or social status separating one\\n\\t\\t\\t\\tperson from another."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "200",
    "NoteID": "185",
    "Body": "Most of the commentators see in this passage a reference\\n\\t\\t\\t\\tto the custom of the pre-Islamic Arabs to extol, on the\\n\\t\\t\\t\\toccasion of various gatherings, the greatness and the\\n\\t\\t\\t\\tsupposed virtues of their ancestors. Some of the earliest\\n\\t\\t\\t\\tIslamic scholars, however - e.g., Ad-Dahhak, Ar-Rabi' and\\n\\t\\t\\t\\tAbu Muslim - are of the opinion that what is meant here\\n\\t\\t\\t\\tare actual fathers (or, by implication, both parents),\\n\\t\\t\\t\\twhom a child usually considers to be the embodiment of\\n\\t\\t\\t\\tall that is good and powerful (see Razi's commentary on\\n\\t\\t\\t\\tthis verse)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "203",
    "NoteID": "186",
    "Body": "These are the days following the \"Festival of Sacrifices\"\\n\\t\\t\\t\\t('id al-adha'), which takes place on the 10th of Dhu\\n\\t\\t\\t\\t'l-Hijjah. The pilgrims are obliged to spend at least two\\n\\t\\t\\t\\tof these days in the valley of Mina, about half-way\\n\\t\\t\\t\\tbetween 'Arafat and Mecca."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "204",
    "NoteID": "187",
    "Body": "Lit., \"among the people there is he\" (or \"such as\").\\n\\t\\t\\t\\tSince there is no valid reason to suppose, as some\\n\\t\\t\\t\\tcommentators do, that this refers to a particular person\\n\\t\\t\\t\\t- a contemporary of the Prophet - the most reliable\\n\\t\\t\\t\\tauthorities hold that the above passage has a general\\n\\t\\t\\t\\tmeaning (cf. Razi). As the context shows, it is a further\\n\\t\\t\\t\\telaboration of the allusion, made in {2:200-201}, to two\\n\\t\\t\\t\\tcontrasting attitudes: the attitude of people whose only\\n\\t\\t\\t\\treal concern is the life of this world, and that of\\n\\t\\t\\t\\tpeople who are mindful of the hereafter as well as, or\\n\\t\\t\\t\\teven more than, their present life."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "204",
    "NoteID": "188",
    "Body": "Lit., \"the most contentious of adversaries in a dispute\".\\n\\t\\t\\t\\tAccording to Az-Zajjaj (quoted by Razi), this signifies a\\n\\t\\t\\t\\tperson who is always able to defeat his opponent in a\\n\\t\\t\\t\\tcontroversy by the use of extremely adroit and often\\n\\t\\t\\t\\tmisleading arguments. It is obvious that this passage\\n\\t\\t\\t\\trefers to people who hold plausible and even admirable\\n\\t\\t\\t\\tviews regarding a possible improvement of human society\\n\\t\\t\\t\\tand of man's lot on earth, but at the same time refuse to\\n\\t\\t\\t\\tbe guided by what they regard as \"esoteric\"\\n\\t\\t\\t\\tconsiderations - like belief in a life after death - and\\n\\t\\t\\t\\tjustify their exclusive preoccupation with the affairs of\\n\\t\\t\\t\\tthis world by seemingly sound arguments and a stress on\\n\\t\\t\\t\\ttheir own ethical objectives (\"they cite God as witness\\n\\t\\t\\t\\tto what is in their hearts\"). There is an inescapable\\n\\t\\t\\t\\taffinity between the mental attitude described in the\\n\\t\\t\\t\\tabove passage and the one spoken of in {2:8-12}."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "205",
    "NoteID": "189",
    "Body": "Lit., \"he hastens about the earth (or \"strives on earth\"]\\n\\t\\t\\t\\tto spread corruption therein and to destroy tilth and\\n\\t\\t\\t\\tprogeny\". Most of the commentators see in this sentence\\n\\t\\t\\t\\tan indication of a conscious intent on the part of the\\n\\t\\t\\t\\tperson thus described; but it is also possible that the\\n\\t\\t\\t\\tparticle li in li-yufsida (generally taken to mean \"in\\n\\t\\t\\t\\torder that he might spread corruption\") plays in this\\n\\t\\t\\t\\tcontext the role of what the grammarians call a lam\\n\\t\\t\\t\\tal-'aqibah, \"the [letter] lam used to denote a\\n\\t\\t\\t\\tconsequence\" - i.e., regardless of the existence or\\n\\t\\t\\t\\tnon-existence of a conscious intent. (By rendering the\\n\\t\\t\\t\\tsentence the way I do it, both possibilities are left\\n\\t\\t\\t\\topen.) As regards the expression harth (rendered by me as\\n\\t\\t\\t\\t\"tilth\"), its primary significance is \"gain\" or\\n\\t\\t\\t\\t\"acquisition\" through labour; and thus it often signifies\\n\\t\\t\\t\\t\"worldly goods\" (see Lane II, 542), and especially the\\n\\t\\t\\t\\tcrops obtained by tilling land, as well as the tilled\\n\\t\\t\\t\\tland itself. If harth is understood in this context as\\n\\t\\t\\t\\t\"tilth\", it would apply, metaphorically, to human\\n\\t\\t\\t\\tendeavours in general, and to social endeavours in\\n\\t\\t\\t\\tparticular. However, some commentators - basing their\\n\\t\\t\\t\\topinion on the Qur'anic sentence, \"your wives are your\\n\\t\\t\\t\\ttilth\" ( 2:223 )- maintain that harth stands here for\\n\\t\\t\\t\\t\"wives\" (cf. Razi, and the philologist Al-Azhari, as\\n\\t\\t\\t\\tquoted in Manar II, 248): in which case the \"destruction\\n\\t\\t\\t\\tof tilth and progeny\" would be synonymous with an\\n\\t\\t\\t\\tupsetting of family life and, consequently, of the entire\\n\\t\\t\\t\\tsocial fabric. According to either of these two\\n\\t\\t\\t\\tinterpretations, the passage has the following meaning:\\n\\t\\t\\t\\tAs soon as the mental attitude described above is\\n\\t\\t\\t\\tgenerally accepted and made the basis of social\\n\\t\\t\\t\\tbehaviour, it unavoidably results in widespread moral\\n\\t\\t\\t\\tdecay and, consequently, social disintegration."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "207",
    "NoteID": "190",
    "Body": "Lit., \"there is such as would sell his own self out of a\\n\\t\\t\\t\\tdesire for God's pleasure\": i.e., would give up all his\\n\\t\\t\\t\\tpersonal interests if compliance with God's will were to\\n\\t\\t\\t\\tdemand it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "208",
    "NoteID": "191",
    "Body": "Lit., \"enter wholly into self-surrender\". Since\\n\\t\\t\\t\\tself-surrender to God is the basis of all true belief,\\n\\t\\t\\t\\tsome of the greatest commentators (e.g., Zamakhshari,\\n\\t\\t\\t\\tRazi) hold that the address, \"O you who have attained to\\n\\t\\t\\t\\tfaith\" cannot refer here to Muslims - a designation\\n\\t\\t\\t\\twhich, throughout the Qur'an, literally means \"those who\\n\\t\\t\\t\\thave surrendered themselves to God\" - but must relate to\\n\\t\\t\\t\\tpeople who have not yet achieved such complete\\n\\t\\t\\t\\tself-surrender: that is, to the Jews and the Christians,\\n\\t\\t\\t\\twho do believe in most of the earlier revelations but do\\n\\t\\t\\t\\tnot regard the message of the Qur'an as true. This\\n\\t\\t\\t\\tinterpretation would seem to be borne out by the\\n\\t\\t\\t\\tsubsequent passages."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "210",
    "NoteID": "192",
    "Body": "Lit., \"they\" - obviously referring to the people\\n\\t\\t\\t\\taddressed in the preceding two verses."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "210",
    "NoteID": "193",
    "Body": "I.e., it will be too late for repentance. All\\n\\t\\t\\t\\tcommentators agree in that the \"decision\" relates to the\\n\\t\\t\\t\\tunequivocal manifestation of God's will on the Day of\\n\\t\\t\\t\\tJudgment, which is alluded to in the words, \"when unto\\n\\t\\t\\t\\tGod all things will have been brought back\". Since, in\\n\\t\\t\\t\\tthe next verse, the children of Israel are addressed, it\\n\\t\\t\\t\\tis possible that this rhetorical question is connected\\n\\t\\t\\t\\twith their refusal, in the time of Moses, to believe in\\n\\t\\t\\t\\tthe divine message unless they \"see God face to face\"\\n\\t\\t\\t\\t(cf.  2:55 )."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "211",
    "NoteID": "194",
    "Body": "Lit., \"God's blessing\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "212",
    "NoteID": "195",
    "Body": "Lit., \"has been made beauteous\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "212",
    "NoteID": "196",
    "Body": "I.e., He cannot be called to account for the way in which\\n\\t\\t\\t\\tHe distributes worldly benefits, sometimes granting them\\n\\t\\t\\t\\tto the morally deserving and sometimes to sinners."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "213",
    "NoteID": "197",
    "Body": "By using the expression ummah wahidah (\"one single\\n\\t\\t\\t\\tcommunity\") to describe the original state of mankind,\\n\\t\\t\\t\\tthe Qur'an does not propound, as might appear at first\\n\\t\\t\\t\\tglance, the idea of a mythical \"golden age\" obtaining at\\n\\t\\t\\t\\tthe dawn of man's history. What is alluded to in this\\n\\t\\t\\t\\tverse is no more than the relative homogeneity of\\n\\t\\t\\t\\tinstinctive perceptions and inclinations characteristic\\n\\t\\t\\t\\tof man's primitive mentality and the primitive social\\n\\t\\t\\t\\torder in which he lived in those early days. Since that\\n\\t\\t\\t\\thomogeneity was based on a lack of intellectual and\\n\\t\\t\\t\\temotional differentiation rather than on a conscious\\n\\t\\t\\t\\tagreement among the members of human society, it was\\n\\t\\t\\t\\tbound to disintegrate in the measure of man's subsequent\\n\\t\\t\\t\\tdevelopment. As his thought-life became more and more\\n\\t\\t\\t\\tcomplex, his emotional capacity and his individual needs,\\n\\t\\t\\t\\ttoo, became more differentiated, conflicts of views and\\n\\t\\t\\t\\tinterests came to the fore, and mankind ceased to be \"one\\n\\t\\t\\t\\tsingle community\" as regards their outlook on life and\\n\\t\\t\\t\\ttheir moral valuations: and it was at this stage that\\n\\t\\t\\t\\tdivine guidance became necessary. (It is to be borne in\\n\\t\\t\\t\\tmind that the term al-kitab refers here - as in many\\n\\t\\t\\t\\tother places in the Qur'an - not to any particular\\n\\t\\t\\t\\tscripture but to divine revelation as such.) This\\n\\t\\t\\t\\tinterpretation of the above Qur'anic passage is supported\\n\\t\\t\\t\\tby the fact that the famous Companion 'Abd Allah ibn\\n\\t\\t\\t\\tMas'ud used to read it thus: \"All mankind were once one\\n\\t\\t\\t\\tsingle community, and then they began to differ\\n\\t\\t\\t\\t(fakhtalafu) - whereupon God raised up...\", etc. Although\\n\\t\\t\\t\\tthe word fakhtalafu interpolated here by Ibn Mas'ud does\\n\\t\\t\\t\\tnot appear in the generally-accepted text of the Qur'an,\\n\\t\\t\\t\\talmost all of the authorities are of the opinion that it\\n\\t\\t\\t\\tis implied in the context."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "213",
    "NoteID": "198",
    "Body": "Or: \"God guides whomever He wills onto a straight way.\"\\n\\t\\t\\t\\tAs is made clear in the second part of verse {253} of\\n\\t\\t\\t\\tthis surah, man's proneness to intellectual dissension is\\n\\t\\t\\t\\tnot an accident of history but an integral, God-willed\\n\\t\\t\\t\\taspect of human nature as such: and it is this natural\\n\\t\\t\\t\\tcircumstance to which the words \"by His leave\" allude.\\n\\t\\t\\t\\tFor an explanation of the phrase \"out of mutual\\n\\t\\t\\t\\tjealousy\", see  23:53  and the corresponding note [30]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "214",
    "NoteID": "199",
    "Body": "Lit., \"while yet there has not come to you the like of\\n\\t\\t\\t\\t[what has come to] those who passed away before you\".\\n\\t\\t\\t\\tThis passage connects with the words, \"God guides onto a\\n\\t\\t\\t\\tstraight way him that wills [to be guided]\", which occur\\n\\t\\t\\t\\tat the end of the preceding verse. The meaning is that\\n\\t\\t\\t\\tintellectual cognition of the truth cannot, by itself, be\\n\\t\\t\\t\\ta means of attaining to ultimate bliss: it must be\\n\\t\\t\\t\\tcomplemented by readiness to sacrifice and spiritual\\n\\t\\t\\t\\tpurification through suffering."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "214",
    "NoteID": "200",
    "Body": "The preceding reference to \"those who passed away before\\n\\t\\t\\t\\tyou\" makes it obvious that the term \"the apostle\" is used\\n\\t\\t\\t\\there in a generic sense, applying to all the apostles\\n\\t\\t\\t\\t(Manar II, 301)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "216",
    "NoteID": "201",
    "Body": "Insofar as it relates to fighting, this verse must be\\n\\t\\t\\t\\tread in conjunction with {2:190-193} and  22:39 : but it\\n\\t\\t\\t\\texpresses, in addition, a general truth applicable to\\n\\t\\t\\t\\tmany situations."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "217",
    "NoteID": "202",
    "Body": "For an explanation of the \"sacred months\", see note [171]\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "218",
    "NoteID": "203",
    "Body": "The expression alladhina hajaru (lit., \"those who have\\n\\t\\t\\t\\tforsaken their homelands\") denotes, primarily, the early\\n\\t\\t\\t\\tMeccan Muslims who migrated at the Prophet's bidding to\\n\\t\\t\\t\\tMedina - which was then called Yathrib - in order to be\\n\\t\\t\\t\\table to live in freedom and in accordance with the\\n\\t\\t\\t\\tdictates of Islam. After the conquest of Mecca by the\\n\\t\\t\\t\\tMuslims in the year 8 H., this exodus (hijrah) from Mecca\\n\\t\\t\\t\\tto Medina ceased to be a religious obligation. Ever since\\n\\t\\t\\t\\tthe earliest days of Islam, however, the term hijrah has\\n\\t\\t\\t\\thad a spiritual connotation as well - namely, a\\n\\t\\t\\t\\t\"forsaking of the domain of evil\" and turning towards\\n\\t\\t\\t\\tGod: and since this spiritual connotation applies both to\\n\\t\\t\\t\\tthe historical muhajirun (\"emigrants\") of early Islam and\\n\\t\\t\\t\\tto all believers of later times who forsake all that is\\n\\t\\t\\t\\tsinful and \"migrate unto God\", I am using this expression\\n\\t\\t\\t\\tfrequently."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "219",
    "NoteID": "204",
    "Body": "Lit., \"sin\", or anything that is conducive to sinning. As\\n\\t\\t\\t\\tsome of the classical commentators (e.g., Razi) point\\n\\t\\t\\t\\tout, the term ithm is used in this verse as the\\n\\t\\t\\t\\tantithesis of manafi' (\"benefits\"); it can, therefore, be\\n\\t\\t\\t\\tsuitably rendered as \"evil\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "219",
    "NoteID": "205",
    "Body": "Lit., \"their evil is greater than their benefit\". For a\\n\\t\\t\\t\\tclear-cut prohibition of intoxicants and games of chance,\\n\\t\\t\\t\\tsee {5:90-91} and the corresponding notes."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "220",
    "NoteID": "206",
    "Body": "The implication is that if one shares the life of an\\n\\t\\t\\t\\torphan in his charge, one is permitted to benefit by such\\n\\t\\t\\t\\tan association - for instance, through a business\\n\\t\\t\\t\\tpartnership - provided this does not damage the orphan's\\n\\t\\t\\t\\tinterests in any way."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "220",
    "NoteID": "207",
    "Body": "I.e., \"by putting you under an obligation to care for the\\n\\t\\t\\t\\torphans, and at the same time prohibiting you from\\n\\t\\t\\t\\tsharing their life\" (see preceding note)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "221",
    "NoteID": "208",
    "Body": "Although the majority of the commentators attribute to\r\\n\\t\\t\\t\\tthe term amah, occurring in this context, its usual\r\\n\\t\\t\\t\\tconnotation of \"slave-girl\", some of them are of the\r\\n\\t\\t\\t\\topinion that it stands here for \"God's bondwoman\". Thus,\r\\n\\t\\t\\t\\tZamakhshari explains the words amah mu'minah (lit., \"a\r\\n\\t\\t\\t\\tbelieving bondwoman\") as denoting \"any believing woman,\r\\n\\t\\t\\t\\twhether she be free or slave; and this applies to [the\r\\n\\t\\t\\t\\texpression] 'believing bondman' as well: for all human\r\\n\\t\\t\\t\\tbeings are God's bondmen and bondwomen\". My rendering of\r\\n\\t\\t\\t\\tthe above passage is based on this eminently plausible\r\\n\\t\\t\\t\\tinterpretation."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "222",
    "NoteID": "209",
    "Body": "This is one of the many references in the Qur'an to the\\n\\t\\t\\t\\tpositive, God-ordained nature of sexuality."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "222",
    "NoteID": "210",
    "Body": "I.e., if they have transgressed against the above\\n\\t\\t\\t\\trestriction."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "223",
    "NoteID": "211",
    "Body": "In other words, a spiritual relationship between man and\\n\\t\\t\\t\\twoman is postulated as the indispensable basis of sexual\\n\\t\\t\\t\\trelations."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "224",
    "NoteID": "212",
    "Body": "Lit., \"do not make God, because of your oaths...\", etc.\\n\\t\\t\\t\\tAs can be seen from verse {226}, this injunction refers\\n\\t\\t\\t\\tprimarily to oaths relating to divorce but is,\\n\\t\\t\\t\\tnevertheless, general in its import. Thus, there are\\n\\t\\t\\t\\tseveral authentic Traditions to the effect that the\\n\\t\\t\\t\\tProphet Muhammad said: \"If anyone takes a solemn oath\\n\\t\\t\\t\\t[that he would do or refrain from doing such-and such a\\n\\t\\t\\t\\tthing], and thereupon realizes that something else would\\n\\t\\t\\t\\tbe a more righteous course, then let him do that which is\\n\\t\\t\\t\\tmore righteous, and let him break his oath and then atone\\n\\t\\t\\t\\tfor it\" (Bukhari and Muslim; and other variants of the\\n\\t\\t\\t\\tsame Tradition in other compilations). As regards the\\n\\t\\t\\t\\tmethod of atonement, see  5:89 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "226",
    "NoteID": "213",
    "Body": "I.e., during this period of grace."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "228",
    "NoteID": "214",
    "Body": "Lit., \"by themselves\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "228",
    "NoteID": "215",
    "Body": "The primary purpose of this waiting-period is the\\n\\t\\t\\t\\tascertainment of possible pregnancy, and thus of the\\n\\t\\t\\t\\tparentage of the as yet unborn child. In addition, the\\n\\t\\t\\t\\tcouple are to be given an opportunity to reconsider their\\n\\t\\t\\t\\tdecision and possibly to resume the marriage. See also\\n\\t\\t\\t\\t 65:1  and the corresponding note [2]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "228",
    "NoteID": "216",
    "Body": "A divorced wife has the right to refuse a resumption of\\n\\t\\t\\t\\tmarital relations even if the husband expresses, before\\n\\t\\t\\t\\tthe expiry of the waiting-period, his willingness to have\\n\\t\\t\\t\\tthe provisional divorce rescinded; but since it is the\\n\\t\\t\\t\\thusband who is responsible for the maintenance of the\\n\\t\\t\\t\\tfamily, the first option to rescind a provisional divorce\\n\\t\\t\\t\\trests with him."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "229",
    "NoteID": "217",
    "Body": "Lit., \"whereupon either retention in fairness or release\\n\\t\\t\\t\\tin a goodly manner\". In other words, a third\\n\\t\\t\\t\\tpronouncement of divorce makes it final and irrevocable."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "229",
    "NoteID": "218",
    "Body": "All authorities agree in that this verse relates to the\\n\\t\\t\\t\\tunconditional right on the part of the wife to obtain a\\n\\t\\t\\t\\tdivorce from her husband; such a dissolution of marriage\\n\\t\\t\\t\\tat the wife's instance is called khul'. There exist a\\n\\t\\t\\t\\tnumber of highly-authenticated Traditions to the effect\\n\\t\\t\\t\\tthat the wife of Thabit ibn Qays, Jamilah, came to the\\n\\t\\t\\t\\tProphet and demanded a divorce from her husband on the\\n\\t\\t\\t\\tground that, in spite of his irreproachable character and\\n\\t\\t\\t\\tbehaviour, she \"disliked him as she would dislike falling\\n\\t\\t\\t\\tinto unbelief after having accepted Islam\". Thereupon the\\n\\t\\t\\t\\tProphet ordained that she should return to Thabit the\\n\\t\\t\\t\\tgarden which he has given her as her dower (mahr) at the\\n\\t\\t\\t\\ttime of their wedding, and decreed that the marriage\\n\\t\\t\\t\\tshould be dissolved. (Several variants of this Tradition\\n\\t\\t\\t\\thave been recorded by Bukhari, Nasa'i, Tirmidhi, Ibn\\n\\t\\t\\t\\tMajah and Bayhaqi, on the authority of Ibn 'Abbas.)\\n\\t\\t\\t\\tSimilar Traditions, handed down on the authority of\\n\\t\\t\\t\\t'A'ishah and relating to a woman called Hubaybah bint\\n\\t\\t\\t\\tSahl, are to be found in the Muwatta' of Imam Malik, in\\n\\t\\t\\t\\tthe Musnad of Imam Ahmad, and in the compilations of\\n\\t\\t\\t\\tNasa'i and Abu Da'ud (in one variant, the latter gives\\n\\t\\t\\t\\tthe woman's name as Hafsah bint Sahl). In accordance with\\n\\t\\t\\t\\tthese Traditions, Islamic Law stipulates that whenever a\\n\\t\\t\\t\\tmarriage is dissolved at the wife's instance without any\\n\\t\\t\\t\\toffence on the part of the husband against his marital\\n\\t\\t\\t\\tobligations, the wife is the contract-breaking party and\\n\\t\\t\\t\\tmust, therefore, return the dower which she received from\\n\\t\\t\\t\\thim at the time of concluding the marriage: and in this\\n\\t\\t\\t\\tevent \"there shall be no sin upon either of them\" if the\\n\\t\\t\\t\\thusband takes back the dower which the wife gives up of\\n\\t\\t\\t\\ther own free will. An exhaustive discussion of all these\\n\\t\\t\\t\\tTraditions and their legal implications is found in Nayl\\n\\t\\t\\t\\tal-Awtar VII, pp. 34-41. For a summary of the relevant\\n\\t\\t\\t\\tviews of the various schools of Islamic jurisprudence,\\n\\t\\t\\t\\tsee Bidayat al-Mujtahid II, pp. 54-57."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "233",
    "NoteID": "219",
    "Body": "Most of the commentators understand the word fisal as\\n\\t\\t\\t\\tbeing synonymous with \"weaning\" (i.e., before the end of\\n\\t\\t\\t\\tthe maximum period of two years). Abu Muslim, however, is\\n\\t\\t\\t\\tof the opinion that it stands here for \"separation\" -\\n\\t\\t\\t\\ti.e., of the child from its mother (Razi). It appears to\\n\\t\\t\\t\\tme that this is the better of the two interpretations\\n\\t\\t\\t\\tinasmuch as it provides a solution for cases in which\\n\\t\\t\\t\\tboth parents agree that, for some reason or other, it\\n\\t\\t\\t\\twould not be fair to burden the divorced mother with the\\n\\t\\t\\t\\tupbringing of the child despite the father's obligation\\n\\t\\t\\t\\tto support them materially, while, on the other hand, it\\n\\t\\t\\t\\twould not be feasible for the father to undertake this\\n\\t\\t\\t\\tduty single-handed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "233",
    "NoteID": "220",
    "Body": "Lit., \"provided you make safe [or \"provided you\\n\\t\\t\\t\\tsurrender\"] in a fair manner that which you are handing\\n\\t\\t\\t\\tover\". While it cannot be denied that the verb sallamahu\\n\\t\\t\\t\\tcan mean \"he surrendered it\" as well as \"he made it\\n\\t\\t\\t\\tsafe\", it seems to me that the latter meaning (which is\\n\\t\\t\\t\\tthe primary one) is preferable in this context since it\\n\\t\\t\\t\\timplies the necessity of assuring the child's future\\n\\t\\t\\t\\tsafety and well-being. (The commentators who take the\\n\\t\\t\\t\\tverb sallamtum in the sense of \"you surrender\" interpret\\n\\t\\t\\t\\tthe phrase idha sallamtum ma ataytum bi'l-ma'ruf as\\n\\t\\t\\t\\tmeaning \"provided you hand over the agreed-upon [wages to\\n\\t\\t\\t\\tthe foster-mothers] in a fair manner\" - which, to my\\n\\t\\t\\t\\tmind, unduly limits the purport of the above injunction.)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "234",
    "NoteID": "221",
    "Body": "Lit., \"by themselves\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "234",
    "NoteID": "222",
    "Body": "Lit., \"you will incur no sin\". Since, obviously, the\\n\\t\\t\\t\\twhole community is addressed here (Zamakhshari), the\\n\\t\\t\\t\\trendering \"there shall be no sin\" would seem appropriate."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "235",
    "NoteID": "223",
    "Body": "Lit., \"if you conceal [such an intention] within\r\\n\\t\\t\\t\\tyourselves: [for] God knows that you will mention [it] to\r\\n\\t\\t\\t\\tthem\". In classical Arabic usage, the expression\r\\n\\t\\t\\t\\tdhakaraha (\"he mentioned [it] to her\") is often\r\\n\\t\\t\\t\\tidiomatically synonymous with \"he demanded her in\r\\n\\t\\t\\t\\tmarriage\" (see Lane III, 969). The above passage relates\r\\n\\t\\t\\t\\tto a marriage-offer - or to an intention of making such\r\\n\\t\\t\\t\\tan offer - to a newly-widowed or divorced woman before\r\\n\\t\\t\\t\\tthe expiry of the prescribed waiting-term."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "236",
    "NoteID": "224",
    "Body": "The term faridah denotes the dower (often also called\\n\\t\\t\\t\\tmahr) which must be agreed upon by bridegroom and bride\\n\\t\\t\\t\\tbefore the conclusion of the marriage-tie. While the\\n\\t\\t\\t\\tamount of this dower is left to the discretion of the two\\n\\t\\t\\t\\tcontracting parties (and may even consist of no more than\\n\\t\\t\\t\\ta token gift), its stipulation is an essential part of an\\n\\t\\t\\t\\tIslamic marriage contract. For exceptions from this rule,\\n\\t\\t\\t\\tsee  33:50  and the corresponding note [58]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "236",
    "NoteID": "225",
    "Body": "Lit., \"upon the doers of good\" - i.e., all who are\\n\\t\\t\\t\\tdetermined to act in accordance with God's will."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "237",
    "NoteID": "226",
    "Body": "According to some of the most prominent Companions of the\\n\\t\\t\\t\\tProphet (e.g., 'Ali) and their immediate successors\\n\\t\\t\\t\\t(e.g., Sa'id ibn al-Musayyab and Sa'id ibn Jubayr), this\\n\\t\\t\\t\\tterm denotes the husband (cf. Tabari, Zamakhshari,\\n\\t\\t\\t\\tBaghawi, Razi and Ibn Kathir)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "238",
    "NoteID": "227",
    "Body": "Lit., \"the midmost [or \"the most excellent\"] prayer\". It\\n\\t\\t\\t\\tis generally assumed that this refers to the\\n\\t\\t\\t\\tmid-afternoon ('asr) prayer, although some authorities\\n\\t\\t\\t\\tbelieve that it denotes the prayer at dawn (fajr).\\n\\t\\t\\t\\tMuhammad 'Abduh, however, advances the view that it may\\n\\t\\t\\t\\tmean \"the noblest kind of prayer - that is, a prayer from\\n\\t\\t\\t\\tthe fullness of the heart, with the whole mind turned\\n\\t\\t\\t\\ttowards God, inspired by awe of Him, and reflecting upon\\n\\t\\t\\t\\tHis word\" (Manar II, 438). - In accordance with the\\n\\t\\t\\t\\tsystem prevailing throughout the Qur'an, any lengthy\\n\\t\\t\\t\\tsection dealing with social laws is almost invariably\\n\\t\\t\\t\\tfollowed by a call to God-consciousness: and since\\n\\t\\t\\t\\tGod-consciousness comes most fully to its own in prayer,\\n\\t\\t\\t\\tthis and the next verse are interpolated here between\\n\\t\\t\\t\\tinjunctions relating to marital life and divorce."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "239",
    "NoteID": "228",
    "Body": "This relates to any dangerous situation - for instance,\\n\\t\\t\\t\\tin war - where remaining for any length of time at one\\n\\t\\t\\t\\tplace would only increase the peril: in such an event,\\n\\t\\t\\t\\tthe obligatory prayers may be offered in any way that is\\n\\t\\t\\t\\tfeasible, even without consideration of the qiblah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "240",
    "NoteID": "229",
    "Body": "Lit., \"[it is] a bequest to their wives [of] one year's\\n\\t\\t\\t\\tmaintenance without being dislodged\". (As regards the\\n\\t\\t\\t\\tjustification of the rendering adopted by me, see Manar\\n\\t\\t\\t\\tII, 446 ff.). The question of a widow's residence in her\\n\\t\\t\\t\\tdead husband's house arises, of course, only in the event\\n\\t\\t\\t\\tthat it has not been bequeathed to her outright under the\\n\\t\\t\\t\\tprovisions stipulated in  4:12 ."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "240",
    "NoteID": "230",
    "Body": "For instance, by remarrying - in which case they forgo\\n\\t\\t\\t\\ttheir claim to additional maintenance during the\\n\\t\\t\\t\\tremainder of the year. Regarding the phrase \"there shall\\n\\t\\t\\t\\tbe no sin\", see note [222] above."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "241",
    "NoteID": "231",
    "Body": "This obviously relates to women who are divorced without\\n\\t\\t\\t\\tany legal fault on their part. The amount of alimony -\\n\\t\\t\\t\\tpayable unless and until they remarry - has been left\\n\\t\\t\\t\\tunspecified since it must depend on the husband's\\n\\t\\t\\t\\tfinancial circumstances and on the social conditions of\\n\\t\\t\\t\\tthe time."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "243",
    "NoteID": "232",
    "Body": "After the conclusion of the injunctions relating to\\n\\t\\t\\t\\tmarital life, the Qur'an returns here to the problem of\\n\\t\\t\\t\\twarfare in a just cause by alluding to people who -\\n\\t\\t\\t\\tobviously under a hostile attack - \"forsook their\\n\\t\\t\\t\\thomelands for fear of death\". Now, neither the Qur'an nor\\n\\t\\t\\t\\tany authentic Tradition offers any indication as to who\\n\\t\\t\\t\\tthe people referred to in this verse may have been. The\\n\\t\\t\\t\\t\"historical\" explanations given by some of the\\n\\t\\t\\t\\tcommentators are most contradictory; they seem to have\\n\\t\\t\\t\\tbeen derived from Talmudic stories current at the time,\\n\\t\\t\\t\\tand cannot be used in this context with any\\n\\t\\t\\t\\tjustification. We must, therefore, assume (as Muhammad\\n\\t\\t\\t\\t'Abduh does in Manar II. 455 ff.) that the above allusion\\n\\t\\t\\t\\tis parabolically connected with the subsequent call to\\n\\t\\t\\t\\tthe faithful to be ready to lay down their lives in God's\\n\\t\\t\\t\\tcause: an illustration of the fact that fear of physical\\n\\t\\t\\t\\tdeath leads to the moral death of nations and\\n\\t\\t\\t\\tcommunities, just as their regeneration (or \"coming back\\n\\t\\t\\t\\tto life\") depends on their regaining their moral status\\n\\t\\t\\t\\tthrough overcoming the fear of death. This is undoubtedly\\n\\t\\t\\t\\tthe purport of the elliptic story of Samuel, Saul and\\n\\t\\t\\t\\tDavid told in verses {246-251}."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "244",
    "NoteID": "233",
    "Body": "I.e., in a just war in self-defence against oppression or\\n\\t\\t\\t\\tunprovoked aggression (cf. {2:190-194})."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "245",
    "NoteID": "234",
    "Body": "I.e., by sacrificing one's life in, or devoting it to,\\n\\t\\t\\t\\tHis cause."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "246",
    "NoteID": "235",
    "Body": "The prophet referred to here is Samuel (cf. Old\\n\\t\\t\\t\\tTestament, I Samuel viii ff.)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "246",
    "NoteID": "236",
    "Body": "Obviously a reference to the many invasions of their\\n\\t\\t\\t\\thomelands by their perennial enemies, the Philistines,\\n\\t\\t\\t\\tAmorites, Amalekites and other Semitic and non-Semitic\\n\\t\\t\\t\\ttribes living in and around Palestine; and, by\\n\\t\\t\\t\\timplication, a reminder to believers of all times that\\n\\t\\t\\t\\t\"fighting in God's cause\" (as defined in the Qur'an) is\\n\\t\\t\\t\\tan act of faith."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "247",
    "NoteID": "237",
    "Body": "Lit., \"to them\" - but the next sentence shows that the\\n\\t\\t\\t\\telders were thus addressed by Samuel."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "247",
    "NoteID": "238",
    "Body": "An allusion to the Qur'anic doctrine that all dominion\\n\\t\\t\\t\\tand all that may be \"owned\" by man belongs to God alone,\\n\\t\\t\\t\\tand that man holds it only in trust from Him."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "248",
    "NoteID": "239",
    "Body": "Lit., \"that there will come to you the heart\". The word\\n\\t\\t\\t\\ttabut - here rendered as \"heart\" - has been\\n\\t\\t\\t\\tconventionally interpreted as denoting the Ark of the\\n\\t\\t\\t\\tCovenant mentioned in the Old Testament, which is said to\\n\\t\\t\\t\\thave been a highly-ornamented chest or box. The\\n\\t\\t\\t\\texplanations offered by most of the commentators who\\n\\t\\t\\t\\tadopt the latter meaning are very contradictory, and seem\\n\\t\\t\\t\\tto be based on Talmudic legends woven around that \"ark\".\\n\\t\\t\\t\\tHowever, several authorities of the highest standing\\n\\t\\t\\t\\tattribute to tabut the meaning of \"bosom\" or \"heart\" as\\n\\t\\t\\t\\twell: thus, Baydawi in one of the alternatives offered in\\n\\t\\t\\t\\this commentary on this verse, as well as Zamakhshari in\\n\\t\\t\\t\\this Asas (though not in the Kashshaf), Ibn al-Athir in\\n\\t\\t\\t\\tthe Nihayah, Raghib, and Taj al-'Arus (the latter four in\\n\\t\\t\\t\\tthe article tabata); see also Lane I, 321, and IV, 1394\\n\\t\\t\\t\\t(art. sakinah). If we take this to be the meaning of\\n\\t\\t\\t\\ttabut in the above context, it would be an allusion to\\n\\t\\t\\t\\tthe Israelites' coming change of heart (a change already\\n\\t\\t\\t\\tindicated, in general terms, in verse {243} above). In\\n\\t\\t\\t\\tview of the subsequent mention of the \"inner peace\" in\\n\\t\\t\\t\\tthe tabut, its rendering as \"heart\" is definitely more\\n\\t\\t\\t\\tappropriate than \"ark\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "248",
    "NoteID": "240",
    "Body": "Lit., \"and the remainder of that which the House (al) of\\n\\t\\t\\t\\tMoses and the House of Aaron left behind, borne by the\\n\\t\\t\\t\\tangels\". The expression \"borne by the angels\" or\\n\\t\\t\\t\\t\"angel-borne\" is an allusion to the God-inspired nature\\n\\t\\t\\t\\tof the spiritual heritage left by those two prophets;\\n\\t\\t\\t\\twhile the \"remainder\" (baqiyyah) denotes that which is\\n\\t\\t\\t\\t\"lasting\" or \"enduring\" in that heritage."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "249",
    "NoteID": "241",
    "Body": "Lit., \"excepting him\". The symbolic implication is that\\n\\t\\t\\t\\tfaith - and, thus, belief in the justice of one's cause -\\n\\t\\t\\t\\thas no value unless it is accompanied by heightened\\n\\t\\t\\t\\tself-discipline and disregard of one's material\\n\\t\\t\\t\\tinterests."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "251",
    "NoteID": "242",
    "Body": "Lit., \"were it not that God repels some people by means\\n\\t\\t\\t\\tof others\": an elliptic reference to God's enabling\\n\\t\\t\\t\\tpeople to defend themselves against aggression or\\n\\t\\t\\t\\toppression. {Exactly the same phrase occurs in  22:40 ,\\n\\t\\t\\t\\twhich deals with fighting in self-defence}."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "243",
    "Body": "This appears to be an allusion to Muhammad inasmuch as he\\n\\t\\t\\t\\twas the Last Prophet and the bearer of a universal\\n\\t\\t\\t\\tmessage applicable to all people and to all times. By\\n\\t\\t\\t\\t\"such as were spoken to by God\" Moses is meant (see the\\n\\t\\t\\t\\tlast sentence of  4:164 )."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "244",
    "Body": "The mention, in this context, of Jesus by name is\r\\n\\t\\t\\t\\tintended to stress the fact of his having been a prophet,\r\\n\\t\\t\\t\\tand to refute the claims of those who deify him. For an\r\\n\\t\\t\\t\\texplanation of the term ruh al-qudus (rendered by me as\r\\n\\t\\t\\t\\t\"holy inspiration\"), see note [71] on verse {87} of this\r\\n\\t\\t\\t\\tsurah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "245",
    "Body": "Once again - as in verse {213} above - the Qur'an alludes\\n\\t\\t\\t\\tto the inevitability of dissension among human beings: in\\n\\t\\t\\t\\tother words, it is the will of God that their way to the\\n\\t\\t\\t\\ttruth should be marked by conflicts and trial by error."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "254",
    "NoteID": "246",
    "Body": "I.e., the Day of Judgment. With this exhortation, the\\n\\t\\t\\t\\tQur'an returns to the subject of verse {245}: \"Who is it\\n\\t\\t\\t\\tthat will offer up unto God a goodly loan?\" We may,\\n\\t\\t\\t\\ttherefore, infer that the \"spending in God's way\" relates\\n\\t\\t\\t\\there to every kind of sacrifice in God's cause, and not\\n\\t\\t\\t\\tmerely to the spending of one's possessions."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "255",
    "NoteID": "247",
    "Body": "Lit., \"that which is between their hands and that which\\n\\t\\t\\t\\tis behind them\". The commentators give most conflicting\\n\\t\\t\\t\\tinterpretations to this phrase. Thus, for instance,\\n\\t\\t\\t\\tMujahid and 'Ata' assume that \"that which is between\\n\\t\\t\\t\\ttheir hands\" means \"that which has happened to them in\\n\\t\\t\\t\\tthis world\", while \"that which is behind them\" is an\\n\\t\\t\\t\\tallusion to \"that which will happen to them in the next\\n\\t\\t\\t\\tworld\"; Ad-Dahhak and Al-Kalbi, on the other hand, assume\\n\\t\\t\\t\\tthe exact opposite and say that \"that which is between\\n\\t\\t\\t\\ttheir hands\" refers to the next world, \"because they are\\n\\t\\t\\t\\tgoing towards it\", while \"that which is behind them\"\\n\\t\\t\\t\\tmeans this world, \"because they are leaving it behind\"\\n\\t\\t\\t\\t(Razi). Another explanation is \"that which took place\\n\\t\\t\\t\\tbefore them and that which will take place after them\"\\n\\t\\t\\t\\t(Zamakhshari). It would seem, however, that in all these\\n\\t\\t\\t\\tinterpretations the obvious meaning of the idiomatic\\n\\t\\t\\t\\texpression ma bayna yadayhi (\"that which lies open\\n\\t\\t\\t\\tbetween one's hands\") is lost sight of: namely, that\\n\\t\\t\\t\\twhich is evident, or known, or perceivable; similarly, ma\\n\\t\\t\\t\\tkhalfahu means that which is beyond one's ken or\\n\\t\\t\\t\\tperception. Since the whole tenor of the above\\n\\t\\t\\t\\tQur'an-verse relates to God's omnipotence and\\n\\t\\t\\t\\tomniscience, the translation given by me seems to be the\\n\\t\\t\\t\\tmost appropriate."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "255",
    "NoteID": "248",
    "Body": "Lit., \"His seat [of power]\". Some of the commentators\\n\\t\\t\\t\\t(e.g., Zamakhshari) interpret this as \"His sovereignty\"\\n\\t\\t\\t\\tor \"His dominion\", while others take it to mean \"His\\n\\t\\t\\t\\tknowledge\" (see Muhammad 'Abduh in Manar III, 33); Razi\\n\\t\\t\\t\\tinclines to the view that this word denotes God's majesty\\n\\t\\t\\t\\tand indescribable, eternal glory."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "256",
    "NoteID": "249",
    "Body": "The term din denotes both the contents of and the\r\\n\\t\\t\\t\\tcompliance with a morally binding law; consequently, it\r\\n\\t\\t\\t\\tsignifies \"religion\" in the widest sense of this term,\r\\n\\t\\t\\t\\textending over all that pertains to its doctrinal\r\\n\\t\\t\\t\\tcontents and their practical implications, as well as to\r\\n\\t\\t\\t\\tman's attitude towards the object of his worship, thus\r\\n\\t\\t\\t\\tcomprising also the concept of \"faith\". The rendering of\r\\n\\t\\t\\t\\tdin as \"religion\", \"faith\", \"religious law\" or \"moral\r\\n\\t\\t\\t\\tlaw\" (see note [3] on  109:6 ) depends on the context in\r\\n\\t\\t\\t\\twhich this term is used. On the strength of the above\r\\n\\t\\t\\t\\tcategorical prohibition of coercion (ikrah) in anything\r\\n\\t\\t\\t\\tthat pertains to faith or religion, all Islamic jurists\r\\n\\t\\t\\t\\t(fuqaha'), without any exception, hold that forcible\r\\n\\t\\t\\t\\tconversion is under all circumstances null and void, and\r\\n\\t\\t\\t\\tthat any attempt at coercing a non-believer to accept the\r\\n\\t\\t\\t\\tfaith of Islam is a grievous sin: a verdict which\r\\n\\t\\t\\t\\tdisposes of the widespread fallacy that Islam places\r\\n\\t\\t\\t\\tbefore the unbelievers the alternative of \"conversion or\r\\n\\t\\t\\t\\tthe sword\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "256",
    "NoteID": "250",
    "Body": "At-taghut denotes, primarily, anything that is worshipped\\n\\t\\t\\t\\tinstead of God and, thus, all that may turn man away from\\n\\t\\t\\t\\tGod and lead him to evil. It has both a singular and a\\n\\t\\t\\t\\tplural significance (Razi) and is, therefore, best\\n\\t\\t\\t\\trendered as \"the powers of evil\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "258",
    "NoteID": "251",
    "Body": "According to Muhammad 'Abduh, the wrong (zulm) referred\\n\\t\\t\\t\\tto here consists in \"one's deliberately turning away from\\n\\t\\t\\t\\tthe light [of guidance] provided by God\" (Manar III, 47)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "259",
    "NoteID": "252",
    "Body": "Lit., \"Or like him\". The words interpolated by me between\\n\\t\\t\\t\\tbrackets are based on Zamakhshari's interpretation of\\n\\t\\t\\t\\tthis passage, which connects with the opening of the\\n\\t\\t\\t\\tpreceding verse."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "259",
    "NoteID": "253",
    "Body": "The story told in this verse is obviously a parable meant\\n\\t\\t\\t\\tto illustrate God's power to bring the dead back to life:\\n\\t\\t\\t\\tand, thus, it is significantly placed between Abraham's\\n\\t\\t\\t\\twords in verse {258}, \"My Sustainer is He who grants life\\n\\t\\t\\t\\tand deals death\", and his subsequent request, in verse\\n\\t\\t\\t\\t{260}, to be shown how God resurrects the dead. The\\n\\t\\t\\t\\tspeculations of some of the earlier commentators as to\\n\\t\\t\\t\\tthe \"identity\" of the man and the town mentioned in this\\n\\t\\t\\t\\tstory are without any substance, and may have been\\n\\t\\t\\t\\tinfluenced by Talmudic legends."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "259",
    "NoteID": "254",
    "Body": "Sc., \"and observe that it is alive\": thus pointing out\\n\\t\\t\\t\\tthat God has the power to grant life indefinitely, as\\n\\t\\t\\t\\twell as to resurrect the dead."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "259",
    "NoteID": "255",
    "Body": "The Qur'an frequently points to the ever-recurring\\n\\t\\t\\t\\tmiracle of birth, preceded by the gradual evolution of\\n\\t\\t\\t\\tthe embryo in its mother's womb, as a visible sign of\\n\\t\\t\\t\\tGod's power to create - and therefore also to re-create -\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "260",
    "NoteID": "256",
    "Body": "Lit., \"make them incline towards thee\" (Zamakhshari; see\\n\\t\\t\\t\\talso Lane IV, 1744)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "260",
    "NoteID": "257",
    "Body": "My rendering of the above parable is based on the primary\\n\\t\\t\\t\\tmeaning of the imperative surhunna ilayka (\"make them\\n\\t\\t\\t\\tincline towards thee\", i.e., \"teach them to obey thee\").\\n\\t\\t\\t\\tThe moral of this story has been pointed out convincingly\\n\\t\\t\\t\\tby the famous commentator Abu Muslim (as quoted by Razi):\\n\\t\\t\\t\\t\"If man is able - as he undoubtedly is - to train birds\\n\\t\\t\\t\\tin such a way as to make them obey his call, then it is\\n\\t\\t\\t\\tobvious that God, whose will all things obey, can call\\n\\t\\t\\t\\tlife into being by simply decreeing, 'Be!'\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "262",
    "NoteID": "258",
    "Body": "Lit., \"do not follow up\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "263",
    "NoteID": "259",
    "Body": "For the rendering of maghfarah (lit., \"forgiveness\") in\\n\\t\\t\\t\\tthis context as \"veiling another's want\" I am indebted to\\n\\t\\t\\t\\tBaghawi's explanation of this verse."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "272",
    "NoteID": "260",
    "Body": "Lit., \"their guidance is not upon thee\" - i.e., \"thou art\\n\\t\\t\\t\\tresponsible only for conveying God's message to them, and\\n\\t\\t\\t\\tnot for their reaction to it\": the people referred to\\n\\t\\t\\t\\tbeing the needy spoken of in the preceding verses. It\\n\\t\\t\\t\\tappears that in the early days after his migration to\\n\\t\\t\\t\\tMedina, the Prophet - faced by the great poverty\\n\\t\\t\\t\\tprevalent among his own community - advised his\\n\\t\\t\\t\\tCompanions that \"charity should be bestowed only on the\\n\\t\\t\\t\\tfollowers of Islam\" - a view that was immediately\\n\\t\\t\\t\\tcorrected by the revelation of the above verse (a number\\n\\t\\t\\t\\tof Traditions to this effect are quoted by Tabari, Razi\\n\\t\\t\\t\\tand Ibn Kathir, as well as in Manar III, 82 f.).\\n\\t\\t\\t\\tAccording to several other Traditions (recorded, among\\n\\t\\t\\t\\tothers, by Nasa'i and Abu Da'ud and quoted by all the\\n\\t\\t\\t\\tclassical commentators), the Prophet thereupon explicitly\\n\\t\\t\\t\\tenjoined upon his followers to disburse charities upon\\n\\t\\t\\t\\tall who needed them, irrespective of the faith of the\\n\\t\\t\\t\\tperson concerned. Consequently, there is full agreement\\n\\t\\t\\t\\tamong all the commentators that the above verse of the\\n\\t\\t\\t\\tQur'an - although expressed in the singular and, on the\\n\\t\\t\\t\\tface of it, addressed to the Prophet - lays down an\\n\\t\\t\\t\\tinjunction binding upon all Muslims. Razi, in particular,\\n\\t\\t\\t\\tdraws from it the additional conclusion that charity - or\\n\\t\\t\\t\\tthe threat to withhold it - must never become a means of\\n\\t\\t\\t\\tattracting unbelievers to Islam: for, in order to be\\n\\t\\t\\t\\tvalid, faith must be an outcome of inner conviction and\\n\\t\\t\\t\\tfree choice. This is in consonance with verse {256} of\\n\\t\\t\\t\\tthis surah: \"There shall be no coercion in matters of\\n\\t\\t\\t\\tfaith.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "273",
    "NoteID": "261",
    "Body": "I.e., those who have devoted themselves entirely to\\n\\t\\t\\t\\tworking in the cause of the Faith - be it by spreading,\\n\\t\\t\\t\\telucidating or defending it physically or intellectually\\n\\t\\t\\t\\t- or to any of the selfless pursuits extolled in God's\\n\\t\\t\\t\\tmessage, such as search for knowledge, work for the\\n\\t\\t\\t\\tbetterment of man's lot, and so forth; and, finally,\\n\\t\\t\\t\\tthose who, having suffered personal or material hurt in\\n\\t\\t\\t\\tsuch pursuits, are henceforth unable to fend for\\n\\t\\t\\t\\tthemselves."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "275",
    "NoteID": "262",
    "Body": "For a discussion of the concept of riba (\"usury\"), see\\n\\t\\t\\t\\tnote [35] on  30:39 , where this term occurs for the\\n\\t\\t\\t\\tfirst time in the chronological order of revelation. The\\n\\t\\t\\t\\tpassage dealing with the prohibition of riba, which\\n\\t\\t\\t\\tfollows here, is believed to have been among the last\\n\\t\\t\\t\\trevelations received by the Prophet. The subject of usury\\n\\t\\t\\t\\tconnects logically with the preceding long passage on the\\n\\t\\t\\t\\tsubject of charity because the former is morally the\\n\\t\\t\\t\\texact opposite of the latter: true charity consists in\\n\\t\\t\\t\\tgiving without an expectation of material gain, whereas\\n\\t\\t\\t\\tusury is based on an expectation of gain without any\\n\\t\\t\\t\\tcorresponding effort on the part of the lender."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "275",
    "NoteID": "263",
    "Body": "Lit., \"like\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "275",
    "NoteID": "264",
    "Body": "Lit., \"he to whom an admonition has come from his\\n\\t\\t\\t\\tSustainer\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "276",
    "NoteID": "265",
    "Body": "Lit., \"whereas He causes [the merit of] charitable deeds\\n\\t\\t\\t\\tto increase with interest (yurbi)\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "278",
    "NoteID": "266",
    "Body": "This refers not merely to the believers at the time when\\n\\t\\t\\t\\tthe prohibition of usury was proclaimed, but also to\\n\\t\\t\\t\\tpeople of later times who may come to believe in the\\n\\t\\t\\t\\tQur'anic message."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "279",
    "NoteID": "267",
    "Body": "I.e., without interest."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "281",
    "NoteID": "268",
    "Body": "According to the uncontested evidence of Ibn 'Abbas, the\\n\\t\\t\\t\\tabove verse was the last revelation granted to the\\n\\t\\t\\t\\tProphet, who died shortly afterwards (Bukhari; see also\\n\\t\\t\\t\\tFath al-Bari VIII, 164f.)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "269",
    "Body": "The above phrase embraces any transaction on the basis of\\n\\t\\t\\t\\tcredit, be it an outright loan or a commercial deal. It\\n\\t\\t\\t\\trelates (as the grammatical form tadayantum shows) to\\n\\t\\t\\t\\tboth the giver and taker of credit, and has been rendered\\n\\t\\t\\t\\taccordingly."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "270",
    "Body": "I.e., in accordance with the laws promulgated in the\\n\\t\\t\\t\\tQur'an."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "271",
    "Body": "Lit., \"and do not diminish anything thereof\". Thus, the\\n\\t\\t\\t\\tformulation of the undertaking is left to the weaker\\n\\t\\t\\t\\tparty, i.e., to the one who contracts the debt."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "272",
    "Body": "E.g., because he is physically handicapped, or does not\\n\\t\\t\\t\\tfully understand the business terminology used in such\\n\\t\\t\\t\\tcontracts, or is not acquainted with the language in\\n\\t\\t\\t\\twhich the contract is to be written. The definition \"weak\\n\\t\\t\\t\\tof mind or body\" (lit., \"lacking in understanding or\\n\\t\\t\\t\\tweak\") applies to minors as well as to very old persons\\n\\t\\t\\t\\twho are no longer in full possession of their mental\\n\\t\\t\\t\\tfaculties."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "273",
    "Body": "The stipulation that two women may be substituted for one\\n\\t\\t\\t\\tmale witness does not imply any reflection on woman's\\n\\t\\t\\t\\tmoral or intellectual capabilities: it is obviously due\\n\\t\\t\\t\\tto the fact that, as a rule, women are less familiar with\\n\\t\\t\\t\\tbusiness procedures than men and, therefore, more liable\\n\\t\\t\\t\\tto commit mistakes in this respect (see 'Abduh in Manar\\n\\t\\t\\t\\tIII, 124 f.)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "274",
    "Body": "Lit., \"to write it down\" - i.e., all rights and\\n\\t\\t\\t\\tobligations arising from the contract."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "275",
    "Body": "E.g., by being held responsible for the eventual\\n\\t\\t\\t\\tconsequences of the contract as such, or for the\\n\\t\\t\\t\\tnon-fulfilment of any of its provisions by either of the\\n\\t\\t\\t\\tcontracting parties."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "283",
    "NoteID": "276",
    "Body": "Lit., \"do not conceal testimony\". This relates not only\\n\\t\\t\\t\\tto those who have witnessed a business transaction, but\\n\\t\\t\\t\\talso to a debtor who has been given a loan on trust -\\n\\t\\t\\t\\twithout a written agreement and without witnesses - and\\n\\t\\t\\t\\tsubsequently denies all knowledge of his indebtedness."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "285",
    "NoteID": "277",
    "Body": "Lit., \"we make no distinction between any of His\\n\\t\\t\\t\\tapostles\": these words are put, as it were, in the mouths\\n\\t\\t\\t\\tof the believers. Inasmuch as all the apostles were true\\n\\t\\t\\t\\tbearers of God's messages, there is no distinction\\n\\t\\t\\t\\tbetween them, albeit some of them have been \"endowed more\\n\\t\\t\\t\\thighly than others\" (see verse {253})."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "286",
    "NoteID": "278",
    "Body": "A reference to the heavy burden of rituals imposed by the\\n\\t\\t\\t\\tLaw of Moses upon the children of Israel, as well as the\\n\\t\\t\\t\\tworld-renunciation recommended by Jesus to his followers."
  }
]
