[
  {
    "SurahNumber": "79",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "For my rendering of the adjurative particle wa as\\n\\t\\t\\t\\t\"Consider\", see first half of note [23] on  74:32 . - The\\n\\t\\t\\t\\tearly commentators differ widely in their explanations of\\n\\t\\t\\t\\tverses {1-5} of this surah. The most popular\\n\\t\\t\\t\\tinterpretation is based on the view that the descriptive\\n\\t\\t\\t\\tparticiples an-nazi'at, an-nashitat, as-sabihat,\\n\\t\\t\\t\\tas-sabiqat and al-mudabbirat refer to angels and their\\n\\t\\t\\t\\tactivities with regard to the souls of the dying: an\\n\\t\\t\\t\\tinterpretation categorically rejected by Abu Muslim\\n\\t\\t\\t\\tal-Isfahani, who - as mentioned by Razi - points out that\\n\\t\\t\\t\\tthe angels are never referred to in the Qur'an in the\\n\\t\\t\\t\\tfemale gender, as is the case in the above five\\n\\t\\t\\t\\tparticiples, and that the present passage cannot be an\\n\\t\\t\\t\\texception. Almost equally unconvincing - because somewhat\\n\\t\\t\\t\\tlaboured - are the explanations which link those five\\n\\t\\t\\t\\tparticiples to the souls of the dying, or to warriors\\n\\t\\t\\t\\tengaged in holy war, or to war-mounts, and so forth. The\\n\\t\\t\\t\\tclearest and simplest interpretation is that advanced by\\n\\t\\t\\t\\tQatadah (as quoted by Tabari and Baghawi) and Al-Hasan\\n\\t\\t\\t\\tal-Basri (quoted by Baghawi and Razi), who maintain that\\n\\t\\t\\t\\twhat is meant in this passage are the stars - including\\n\\t\\t\\t\\tthe sun and the moon - and their movements in space: and\\n\\t\\t\\t\\tthis interpretation is fully in tune with many other\\n\\t\\t\\t\\tpassages in the Qur'an in which the harmony of those\\n\\t\\t\\t\\tcelestial bodies in their multiform orbits and graded\\n\\t\\t\\t\\tspeeds is cited as an evidence of God's planning and\\n\\t\\t\\t\\tcreativeness. In accordance with this interpretation, the\\n\\t\\t\\t\\tparticiple an-nazi'at occurring in the first verse\\n\\t\\t\\t\\tdenotes the daily \"ascending\" or \"rising\" of the stars,\\n\\t\\t\\t\\twhile their subsequent \"setting\" is indicated by the\\n\\t\\t\\t\\texpression gharqan, which comprises the two concepts of\\n\\t\\t\\t\\t\"drowning,\" (i.e., disappearing) and, tropically, of the\\n\\t\\t\\t\\t\"completeness\" of this daily phenomenon (Zamakhshari)."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "I.e., passing from constellation to constellation\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "This is apparently an allusion to the different speeds of\\n\\t\\t\\t\\tthe orbiting stars (Al-Hasan and Abu 'Ubaydah, as quoted\\n\\t\\t\\t\\tby Razi), as well as to the extent of their orbits in\\n\\t\\t\\t\\trelation to one another."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "6",
    "NoteID": "4",
    "Body": "I.e., upon realizing the above-mentioned evidence of God's almightiness and, therefore, of man's subjection to His ultimate judgment."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "12",
    "NoteID": "5",
    "Body": "Implying derisively (Zamakhshari) that in such a case\\n\\t\\t\\t\\tthey would be proved wrong in what they now consider a\\n\\t\\t\\t\\t\"reasonable\" assumption."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "15",
    "NoteID": "6",
    "Body": "Connecting with the preceding passage, the story of Moses\\n\\t\\t\\t\\t(which appears in much greater detail in {20:9-98}) is\\n\\t\\t\\t\\tcited here as an illustration of the fact that everyone\\n\\t\\t\\t\\twill have to answer on Judgment Day for whatever he did\\n\\t\\t\\t\\tin life, and that it is the main function of every\\n\\t\\t\\t\\tprophet to make man aware of this responsibility."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "16",
    "NoteID": "7",
    "Body": "See note [9] on  20:12 . - For the meaning of the\\n\\t\\t\\t\\tparticle idh at the beginning of this sentence, rendered\\n\\t\\t\\t\\tby me as \"Lo!\", see surah {2}, note [21]."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "19",
    "NoteID": "8",
    "Body": "Implying that so long as man is not fully aware of the\\n\\t\\t\\t\\texistence of God, he cannot really discern between what\\n\\t\\t\\t\\tis morally right or wrong; and since God is just, He does\\n\\t\\t\\t\\tnot punish anyone who has not yet attained to such a\\n\\t\\t\\t\\tdiscernment (or, as expressed in the preceding sentence,\\n\\t\\t\\t\\t\"to [moral] purity\"): cf.  6:131  - \"thy Sustainer would\\n\\t\\t\\t\\tnever destroy a community for its wrongdoing so long as\\n\\t\\t\\t\\tits people are still unaware [of the meaning of right and\\n\\t\\t\\t\\twrong]\"."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "20",
    "NoteID": "9",
    "Body": "Lit., \"showed him the great wonder\", i.e., of the\\n\\t\\t\\t\\tguidance which God, in His measureless grace, offers even\\n\\t\\t\\t\\tto the most recalcitrant sinner."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "24",
    "NoteID": "10",
    "Body": "Cf. 28 : 38 and the corresponding note 36. Pharaoh's claim to divine status is the cardinal sin whereby \"he has transgressed all bounds of what is right\" (verse 17 above)."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "25",
    "NoteID": "11",
    "Body": "Lit., \"in the first [life]\". See last sentence of  7:137 \\n\\t\\t\\t\\t- \"We utterly destroyed all that Pharaoh and his people\\n\\t\\t\\t\\thad wrought, and all that they had built\" - and the\\n\\t\\t\\t\\tcorresponding note [100]."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "27",
    "NoteID": "12",
    "Body": "Lit., \"or the heaven...\", etc. The \"heaven\" is here, as\\n\\t\\t\\t\\tin many other places in the Qur'an, a metonym for \"cosmic\\n\\t\\t\\t\\tsystem\" (cf. note [20] on  2:29 ). The above verse is an\\n\\t\\t\\t\\techo of an earlier, more explicit passage - namely,\\n\\t\\t\\t\\t{40:56-57}, which should be read together with the\\n\\t\\t\\t\\tcorresponding notes [40] and [41]. Both these passages\\n\\t\\t\\t\\trefute the \"man-centred\" view of the universe by pointing\\n\\t\\t\\t\\tout man's insignificance as compared with the vastness\\n\\t\\t\\t\\tand complexity of the whole God-created universe."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "28",
    "NoteID": "13",
    "Body": "See  87:2 , which is the earliest instance, in the\\n\\t\\t\\t\\tchronology of Qur'anic revelation, of the use of the verb\\n\\t\\t\\t\\tsawwa in the above sense."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "31",
    "NoteID": "14",
    "Body": "The term \"pasture\" (mar'a) connotes here, metonymically,\\n\\t\\t\\t\\tall herbal produce suitable for consumption by man or\\n\\t\\t\\t\\tanimal (Razi)."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "33",
    "NoteID": "15",
    "Body": "Implying (as in {80:24-32}) that man ought to be grateful\\n\\t\\t\\t\\tto God, and should always be conscious of His being the\\n\\t\\t\\t\\tProvider: hence the subsequent return of the discourse to\\n\\t\\t\\t\\tthe theme of resurrection and ultimate judgment."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "36",
    "NoteID": "16",
    "Body": "Cf.  26:91  - \"will be laid open before those who had\\n\\t\\t\\t\\tbeen lost in grievous error\": thus reminding man that\\n\\t\\t\\t\\tsuffering in the hereafter (\"hell\") is the inevitable\\n\\t\\t\\t\\tconsequence of spiritual self-destruction through\\n\\t\\t\\t\\tdeliberate wrongdoing."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "43",
    "NoteID": "17",
    "Body": "Lit., \"wherein [or \"whereon\"] art thou with regard to\\n\\t\\t\\t\\tstating it (min dhikraha)?\""
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "44",
    "NoteID": "18",
    "Body": "Lit., \"its utmost limit\", i.e., the beginning and the end\\n\\t\\t\\t\\tof all that can be known about it."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "46",
    "NoteID": "19",
    "Body": "As in many other places in the Qur'an (e.g., in  2:259 ,\\n\\t\\t\\t\\t 17:52 ,  18:19 , {20:103-104}, {23:112-113},  30:55 ,\\n\\t\\t\\t\\tetc.), this is a subtle indication of the illusory,\\n\\t\\t\\t\\tearthbound nature of man's concept of \"time\" - a concept\\n\\t\\t\\t\\twhich, we are told, will lose all its meaning in the\\n\\t\\t\\t\\tcontext of the ultimate reality comprised in the term\\n\\t\\t\\t\\t\"hereafter\" (al-akhirah)."
  }
]
