[
  {
    "SurahNumber": "29",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "I.e., to others and/or to themselves (see note [7])."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "8",
    "NoteID": "3",
    "Body": "Cf. {31:14-15} and, particularly, the corresponding note\\n\\t\\t\\t\\t[15]."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "8",
    "NoteID": "4",
    "Body": "Lit., \"something of which thou hast no knowledge\": i.e.,\\n\\t\\t\\t\\tin this particular case, \"something which conflicts with\\n\\t\\t\\t\\tthy knowledge that none and nothing can have any share in\\n\\t\\t\\t\\tGod's qualities or powers\". According to Razi, this\\n\\t\\t\\t\\tphrase may also allude to concepts not evolved through\\n\\t\\t\\t\\tpersonal knowledge but, rather, acquired through a blind,\\n\\t\\t\\t\\tuncritical acceptance of other people's views (taqlid)."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "10",
    "NoteID": "5",
    "Body": "I.e., the suffering which is bound to befall in the\\n\\t\\t\\t\\thereafter all who abandon their faith for fear of being\\n\\t\\t\\t\\tpersecuted in this world. (It is to be borne in mind that\\n\\t\\t\\t\\ta mere outward renunciation of faith under torture or\\n\\t\\t\\t\\tthreat of death is not considered a sin in Islam,\\n\\t\\t\\t\\talthough martyrdom for the sake of one's faith is the\\n\\t\\t\\t\\thighest degree of merit to which man can attain.)"
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "10",
    "NoteID": "6",
    "Body": "I.e., when it is no longer risky to be counted as one of\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "11",
    "NoteID": "7",
    "Body": "This is probably the earliest occurrence of the term\\n\\t\\t\\t\\tmunafiq in the chronology of Qur'anic revelation.\\n\\t\\t\\t\\tIdiomatically, the term is derived from the noun nafaq,\\n\\t\\t\\t\\twhich denotes an \"underground passage\" having an outlet\\n\\t\\t\\t\\tdifferent from the entry, and signifying, specifically,\\n\\t\\t\\t\\tthe complicated burrow of a field-mouse, a lizard, etc.,\\n\\t\\t\\t\\tfrom which the animal can easily escape or in which it\\n\\t\\t\\t\\tcan outwit a pursuer. Tropically, the term munafiq\\n\\t\\t\\t\\tdescribes a person who is \"two-faced\", inasmuch as he\\n\\t\\t\\t\\talways tries to find an easy way out of any real\\n\\t\\t\\t\\tcommitment, be it spiritual or social, by adapting his\\n\\t\\t\\t\\tcourse of action to what promises to be of practical\\n\\t\\t\\t\\tadvantage to him in the situation in which he happens to\\n\\t\\t\\t\\tfind himself. Since a person thus characterized usually\\n\\t\\t\\t\\tpretends to be morally better than he really is, the\\n\\t\\t\\t\\tepithet munafiq may roughly be rendered as \"hypocrite\".\\n\\t\\t\\t\\tIt should, however, be noted that whereas this Western\\n\\t\\t\\t\\tterm invariably implies conscious dissembling with the\\n\\t\\t\\t\\tintent to deceive others, the Arabic term mun afiq may\\n\\t\\t\\t\\talso be applied - and occasionally is applied in the\\n\\t\\t\\t\\tQur'an - to a person who, being weak or uncertain in his\\n\\t\\t\\t\\tbeliefs or moral convictions, merely deceives himself.\\n\\t\\t\\t\\tHence, while using in my rendering of the Qur'anic text\\n\\t\\t\\t\\tthe conventional expression \"hypocrite\", I have\\n\\t\\t\\t\\tendeavoured to point out the above differentiation,\\n\\t\\t\\t\\twhenever possible and necessary, in my explanatory notes."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "12",
    "NoteID": "8",
    "Body": "The above \"saying\" of the deniers of the truth is, of\\n\\t\\t\\t\\tcourse, but a metonym for their attitude towards the\\n\\t\\t\\t\\tbelievers; hence my interpolation, between brackets, of\\n\\t\\t\\t\\tthe words \"as it were\". The implication is that people\\n\\t\\t\\t\\twho deny the validity of any spiritual commitment arising\\n\\t\\t\\t\\tout of one’s faith in \"something that is beyond the reach\\n\\t\\t\\t\\tof human perception\" (al-ghayb) - in this case, the\\n\\t\\t\\t\\texistence of God - are, as a rule, unwilling to tolerate\\n\\t\\t\\t\\tsuch a faith and such a commitment in others as well: and\\n\\t\\t\\t\\tso they endeavour to bring the believers to their way of\\n\\t\\t\\t\\tthinking by a sarcastic, contemptuous reference to the\\n\\t\\t\\t\\talleged irrelevance of the concept of \"sin\" as such."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "12",
    "NoteID": "9",
    "Body": "Lit., \"bear\" - implying a reduction of the burden which\\n\\t\\t\\t\\tthe others would have to bear (Razi) See also next note."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "13",
    "NoteID": "10",
    "Body": "Cf. the Prophet's saying: \"Whoever calls [others] unto\\n\\t\\t\\t\\tthe right way shall have a reward equal to the [combined]\\n\\t\\t\\t\\trewards of all who may follow him until Resurrection Day,\\n\\t\\t\\t\\twithout anything being lessened of their rewards; and\\n\\t\\t\\t\\twhoever calls unto the way of error will have to bear a\\n\\t\\t\\t\\tsin equal to the [combined] sins of all who may follow\\n\\t\\t\\t\\thim until Resurrection Day, without anything being\\n\\t\\t\\t\\tlessened of their sins\" (Bukhari)."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "14",
    "NoteID": "11",
    "Body": "This passage connects with verse {2} above, \"We did test\\n\\t\\t\\t\\tthose who lived before them\". The story of Noah and of\\n\\t\\t\\t\\this failure to convert his people occurs in the Qur'an\\n\\t\\t\\t\\tseveral times, and most extensively in {11:25-48}. In the\\n\\t\\t\\t\\tpresent instance it is meant to illustrate the truth that\\n\\t\\t\\t\\tno one - not even a prophet - can bestow faith on another\\n\\t\\t\\t\\tperson (cf.  28:56  - \"thou canst not guide aright\\n\\t\\t\\t\\teveryone whom thou lovest\"). The same purport underlies\\n\\t\\t\\t\\tthe subsequent references, in verses {16-4O}, to other\\n\\t\\t\\t\\tprophets."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "14",
    "NoteID": "12",
    "Body": "Sc., \"and despite this great length of time was unable to\\n\\t\\t\\t\\tconvince them of the truth of his mission\". The identical\\n\\t\\t\\t\\tfigure - 950 years - is given in the Bible (Genesis ix,\\n\\t\\t\\t\\t29) as Noah's life-span. By repeating this element of the\\n\\t\\t\\t\\tBiblical legend, the Qur'an merely stresses the fact that\\n\\t\\t\\t\\tthe duration of a prophet's mission has nothing to do\\n\\t\\t\\t\\twith its success or failure, since \"all true guidance is\\n\\t\\t\\t\\tGod's guidance\" ( 3:73 ) - and, as we are so often told\\n\\t\\t\\t\\tin the Qur'an, \"God guides [only] him that wills [to be\\n\\t\\t\\t\\tguided]\". Thus, the reference to Noah is meant to\\n\\t\\t\\t\\treassure the believer who may be distressed at seeing the\\n\\t\\t\\t\\tmajority of his fellow-men refuse to accept, all at once,\\n\\t\\t\\t\\ta truth which appears self-evident to him."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "17",
    "NoteID": "13",
    "Body": "Lit., \"you create a lie\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "19",
    "NoteID": "14",
    "Body": "This passage - consisting of verses {19-23} - is\\n\\t\\t\\t\\tparenthetically placed in the midst of the story of\\n\\t\\t\\t\\tAbraham, connecting with the latter's reference to\\n\\t\\t\\t\\tresurrection at the end of verse {17} (\"unto Him you\\n\\t\\t\\t\\tshall be brought back\"). The ever-recurring emergence,\\n\\t\\t\\t\\tdecay and re-emergence of life, so vividly exemplified in\\n\\t\\t\\t\\tall organic nature, is often cited in the Qur'an not\\n\\t\\t\\t\\tmerely in support of the doctrine of resurrection, but\\n\\t\\t\\t\\talso as evidence of a consciously-devised plan underlying\\n\\t\\t\\t\\tcreation as such - and, thus, of the existence of the\\n\\t\\t\\t\\tCreator."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "20",
    "NoteID": "15",
    "Body": "Cf., for example, {23:12-14}, which alludes to man's\\n\\t\\t\\t\\tcoming into existence out of most primitive elements, and\\n\\t\\t\\t\\tgradually evolving into a highly complex being endowed\\n\\t\\t\\t\\tnot only with a physical body but also with a mind, with\\n\\t\\t\\t\\tfeelings, and instincts."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "23",
    "NoteID": "16",
    "Body": "Implying that such people deprive themselves of God's\\n\\t\\t\\t\\tgrace and mercy (which is the twofold significance of the\\n\\t\\t\\t\\tterm rahmah in this context) by rejecting all belief in\\n\\t\\t\\t\\tHis existence: in other words, belief in God - or one's\\n\\t\\t\\t\\treadiness to believe in Him - is, in and by itself,\\n\\t\\t\\t\\talready an outcome of His grace and mercy, just as\\n\\t\\t\\t\\tsuffering in the hereafter is an outcome of one's being\\n\\t\\t\\t\\t\"bent on denying the truth\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "24",
    "NoteID": "17",
    "Body": "Lit., \"the answer of his people was nothing but that they\\n\\t\\t\\t\\tsaid\" - thus connecting with the passage ending with\\n\\t\\t\\t\\tverse {18}."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "24",
    "NoteID": "18",
    "Body": "See note [64] on  21:69 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "25",
    "NoteID": "19",
    "Body": "Lit., \"solely out of love\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "25",
    "NoteID": "20",
    "Body": "Thus Razi, explaining this idol-worship as a result of a\\n\\t\\t\\t\\tmere blind imitation (taqlid) of attitudes inherited from\\n\\t\\t\\t\\tpast generations."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "26",
    "NoteID": "21",
    "Body": "For an explanation of the concept of hijrah and of my\\n\\t\\t\\t\\tabove rendering of the term muhajir, see surah {2}, note\\n\\t\\t\\t\\t[203], and surah {4}, note [124]. In the present instance\\n\\t\\t\\t\\tthis term is obviously used in both its physical and\\n\\t\\t\\t\\tspiritual senses, analogous to the earlier allusion (in\\n\\t\\t\\t\\t{19:48-49}) to Abraham's \"withdrawal\" (i'tizal) from his\\n\\t\\t\\t\\tevil, native environment and to his physical migration to\\n\\t\\t\\t\\tHarran (in northern Mesopotamia), and thence to Syria and\\n\\t\\t\\t\\tPalestine. The story of Lot (Lut) is mentioned in the\\n\\t\\t\\t\\tQur'an several times, and particularly in {11:69-83}."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "27",
    "NoteID": "22",
    "Body": "I.e., in addition to Ishmael (Isma'il), who had been born\\n\\t\\t\\t\\tsome years earlier (cf.  21:72 )."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "27",
    "NoteID": "23",
    "Body": "Among other things, by making him \"a leader of men\"\\n\\t\\t\\t\\t( 2:124 )."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "29",
    "NoteID": "24",
    "Body": "This particular interpretation of the phrase taqta'un\\n\\t\\t\\t\\tas-sabil is advanced by Baghawi and (on the authority of\\n\\t\\t\\t\\tAl-Hassan) by Zamakhshari; Razi adopts it exclusively and\\n\\t\\t\\t\\twithout reservation."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "31",
    "NoteID": "25",
    "Body": "See  11:69  ff., as well as the first half of the\\n\\t\\t\\t\\tcorresponding note [99]."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "31",
    "NoteID": "26",
    "Body": "The term qaryah has here, as so often in classical\\n\\t\\t\\t\\tArabic, the connotation of \"land\", in this instance\\n\\t\\t\\t\\tcomprising the towns of Sodom and Gomorrah."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "32",
    "NoteID": "27",
    "Body": "See note [66] on  7:83  and note [113] on  11:81 . In the\\n\\t\\t\\t\\tpresent instance, as well as in the next verse, the\\n\\t\\t\\t\\tpast-tense auxiliary verb kanat is meant to stress the\\n\\t\\t\\t\\tinevitability of the future event referred to; hence,\\n\\t\\t\\t\\t\"she will indeed be...\", etc."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "33",
    "NoteID": "28",
    "Body": "See note [107] on  11:77 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "35",
    "NoteID": "29",
    "Body": "This is an allusion to the Dead Sea - known to this day\\n\\t\\t\\t\\tas Bahr Lut (\"The Sea of Lot\") - which covers most of the\\n\\t\\t\\t\\tregion in which Sodom and Gomorrah were once situated.\\n\\t\\t\\t\\tIts waters contain so high a percentage of sulphur and\\n\\t\\t\\t\\tpotash that no fish or plants can live in them."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "36",
    "NoteID": "30",
    "Body": "See note [67] on  7:85 . The story of Shuayb and his\\n\\t\\t\\t\\tpeople appears in greater detail in {11:84-95}."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "37",
    "NoteID": "31",
    "Body": "See note [62] on  7:78  (a passage which relates to the\\n\\t\\t\\t\\ttribe of Thamud), and note [73] on  7:91 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "38",
    "NoteID": "32",
    "Body": "See surah {7}, second half of note [48], and note [56]."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "38",
    "NoteID": "33",
    "Body": "As regards the tribe of 'Ad, the above seems to be an\\n\\t\\t\\t\\tallusion to their one-time capital, the legendary \"Iram\\n\\t\\t\\t\\tthe many-pillared\" (mentioned in the Qur'an only once,\\n\\t\\t\\t\\tnamely, in  89:7 ). It has since been buried by the\\n\\t\\t\\t\\tmoving sand-dunes of Al-Ahqaf (a region between Uman and\\n\\t\\t\\t\\tHadramawt, within the great South-Arabian desert of Rub'\\n\\t\\t\\t\\tal-Khali); it is said, however, that its traces are\\n\\t\\t\\t\\toccasionally uncovered by strong winds. For an\\n\\t\\t\\t\\texplanation of the reference to the dwellings of the\\n\\t\\t\\t\\tThamud, see note [59] on  7:74 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "38",
    "NoteID": "34",
    "Body": "Thus, the Qur'an implies that it is man's \"ability to\\n\\t\\t\\t\\tperceive the truth\" (istibsar) that makes him morally\\n\\t\\t\\t\\tresponsible for his doings and, hence, for his failure to\\n\\t\\t\\t\\tresist his own evil impulses - which is evidently the\\n\\t\\t\\t\\tmeaning of \"Satan\" in this context. See in this\\n\\t\\t\\t\\tconnection  14:22  and the corresponding notes [31] and\\n\\t\\t\\t\\t[33]."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "39",
    "NoteID": "35",
    "Body": "As regards Qarun, see  28:76  ff. and, in particular, the\\n\\t\\t\\t\\tcorresponding note [84]; for Haman, note [6] on  28:6 .\\n\\t\\t\\t\\tThe common denominator between these two and Pharaoh is\\n\\t\\t\\t\\ttheir false pride (takabbur) and arrogance (istikbar),\\n\\t\\t\\t\\twhich cause them to become \"archetypes of evil\" (cf.\\n\\t\\t\\t\\t 28:41  and the corresponding note [40]). A similar\\n\\t\\t\\t\\tattitude of mind is said to have been characteristic of\\n\\t\\t\\t\\tthe tribes of 'Ad and Thamud, mentioned in the preceding\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "40",
    "NoteID": "36",
    "Body": "Sc., \"of God's punishment\": cf. note [98] on  11:67 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "42",
    "NoteID": "37",
    "Body": "Lit., \"whatever thing they invoke instead of Him\": i.e.,\\n\\t\\t\\t\\tHe knows the nothingness of those false objects of\\n\\t\\t\\t\\tworship (Zamakhshari), irrespective of whether they be\\n\\t\\t\\t\\timaginary deities, or deified saints, or forces of\\n\\t\\t\\t\\tnature, or even false concepts or ideas; but He also\\n\\t\\t\\t\\tknows the weakness of the human heart and mind and,\\n\\t\\t\\t\\thence, the hidden motivation of all such irrational\\n\\t\\t\\t\\tworship."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "43",
    "NoteID": "38",
    "Body": "Inasmuch as awareness of the existence of God is here\\n\\t\\t\\t\\tpostulated as a prerequisite of a full understanding of\\n\\t\\t\\t\\tthe Qur'anic parables (and, by implication, allegories as\\n\\t\\t\\t\\twell), the above verse should be read side by side with\\n\\t\\t\\t\\tthe statement that the Qur'an is meant to be \"a guidance\\n\\t\\t\\t\\tfor all the God-conscious, who believe in [the existence\\n\\t\\t\\t\\tof] a reality which is beyond the reach of human\\n\\t\\t\\t\\tperception\" (see {2:2-3} and the corresponding note [3])."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "44",
    "NoteID": "39",
    "Body": "I.e., endowed with meaning and purpose: see surah {10},\\n\\t\\t\\t\\tnote [11]. In other words, belief in the existence of a\\n\\t\\t\\t\\tmeaning and a purpose underlying the creation of the\\n\\t\\t\\t\\tuniverse is a logical corollary of one's belief in God."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "45",
    "NoteID": "40",
    "Body": "If we assume that verses {45-46} are addressed not merely\\n\\t\\t\\t\\tto the Prophet but to believers in general (an assumption\\n\\t\\t\\t\\twhich is strengthened by the plural form of address in\\n\\t\\t\\t\\tthe last clause of verse {45} and throughout verse {46}),\\n\\t\\t\\t\\tthe above phrase may be taken to mean \"whatever of the\\n\\t\\t\\t\\tdivine writ has revealed itself to thy understanding\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "45",
    "NoteID": "41",
    "Body": "For an explanation of this rendering of the term and\\n\\t\\t\\t\\tconcept of al-munkar, see surah {16}, note [109]."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "46",
    "NoteID": "42",
    "Body": "Sc., \"and are therefore not accessible to friendly\\n\\t\\t\\t\\targument\": the implication being that in such cases all\\n\\t\\t\\t\\tdisputes should a priori be avoided. As regards religious\\n\\t\\t\\t\\tdiscussions in general, see note [149] on  16:125 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "47",
    "NoteID": "43",
    "Body": "I.e., \"in this spirit\": a reference to the sameness of\\n\\t\\t\\t\\tthe fundamental truths in all revealed religions."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "47",
    "NoteID": "44",
    "Body": "I.e., \"they to whom We grant the ability to understand\\n\\t\\t\\t\\tthis divine writ\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "47",
    "NoteID": "45",
    "Body": "This rendering of the verb jahada - in the present\\n\\t\\t\\t\\tinstance and in verse {49} below (as well as in  31:32 ,\\n\\t\\t\\t\\t 40:63  or  41:28 ) - in the sense of a person's denying\\n\\t\\t\\t\\tor rejecting something which he knows to be true is based\\n\\t\\t\\t\\ton the authority of Zamakhshari's Asas."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "48",
    "NoteID": "46",
    "Body": "Lit., \"with thy right hand\" - the term yamin being used\\n\\t\\t\\t\\there metonymically, denoting no more than one's \"own\\n\\t\\t\\t\\thand\". - It is historically established that Muhammad,\\n\\t\\t\\t\\tthe \"unlettered prophet\" (cf.  7:157  and {158}), could\\n\\t\\t\\t\\tneither read nor write, and could not, therefore, have\\n\\t\\t\\t\\tderived his extensive knowledge of the contents of\\n\\t\\t\\t\\tearlier revelations from the Bible or other scriptures:\\n\\t\\t\\t\\twhich - as the Qur'an points out - ought to convince any\\n\\t\\t\\t\\tunprejudiced person that this knowledge must have come to\\n\\t\\t\\t\\thim through divine revelation."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "48",
    "NoteID": "47",
    "Body": "The participial noun mubtil is derived from the verb\\n\\t\\t\\t\\tabtala, \"he made a false [or  \"vain\"] claim\", or \"tried\\n\\t\\t\\t\\tto disprove the truth [of something]\", or \"to reduce\\n\\t\\t\\t\\t[something] to nothing\", or \"to prove [it] to be of no\\n\\t\\t\\t\\taccount\", or \"null and void\", or \"unfounded\", \"false\",\\n\\t\\t\\t\\t\"spurious\", etc., irrespective of whether the object is\\n\\t\\t\\t\\ttrue or false, authentic or spurious, valid or unfounded\\n\\t\\t\\t\\t(Lisan al-'Arab and Taj al-'Arus)."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "49",
    "NoteID": "48",
    "Body": "Lit., \"self-evident (bayyinat) in the breasts of those\\n\\t\\t\\t\\twho have been given knowledge\" - the term 'ilm having\\n\\t\\t\\t\\there the connotation of intuitive, spiritual perception."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "50",
    "NoteID": "49",
    "Body": "See note [94] on  6:109 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "51",
    "NoteID": "50",
    "Body": "I.e., \"are the contents of this revelation not enough for\\n\\t\\t\\t\\tthem to make them grasp its intrinsic truth without the\\n\\t\\t\\t\\thelp of 'miraculous proofs' of its divine origin?\" (Cf.\\n\\t\\t\\t\\tnote [60] on the last sentence of  7:75 .)"
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "53",
    "NoteID": "51",
    "Body": "See note [32] on  8:32 ."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "55",
    "NoteID": "52",
    "Body": "I.e., from all directions and from many causes."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "56",
    "NoteID": "53",
    "Body": "Implying that since the earth offers innumerable,\\n\\t\\t\\t\\tmultiform facilities to human life, there is no excuse\\n\\t\\t\\t\\tfor forgetting God \"owing to the pressure of adverse\\n\\t\\t\\t\\tcircumstances\". Whenever or wherever the worship of God -\\n\\t\\t\\t\\tin its essential, and not merely liturgical sense -\\n\\t\\t\\t\\tbecomes impossible, the believer is obliged to \"forsake\\n\\t\\t\\t\\tthe domain of evil\" (which, as explained in note [124] on\\n\\t\\t\\t\\t 4:97 , is the innermost meaning of the concept of\\n\\t\\t\\t\\thijrah) and to \"migrate unto God\", that is, to a place\\n\\t\\t\\t\\twhere it is possible to live in accordance with one's\\n\\t\\t\\t\\tfaith."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "60",
    "NoteID": "54",
    "Body": "Lit., \"that does not bear [or \"assume responsibility\\n\\t\\t\\t\\tfor\"] its sustenance\" - i.e., is either too weak to fend\\n\\t\\t\\t\\tfor itself or (according to Al-Hasan, as quoted by\\n\\t\\t\\t\\tZamakhshari) does not store up provisions for the morrow.\\n\\t\\t\\t\\tThis passage connects with the reference at the end of\\n\\t\\t\\t\\tthe preceding verse to \"those who in their Sustainer\\n\\t\\t\\t\\tplace their trust\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "61",
    "NoteID": "55",
    "Body": "Regarding my rendering of la'in as \"thus it is: if...\",\\n\\t\\t\\t\\tetc., see surah {30}, note [45]. The people spoken of in\\n\\t\\t\\t\\tthe sequence are such as do acknowledge the existence of\\n\\t\\t\\t\\tGod but have only a vague idea as to what this\\n\\t\\t\\t\\tacknowledgment implies or should imply."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "61",
    "NoteID": "56",
    "Body": "See surah {5}, note [90] The perversion consists in their\\n\\t\\t\\t\\tthinking that they really \"believe in God\" and\\n\\t\\t\\t\\tnevertheless worshipping false values and allegedly\\n\\t\\t\\t\\t\"divine\" powers side by side with Him: all of which\\n\\t\\t\\t\\tamounts to a virtual denial of His almightiness and\\n\\t\\t\\t\\tuniqueness."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "62",
    "NoteID": "57",
    "Body": "Sc., \"and, hence, knows what is really good and, from the\\n\\t\\t\\t\\tviewpoint of His unfathomable plan, necessary for each\\n\\t\\t\\t\\tliving being\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "66",
    "NoteID": "58",
    "Body": "The particle li prefixed to the subsequent verbs yakfuru\\n\\t\\t\\t\\t(\"they show [utter] ingratitude\") and yatamatta'u (\"they\\n\\t\\t\\t\\tenjoy [or \"go on enjoying\"] their worldly life\") is not\\n\\t\\t\\t\\tan indication of intent (\"so that\" or \"in order that\")\\n\\t\\t\\t\\tbut merely of a causal sequence; in the above context, it\\n\\t\\t\\t\\tmay be appropriately rendered as \"and thus\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "67",
    "NoteID": "59",
    "Body": "See note [58] on the second paragraph of  28:57 . In\\n\\t\\t\\t\\tcontrast to the \"sanctuary secure\" - the inner peace and\\n\\t\\t\\t\\tsense of spiritual fulfilment which God bestows on those\\n\\t\\t\\t\\twho truly believe in Him - the atheist or agnostic is\\n\\t\\t\\t\\tmore often than not exposed to fear of the Unknown and a\\n\\t\\t\\t\\tdespair born of the uncertainty as to what will happen to\\n\\t\\t\\t\\thim after death."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "68",
    "NoteID": "60",
    "Body": "I.e., by persuading himself that there is, side by side\\n\\t\\t\\t\\twith God or even independently of Him, any \"power\" that\\n\\t\\t\\t\\tcould govern men's destinies."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "69",
    "NoteID": "61",
    "Body": "Lit., \"Our paths\". The plural used here is obviously\\n\\t\\t\\t\\tmeant to stress the fact - alluded to often in the Qur'an\\n\\t\\t\\t\\t- that there are many paths which lead to a cognizance\\n\\t\\t\\t\\t(ma'rifah) of God."
  }
]
