[
  {
    "Title": "Ramadan Day 1 Dua",
    "Type": "dua_of_the_day",
    "Day": "1",
    "Text": "<span class='arabic-text'>رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ </span>\r\\n<br />\r\\nOur Lord, Forgive me, and my parents, and the believers on the Day of Accounting.\r\\n<br />\r\\n[Ibrahim, 14:41]"
  },
  {
    "Title": "Ramadan Day 2 Dua",
    "Type": "dua_of_the_day",
    "Day": "2",
    "Text": "<span class='arabic-text'>اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، \r\\nوَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ\r\\n<br />\r\\n\r\\n</span>O Allah! I seek refuge in You from cowardice. O Allah, I seek refuge in You from being brought back to a bad stage of the age, I seek refuge in You from trials of this world and from the torment of the grave. \r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 3 Dua",
    "Type": "dua_of_the_day",
    "Day": "3",
    "Text": "<span class='arabic-text'>اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَمِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ\r\\nالْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ\r\\n<br />\r\\n\r\\n</span>O Allah! I seek refuge in you from the torment of hell, from the torment of the grave, from the trial of life and death and from the evil of the trial of Masih al-Dajjal.\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 4 Dua",
    "Type": "dua_of_the_day",
    "Day": "4",
    "Text": "<span class='arabic-text'>رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي\r\\nوَاهْدِ قَلْبِي وَسَدِّدْ لِسَانِي وَاسْلُلْ سَخِيمَةَ قَلْبِي\r\\n<br />\r\\n</span>My Lord, accept my repentance, wash away my sin, answer my supplication, clearly establish\r\\nmy evidence, guide my heart, make true my tongue and draw out malice in my breast.\r\\n<br />\r\\n[Abu Dawood]"
  },
  {
    "Title": "Ramadan Day 5 Dua",
    "Type": "dua_of_the_day",
    "Day": "5",
    "Text": "<span class='arabic-text'>الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا الطَّعَامَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي\r\\nوَلَا قُوَّةٍ\r\\n<br />\r\\n</span>All praise is due to Allah who has given me food to eat and provided it without any endeavour on my part or any power.\r\\n<br />\r\\n[Tirmidhi]\r\\n<br />\r\\nWhoever eats food and say (the above) at the end, all his past sins will be forgiven. [Tirmidhi]"
  },
  {
    "Title": "Ramadan Day 6 Dua",
    "Type": "dua_of_the_day",
    "Day": "6",
    "Text": "<span class='arabic-text'>اللَّهُمَّ اهْدِنِي لِأَحْسَنِ الْأَعْمَالِ وَأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِي لِأَحْسَنِهَا\r\\nإِلَّا أَنْتَ وَقِنِي سَيِّئَ الْأَعْمَالِ وَسَيِّئَ الْأَخْلَاقِ لَا يَقِي سَيِّئَهَا إِلَّا أَنْتَ\r\\n<br />\r\\n</span>O Allah, guide me to the best of deeds and the best of manners, for none can guide to the best of them but You. And protect me from bad deeds and bad manners, for none can protect against them but You. [An-Nasa'i]"
  },
  {
    "Title": "Ramadan Day 7 Dua",
    "Type": "dua_of_the_day",
    "Day": "7",
    "Text": "<span class='arabic-text'>رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ\r\\nأَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ\r\\n<br />\r\\n</span>O my Lord! Inspire and bestow upon me the power and ability that I may be grateful for Your\r\\nfavours which You have bestowed on me and on my parents, and that I may do good deeds\r\\n(righteous) that will please You, and admit me by Your mercy among Your righteous\r\\nservants. [An Naml, 27:19]"
  },
  {
    "Title": "Ramadan Day 8 Dua",
    "Type": "dua_of_the_day",
    "Day": "8",
    "Text": "<span class='arabic-text'>رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ\r\\nدُعَاء\r\\n<br />\r\\n</span>O Lord, make me steadfast in prayer, and (also) some of my offspring. O our Lord, accept my prayer.\r\\n<br />\r\\n(Ibrahim, 14: 40)"
  },
  {
    "Title": "Ramadan Day 9 Dua",
    "Type": "dua_of_the_day",
    "Day": "9",
    "Text": "<span class='arabic-text'>اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَقِ وَالأَعْمَالِ\r\\nوَالأَهْوَاءِ\r\\n<br />\r\\n</span>O Allah, I seek refuge in You from evil character, evil actions, and evil desires.\r\\n<br />\r\\n[At-Tirmidhi]\r\\n"
  },
  {
    "Title": "Ramadan Day 1 Deed",
    "Type": "deed_of_the_day",
    "Day": "1",
    "Text": "Purify our intentions to perform our fast and good deeds for the sake of Allah and take a minute or two today to seek Allah's forgiveness for all the believers."
  },
  {
    "Title": "Ramadan Day 10 Dua",
    "Type": "dua_of_the_day",
    "Day": "10",
    "Text": "<span class='arabic-text'>رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ\r\\nوَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا\r\\n<br />\r\\n</span>O Lord, cause me to enter a goodly entrance and cause me to exit a goodly exit, and\r\\ngrant me from Yourself a supporting authority.\r\\n<br />\r\\n[Sura al-‘Isra’, 17: 80]"
  },
  {
    "Title": "Ramadan Day 11 Dua",
    "Type": "dua_of_the_day",
    "Day": "11",
    "Text": "<span class='arabic-text'>اَللّٰھُمَّ إِنِّیْ أَعُوْذُبِکَ مِنْ جَھْدِ الْبَلاَءِ ، وَدَرْکِ الشَّقَاءِ،\r\\nوَسُوءِ الْقَضَاءِ ، وَشَمَاتَةِ الأَعْدَاءِ\r\\n<br />\r\\n</span>O Allah! Indeed I seek refuge in You from severe trials and hardships, being overtaken by misfortune, a bad fate and the rejoicing of enemies.\r\\n<br />\r\\n[Bukhari, Muslim]\r\\n"
  },
  {
    "Title": "Ramadan Day 12 Dua",
    "Type": "dua_of_the_day",
    "Day": "12",
    "Text": "<span class='arabic-text'>رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ\r\\n<br />\r\\n</span>My Lord! Forgive and have mercy, for You are the best of those who show mercy.\r\\n<br />\r\\n[Al-Mu'minun, 23:118]"
  },
  {
    "Title": "Ramadan Day 13 Dua",
    "Type": "dua_of_the_day",
    "Day": "13",
    "Text": "<span class='arabic-text'>اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ\r\\n<br />\r\\n</span>O Allah, help me remember You, to be grateful to You, and to worship You in an excellent manner. [Abu Dawood]"
  },
  {
    "Title": "Ramadan Day 14 Dua",
    "Type": "dua_of_the_day",
    "Day": "14",
    "Text": "<span class='arabic-text'>رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا\r\\n<br />\r\\n</span>Our Lord, give us in this world [that which is] good and in the Hereafter [that which\r\\nis] good and protect us from the punishment of the Fire.\r\\n<br />\r\\n[Al Baqarah, 2:201]"
  },
  {
    "Title": "Ramadan Day 15 Dua",
    "Type": "dua_of_the_day",
    "Day": "15",
    "Text": "ر<span class='arabic-text'>َّبِّ زِدْنِى عِلْمًا\r\\n<br />\r\\nO’My Lord! Increase me in knowledge.\r\\n<br />\r\\n</span>[Ta-Ha, 20:114]"
  },
  {
    "Title": "Ramadan Day 16 Dua",
    "Type": "dua_of_the_day",
    "Day": "16",
    "Text": "<span class='arabic-text'>اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الأَرْبَعِ مِنْ عِلْمٍ لاَ يَنْفَعُ وَمِنْ قَلْبٍ لاَ\r\\nيَخْشَعُ وَمِنْ نَفْسٍ لاَ تَشْبَعُ وَمِنْ دُعَاءٍ لاَ يُسْمَعُ\r\\n\r\\n<br />\r\\n</span>O Allah, I seek refuge in Thee from four things: Knowledge which does not profit, a heart which is not submissive, a soul which has an insatiable appetite, and a supplication which is not heard.\r\\n<br />\r\\n[Abu Dawood]"
  },
  {
    "Title": "Ramadan Day 17 Dua",
    "Type": "dua_of_the_day",
    "Day": "17",
    "Text": "<span class='arabic-text'>اَللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا, وَ رِزْقًا طَيَّبًا, وَ عَمَلاً\r\\nمُتَقَبَّل\r\\n<br />\r\\n</span>O Allah! I ask You for knowledge that is of benefit, a good provision and deeds that will be accepted.\r\\n<br />\r\\n[Sunan Ibn Majah]"
  },
  {
    "Title": "Ramadan Day 18 Dua",
    "Type": "dua_of_the_day",
    "Day": "18",
    "Text": "<span class='arabic-text'>يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِى عَلَى دِينِكَ\r\\n<br />\r\\n</span>O Turner of hearts, keep my heart steadfast on Your deen.\r\\n<br />\r\\n[Tirmidhi]"
  },
  {
    "Title": "Ramadan Day 19 Dua",
    "Type": "dua_of_the_day",
    "Day": "19",
    "Text": "<span class='arabic-text'>رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ\r\\nمِنَ الْخَاسِرِينَ\r\\n<br />\r\\n</span>Our Lord! We have wronged ourselves, and if You do not forgive us and not have\r\\nmercy on us, we shall most surely be among the losers.\r\\n<br />\r\\n[Al A'raf, 7:23]"
  },
  {
    "Title": "Ramadan Day 2 Deed",
    "Type": "deed_of_the_day",
    "Day": "2",
    "Text": "Recite SubhanAllah 33x, Alhamdulillah 33x, Allahu Akbar 33x and completes the hundred with Laa ilaaha ill-Allah wahdahu laa shareeka lahu, lahu’l-mulku wa lahu’l-hamd wa huwa ‘ala kulli shay’in qadeer after every salah - sins will be forgiven even if they are like the foam of\r\\nthe sea.\r\\n<br />\r\\n [Muslim]"
  },
  {
    "Title": "Ramadan Day 20 Dua",
    "Type": "dua_of_the_day",
    "Day": "20",
    "Text": "<span class='arabic-text'>اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي\r\\n<br />\r\\n</span>O Allah, You are Forgiving and love forgiveness, so forgive me.\r\\n<br />\r\\n[Sunan Ibn Majah]"
  },
  {
    "Title": "Ramadan Day 21 Dua",
    "Type": "dua_of_the_day",
    "Day": "21",
    "Text": "<span class='arabic-text'>فَاطِرَ السَّمَاوَاتِ وَالأرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالآخِرَةِ تَوَفَّنِي\r\\nمُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ\r\\n<br />\r\\n</span>Creator of the heavens and earth, You are my protector in this world and in the Hereafter. Cause me to die a Muslim and join me with the righteous.\r\\n<br />\r\\n[Yusuf 12:101]"
  },
  {
    "Title": "Ramadan Day 22 Dua",
    "Type": "dua_of_the_day",
    "Day": "22",
    "Text": "Surah Al Falaq\r\\n<br />\r\\n<span class='arabic-text'>بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ\r\\nقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ. مِن شَرِّ مَا خَلَقَ. وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ. وَمِن شَرِّ\r\\nالنَّفَّاثَاتِ فِي الْعُقَدِ. وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.\r\\n<br />\r\\n</span>I seek refuge with (Allah), the Lord of the daybreak. From the evil of what He has created. And\r\\nfrom the evil of the darkening (night) as it comes with its darkness. And from the evil of those\r\\nwho practise witchcraft when they blow in the knots, And from the evil of the envier when he\r\\nenvies."
  },
  {
    "Title": "Ramadan Day 23 Dua",
    "Type": "dua_of_the_day",
    "Day": "23",
    "Text": "<span class='arabic-text'>رَبِّ اغْفِرْ لِي وَتُبْ عَلَىَّ إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُورُ\r\\n<br />\r\\n</span>O my Lord, forgive me, and accept my repentance. Verily, You are the Oft- Returning, the Most Forgiving.\r\\n<br />\r\\n[Tirmidhi]"
  },
  {
    "Title": "Ramadan Day 24 Dua",
    "Type": "dua_of_the_day",
    "Day": "24",
    "Text": "<span class='arabic-text'>اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالسَّلَامَةَ مِنْ\r\\nكُلِّ إِثْمٍ، وَالْغَنِيْمَةَ مِنْ كُلِّ بِرٍ، وَالْفَوْزَ بِالجَنَّةِ، وَالنَّجَاةَ مِنَ النَّارِ\r\\n<br />\r\\n</span>O Allah! I beg You for that which incites Your mercy and the means of Your forgiveness, safety from every sin, the benefit from every good deed, success in attaining Jannah and safety from the Fire. \r\\n<br />\r\\n[Al Hakim]"
  },
  {
    "Title": "Ramadan Day 25 Dua",
    "Type": "dua_of_the_day",
    "Day": "25",
    "Text": "<span class='arabic-text'>اَللّٰهُمَّ اَلِّفْ بَيْنَ قُلُوْبِنَا وَأَصْلِحْ ذَاتَ بَيْنِنَا، وَاهْدِنَا سُبُلَ\r\\nالسَّلاَمِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّوْرِ\r\\n<br />\r\\n</span>O Allah, join our hearts, reform our matters within us, guide us to the path of peace, bring us from darkness to light.\r\\n<br />\r\\n[Abu Dawood]"
  },
  {
    "Title": "Ramadan Day 26 Dua",
    "Type": "dua_of_the_day",
    "Day": "26",
    "Text": "<span class='arabic-text'>اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا\r\\nلَا أَعْلَمُ\r\\n<br />\r\\n</span>O Allah! I seek refuge in you lest I associate anything with you while I know it, and I seek your forgiveness for what I do not know.\r\\n<br />\r\\n[Adab Al Mufrad]"
  },
  {
    "Title": "Ramadan Day 27 Dua",
    "Type": "dua_of_the_day",
    "Day": "27",
    "Text": "<span class='arabic-text'>رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ\r\\nالنَّار\r\\n<br />\r\\n</span>Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.\r\\n<br />\r\\n[Al-Baqarah, 2:201]"
  },
  {
    "Title": "Ramadan Day 28 Dua",
    "Type": "dua_of_the_day",
    "Day": "28",
    "Text": "<span class='arabic-text'>اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ أَصْلِحْ\r\\nلِي شَأْنِي كُلَّهُ لَا إِلَهَ إِلَّا أَنْت\r\\n<br />\r\\n</span>O Allah I hope for Your Mercy, do not entrust me to my own self even for the blink of an eye, correct for me all my matters, there is none worthy of worship except You.\r\\n<br />\r\\n[Ahmad, Abu Dawood]"
  },
  {
    "Title": "Ramadan Day 29 Dua",
    "Type": "dua_of_the_day",
    "Day": "29",
    "Text": "<span class='arabic-text'>رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً\r\\nإِنَّكَ أَنتَ الْوَهَّابُ\r\\n<br />\r\\n</span>Our Lord! Let not our hearts deviate after You have guided us, and grant us mercy from You. Truly, You are the One Who Bestows. \r\\n<br />\r\\n[Al-Imran, 3:8]"
  },
  {
    "Title": "Ramadan Day 3 Deed",
    "Type": "deed_of_the_day",
    "Day": "3",
    "Text": "Donate, even a little, for the construction of a mosque, school or any charitable cause. You can also donate your energy in cleaning your house, mosque, old folks home or orphanage."
  },
  {
    "Title": "Ramadan Day 30 Dua",
    "Type": "dua_of_the_day",
    "Day": "30",
    "Text": "<span class='arabic-text'>اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ\r\\nاللَّهُمَّ نَقِّنِي مِنْ خَطَايَاىَ كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ\r\\nاللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَاىَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ\r\\n<br />\r\\n</span>O Allah, remove my sins from me as Thou hast removed the East from the West. O Allah purify\r\\nme from sins as a white garment is purified from filth. O Allah! wash away my sins with snow,\r\\nwater and ice. \r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 4 Deed",
    "Type": "deed_of_the_day",
    "Day": "4",
    "Text": "Purify your heart and make du'a for blessings and goodness for those you love and those who have hurt you."
  },
  {
    "Title": "Ramadan Day 5 Deed",
    "Type": "deed_of_the_day",
    "Day": "5",
    "Text": "Provide or prepare a drink/food for those who are fasting or anyone who is in need of food.\r\\n<br />\r\\n“Guard yourself from the Hellfire, even with half of a date in charity.\"\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 6 Deed",
    "Type": "deed_of_the_day",
    "Day": "6",
    "Text": "Treat your parents/ spouse/ children/ siblings with gentleness and kindness. Help them with anything they need.\r\\n<br />\r\\nMake du'a to Allah for them to be forgiven, granted mercy and Jannatul Firdaus."
  },
  {
    "Title": "Ramadan Day 7 Deed",
    "Type": "deed_of_the_day",
    "Day": "7",
    "Text": "Share information or video on Islam, Al Quran and sunnah that will be beneficial in the Dunya\r\\nand Akhirah. \r\\n<br />\r\\nShare \"Du'a of the Day'\" with someone."
  },
  {
    "Title": "Ramadan Day 8 Deed",
    "Type": "deed_of_the_day",
    "Day": "8",
    "Text": "Recite salawat (blessings) for Prophet <span class='arabic-text'> صلى الله عليه وسلم) ) </span>as many times as possible and try to incorporate this in your daily routine.\r\\n<br />\r\\nThe Prophet ( صلى الله عليه وسلم) said: \"Whoever sends salah (blessings) upon me once, Allah\r\\n(SWT) will send salah upon him tenfold.\" [An Nasa'i]."
  },
  {
    "Title": "Ramadan Day 9 Deed",
    "Type": "deed_of_the_day",
    "Day": "9",
    "Text": "Say Salam to someone and speak softly and with humility.\r\\n<br />\r\\nAvoid back-biting or saying harsh words to anyone."
  },
  {
    "Title": "Ramadan Day 10 Deed",
    "Type": "deed_of_the_day",
    "Day": "10",
    "Text": "Seek forgiveness from those you have done wrong.\r\\n<br />\r\\nIf you are unable to, give in charity on their behalf and make doa for them."
  },
  {
    "Title": "Ramadan Day 11 Deed",
    "Type": "deed_of_the_day",
    "Day": "11",
    "Text": "Recite 100 times:\r\\n<br />\r\\n<span class='arabic-text'>أَسْتَغْفِرُ للهَ وَأَتُوْبُ إِلَيْهِ\r\\n<br />\r\\n</span>I seek forgiveness from Allah and repent towards Him."
  },
  {
    "Title": "Ramadan Day 12 Deed",
    "Type": "deed_of_the_day",
    "Day": "12",
    "Text": "Pray in congregation.\r\\n<br />\r\\nStraighten your rows and be gentle with your brothers / sisters when straightening the rows."
  },
  {
    "Title": "Ramadan Day 13 Deed",
    "Type": "deed_of_the_day",
    "Day": "13",
    "Text": "Perform Fajr and Isha' prayers in congregation, preferably at the mosque."
  },
  {
    "Title": "Ramadan Day 14 Deed",
    "Type": "deed_of_the_day",
    "Day": "14",
    "Text": "Reflect on everything you have been blessed with and thank Allah for the blessings.\r\\n<br />\r\\nSay Alhamdulillah with your tongue and use the wealth/knowledge/energy in a manner that is pleasing to Allah."
  },
  {
    "Title": "Ramadan Day 15 Deed",
    "Type": "deed_of_the_day",
    "Day": "15",
    "Text": "Read the tafsir of some ayah of the Al Qur'an and tadabbur (ponder) over the meaning.\r\\n<br />\r\\nShare any lessons learnt with a family member or friend."
  },
  {
    "Title": "Ramadan Day 16 Deed",
    "Type": "deed_of_the_day",
    "Day": "16",
    "Text": "Prepare for prayer early, focus on taking wudhu' properly and pray as if Allah is in front of you."
  },
  {
    "Title": "Ramadan Day 17 Deed",
    "Type": "deed_of_the_day",
    "Day": "17",
    "Text": "Prepare or arrange for some food or drinks to be provided to those breaking their fast or in need, even if it is a glass of water."
  },
  {
    "Title": "Ramadan Day 18 Deed",
    "Type": "deed_of_the_day",
    "Day": "18",
    "Text": "Share the du'a below with a family member or friend and encourage them to recite it everyday.\r\\n<br />\r\\n\"Whoever teaches some knowledge will have the reward of the one who acts upon it, without that detracting from his reward in the slightest.\"\r\\n<br />\r\\n[Sunan Ibn Majah]"
  },
  {
    "Title": "Ramadan Day 19 Deed",
    "Type": "deed_of_the_day",
    "Day": "19",
    "Text": "Avoid ill speech - verbally or through texts."
  },
  {
    "Title": "Ramadan Day 20 Deed",
    "Type": "deed_of_the_day",
    "Day": "20",
    "Text": "Invite your loved ones to join you for Qiyam, recitation of Al Qur'an, du'a and adhkar."
  },
  {
    "Title": "Ramadan Day 21 Deed",
    "Type": "deed_of_the_day",
    "Day": "21",
    "Text": "Recite Surah Al Mulk before you sleep.\r\\n<br />\r\\n\"There is a Surah in the Qur'an which contains thirty Ayat which kept interceding for a man until his sins are forgiven. This Surah is 'Blessed is He in Whose Hand is the dominion.\" (Surah\r\\nAl-Mulk).\r\\n<br />\r\\n[Abu Dawud]"
  },
  {
    "Title": "Ramadan Day 22 Deed",
    "Type": "deed_of_the_day",
    "Day": "22",
    "Text": "Learn the meaning of Surah Al Falaq and teach or share it with someone.\r\\n<br />\r\\nRecite Surah Al Falaq everyday for protection."
  },
  {
    "Title": "Ramadan Day 23 Deed",
    "Type": "deed_of_the_day",
    "Day": "23",
    "Text": "Make du'a using Allah's names.\r\\n<br />\r\\nExample:\r\\n<br />\r\\n<span class='arabic-text'>لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ\r\\nالْعَرْشِ الْعَظِيمِ لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ\r\\nالأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ\r\\n<br />\r\\n</span>There is no god but Allah, the Great, the Tolerant, there is no god but Allah, the Lord of the Magnificent Throne There is no god but Allah, the Lord of the Heaven and the earth, the Lord of the Edifying Throne."
  },
  {
    "Title": "Ramadan Day 24 Deed",
    "Type": "deed_of_the_day",
    "Day": "24",
    "Text": "Pray your fardh prayers in congregation, preferably at the mosque."
  },
  {
    "Title": "Ramadan Day 25 Deed",
    "Type": "deed_of_the_day",
    "Day": "25",
    "Text": "Visit your parents, siblings or relatives. If this is not possible, give them a call or send them a\r\\nmessage."
  },
  {
    "Title": "Ramadan Day 26 Deed",
    "Type": "deed_of_the_day",
    "Day": "26",
    "Text": "Seek forgiveness from Allah and make a list of bad habits that you would like to stop from now\r\\nonwards or after Ramadan ends."
  },
  {
    "Title": "Ramadan Day 27 Deed",
    "Type": "deed_of_the_day",
    "Day": "27",
    "Text": "Recite 100 times:\r\\n<br />\r\\n<span class='arabic-text'>سُبْحَانَ اللَّهِ وَبِحَمْدِهِ\r\\n<br />\r\\n</span>Allah is free from imperfection, and all praise is due to Him."
  },
  {
    "Title": "Ramadan Day 28 Deed",
    "Type": "deed_of_the_day",
    "Day": "28",
    "Text": "1. Stop the wrong that you are doing.\r\\n<br />\r\\n2. Ask Allah for forgiveness.\r\\n<br />\r\\n3. Repent - regret and intend to never do it again."
  },
  {
    "Title": "Ramadan Day 29 Deed",
    "Type": "deed_of_the_day",
    "Day": "29",
    "Text": "Recite 100 times:\r\\n<br />\r\\n<span class='arabic-text'>لاَ إِلَهَ إِلاَّ اللَّهُ\r\\n<br />\r\\n</span>There is no god but Allah."
  },
  {
    "Title": "Ramadan Day 3 Verse",
    "Type": "hadith_of_the_day",
    "Day": "3",
    "Text": "If you loan Allah a goodly loan, He will multiply it for you and forgive you. And Allah is [most]\r\\nAppreciative and Forebearing.\r\\n<br />\r\\n[At-Taghabun, 64:17]"
  },
  {
    "Title": "Ramadan Day 30 Deed",
    "Type": "deed_of_the_day",
    "Day": "30",
    "Text": "Pay Fitr charity (zakah).\r\\n<br />\r\\n\"Whoever distributes Fitr Charity before Eid prayer, it will be accepted as Fitr charity. Whoever distributes it after Eid prayer, his Fitr charity will be similar to ordinary charity.\"\r\\n<br />\r\\n[Ahmad, Ibn Majah]"
  },
  {
    "Title": "Ramadan Day 1 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "1",
    "Text": "Whoever seeks forgiveness for every male and female believer, Allah will record a good deed for him for every male and female believer.\r\\n<br />\r\\n[Tabarani]"
  },
  {
    "Title": "Ramadan Day 2 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "2",
    "Text": "Whoever recites a letter from the Book of Allah, he will receive one good deed as ten good\r\\ndeeds like it. I do not say that Alif Lam Meem is one letter, but rather Alif is a letter, Lam is a letter, and Meem is a letter.\r\\n<br />\r\\n[Tirmidhi]"
  },
  {
    "Title": "Ramadan Day 4 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "4",
    "Text": "He who supplicates for his brother behind his back (in his absence), the Angel commissioned (for carrying supplication to his Lord) says: Amen, and it is for you also.\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 5 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "5",
    "Text": "There is no servant who fasts a day in the way of Allah except that Allah will distance his\r\\nface from the Hellfire by a length of seventy years of travel.\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 6 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "6",
    "Text": "The best of you is the one who has the best character.\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 7 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "7",
    "Text": "The most beloved people to Allah are those who are most beneficial to the people.\r\\n<br />\r\\n[Ahmad]"
  },
  {
    "Title": "Ramadan Day 8 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "8",
    "Text": "The closest of people to me (Prophet <span class='arabic-text'>صلى الله عليه وسلم </span>) on the Day of Judgement will be those who\r\\nsend the most salah (blessings) to me.\r\\n<br />\r\\n[Tirmidhi]"
  },
  {
    "Title": "Ramadan Day 9 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "9",
    "Text": "Harithah bin Wahb narrated that the Messenger of Allah (<span class='arabic-text'>صلى الله عليه وسلم</span>) said:“Shall I not tell you\r\\nabout the people of Paradise? Every weak and oppressed one. Shall I not tell you about the people of Hell? Every harsh, haughty and arrogant one.”\r\\n<br />\r\\n[Ibn Majah]"
  },
  {
    "Title": "Ramadan Day 10 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "10",
    "Text": "He who has done a wrong affecting his brother's honour or anything else, let him ask his forgiveness today before the time (i.e., the Day of Resurrection) when he will have neither a dinar nor a dirham. If he has done some good deeds, a portion equal to his wrong doings will be subtracted from them; but if he has no good deeds, he will be burdened with the evil\r\\ndeeds of the one he had wronged in the same proportion. \r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 11 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "11",
    "Text": "This world is a prison for the believer and a paradise for the disbeliever.\r\\n<br />\r\\n[Sunan Ibn Majah]"
  },
  {
    "Title": "Ramadan Day 12 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "12",
    "Text": "Keep your rows straight for your rows resemble those of the angels. Join the shoulders and fill the gaps between yourselves, be gentle and soft in your brother's hands and do not leave\r\\nthe gaps for syaitan. He who connects a row, Allah will connect him (with His mercy).\r\\n<br />\r\\n[Musnad Ahmad]"
  },
  {
    "Title": "Ramadan Day 13 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "13",
    "Text": "He who observed the 'Isha' prayer in congregation, it was as if he prayed up to midnight, and he\r\\nwho prayed the morning prayer in congregation, it was as if he prayed the whole night.\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 14 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "14",
    "Text": "And (remember) when your Lord proclaimed, \"If you are grateful, I will surely increase you\r\\n(in favor), but if you deny, indeed, My punishment is severe.\"\r\\n<br />\r\\n[Ibrahim, 14:7]"
  },
  {
    "Title": "Ramadan Day 15 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "15",
    "Text": "Whoever takes a path upon which to obtain knowledge, Allah makes the path to Paradise\r\\neasy for him.\r\\n<br />\r\\n[Tirmidhi]"
  },
  {
    "Title": "Ramadan Day 16 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "16",
    "Text": "The servant is closest to his Lord during prostration, so increase your supplications therein.\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 17 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "17",
    "Text": "Every day two angels come down from Heaven and one of them says, 'O Allah! Compensate every person who spends in Your Cause,' and the other (angel) says, 'O Allah! Destroy every\r\\nmiser.\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 18 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "18",
    "Text": "When carried to his grave, a dead person is followed by three, two of which return (after his burial) and one remains with him: his relative, his property, and his deeds follow him; relatives and his property go back while his deeds remain with him.\"\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 20 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "20",
    "Text": "When the last ten days of Ramadan began, the Prophet (صلى الله عليه وسلم) used to stay up\r\\nat night, tighten his waist- wrap, and wake up his family (to pray).\r\\n<br />\r\\n[Sunan Ibn Majah]"
  },
  {
    "Title": "Ramadan Day 21 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "21",
    "Text": "Whoever established prayers on the night of Qadr out of sincere faith and hoping for a reward\r\\nfrom Allah, then all his previous sins will be forgiven; and whoever fasts in the month of\r\\nRamadan out of sincere faith, and hoping for a reward from Allah, then all his previous\r\\nsins will be forgiven.\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 22 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "22",
    "Text": "The best among you (Muslims) are those who learn the Qur'an and teach it.\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 23 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "23",
    "Text": "“And when My servants ask you, [O Muhammad, concerning Me - indeed I am near. I respond to\r\\nthe invocation of the supplicant when he calls upon Me. So let them respond to Me [by\r\\nobedience] and believe in Me that they may be [rightly] guided.”\r\\n<br />\r\\n[Al Baqarah 2:186]"
  },
  {
    "Title": "Ramadan Day 24 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "24",
    "Text": "The reward of the congregational prayer is twenty seven times greater (than that of the  prayer offered by a person alone).\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 25 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "25",
    "Text": "The person who severs the bond of kinship will not enter Jannah.\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 26 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "26",
    "Text": "Whoever loves the meeting with Allah, Allah too, loves the meeting with him; and whoever\r\\nhates the meeting with Allah, Allah too, hates the meeting with him.\r\\n<br />\r\\n[Al Bukhari]"
  },
  {
    "Title": "Ramadan Day 27 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "27",
    "Text": "He who recites <span class='arabic-text'>سُبْحَانَ ال لَّهِ وَبِحَمْدِهِ </span>in the morning and evening 100 times, will not be surpassed on\r\\nthe Day of Judgement by anyone with better deeds except the one who says the same\r\\nwords or more.\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 28 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "28",
    "Text": "Verily, when the slave (of Allah) commits a sin, a black spot appears on his heart. When he refrains from it, seeks forgiveness and repents, his heart is polished clean.\r\\n<br />\r\\n[Tirmidhi]"
  },
  {
    "Title": "Ramadan Day 29 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "29",
    "Text": "He whose last words are <span class='arabic-text'> لاَ إِلَهَ إِلاَّ اللَّهُ </span>will enter Paradise.\r\\n<br />\r\\n[Abu Dawood]"
  },
  {
    "Title": "Ramadan Day 30 Hadith",
    "Type": "hadith_of_the_day",
    "Day": "30",
    "Text": "Whoever observes the fast of Ramadan and follows it up with six fasts in Shawwal will be\r\\nrewarded as if he has fasted the entire year.\r\\n<br />\r\\n[Muslim]"
  },
  {
    "Title": "Ramadan Day 19 Hadith ",
    "Type": "hadith_of_the_day",
    "Day": "19",
    "Text": "Whoever does not give up forged speech and evil actions, Allah is not in need of his leaving his food and drink (i.e. Allah will not accept his fasting.)\r\\n<br />\r\\n[Al Bukhari]"
  }
]
