[
  {
    "SurahNumber": "89",
    "AyahNumber": "1",
    "NoteID": "6108",
    "Body": "Four striking contrasts are mentioned, to show Allah's\\n\\t\\t\\t\\tPower and Justice, and appeal to \"those who understand\".\\n\\t\\t\\t\\tThe first is the glory and mystery of the Break of Day.\\n\\t\\t\\t\\tIt just succeeds the deepest dark of the Night, when the\\n\\t\\t\\t\\tfirst rays of light break through. Few people except\\n\\t\\t\\t\\tthose actually in personal touch with nature can feel its\\n\\t\\t\\t\\tcompelling power. In respect both of beauty and terror,\\n\\t\\t\\t\\tof hope and inspiration, of suddenness and continuing\\n\\t\\t\\t\\tincrease of light and joy, this \"holy time\" of night may\\n\\t\\t\\t\\twell stand as the type of spiritual awakening from\\n\\t\\t\\t\\tdarkness to Faith, from Death to Resurrection."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "2",
    "NoteID": "6109",
    "Body": "By the Ten Nights are usually understood the first ten\\n\\t\\t\\t\\tnights of Zul-Hijja, the sacred season of Pilgrimage.\\n\\t\\t\\t\\tFrom the most ancient times Makkah was the centre of Arab\\n\\t\\t\\t\\tpilgrimage. The story of Abraham is intimately connected\\n\\t\\t\\t\\twith it: see ii. 125-127 and notes, also n. 217 to ii.\\n\\t\\t\\t\\t197. In times of Paganism various superstitions were\\n\\t\\t\\t\\tintroduced, which Islam swept away. Islam also purified\\n\\t\\t\\t\\tthe rites and ceremonies, giving them new meaning. The\\n\\t\\t\\t\\tten days specially devoted to the Hajj introduce a\\n\\t\\t\\t\\tstriking contrast in the life of Makkah and of the\\n\\t\\t\\t\\tpilgrims. Makkah, from being a quiet secluded city, is\\n\\t\\t\\t\\tthen thronged with thousands of pilgrims from all parts\\n\\t\\t\\t\\tof the world. They discard their ordinary\\n\\t\\t\\t\\tdress-representing every kind of costume-to the simple\\n\\t\\t\\t\\tand ordinary Ihram (n. 217); they refrain from every kind\\n\\t\\t\\t\\tof fighting and quarrel; they abstain from every kind of\\n\\t\\t\\t\\tluxury and self-indulgence; they hold all life sacred,\\n\\t\\t\\t\\thowever humble, except in the way of carefully-regulated\\n\\t\\t\\t\\tsacrifice; and they spend their nights in prayer and\\n\\t\\t\\t\\tmeditation."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "3",
    "NoteID": "6110",
    "Body": "The contrast between even and odd forms the subject of\\n\\t\\t\\t\\tlearned argument among those who deal with the properties\\n\\t\\t\\t\\tof numbers. In any case, even and odd follow each other\\n\\t\\t\\t\\tin regular succession: each is independent, and yet\\n\\t\\t\\t\\tneither is self-sufficient. In ultimate analysis every\\n\\t\\t\\t\\teven number is a pair of odd ones. And all things go in\\n\\t\\t\\t\\tpairs: see xxxvi. 36, and n. 3981. In the animal world\\n\\t\\t\\t\\tpairs are but two individuals, and yet each is a\\n\\t\\t\\t\\tcomplement of the other. Both abstract and concrete\\n\\t\\t\\t\\tthings are often understood in contrast with their\\n\\t\\t\\t\\topposites. Why should we not, in spiritual matters,\\n\\t\\t\\t\\tunderstand this life better with reference to the\\n\\t\\t\\t\\tHereafter, and why should we disbelieve in the Hereafter\\n\\t\\t\\t\\tsimply because we cannot conceive of anything different\\n\\t\\t\\t\\tfrom our present life?"
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "4",
    "NoteID": "6111",
    "Body": "That is, the last part of the night, just before full\\n\\t\\t\\t\\tday-light. Note the gradations: first, the turn of the\\n\\t\\t\\t\\tnight, when just the first rays of daylight break\\n\\t\\t\\t\\tthrough; secondly, the social and institutional rites of\\n\\t\\t\\t\\treligion, like those during the ten nights of Pilgrimage;\\n\\t\\t\\t\\tthirdly, when the usual contrast between the Here and\\n\\t\\t\\t\\tHereafter vanishes, and we can see heaven even here; and\\n\\t\\t\\t\\tlastly, when this world vanishes, the full light of Day\\n\\t\\t\\t\\tarrives, and we see Reality face to face."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "5",
    "NoteID": "6112",
    "Body": "All these Signs draw our attention, like solemn\\n\\t\\t\\t\\tadjurations in speech, to the profoundest mystery of our\\n\\t\\t\\t\\tinner life, viz., how from utter depths of\\n\\t\\t\\t\\tdarkness-ignorance or even degradation-Allah's wonderful\\n\\t\\t\\t\\tlight or Revelation can lead us by contrast into the most\\n\\t\\t\\t\\tbeautiful sunshine of a glorious spiritual Day. But the\\n\\t\\t\\t\\tcontrast suggest also the opposite process as a\\n\\t\\t\\t\\tcorollary,-how resistance to Allah's fight would destroy\\n\\t\\t\\t\\tus utterly, converting our greatness or glory to\\n\\t\\t\\t\\tperdition, as happened with the peoples of Arab\\n\\t\\t\\t\\tantiquity, the 'Ad and the Thamud, and the type of the\\n\\t\\t\\t\\tpowerful but arrogant and godless monarch, the Pharaoh of\\n\\t\\t\\t\\tEgypt. Like a man with a bounded horizon, the average man\\n\\t\\t\\t\\tdoes not understand these long-range mysteries of life,\\n\\t\\t\\t\\tand we have need to pray that we may be of \"those who\\n\\t\\t\\t\\tunderstand\"."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "6",
    "NoteID": "6113",
    "Body": "For the 'Ad see n. 1040 to vii. 65. They seem to have\\n\\t\\t\\t\\tpossessed an ancient civilisation, which succumbed when\\n\\t\\t\\t\\tthey persistently broke Allah's law."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "7",
    "NoteID": "6114",
    "Body": "Iram would seem to have been an ancient 'Ad capital, in\\n\\t\\t\\t\\tsouthern Arabia. It boasted of lofty architecture (\"lofty\\n\\t\\t\\t\\tpillars\"). Some Commentators understand Iram to be the\\n\\t\\t\\t\\tname of an eponymous hero of the 'Ad, in which case the\\n\\t\\t\\t\\tfollowing line, \"with lofty pillars\", should be construed\\n\\t\\t\\t\\t\"of lofty stature\". The 'Ad were a tall race."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "8",
    "NoteID": "6115",
    "Body": "This tract of southern Arabia was once very prosperous\\n\\t\\t\\t\\t(Arabia Felix) and contains ruins and inscriptions. It\\n\\t\\t\\t\\thas always been an object of great interest to the\\n\\t\\t\\t\\tArabia. In the time of Muawiya some precious stones were\\n\\t\\t\\t\\tfound among the ruins in this locality. Quite recently, a\\n\\t\\t\\t\\tbronze lion's head and a bronze piece of gutter with a\\n\\t\\t\\t\\tSabaean inscription, found in Najran, have been described\\n\\t\\t\\t\\tin the British Museum Quarterly, vol, XI, No. 4, Sept.\\n\\t\\t\\t\\t1937."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "9",
    "NoteID": "6116",
    "Body": "For the Thamud see n. 1043 to vi. 73. Their civilisation\\n\\t\\t\\t\\tshows traces of Egyptian, Syrian, and (later) Greek and\\n\\t\\t\\t\\tRoman influences. They built fine temples, tombs, and\\n\\t\\t\\t\\tbuildings cut out of the solid rock. The cult of the\\n\\t\\t\\t\\tgoddess Lat flourished among them."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "10",
    "NoteID": "6117",
    "Body": "For \"Lord of Stakes\", see xxxviii. 12, n 4160. For\\n\\t\\t\\t\\tPharaoh's arrogance and his fall see xx. 43, 78-79. The\\n\\t\\t\\t\\tthree examples given, the 'Ad, the Thamud, and Pharaoh,\\n\\t\\t\\t\\tshow that neither nations nor individuals, however\\n\\t\\t\\t\\tmighty, prosperous, or firmly established they may be,\\n\\t\\t\\t\\tcan live if they transgress the Law of Allah. The Law of\\n\\t\\t\\t\\tAllah, which is also the law of the higher nature which\\n\\t\\t\\t\\tHe has bestowed on us, made them in the first place great\\n\\t\\t\\t\\tand glorious: when they fell from it and \"heaped mischief\\n\\t\\t\\t\\ton mischief\", they were swept away."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "14",
    "NoteID": "6118",
    "Body": "Even though Allah's punishment is delayed, it is not to\\n\\t\\t\\t\\tbe supposed that He does not see all things. Allah's\\n\\t\\t\\t\\tprovidence is ever vigilant: His punishment of evil doers\\n\\t\\t\\t\\tis a form of justice to the weak and the righteous whom\\n\\t\\t\\t\\tthey oppress. It is part of the signification of His\\n\\t\\t\\t\\ttitle as Rabb (Cherisher)."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "15",
    "NoteID": "6119",
    "Body": "Contrast with Allah's justice and watchful care, man's\\n\\t\\t\\t\\tselfishness and pettiness. Allah tries us both by\\n\\t\\t\\t\\tprosperity and adversity: in the one we should show\\n\\t\\t\\t\\thumility and kindness; and in the other patience and\\n\\t\\t\\t\\tfaith. On the contrary, we get puffed up in prosperity\\n\\t\\t\\t\\tand depressed in adversity, putting false values on this\\n\\t\\t\\t\\tworld's goods."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "16",
    "NoteID": "6120",
    "Body": "Subsistence, in both the literal and the figurative\\n\\t\\t\\t\\tsense. Allah provides for all, but people complain if the\\n\\t\\t\\t\\tprovision is measured and restricted to their needs,\\n\\t\\t\\t\\tcircumstances, and antecedents, and does not come up to\\n\\t\\t\\t\\ttheir desires or expectations, or is different from that\\n\\t\\t\\t\\tgiven to people in quite different circumstances."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "17",
    "NoteID": "6121",
    "Body": "Even at our own valuation, if we are favoured with\\n\\t\\t\\t\\tsuperfluities, do we think of the fatherless children, or\\n\\t\\t\\t\\tthe stuggling poor? On the contrary, too many men are but\\n\\t\\t\\t\\tready to embezzle the helpless orphan's inheritance, and\\n\\t\\t\\t\\tto waste their own substance in worthless riot instead of\\n\\t\\t\\t\\tsupplying the people's real needs."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "18",
    "NoteID": "6122",
    "Body": "Kindness and generosity set up standards which even\\n\\t\\t\\t\\tworldly men feel bound to follow out of social\\n\\t\\t\\t\\tconsiderations even if they are not moved by higher\\n\\t\\t\\t\\tmotives. But the wicked find plausible excuses for their\\n\\t\\t\\t\\town hard-heartedness, and by their evil example choke up\\n\\t\\t\\t\\tthe springs of charity and kindness in others."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "19",
    "NoteID": "6123",
    "Body": "Inheritance is abused in two ways. (1) Guardians and\\n\\t\\t\\t\\ttrustees for the inheritance of minors or women or\\n\\t\\t\\t\\tpersons unable to look after their own interests should\\n\\t\\t\\t\\tfulfil their trusts with even more care than they devote\\n\\t\\t\\t\\tto their own interests. Instead of that they selfishly\\n\\t\\t\\t\\t\"devour\" the property. (2) Persons who inherit property\\n\\t\\t\\t\\tin their own rights should remember that in that case,\\n\\t\\t\\t\\ttoo, it is a sacred trust. They must use it for the\\n\\t\\t\\t\\tpurposes, objects, and duties which they also inherit. It\\n\\t\\t\\t\\tgives them no licence to live in idleness or waste their\\n\\t\\t\\t\\tdays in riotous show."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "21",
    "NoteID": "6124",
    "Body": "Our attention is now called to the Day of Reckoning.\\n\\t\\t\\t\\tWhether we failed to respect the rights of the helpless\\n\\t\\t\\t\\there or actually suppressed those rights in our mad love\\n\\t\\t\\t\\tfor the good things of this life, we shall have to answer\\n\\t\\t\\t\\tin the realm of Reality. This solid earth, which we\\n\\t\\t\\t\\timagine to be so real, will crumble to powder like dust\\n\\t\\t\\t\\tbefore the real Presence, manifested in glory."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "23",
    "NoteID": "6125",
    "Body": "The Retribution will at last come, and we shall realise\\n\\t\\t\\t\\tit in our inmost being, all the illusions of this\\n\\t\\t\\t\\tfleeting world having been swept away. Then we shall\\n\\t\\t\\t\\tremember, and wish, too late, that we had repented. Why\\n\\t\\t\\t\\tnot repent now? Why not bring forth the fruits of\\n\\t\\t\\t\\trepentance now, as a preparation for the Hereafter?"
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "25",
    "NoteID": "6126",
    "Body": "\"Chastisement\" in this verse and the \"binding in bonds\"\\n\\t\\t\\t\\tin the next verse are two distinct phases of the Penalty.\\n\\t\\t\\t\\t\"Chastisement\" involves pain and agony, such as cannot be\\n\\t\\t\\t\\timagined anywhere else, or from any other source, for it\\n\\t\\t\\t\\ttouches our inmost soul and cannot be compared with\\n\\t\\t\\t\\tanything our bodies may suffer or others may inflict.\\n\\t\\t\\t\\t\"Bonds\" imply confinement, want of freedom, the closing\\n\\t\\t\\t\\tof a door which was once open but which we deliberately\\n\\t\\t\\t\\tpassed by. We see that others accepted in faith and\\n\\t\\t\\t\\tentered that door. This shutting out of what might have\\n\\t\\t\\t\\tbeen is worse than any other bonds or confinement we can\\n\\t\\t\\t\\timagine, and may be worse than actual chastisement."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "27",
    "NoteID": "6127",
    "Body": "The righteous enter into their inheritance and receive\\n\\t\\t\\t\\ttheir welcome with a title that suggests freedom from all\\n\\t\\t\\t\\tpain, sorrow, doubt, struggle, disappointment, passion,\\n\\t\\t\\t\\tand even further desire; at rest, in peace; in a state of\\n\\t\\t\\t\\tcomplete satisfaction. In Muslim theology, this stage of\\n\\t\\t\\t\\tthe soul is the final stage of bliss. The unregenerate\\n\\t\\t\\t\\thuman soul, that seeks its satisfaction in the lower\\n\\t\\t\\t\\tearthly desires, is the Ammara (xii. 53). The\\n\\t\\t\\t\\tself-reproaching soul that feels conscious of sin and\\n\\t\\t\\t\\tresists it is the Lawwama (lxxv. 2, and n. 5810)."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "28",
    "NoteID": "6128",
    "Body": "Note that Evil finds itself isolated, and cries out in\\n\\t\\t\\t\\tlonely agony (verse 24), while Good receives a warm\\n\\t\\t\\t\\twelcome from the Lord of Goodness Himself,-also that it\\n\\t\\t\\t\\tis the soul which enters heaven, and not the gross body\\n\\t\\t\\t\\twhich perishes."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "30",
    "NoteID": "6129",
    "Body": "The climax of the whole is: \"Enter My Heaven!\" Men may\\n\\t\\t\\t\\thave imagined all kinds of heaven before, and many types\\n\\t\\t\\t\\tare used in the sacred Word itself. But nothing can\\n\\t\\t\\t\\texpress the reality itself better than \"My\\n\\t\\t\\t\\tHeaven\"-Allah's own Heaven! May we reach it through\\n\\t\\t\\t\\tAllah's grace!"
  }
]
