[
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "1",
    "Text": "O humanity! Be mindful of your Lord Who created you from a single soul, and from it He created its mate,<span class='fn' foot_note=28997>1</span>&nbsp;and through both He spread countless men and women. And be mindful of Allah&mdash;in Whose Name you appeal to one another&mdash;and &#761;honour&#762; family ties. Surely Allah is ever Watchful over you."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "2",
    "Text": "Give orphans their wealth &#761;when they reach maturity&#762;, and do not exchange your worthless possessions for their valuables, nor cheat them by mixing their wealth with your own. For this would indeed be a great sin."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "3",
    "Text": "If you fear you might fail to give orphan women their &#761;due&#762; rights &#761;if you were to marry them&#762;, then marry other women of your choice&mdash;two, three, or four. But if you are afraid you will fail to maintain justice, then &#761;content yourselves with&#762; one<span class='fn' foot_note=28998>1</span>&nbsp;or those &#761;bondwomen&#762; in your possession.<span class='fn' foot_note=28999>2</span>&nbsp;This way you are less likely to commit injustice."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "4",
    "Text": "Give women &#761;you wed&#762; their due dowries graciously. But if they waive some of it willingly, then you may enjoy it freely with a clear conscience."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "5",
    "Text": "Do not entrust the incapable &#761;among your dependants&#762; with your wealth which Allah has made a means of support for you&mdash;but feed and clothe them from it, and speak to them kindly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "6",
    "Text": "Test &#761;the competence of&#762; the orphans until they reach a marriageable age. Then if you feel they are capable of sound judgment, return their wealth to them. And do not consume it wastefully and hastily before they grow up &#761;to demand it&#762;. If the guardian is well-off, they should not take compensation; but if the guardian is poor, let them take a reasonable provision. When you give orphans back their property, call in witnesses. And sufficient is Allah as a &#761;vigilant&#762; Reckoner."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "7",
    "Text": "For men there is a share in what their parents and close relatives leave, and for women there is a share in what their parents and close relatives leave&mdash;whether it is little or much. &#761;These are&#762; obligatory shares."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "8",
    "Text": "If &#761;non-inheriting&#762; relatives, orphans,<span class='fn' foot_note=29000>1</span>&nbsp;or the needy are present at the time of distribution, offer them a &#761;small&#762; provision from it and speak to them kindly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "9",
    "Text": "Let the guardians be as concerned &#761;for the orphans&#762; as they would if they were to &#761;die and&#762; leave &#761;their own&#762; helpless children behind. So let them be mindful of Allah and speak equitably."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "10",
    "Text": "Indeed, those who unjustly consume orphans&rsquo; wealth &#761;in fact&#762; consume nothing but fire into their bellies. And they will be burned in a blazing Hell!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "11",
    "Text": "Allah commands you regarding your children: the share of the male will be twice that of the female.<span class='fn' foot_note=29001>1</span>&nbsp;If you leave only two &#761;or more&#762; females, their share is two-thirds of the estate. But if there is only one female, her share will be one-half. Each parent is entitled to one-sixth if you leave offspring.<span class='fn' foot_note=29002>2</span>&nbsp;But if you are childless and your parents are the only heirs, then your mother will receive one-third.<span class='fn' foot_note=29003>3</span>&nbsp;But if you leave siblings, then your mother will receive one-sixth<span class='fn' foot_note=29004>4</span>&mdash;after the fulfilment of bequests and debts.<span class='fn' foot_note=29005>5</span>&nbsp;&#761;Be fair to&#762; your parents and children, as you do not &#761;fully&#762; know who is more beneficial to you.<span class='fn' foot_note=29006>6</span>&nbsp;&#761;This is&#762; an obligation from Allah. Surely Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "12",
    "Text": "You will inherit half of what your wives leave if they are childless. But if they have children, then &#761;your share is&#762; one-fourth of the estate&mdash;after the fulfilment of bequests and debts. And your wives will inherit one-fourth of what you leave if you are childless. But if you have children, then your wives will receive one-eighth of your estate&mdash;after the fulfilment of bequests and debts. And if a man or a woman leaves neither parents nor children but only a brother or a sister &#761;from their mother&rsquo;s side&#762;, they will each inherit one-sixth, but if they are more than one, they &#761;all&#762; will share one-third of the estate<span class='fn' foot_note=29007>1</span>&mdash;after the fulfilment of bequests and debts without harm &#761;to the heirs&#762;.<span class='fn' foot_note=29008>2</span>&nbsp;&#761;This is&#762; a commandment from Allah. And Allah is All-Knowing, Most Forbearing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "13",
    "Text": "These &#761;entitlements&#762; are the limits set by Allah. Whoever obeys Allah and His Messenger will be admitted into Gardens under which rivers flow, to stay there forever. That is the ultimate triumph!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "14",
    "Text": "But whoever disobeys Allah and His Messenger and exceeds their limits will be cast into Hell, to stay there forever. And they will suffer a humiliating punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "15",
    "Text": "&#761;As for&#762; those of your women who commit illegal intercourse&mdash;call four witnesses from among yourselves. If they testify, confine the offenders to their homes until they die or Allah ordains a &#761;different&#762; way for them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "16",
    "Text": "And the two among you who commit this sin&mdash;discipline them. If they repent and mend their ways, relieve them. Surely Allah is ever Accepting of Repentance, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "17",
    "Text": "Allah only accepts the repentance of those who commit evil ignorantly &#761;or recklessly&#762; then repent soon after<span class='fn' foot_note=29009>1</span>&mdash;Allah will pardon them. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "18",
    "Text": "However, repentance is not accepted from those who knowingly persist in sin until they start dying, and then cry, &ldquo;Now I repent!&rdquo; nor those who die as disbelievers. For them We have prepared a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "19",
    "Text": "O believers! It is not permissible for you to inherit women against their will<span class='fn' foot_note=29010>1</span>&nbsp;or mistreat them to make them return some of the dowry &#761;as a ransom for divorce&#762;&mdash;unless they are found guilty of adultery.<span class='fn' foot_note=29011>2</span>&nbsp;Treat them fairly. If you happen to dislike them, you may hate something which Allah turns into a great blessing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "20",
    "Text": "If you desire to replace a wife with another and you have given the former &#761;even&#762; a stack of gold &#761;as a dowry&#762;, do not take any of it back. Would you &#761;still&#762; take it unjustly and very sinfully?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "21",
    "Text": "And how could you take it back after having enjoyed each other intimately and she has taken from you a firm commitment?<span class='fn' foot_note=29012>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "22",
    "Text": "Do not marry former wives of your fathers&mdash;except what was done previously. It was indeed a shameful, despicable, and evil practice."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "23",
    "Text": "&#761;Also&#762; forbidden to you for marriage are your mothers, your daughters, your sisters, your paternal and maternal aunts, your brother&rsquo;s daughters, your sister&rsquo;s daughters, your foster-mothers, your foster-sisters, your mothers-in-law, your stepdaughters under your guardianship if you have consummated marriage with their mothers&mdash;but if you have not, then you can marry them&mdash;nor the wives of your own sons, nor two sisters together at the same time&mdash;except what was done previously. Surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "24",
    "Text": "Also &#761;forbidden are&#762; married women&mdash;except &#761;female&#762; captives in your possession.<span class='fn' foot_note=29013>1</span>&nbsp;This is Allah&rsquo;s commandment to you. Lawful to you are all beyond these&mdash;as long as you seek them with your wealth in a legal marriage, not in fornication. Give those you have consummated marriage with their due dowries. It is permissible to be mutually gracious regarding the set dowry. Surely Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "25",
    "Text": "But if any of you cannot afford to marry a free believing woman, then &#761;let him marry&#762; a believing bondwoman possessed by one of you. Allah knows best &#761;the state of&#762; your faith &#761;and theirs&#762;. You are from one another.<span class='fn' foot_note=29014>1</span>&nbsp;So marry them with the permission of their owners,<span class='fn' foot_note=29015>2</span>&nbsp;giving them their dowry in fairness, if they are chaste, neither promiscuous nor having secret affairs. If they commit indecency after marriage, they receive half the punishment of free women.<span class='fn' foot_note=29016>3</span>&nbsp;This is for those of you who fear falling into sin. But if you are patient, it is better for you. And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "26",
    "Text": "It is Allah&rsquo;s Will to make things clear to you, guide you to the &#761;noble&#762; ways of those before you, and turn to you in mercy. For Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "27",
    "Text": "And it is Allah&rsquo;s Will to turn to you in grace, but those who follow their desires wish to see you deviate entirely &#761;from Allah&rsquo;s Way&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "28",
    "Text": "And it is Allah&rsquo;s Will to lighten your burdens, for humankind was created weak."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "29",
    "Text": "O believers! Do not devour one another&rsquo;s wealth illegally, but rather trade by mutual consent. And do not kill &#761;each other or&#762; yourselves. Surely Allah is ever Merciful to you."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "30",
    "Text": "And whoever does this sinfully and unjustly, We will burn them in the Fire. That is easy for Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "31",
    "Text": "If you avoid the major sins forbidden to you, We will absolve you of your &#761;lesser&#762; misdeeds and admit you into a place of honour.<span class='fn' foot_note=29017>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "32",
    "Text": "And do not crave what Allah has given some of you over others. Men will be rewarded according to their deeds and women &#761;equally&#762; according to theirs. Rather, ask Allah for His bounties. Surely Allah has &#761;perfect&#762; knowledge of all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "33",
    "Text": "And We have appointed heirs to what has been left by parents and next of kin. As for those you have made a pledge to, give them their share.<span class='fn' foot_note=29018>1</span>&nbsp;Surely Allah is a Witness over all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "34",
    "Text": "Men are the caretakers of women, as men have been provisioned by Allah over women and tasked with supporting them financially. And righteous women are devoutly obedient and, when alone, protective of what Allah has entrusted them with.<span class='fn' foot_note=29019>1</span>&nbsp;And if you sense ill-conduct from your women, advise them &#761;first&#762;, &#761;if they persist,&#762; do not share their beds, &#761;but if they still persist,&#762; then discipline them &#761;gently&#762;.<span class='fn' foot_note=29020>2</span>&nbsp;But if they change their ways, do not be unjust to them. Surely Allah is Most High, All-Great."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "35",
    "Text": "If you anticipate a split between them, appoint a mediator from his family and another from hers. If they desire reconciliation, Allah will restore harmony between them. Surely Allah is All-Knowing, All-Aware."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "36",
    "Text": "Worship Allah &#761;alone&#762; and associate none with Him. And be kind to parents, relatives, orphans, the poor, near and distant neighbours, close friends, &#761;needy&#762; travellers, and those &#761;bondspeople&#762; in your possession. Surely Allah does not like whoever is arrogant, boastful&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "37",
    "Text": "those who are stingy, promote stinginess among people, and withhold Allah&rsquo;s bounties. We have prepared for the disbelievers a humiliating punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "38",
    "Text": "Likewise for those who spend their wealth to show off and do not believe in Allah or the Last Day. And whoever takes Satan as an associate&mdash;what an evil associate they have!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "39",
    "Text": "What harm could have come to them if they had believed in Allah and the Last Day and donated from what Allah has provided for them? And Allah has &#761;perfect&#762; knowledge of them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "40",
    "Text": "Indeed, Allah never wrongs &#761;anyone&#762;&mdash;even by an atom&rsquo;s weight.<span class='fn' foot_note=29021>1</span>&nbsp;And if it is a good deed, He will multiply it many times over and will give a great reward out of His grace."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "41",
    "Text": "So how will it be when We bring a witness from every faith-community and bring you &#761;O Prophet&#762; as a witness against yours?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "42",
    "Text": "On that Day, those who denied &#761;Allah&#762; and disobeyed the Messenger will wish they were reduced to dust. And they will never be able to hide anything from Allah.<span class='fn' foot_note=29022>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "43",
    "Text": "O believers! Do not approach prayer while intoxicated<span class='fn' foot_note=29023>1</span>&nbsp;until you are aware of what you say, nor in a state of &#761;full&#762; impurity<span class='fn' foot_note=29024>2</span>&mdash;unless you merely pass through &#761;the mosque&#762;&mdash;until you have bathed. But if you are ill, on a journey, or have relieved yourselves, or been intimate with your wives and cannot find water, then purify yourselves with clean earth, wiping your faces and hands.<span class='fn' foot_note=29025>3</span>&nbsp;And Allah is Ever-Pardoning, All-Forgiving."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "44",
    "Text": "Have you &#761;O Prophet&#762; not seen those who were given a portion of the Scriptures yet trade it for misguidance and wish to see you deviate from the &#761;Right&#762; Path?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "45",
    "Text": "Allah knows best who your enemies are! And Allah is sufficient as a Guardian, and He is sufficient as a Helper."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "46",
    "Text": "Some Jews take words out of context and say, &ldquo;We listen and we disobey,&rdquo; &ldquo;Hear! May you never hear,&rdquo; and &ldquo;R&acirc;&rsquo;ina!&rdquo;&mdash;playing with words and discrediting the faith. Had they said &#761;courteously&#762;, &ldquo;We hear and obey,&rdquo; &ldquo;Listen to us,&rdquo; and &ldquo;Un&#7827;urna,&rdquo; it would have been better for them and more proper. Allah has condemned them for their disbelief, so they do not believe except for a few."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "47",
    "Text": "O you who were given the Book! Believe in what We have revealed&mdash;confirming your own Scriptures&mdash;before We wipe out &#761;your&#762; faces, turning them backwards, or We condemn the defiant as We did to the Sabbath-breakers.<span class='fn' foot_note=29026>1</span>&nbsp;And Allah&rsquo;s command is always executed!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "48",
    "Text": "Indeed, Allah does not forgive associating others with Him &#761;in worship&#762;,<span class='fn' foot_note=29027>1</span>&nbsp;but forgives anything else of whoever He wills. And whoever associates others with Allah has indeed committed a grave sin."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "49",
    "Text": "Have you &#761;O Prophet&#762; not seen those who &#761;falsely&#762; elevate themselves? It is Allah who elevates whoever He wills. And none will be wronged &#761;even by the width of&#762; the thread of a date stone."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "50",
    "Text": "See how they fabricate lies against Allah&mdash;this alone is a blatant sin."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "51",
    "Text": "Have you &#761;O Prophet&#762; not seen those who were given a portion of the Scriptures yet believe in idols and false gods and reassure the disbelievers<span class='fn' foot_note=29028>1</span>&nbsp;that they are better guided than the believers?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "52",
    "Text": "It is they who have been condemned by Allah. And whoever is condemned by Allah will have no helper."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "53",
    "Text": "Do they have control over shares of the kingdom? If so, they would not have given anyone so much as the speck on a date stone."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "54",
    "Text": "Or do they envy the people for Allah&rsquo;s bounties? Indeed, We have given the descendants of Abraham the Book and wisdom, along with great authority."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "55",
    "Text": "Yet some believed in him while others turned away from him.<span class='fn' foot_note=29029>1</span>&nbsp;Hell is sufficient as a torment!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "56",
    "Text": "Surely those who reject Our signs, We will cast them into the Fire. Whenever their skin is burnt completely, We will replace it so they will &#761;constantly&#762; taste the punishment. Indeed, Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "57",
    "Text": "As for those who believe and do good, We will admit them into Gardens under which rivers flow, to stay there for ever and ever. There they will have pure spouses,<span class='fn' foot_note=29030>1</span>&nbsp;and We will place them under a vast shade."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "58",
    "Text": "Indeed, Allah commands you to return trusts to their rightful owners;<span class='fn' foot_note=29031>1</span>&nbsp;and when you judge between people, judge with fairness. What a noble commandment from Allah to you! Surely Allah is All-Hearing, All-Seeing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "59",
    "Text": "O believers! Obey Allah and obey the Messenger and those in authority among you. Should you disagree on anything, then refer it to Allah and His Messenger, if you &#761;truly&#762; believe in Allah and the Last Day. This is the best and fairest resolution."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "60",
    "Text": "Have you &#761;O Prophet&#762; not seen those who claim they believe in what has been revealed to you and what was revealed before you? They seek the judgment of false judges, which they were commanded to reject. And Satan &#761;only&#762; desires to lead them farther away."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "61",
    "Text": "When it is said to them, &ldquo;Come to Allah&rsquo;s revelations and to the Messenger,&rdquo; you see the hypocrites turn away from you stubbornly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "62",
    "Text": "How &#761;horrible&#762; will it be if a disaster strikes them because of what their hands have done, then they come to you swearing by Allah, &ldquo;We intended nothing but goodwill and reconciliation.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "63",
    "Text": "&#761;Only&#762; Allah knows what is in their hearts. So turn away from them, caution them, and give them advice that will shake their very souls."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "64",
    "Text": "We only sent messengers to be obeyed by Allah&rsquo;s Will. If only those &#761;hypocrites&#762; came to you &#761;O Prophet&#762;&mdash;after wronging themselves&mdash;seeking Allah&rsquo;s forgiveness and the Messenger prayed for their forgiveness, they would have certainly found Allah ever Accepting of Repentance, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "65",
    "Text": "But no! By your Lord, they will never be &#761;true&#762; believers until they accept you &#761;O Prophet&#762; as the judge in their disputes, and find no resistance within themselves against your decision and submit wholeheartedly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "66",
    "Text": "If We had commanded them to sacrifice themselves or abandon their homes, none would have obeyed except for a few. Had they done what they were advised to do,<span class='fn' foot_note=29032>1</span>&nbsp;it would have certainly been far better for them and more reassuring,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "67",
    "Text": "and We would have granted them a great reward by Our grace"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "68",
    "Text": "and guided them to the Straight Path."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "69",
    "Text": "And whoever obeys Allah and the Messenger will be in the company of those blessed by Allah: the prophets, the people of truth, the martyrs, and the righteous&mdash;what honourable company!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "70",
    "Text": "This is Allah&rsquo;s favour, and Allah fully knows &#761;who deserves it&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "71",
    "Text": "O believers! Take your precautions and go forth either in groups or together."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "72",
    "Text": "There will be some among you who will lag behind so that if you face a disaster, they will say, &ldquo;Allah has blessed us for not being there among them.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "73",
    "Text": "But if you return with Allah&rsquo;s bounties, they will say&mdash;as if there had been no bond between you&mdash;&ldquo;We wish we had been there with them to share the great gain!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "74",
    "Text": "Let those who would sacrifice this life for the Hereafter fight in the cause of Allah. And whoever fights in Allah&rsquo;s cause&mdash;whether they achieve martyrdom or victory&mdash;We will honour them with a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "75",
    "Text": "And what is it with you? You do not fight in the cause of Allah and for oppressed men, women, and children who cry out, &ldquo;Our Lord! Deliver us from this land of oppressors! Appoint for us a saviour; appoint for us a helper&mdash;all by Your grace.&rdquo;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "76",
    "Text": "Believers fight for the cause of Allah, whereas disbelievers fight for the cause of the Devil. So fight against Satan&rsquo;s &#761;evil&#762; forces. Indeed, Satan&rsquo;s schemes are ever weak."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "77",
    "Text": "Have you &#761;O Prophet&#762; not seen those who had been told, &ldquo;Do not fight! Rather, establish prayer and pay alms-tax.&rdquo;? Then once the order came to fight, a group of them feared those &#761;hostile&#762; people as Allah should be feared&mdash;or even more. They said, &ldquo;Our Lord! Why have You ordered us to fight? If only You had delayed &#761;the order for&#762; us for a little while!&rdquo; Say, &#761;O Prophet,&#762; &ldquo;The enjoyment of this world is so little, whereas the Hereafter is far better for those mindful &#761;of Allah&#762;. And none of you will be wronged &#761;even by the width of&#762; the thread of a date stone."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "78",
    "Text": "Wherever you may be, death will overcome you&mdash;even if you were in fortified towers.&rdquo; When something good befalls them, they say, &ldquo;This is from Allah,&rdquo; but when something evil befalls them, they say, &ldquo;This is from you.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;Both have been destined by Allah.&rdquo; So what is the matter with these people? They can hardly comprehend anything!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "79",
    "Text": "Whatever good befalls you is from Allah and whatever evil befalls you is from yourself.<span class='fn' foot_note=29033>1</span>&nbsp;We have sent you &#761;O Prophet&#762; as a messenger to &#761;all&#762; people. And Allah is sufficient as a Witness."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "80",
    "Text": "Whoever obeys the Messenger has truly obeyed Allah. But whoever turns away, then &#761;know that&#762; We have not sent you &#761;O Prophet&#762; as a keeper over them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "81",
    "Text": "And they say, &ldquo;We obey,&rdquo; but when they leave you, a group of them would spend the night contradicting what they said. Allah records all their schemes. So turn away from them, and put your trust in Allah. And Allah is sufficient as a Trustee of Affairs."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "82",
    "Text": "Do they not then reflect on the Quran? Had it been from anyone other than Allah, they would have certainly found in it many inconsistencies."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "83",
    "Text": "And when they hear news of security or fear,<span class='fn' foot_note=29034>1</span>&nbsp;they publicize it. Had they referred it to the Messenger or their authorities, those with sound judgment among them would have validated it. Had it not been for Allah&rsquo;s grace and mercy, you would have followed Satan&mdash;except for a few."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "84",
    "Text": "So fight in the cause of Allah &#761;O Prophet&#762;. You are accountable for none but yourself. And motivate the believers &#761;to fight&#762;, so perhaps Allah will curb the disbelievers&rsquo; might. And Allah is far superior in might and in punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "85",
    "Text": "Whoever intercedes for a good cause will have a share in the reward, and whoever intercedes for an evil cause will have a share in the burden. And Allah is Watchful over all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "86",
    "Text": "And when you are greeted, respond with a better greeting or at least similarly. Surely Allah is a &#761;vigilant&#762; Reckoner of all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "87",
    "Text": "Allah, there is no god &#761;worthy of worship&#762; except Him. He will certainly gather &#761;all of&#762; you together on the Day of Judgment&mdash;about which there is no doubt. And whose word is more truthful than Allah&rsquo;s?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "88",
    "Text": "Why are you &#761;believers&#762; divided into two groups regarding the hypocrites while Allah allowed them to regress &#761;to disbelief&#762; because of their misdeeds? Do you wish to guide those left by Allah to stray? And whoever Allah leaves to stray, you will never find for them a way."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "89",
    "Text": "They wish you would disbelieve as they have disbelieved, so you may all be alike. So do not take them as allies unless they emigrate in the cause of Allah. But if they turn away, then seize them and kill them wherever you find them, and do not take any of them as allies or helpers,<span class='fn' foot_note=29035>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "90",
    "Text": "except those who are allies of a people you are bound with in a treaty or those wholeheartedly opposed to fighting either you or their own people. If Allah had willed, He would have empowered them to fight you. So if they refrain from fighting you and offer you peace, then Allah does not permit you to harm them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "91",
    "Text": "You will find others who wish to be safe from you and their own people. Yet they cannot resist the temptation &#761;of disbelief or hostility&#762;. If they do not keep away, offer you peace, or refrain from attacking you, then seize them and kill them wherever you find them. We have given you full permission over such people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "92",
    "Text": "It is not lawful for a believer to kill another except by mistake. And whoever kills a believer unintentionally must free a believing slave and pay blood-money to the victim&rsquo;s family&mdash;unless they waive it charitably. But if the victim is a believer from a hostile people, then a believing slave must be freed. And if the victim is from a people bound with you in a treaty, then blood-money must be paid to the family along with freeing a believing slave. Those who are unable, let them fast two consecutive months&mdash;as a means of repentance to Allah. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "93",
    "Text": "And whoever kills a believer intentionally, their reward will be Hell&mdash;where they will stay indefinitely.<span class='fn' foot_note=29036>1</span>&nbsp;Allah will be displeased with them, condemn them, and will prepare for them a tremendous punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "94",
    "Text": "O believers! When you struggle in the cause of Allah, be sure of who you fight. And do not say to those who offer you &#761;greetings of&#762; peace, &ldquo;You are no believer!&rdquo;&mdash;seeking a fleeting worldly gain.<span class='fn' foot_note=29037>1</span>&nbsp;Instead, Allah has infinite bounties &#761;in store&#762;. You were initially like them then Allah blessed you &#761;with Islam&#762;. So be sure! Indeed, Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "95",
    "Text": "Those who stay at home&mdash;except those with valid excuses<span class='fn' foot_note=29038>1</span>&mdash;are not equal to those who strive in the cause of Allah with their wealth and their lives. Allah has elevated in rank those who strive with their wealth and their lives above those who stay behind &#761;with valid excuses&#762;. Allah has promised each a fine reward, but those who strive will receive a far better reward than others&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "96",
    "Text": "far superior ranks, forgiveness, and mercy from Him. And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "97",
    "Text": "When the angels seize the souls of those who have wronged themselves<span class='fn' foot_note=29039>1</span>&mdash;scolding them, &ldquo;What do you think you were doing?&rdquo; they will reply, &ldquo;We were oppressed in the land.&rdquo; The angels will respond, &ldquo;Was Allah&rsquo;s earth not spacious enough for you to emigrate?&rdquo; It is they who will have Hell as their home&mdash;what an evil destination!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "98",
    "Text": "Except helpless men, women, and children who cannot afford a way out&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "99",
    "Text": "it is right to hope that Allah will pardon them. For Allah is Ever-Pardoning, All-Forgiving."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "100",
    "Text": "Whoever emigrates in the cause of Allah will find many safe havens and bountiful resources throughout the earth. Those who leave their homes and die while emigrating to Allah and His Messenger&mdash;their reward has already been secured with Allah. And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "101",
    "Text": "When you travel through the land, it is permissible for you to shorten the prayer<span class='fn' foot_note=29040>1</span>&mdash;&#761;especially&#762; if you fear an attack by the disbelievers. Indeed, the disbelievers are your sworn enemies."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "102",
    "Text": "When you &#761;O Prophet&#762; are &#761;campaigning&#762; with them and you lead them in prayer, let one group of them pray with you&mdash;while armed. When they prostrate themselves, let the other group stand guard behind them. Then the group that has not yet prayed will then join you in prayer&mdash;and let them be vigilant and armed.<span class='fn' foot_note=29041>1</span>&nbsp;The disbelievers would wish to see you neglect your weapons and belongings, so they could launch a sweeping assault on you. But there is no blame if you lay aside your weapons when overcome by heavy rain or illness&mdash;but take precaution. Indeed, Allah has prepared a humiliating punishment for the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "103",
    "Text": "When the prayers are over, remember Allah&mdash;whether you are standing, sitting, or lying down. But when you are secure, establish regular prayers. Indeed, performing prayers is a duty on the believers at the appointed times."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "104",
    "Text": "Do not falter in pursuit of the enemy&mdash;if you are suffering, they too are suffering. But you can hope to receive from Allah what they can never hope for. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "105",
    "Text": "Indeed, We have sent down the Book to you &#761;O Prophet&#762; in truth to judge between people by means of what Allah has shown you. So do not be an advocate for the deceitful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "106",
    "Text": "And seek Allah&rsquo;s forgiveness&mdash;indeed, Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "107",
    "Text": "Do not advocate for those who wrong themselves.<span class='fn' foot_note=29042>1</span>&nbsp;Surely Allah does not like those who are deceitful, sinful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "108",
    "Text": "They try to hide &#761;their deception&#762; from people, but they can never hide it from Allah&mdash;in Whose presence they plot by night what is displeasing to Him. And Allah is Fully Aware of what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "109",
    "Text": "Here you are! You &#761;believers&#762; are advocating for them in this life, but who will &#761;dare to&#762; advocate for them before Allah on the Day of Judgment? Or who will come to their defence?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "110",
    "Text": "Whoever commits evil or wrongs themselves then seeks Allah&rsquo;s forgiveness will certainly find Allah All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "111",
    "Text": "And whoever commits a sin&mdash;it is only to their own loss. Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "112",
    "Text": "And whoever commits an evil or sinful deed then blames it on an innocent person, they will definitely bear the guilt of slander and blatant sin."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "113",
    "Text": "Had it not been for Allah&rsquo;s grace and mercy, a group of them would have sought to deceive you &#761;O Prophet&#762;. Yet they would deceive none but themselves, nor can they harm you in the least. Allah has revealed to you the Book and wisdom and taught you what you never knew. Great &#761;indeed&#762; is Allah&rsquo;s favour upon you!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "114",
    "Text": "There is no good in most of their secret talks&mdash;except those encouraging charity, kindness, or reconciliation between people. And whoever does this seeking Allah&rsquo;s pleasure, We will grant them a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "115",
    "Text": "And whoever defies the Messenger after guidance has become clear to them and follows a path other than that of the believers, We will let them pursue what they have chosen, then burn them in Hell&mdash;what an evil end!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "116",
    "Text": "Surely Allah does not forgive associating &#761;others&#762; with Him &#761;in worship&#762;,<span class='fn' foot_note=29043>1</span>&nbsp;but forgives anything else of whoever He wills. Indeed, whoever associates &#761;others&#762; with Allah has clearly gone far astray."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "117",
    "Text": "Instead of Allah, they only invoke female gods<span class='fn' foot_note=29044>1</span>&nbsp;and they &#761;actually&#762; invoke none but a rebellious Satan&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "118",
    "Text": "cursed by Allah&mdash;who said, &ldquo;I will surely take hold of a certain number of Your servants."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "119",
    "Text": "I will certainly mislead them and delude them with empty hopes. Also, I will order them and they will slit the ears of cattle<span class='fn' foot_note=29045>1</span>&nbsp;and alter Allah&rsquo;s creation.&rdquo; And whoever takes Satan as a guardian instead of Allah has certainly suffered a tremendous loss."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "120",
    "Text": "Satan only makes them &#761;false&#762; promises and deludes them with &#761;empty&#762; hopes. Truly Satan promises them nothing but delusion."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "121",
    "Text": "It is they who will have Hell as their home, and they will find no escape from it!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "122",
    "Text": "And those who believe and do good, We will soon admit them into Gardens under which rivers flow, to stay there for ever and ever. Allah&rsquo;s promise is &#761;always&#762; true. And whose word is more truthful than Allah&rsquo;s?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "123",
    "Text": "&#761;Divine grace is&#762; neither by your wishes nor those of the People of the Book! Whoever commits evil will be rewarded accordingly, and they will find no protector or helper besides Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "124",
    "Text": "But those who do good&mdash;whether male or female&mdash;and have faith will enter Paradise and will never be wronged &#761;even as much as&#762; the speck on a date stone."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "125",
    "Text": "And who is better in faith than those who &#761;fully&#762; submit themselves to Allah, do good, and follow the Way of Abraham, the upright? Allah chose Abraham as a close friend."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "126",
    "Text": "To Allah &#761;alone&#762; belongs whatever is in the heavens and whatever is on the earth. And Allah is Fully Aware of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "127",
    "Text": "They ask you &#761;O Prophet&#762; regarding women. Say, &ldquo;It is Allah Who instructs you regarding them. Instruction has &#761;already&#762; been revealed in the Book<span class='fn' foot_note=29046>1</span>&nbsp;concerning the orphan women you deprive of their due rights<span class='fn' foot_note=29047>2</span>&nbsp;but still wish to marry, also helpless children, as well as standing up for orphans&rsquo; rights. And whatever good you do is certainly well known to Allah.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "128",
    "Text": "If a woman fears indifference or neglect from her husband, there is no blame on either of them if they seek &#761;fair&#762; settlement, which is best. Humans are ever inclined to selfishness.<span class='fn' foot_note=29048>1</span>&nbsp;But if you are gracious and mindful &#761;of Allah&#762;, surely Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "129",
    "Text": "You will never be able to maintain &#761;emotional&#762; justice between your wives&mdash;no matter how keen you are. So do not totally incline towards one leaving the other in suspense.<span class='fn' foot_note=29049>1</span>&nbsp;And if you do what is right and are mindful &#761;of Allah&#762;, surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "130",
    "Text": "But if they choose to separate, Allah will enrich both of them from His bounties. And Allah is Ever-Bountiful, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "131",
    "Text": "To Allah &#761;alone&#762; belongs whatever is in the heavens and whatever is on the earth. Indeed, We have commanded those given the Scripture before you, as well as you, to be mindful of Allah. But if you disobey, then &#761;know that&#762; to Allah belongs whatever is in the heavens and the earth. And Allah is Self-Sufficient, Praiseworthy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "132",
    "Text": "To Allah &#761;alone&#762; belongs whatever is in the heavens and whatever is on the earth. And Allah is sufficient as a Trustee of Affairs."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "133",
    "Text": "If it is His Will, He can remove you altogether, O &nbsp;humanity, and replace you with others. And Allah is Most Capable to do so."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "134",
    "Text": "Whoever desires the reward of this world, then &#761;let them know that&#762; with Allah are the rewards of this world and the Hereafter. And Allah is All-Hearing, All-Seeing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "135",
    "Text": "O believers! Stand firm for justice as witnesses for Allah even if it is against yourselves, your parents, or close relatives. Be they rich or poor, Allah is best to ensure their interests. So do not let your desires cause you to deviate &#761;from justice&#762;. If you distort the testimony or refuse to give it, then &#761;know that&#762; Allah is certainly All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "136",
    "Text": "O believers! Have faith in Allah, His Messenger, the Book He has revealed to His Messenger, and the Scriptures He revealed before. Indeed, whoever denies Allah, His angels, His Books, His messengers, and the Last Day has clearly gone far astray."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "137",
    "Text": "Indeed, those who believed then disbelieved, then believed and again disbelieved&mdash;&#761;only&#762; increasing in disbelief&mdash;Allah will neither forgive them nor guide them to the &#761;Right&#762; Way."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "138",
    "Text": "Give good news of a painful punishment to hypocrites,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "139",
    "Text": "who choose disbelievers as allies instead of the believers. Do they seek honour and power through that company? Surely all honour and power belongs to Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "140",
    "Text": "He has already revealed to you in the Book that when you hear Allah&rsquo;s revelations being denied or ridiculed, then do not sit in that company unless they engage in a different topic, or else you will be like them.<span class='fn' foot_note=29050>1</span>&nbsp;Surely Allah will gather the hypocrites and disbelievers all together in Hell."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "141",
    "Text": "&#761;The hypocrites are&#762; those who wait to see what happens to you. So if Allah grants you victory, they say &#761;to you&#762;, &ldquo;Were we not on your side?&rdquo; But if the disbelievers have a share &#761;of victory&#762;, they say &#761;to them&#762;, &ldquo;Did we not have the advantage over you, yet we protected you from the believers?&rdquo; Allah will judge between &#761;all of&#762; you on the Day of Judgment. And Allah will never grant the disbelievers a way over the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "142",
    "Text": "Surely the hypocrites seek to deceive Allah, but He outwits them. When they stand up for prayer, they do it half-heartedly only to be seen by people&mdash;hardly remembering Allah at all."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "143",
    "Text": "Torn between belief and disbelief&mdash;belonging neither to these &#761;believers&#762; nor those &#761;disbelievers&#762;. And whoever Allah leaves to stray, you will never find for them a way."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "144",
    "Text": "O believers! Do not take disbelievers as allies instead of the believers. Would you like to give Allah solid proof against yourselves?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "145",
    "Text": "Surely the hypocrites will be in the lowest depths of the Fire&mdash;and you will never find for them any helper&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "146",
    "Text": "except those who repent, mend their ways, hold fast to Allah, and are sincere in their devotion to Allah; they will be with the believers. And Allah will grant the believers a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "147",
    "Text": "Why should Allah punish you if you are grateful and faithful? Allah is ever Appreciative, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "148",
    "Text": "Allah does not like negative thoughts to be voiced&mdash;except by those who have been wronged.<span class='fn' foot_note=29051>1</span>&nbsp;Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "149",
    "Text": "Whether you reveal or conceal a good or pardon an evil&mdash;surely Allah is Ever-Pardoning, Most Capable."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "150",
    "Text": "Surely those who deny Allah and His messengers and wish to make a distinction between Allah and His messengers,<span class='fn' foot_note=29052>1</span>&nbsp;saying, &ldquo;We believe in some and disbelieve in others,&rdquo; desiring to forge a compromise,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "151",
    "Text": "they are indeed the true disbelievers. And We have prepared for the disbelievers a humiliating punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "152",
    "Text": "As for those who believe in Allah and His messengers&mdash;accepting all; rejecting none&mdash;He will surely give them their rewards. And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "153",
    "Text": "The People of the Book demand that you &#761;O Prophet&#762; bring down for them a revelation in writing from heaven.<span class='fn' foot_note=29053>1</span>&nbsp;They demanded what is even greater than this from Moses, saying, &ldquo;Make Allah visible to us!&rdquo; So a thunderbolt struck them for their wrongdoing. Then they took the calf for worship after receiving clear signs. Still We forgave them for that &#761;after their repentance&#762; and gave Moses compelling proof."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "154",
    "Text": "We raised the Mount over them &#761;as a warning&#762; for &#761;breaking&#762; their covenant and said, &ldquo;Enter the gate &#761;of Jerusalem&#762; with humility.&rdquo; We also warned them, &ldquo;Do not break the Sabbath,&rdquo; and took from them a firm covenant."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "155",
    "Text": "&#761;They were condemned&#762; for breaking their covenant, rejecting Allah&rsquo;s signs, killing the prophets unjustly, and for saying, &ldquo;Our hearts are unreceptive!&rdquo;<span class='fn' foot_note=29054>1</span>&mdash;it is Allah Who has sealed their hearts for their disbelief, so they do not believe except for a few&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "156",
    "Text": "and for their denial and outrageous accusation against Mary,<span class='fn' foot_note=29055>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "157",
    "Text": "and for boasting, &ldquo;We killed the Messiah, Jesus, son of Mary, the messenger of Allah.&rdquo; But they neither killed nor crucified him&mdash;it was only made to appear so.<span class='fn' foot_note=29056>1</span>&nbsp;Even those who argue for this &#761;crucifixion&#762; are in doubt. They have no knowledge whatsoever&mdash;only making&nbsp;assumptions. They certainly did not kill him."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "158",
    "Text": "Rather, Allah raised him up to Himself. And Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "159",
    "Text": "Every one of the People of the Book will definitely believe in him before his death.<span class='fn' foot_note=29057>1</span>&nbsp;And on the Day of Judgment Jesus will be a witness against them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "160",
    "Text": "We forbade the Jews certain foods that had been lawful to them for their wrongdoing, and for hindering many from the Way of Allah,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "161",
    "Text": "taking interest despite its prohibition, and consuming people&rsquo;s wealth unjustly. We have prepared for the disbelievers among them a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "162",
    "Text": "But those of them well-grounded in knowledge, the faithful &#761;who&#762; believe in what has been revealed to you &#761;O Prophet&#762; and what was revealed before you&mdash;&#761;especially&#762; those who establish prayer&mdash;and those who pay alms-tax and believe in Allah and the Last Day, to these &#761;people&#762; We will grant a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "163",
    "Text": "Indeed, We have sent revelation to you &#761;O Prophet&#762; as We sent revelation to Noah and the prophets after him. We also sent revelation to Abraham, Ishmael, Isaac, Jacob, and his descendants, &#761;as well as&#762; Jesus, Job, Jonah, Aaron, and Solomon. And to David We gave the Psalms."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "164",
    "Text": "There are messengers whose stories We have told you already and others We have not. And to Moses Allah spoke directly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "165",
    "Text": "&#761;All were&#762; messengers delivering good news and warnings so humanity should have no excuse before Allah after &#761;the coming of&#762; the messengers. And Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "166",
    "Text": "Yet &#761;if you are denied, O &nbsp;Prophet,&#762; Allah bears witness to what He has sent down to you&mdash;He has sent it with His knowledge. The angels too bear witness. And Allah &#761;alone&#762; is sufficient as a Witness."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "167",
    "Text": "Those who disbelieve and hinder &#761;others&#762; from the Way of Allah have certainly strayed far away."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "168",
    "Text": "Those who disbelieve and wrong themselves&mdash;surely Allah will neither forgive them nor guide them to any path"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "169",
    "Text": "except that of Hell, to stay there for ever and ever. And that is easy for Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "170",
    "Text": "O humanity! The Messenger has certainly come to you with the truth from your Lord, so believe for your own good. But if you disbelieve, then &#761;know that&#762; to Allah belongs whatever is in the heavens and the earth. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "171",
    "Text": "O People of the Book! Do not go to extremes regarding your faith; say nothing about Allah except the truth.<span class='fn' foot_note=29058>1</span>&nbsp;The Messiah, Jesus, son of Mary, was no more than a messenger of Allah and the fulfilment of His Word through Mary and a spirit &#761;created by a command&#762; from Him.<span class='fn' foot_note=29059>2</span>&nbsp;So believe in Allah and His messengers and do not say, &ldquo;Trinity.&rdquo; Stop!&mdash;for your own good. Allah is only One God. Glory be to Him! He is far above having a son! To Him belongs whatever is in the heavens and whatever is on the earth. And Allah is sufficient as a Trustee of Affairs."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "172",
    "Text": "The Messiah would never be too proud to be a servant of Allah, nor would the angels nearest to Allah. Those who are too proud and arrogant to worship Him will be brought before Him all together."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "173",
    "Text": "As for those who believe and do good, He will reward them in full and increase them out of His grace. But those who are too proud and arrogant, He will subject them to a painful punishment. And besides Allah they will find no protector or helper."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "174",
    "Text": "O humanity! There has come to you conclusive evidence from your Lord. And We have sent down to you a brilliant light."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "175",
    "Text": "As for those who believe in Allah and hold fast to Him, He will admit them into His mercy and grace and guide them to Himself through the Straight Path."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "4",
    "AyahNumber": "176",
    "Text": "They ask you &#761;for a ruling, O &nbsp;Prophet&#762;. Say, &ldquo;Allah gives you a ruling regarding those who die without children or parents.&rdquo; If a man dies childless and leaves behind a sister, she will inherit one-half of his estate, whereas her brother will inherit all of her estate if she dies childless. If this person leaves behind two sisters, they together will inherit two-thirds of the estate. But if the deceased leaves male and female siblings, a male&rsquo;s share will be equal to that of two females. Allah makes &#761;this&#762; clear to you so you do not go astray. And Allah has &#761;perfect&#762; knowledge of all things.<span class='fn' foot_note=29060>1</span>"
  }
]
