[
  {
    "SurahNumber": "11",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II. In the somewhat strange opinion of\\n\\t\\t\\t\\tSibawayh (cf. Manar XII, 3) and of Razi in his commentary\\n\\t\\t\\t\\ton this verse, the letters Alif-Lam-Ra represent the\\n\\t\\t\\t\\ttitle of this surah and ought therefore to be read in\\n\\t\\t\\t\\tconjunction with the following sentence, thus:\\n\\t\\t\\t\\t\"Alif-Lam-Ra is a divine writ...\", etc. However, this\\n\\t\\t\\t\\topinion conflicts sharply with that of several earlier\\n\\t\\t\\t\\tauthorities of great standing, e.g., Az-Zajjaj (quoted by\\n\\t\\t\\t\\tRazi), and is, moreover, unacceptable in view of the fact\\n\\t\\t\\t\\tthat a number of other surahs are preceded by such\\n\\t\\t\\t\\tletter-symbols without any syntactic possibility of their\\n\\t\\t\\t\\tbeing regarded as \"titles\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "According to Zamakhshari and Razi, the conjunction thumma\\n\\t\\t\\t\\tat the beginning of the clause thumma fussilat (lit.,\\n\\t\\t\\t\\t\"and then have been distinctly spelled out\") does not\\n\\t\\t\\t\\tdenote a sequence in time but, rather, a coordination of\\n\\t\\t\\t\\tqualities or conditions; therefore my rendering. As\\n\\t\\t\\t\\tregards my translation of the phrase uhkimat ayatuhu as\\n\\t\\t\\t\\t\"messages that have been made clear in and by\\n\\t\\t\\t\\tthemselves\", see the first sentence of  3:7  as well as\\n\\t\\t\\t\\tthe corresponding note [5], which explains the expression\\n\\t\\t\\t\\tayat muhkamat. Rashid Rida' interprets this phrase in the\\n\\t\\t\\t\\tsame sense (see Manar XII, 3f.)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "The conjunction an (\"that\") preceding the next sentence\\n\\t\\t\\t\\t(\"that you shall...\", etc.) is in this rendering\\n\\t\\t\\t\\texpressed by means of a colon. The interpolation, between\\n\\t\\t\\t\\tbrackets, of the words \"Say, O Prophet\" is necessitated\\n\\t\\t\\t\\tby the first-person construction of this sentence. The\\n\\t\\t\\t\\tsubsequent passage - up to the end of verse {4} -\\n\\t\\t\\t\\toutlines both the \"warning\" and the \"glad tidings\"\\n\\t\\t\\t\\treferred to above, and thus circumscribes elliptically\\n\\t\\t\\t\\tthe whole of the message entrusted to the Prophet."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "I.e., \"till the end of your lives\" (for an explanation of\\n\\t\\t\\t\\tthe term ajal musamma, see note [2] on  6:2 ). Since God,\\n\\t\\t\\t\\tin His unfathomable wisdom, does not always grant worldly\\n\\t\\t\\t\\thappiness and material benefits to everyone who believes\\n\\t\\t\\t\\tin Him and lives righteously, it is only reasonable to\\n\\t\\t\\t\\tassume - as Rashid Rida' does in Manar XII, 7 ff. - that\\n\\t\\t\\t\\tthe \"goodly enjoyment of life\" (i.e., in this world)\\n\\t\\t\\t\\tpromised in the above sentence relates to the community\\n\\t\\t\\t\\tof the believers as a whole, and not necessarily to\\n\\t\\t\\t\\tindividuals. (Cf.  3:139  - \"you are bound to rise high\\n\\t\\t\\t\\tif you are [truly] believers\".)"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "3",
    "NoteID": "5",
    "Body": "The noun fadl, when used with reference to God,\\n\\t\\t\\t\\tinvariably denotes \"bounty\" or \"favour\"; in its reference\\n\\t\\t\\t\\tto man, is usually signifies \"merit\" or, occasionally,\\n\\t\\t\\t\\t\"eminence\". The above verse makes it clear that, in\\n\\t\\t\\t\\tcontrast to the partial and often only moral rewards and\\n\\t\\t\\t\\tpunishments in the life of this world, God will, in the\\n\\t\\t\\t\\tlife to come, bestow the full measure of His favours upon\\n\\t\\t\\t\\teveryone who has acquired merit by virtue of his faith\\n\\t\\t\\t\\tand his actions. (Cf.  3:185  - \"only on the Day of\\n\\t\\t\\t\\tResurrection will you be requited in full for whatever\\n\\t\\t\\t\\tyou have done\".)"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "3",
    "NoteID": "6",
    "Body": "Lit., \"the suffering of a great Day\". See in this\\n\\t\\t\\t\\tconnection  9:128 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "Since the people referred to in this verse obviously do\\n\\t\\t\\t\\tnot believe in the divine origin of Muhammad's message,\\n\\t\\t\\t\\ttheir \"hiding from God\" can have, in this context, only\\n\\t\\t\\t\\tone meaning - namely, that of a metaphor for their\\n\\t\\t\\t\\tunwillingness to listen to the truth which emanates from\\n\\t\\t\\t\\tHim: and this also explains the statement that they are\\n\\t\\t\\t\\t\"enshrouding their hearts\" (lit., \"bosoms\", as at the end\\n\\t\\t\\t\\tof this verse), i.e., are allowing their hearts and minds\\n\\t\\t\\t\\tto remain wrapped-up in prejudices, thus making them\\n\\t\\t\\t\\timpervious to spiritual perception. See in this\\n\\t\\t\\t\\tconnection  8:55  and the corresponding note [58]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "5",
    "NoteID": "8",
    "Body": "The above interpolation corresponds to the meaning given\\n\\t\\t\\t\\tto the preceding phrase by most of the lexicographers\\n\\t\\t\\t\\t(cf. Lane VI, 2262)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "6",
    "NoteID": "9",
    "Body": "For this rendering of mustaqarr and mustawda', see note\\n\\t\\t\\t\\t[83] on  6:98 . The above reference to God's\\n\\t\\t\\t\\tall-embracing knowledge connects with the end of the\\n\\t\\t\\t\\tpreceding verse (\"He has full knowledge of all that is in\\n\\t\\t\\t\\tthe hearts of men\")."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "NoteID": "10",
    "Body": "As regards my rendering of ayyam (lit., \"days\") as\\n\\t\\t\\t\\t\"aeons\" and 'arsh as the \"throne of [God's]\\n\\t\\t\\t\\talmightiness\", see surah {7}, note [43]. The symbolic\\n\\t\\t\\t\\treference to \"the throne of His almightiness resting upon\\n\\t\\t\\t\\twater\" would seem to point to the God-willed evolution of\\n\\t\\t\\t\\tall life out of water - a fact clearly brought out by the\\n\\t\\t\\t\\tQur'an (see  21:30  and the corresponding note [39]) and\\n\\t\\t\\t\\tin modern times confirmed by biological research. This\\n\\t\\t\\t\\ttentative interpretation is strengthened by the mention,\\n\\t\\t\\t\\tin the preceding verse, of \"living creatures\". My\\n\\t\\t\\t\\tinterpolation, between brackets, of the phrase \"ever\\n\\t\\t\\t\\tsince He has willed to create life\" is in accordance with\\n\\t\\t\\t\\tthe views advanced by Rashid Rida' in his lengthy\\n\\t\\t\\t\\tcommentary on this verse (Manar XII, 16ff.)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "NoteID": "11",
    "Body": "The expression la'in (lit., \"indeed, if...\") appearing\\n\\t\\t\\t\\there as well as in each of the next three verses is meant\\n\\t\\t\\t\\tto stress the typical - i.e., recurrent - character of\\n\\t\\t\\t\\tthe situation to which it refers. In my opinion, it is\\n\\t\\t\\t\\tbest rendered as \"thus it is: if...\", etc."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "NoteID": "12",
    "Body": "The term sihr, which is often used in the sense of\r\\n\\t\\t\\t\\t\"sorcery\" or \"magic\", denotes, primarily, \"the turning of\r\\n\\t\\t\\t\\tsomething from its proper [i.e., natural] condition of\r\\n\\t\\t\\t\\tbeing into another condition\" (Taj al-'Arus); hence, it\r\\n\\t\\t\\t\\tsignifies any act which causes something that is false or\r\\n\\t\\t\\t\\tunreal to assume the appearance of reality. Since,\r\\n\\t\\t\\t\\thowever, the Qur'anic statement that \"you shall be raised\r\\n\\t\\t\\t\\tagain after death\" is not - as has been pointed out by\r\\n\\t\\t\\t\\tRazi - an \"act\" in the proper connotation of this word,\r\\n\\t\\t\\t\\tit would be illogical to assume that this statement could\r\\n\\t\\t\\t\\tbe characterized as \"sorcery\" even by those who do not\r\\n\\t\\t\\t\\tbelieve in it. On the other hand, it is obvious that they\r\\n\\t\\t\\t\\tdismiss it contemptuously as a mere \"enchanting delusion\"\r\\n\\t\\t\\t\\tintended to prevent those who are able to do so from\r\\n\\t\\t\\t\\tenjoying their worldly life to the full (Razi) or,\r\\n\\t\\t\\t\\talternatively, to induce the poor and unfortunate to\r\\n\\t\\t\\t\\tremain passively satisfied with their miserable lot on\r\\n\\t\\t\\t\\tearth: and this is the meaning of sihr in the above\r\\n\\t\\t\\t\\tcontext. (Cf.  10:2 , where the epithet sahir - in the\r\\n\\t\\t\\t\\tsense of \"spellbinder\" - is applied by unbelievers to the\r\\n\\t\\t\\t\\tProphet Muhammad.)"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "8",
    "NoteID": "13",
    "Body": "Lit., \"a time computed [by Us]\", i.e., the Day of\\n\\t\\t\\t\\tJudgment: a reference to the last sentence of verse {3}\\n\\t\\t\\t\\tabove, where the Prophet is made to say, \"I dread for you\\n\\t\\t\\t\\tthe suffering [which is bound to befall you] on that\\n\\t\\t\\t\\tawesome Day!\" Among the several meanings which the noun\\n\\t\\t\\t\\tummah comprises, that of \"time\" or \"a period of time\" is\\n\\t\\t\\t\\tthe most appropriate here (Zamakhshari, Ibn Kathir and\\n\\t\\t\\t\\tother classical commentators)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "8",
    "NoteID": "14",
    "Body": "For an explanation of this allusion to the attitude of\\n\\t\\t\\t\\tthe unbelievers, see  8:32  and  10:50 , as well as the\\n\\t\\t\\t\\tcorresponding notes; cf. also {6:57-58}. The repeated\\n\\t\\t\\t\\tQuranic references to the above derisive query are\\n\\t\\t\\t\\tevidently meant to show that the attitude of mind\\n\\t\\t\\t\\tresponsible for it is not restricted to an isolated\\n\\t\\t\\t\\thistoric incident (see surah {8}, note [32]) but is\\n\\t\\t\\t\\tsymptomatic of most, if not all, people \"who are bent on\\n\\t\\t\\t\\tdenying the truth\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "8",
    "NoteID": "15",
    "Body": "Lit., \"that which they were wont to deride enfolded them\\n\\t\\t\\t\\t(haqa bihim)\". According to almost all the commentators,\\n\\t\\t\\t\\tthe use of the past tense in the verb haqa, despite the\\n\\t\\t\\t\\tfact that it refers to the future, has the syntactic\\n\\t\\t\\t\\tvalue of a stress, implying the inevitability of the\\n\\t\\t\\t\\thappening to which it relates. (See also note [9] on\\n\\t\\t\\t\\t 6:10 .)"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "9",
    "NoteID": "16",
    "Body": "The sequence makes it clear that the generic term \"man\"\\n\\t\\t\\t\\treferred to in this and the next verse applies,\\n\\t\\t\\t\\tprimarily, to the agnostics who are either unconvinced of\\n\\t\\t\\t\\tthe existence of God or are \"bent upon denying the\\n\\t\\t\\t\\ttruth\"; in its wider implication, however, it applies\\n\\t\\t\\t\\talso to those who, while believing in God, are weak in\\n\\t\\t\\t\\tfaith and therefore easily swayed by external\\n\\t\\t\\t\\tcircumstances, and particularly by whatever happens to\\n\\t\\t\\t\\tthemselves."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "9",
    "NoteID": "17",
    "Body": "Lit., \"he is [or \"becomes\"] utterly hopeless\" or\\n\\t\\t\\t\\t\"despairing\" (ya'us), inasmuch as he attributes his past\\n\\t\\t\\t\\thappy state to a merely accidental chain of causes and\\n\\t\\t\\t\\teffects - in short, to what is commonly regarded as\\n\\t\\t\\t\\t\"luck\" - and not to God's grace. Hence, the term ya'us,\\n\\t\\t\\t\\tin its Qur'anic usage, is indicative of spiritual\\n\\t\\t\\t\\tnihilism."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "10",
    "NoteID": "18",
    "Body": "This combination of two words is necessary to bring out\\n\\t\\t\\t\\tthe full meaning of the noun na'ma' which occurs in this\\n\\t\\t\\t\\tform in the Qur'an only once. For my rendering of la'in\\n\\t\\t\\t\\tas \"thus it is: if...\", etc., see note [11] above."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "10",
    "NoteID": "19",
    "Body": "Lit., \"he is exultant beyond all measure, excessively\\n\\t\\t\\t\\tself-glorifying\" - i.e., he usually attributes the turn\\n\\t\\t\\t\\tof fortune to his own good qualities and his supposed\\n\\t\\t\\t\\t\"good luck\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "12",
    "NoteID": "20",
    "Body": "Lit., \"because thy bosom is constricted [for fear] lest\\n\\t\\t\\t\\tthey say\". According to all available authorities, the\\n\\t\\t\\t\\texpression la'alla (lit., \"it may well be that\") at the\\n\\t\\t\\t\\tbeginning of the above sentence denotes a wrong\\n\\t\\t\\t\\texpectation on the part of the opponents of Muhammad's\\n\\t\\t\\t\\tmessage; it is, therefore, best rendered in the form of a\\n\\t\\t\\t\\tquery which implies its own denial - thus: \"Is it\\n\\t\\t\\t\\tconceivable that...\", etc. As regards the expectation\\n\\t\\t\\t\\tthat the Prophet might omit a part of what was being\\n\\t\\t\\t\\trevealed to him, it has been reported by 'Abd Allah ibn\\n\\t\\t\\t\\t'Abbas and other Companions (see Razi's commentary on\\n\\t\\t\\t\\tthis verse) that the pagan Quraysh demanded of the\\n\\t\\t\\t\\tProphet, \"Bring us a revelation (kitab) which does not\\n\\t\\t\\t\\tcontain a defamation of our deities, so that we could\\n\\t\\t\\t\\tfollow thee and believe in thee.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "12",
    "NoteID": "21",
    "Body": "Explaining this verse, Ibn'Abbas mentions that some of\\n\\t\\t\\t\\tthe pagan chieftains of Mecca said \"O Muhammad, cause the\\n\\t\\t\\t\\tmountains of Mecca to be turned into gold, if thou art\\n\\t\\t\\t\\ttruly an apostle of God\", while others exclaimed\\n\\t\\t\\t\\tderisively, \"Bring before us angels who would bear\\n\\t\\t\\t\\twitness to thy being a prophet!\" - whereupon the above\\n\\t\\t\\t\\tverse was revealed (Razi). Cf.  6:8  and {17:90-93}."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "12",
    "NoteID": "22",
    "Body": "Sc., \"and so it is He who will cause the truth to\r\\n\\t\\t\\t\\tprevail\". Regarding the Prophet's denial of any ability\r\\n\\t\\t\\t\\ton his part to perform miracles, see  6:50  and the\r\\n\\t\\t\\t\\tcorresponding note [38]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "13",
    "NoteID": "23",
    "Body": "For my rendering of the particle am at the beginning of\\n\\t\\t\\t\\tthis sentence as \"and\", see surah {10}, note [61]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "13",
    "NoteID": "24",
    "Body": "I.e., that a divine writ like the Qur'an could have been\\n\\t\\t\\t\\t\"invented\" by a human being. Cf.  2:23 , {10:37-38} and\\n\\t\\t\\t\\t 17:88 , as well as the corresponding notes."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "14",
    "NoteID": "25",
    "Body": "Lit., \"if they [i.e., your poets and wise men] do not\\n\\t\\t\\t\\trespond to your call\". Cf.  2:24 , where a similar\\n\\t\\t\\t\\tchallenge is followed by the words, \"And if you cannot do\\n\\t\\t\\t\\tit - and most certainly you cannot do it - then...\", etc."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "14",
    "NoteID": "26",
    "Body": "Lit., \"only by God's knowledge\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "16",
    "NoteID": "27",
    "Body": "I.e., although their good deeds will be taken fully into\\n\\t\\t\\t\\taccount on Judgment Day, they will be outweighed by their\\n\\t\\t\\t\\trefusal to believe in resurrection and the life to come."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "28",
    "Body": "This interpolation is based on the interpretation given\\n\\t\\t\\t\\tby Baghawi, Zamakhshari and Razi."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "29",
    "Body": "Lit., \"which a witness from Him recites\", or \"announces\".\\n\\t\\t\\t\\tAccording to Zamakhshari, Razi and other classical\\n\\t\\t\\t\\tcommentators, this phrase refers to the Qur'an; hence my\\n\\t\\t\\t\\trendering of shahid as \"testimony\". If, as some\\n\\t\\t\\t\\tcommentators believe, this term refers to the Prophet or,\\n\\t\\t\\t\\talternatively, to the Angel Gabriel who transmitted the\\n\\t\\t\\t\\trevelation to him, shahid should be translated as\\n\\t\\t\\t\\t\"witness\". Whichever interpretation one adopts, the\\n\\t\\t\\t\\tmeaning remains the same, for - as Ibn Kathir points out\\n\\t\\t\\t\\tin his commentary on this verse - \"the Qur'an was\\n\\t\\t\\t\\trevealed through Gabriel to Muhammad, and was conveyed by\\n\\t\\t\\t\\tthe latter to the world\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "30",
    "Body": "Sc., \"and shall, therefore, attain to happiness in the\\n\\t\\t\\t\\thereafter\". The ijaz (elliptic mode of expression)\\n\\t\\t\\t\\temployed in this passage is comparable in its subtlety to\\n\\t\\t\\t\\tthat in  10:103 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "31",
    "Body": "I.e., in hostile, a-priori opposition to the message of\\n\\t\\t\\t\\tthe Qur'an, without really understanding its purport. The\\n\\t\\t\\t\\t\"historical\" identification, by some of the commentators,\\n\\t\\t\\t\\tof the ahzab with the pagan Arabs who leagued together in\\n\\t\\t\\t\\ttheir hostility to the Prophet is definitely too narrow\\n\\t\\t\\t\\tin this context."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "32",
    "Body": "Razi suggests that the conjunction fa (\"And so\")\\n\\t\\t\\t\\tpreceding this sentence (which is obviously addressed to\\n\\t\\t\\t\\tman in general) connects with verses {12-14} above: a\\n\\t\\t\\t\\tsuggestion which is most convincing in view of the\\n\\t\\t\\t\\tsequence."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "33",
    "Body": "Lit., \"but\" or \"nevertheless\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "18",
    "NoteID": "34",
    "Body": "This is a refutation of the contention of the unbelievers\\n\\t\\t\\t\\tthat the Qur'an was composed by Muhammad himself (cf.\\n\\t\\t\\t\\tverse {13} above as well as  10:17 ) and thereupon\\n\\t\\t\\t\\tblasphemously attributed to God."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "18",
    "NoteID": "35",
    "Body": "Lit., \"the witnesses\". Most of the earliest authorities\\n\\t\\t\\t\\ttake this to mean the recording angels, while others\\n\\t\\t\\t\\t(e.g., Ibn'Abbas, as quoted by Baghawi) relate it to the\\n\\t\\t\\t\\tprophets, who, on the Day of Judgment, will be called\\n\\t\\t\\t\\tupon to testify for or against the people to whom they\\n\\t\\t\\t\\twere sent. The latter interpretation is supported by\\n\\t\\t\\t\\tAd-Dahhak (quoted by Tabari and Baghawi) on the basis of\\n\\t\\t\\t\\t 16:84 , where witnesses \"out of every community\" are\\n\\t\\t\\t\\tmentioned - an expression which can obviously refer only\\n\\t\\t\\t\\tto human beings."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "18",
    "NoteID": "36",
    "Body": "Or: \"against their Sustainer\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "18",
    "NoteID": "37",
    "Body": "The term la'nah - which is usually, but inexactly,\\n\\t\\t\\t\\ttranslated as \"curse\" - is in its primary meaning\\n\\t\\t\\t\\tsynonymous with ib'ad (\"alienation\", \"estrangement\" or\\n\\t\\t\\t\\t\"banishment\") in the moral sense, hence it denotes\\n\\t\\t\\t\\t\"rejection from all that is good\" (Lisan al-'Arab) and,\\n\\t\\t\\t\\twith reference to God, the sinner's \"exclusion from His\\n\\t\\t\\t\\tgrace\" (Manar II, 50)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "19",
    "NoteID": "38",
    "Body": "Cf. {7:44-45}, with which the above passage is almost\\n\\t\\t\\t\\tidentical, with only one difference: whereas in  7:45 \\n\\t\\t\\t\\tthe pronoun \"they\" occurs only once (and the phrase is,\\n\\t\\t\\t\\tconsequently, rendered as \"and who refuse...\", etc.), in\\n\\t\\t\\t\\tthe present verse this pronoun is repeated, to express\\n\\t\\t\\t\\tboth stress and causality (\"since it is they, they who\\n\\t\\t\\t\\trefuse...\", etc.) - thus implying that their refusal to\\n\\t\\t\\t\\tbelieve in a life after death is the ultimate cause of\\n\\t\\t\\t\\ttheir wrongdoing. In other words, belief in resurrection,\\n\\t\\t\\t\\tGod's judgment and life in the hereafter is here\\n\\t\\t\\t\\tpostulated as the only valid and lasting source of human\\n\\t\\t\\t\\tmorality."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "20",
    "NoteID": "39",
    "Body": "The above interpolation is, I believe, necessary in view\\n\\t\\t\\t\\tof the highly elliptic character of this phrase.\\n\\t\\t\\t\\tAccording to Tabari, Zamakhshari and Ibn Kathir. the\\n\\t\\t\\t\\tmeaning is that whereas God's punishment may befall the\\n\\t\\t\\t\\tsinners referred to during their life on earth, it will\\n\\t\\t\\t\\tcertainly befall them in the hereafter. Cf. also  3:185 \\n\\t\\t\\t\\t- \"only on the Day of Resurrection will you be requited\\n\\t\\t\\t\\tin full for whatever you have done.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "20",
    "NoteID": "40",
    "Body": "For an explanation of the \"double suffering\", see surah\\n\\t\\t\\t\\t{7}, note [29]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "20",
    "NoteID": "41",
    "Body": "Lit., \"they were unable to hear and they did not see\":\\n\\t\\t\\t\\tcf.  2:7  and the corresponding note [7], as well as\\n\\t\\t\\t\\t 7:179 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "21",
    "NoteID": "42",
    "Body": "Lit., \"all that they were wont to invent\": a phrase which\\n\\t\\t\\t\\timplies not merely false imaginings regarding the\\n\\t\\t\\t\\texistence of any real \"power\" apart from God (i.e., the\\n\\t\\t\\t\\texistence of supposedly divine or semi-divine beings) but\\n\\t\\t\\t\\talso deceptive ideas and \"glittering half-truths meant to\\n\\t\\t\\t\\tdelude the mind\" (see  6:112  and the corresponding note)\\n\\t\\t\\t\\t- such as \"luck\", wealth, personal power, nationalism,\\n\\t\\t\\t\\tdeterministic materialism, etc. - all of which cause men\\n\\t\\t\\t\\tto lose sight of spiritual values and thus to \"squander\\n\\t\\t\\t\\ttheir own selves\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "24",
    "NoteID": "43",
    "Body": "Lit., \"two groups\" - i.e., the believers and those who\\n\\t\\t\\t\\treject the divine writ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "24",
    "NoteID": "44",
    "Body": "For my rendering, in this context, of mathal (lit.,\\n\\t\\t\\t\\t\"likeness\") as \"nature\", see the first part of note [47]\\n\\t\\t\\t\\ton  3:59 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "25",
    "NoteID": "45",
    "Body": "The conjunction \"and\" at the beginning of this sentence\\n\\t\\t\\t\\tapparently connects with the opening verses of this\\n\\t\\t\\t\\tsurah, and stresses the fact that the fundamental message\\n\\t\\t\\t\\tof the Qur'an is the same as that conveyed to man by the\\n\\t\\t\\t\\tearlier prophets (Manar XII, 59 f.); hence my\\n\\t\\t\\t\\tinterpolation. See also surah {7}, note [45]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "26",
    "NoteID": "46",
    "Body": "As in  7:59 , this may refer either to the imminent\\n\\t\\t\\t\\tdeluge or the Day of Judgment."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "27",
    "NoteID": "47",
    "Body": "As is evidenced by the histories of all the prophets -\\n\\t\\t\\t\\tand particularly that of Jesus and, after him, of\\n\\t\\t\\t\\tMuhammad - most of their early followers belonged to the\\n\\t\\t\\t\\tlowest classes of society - the slaves, the poor and the\\n\\t\\t\\t\\toppressed - to whom the divine message gave the promise\\n\\t\\t\\t\\tof an equitable social order on earth and the hope of\\n\\t\\t\\t\\thappiness in the hereafter: and it is precisely this\\n\\t\\t\\t\\trevolutionary character of every prophet's mission that\\n\\t\\t\\t\\thas always made it so distasteful to the upholders of the\\n\\t\\t\\t\\testablished order and the privileged classes of the\\n\\t\\t\\t\\tsociety concerned."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "27",
    "NoteID": "48",
    "Body": "Lit., \"We do not see in you any superiority [or \"merit\"]\\n\\t\\t\\t\\tover us.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "28",
    "NoteID": "49",
    "Body": "A reference to the cardinal Qur'anic doctrine that \"there\\n\\t\\t\\t\\tshall be no coercion in matters of faith\" ( 2:256 ), as\\n\\t\\t\\t\\twell as to the oft-repeated statement that a prophet is\\n\\t\\t\\t\\tno more than \"a warner and a bearer of glad tidings\",\\n\\t\\t\\t\\timplying that his duty consists only in delivering the\\n\\t\\t\\t\\tmessage entrusted to him. The plural \"we\" in this\\n\\t\\t\\t\\tsentence relates to Noah and his followers."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "29",
    "NoteID": "50",
    "Body": "This is an allusion to the contemptuous statement of the\\n\\t\\t\\t\\tunbelievers (in verse {27} above) that the followers of\\n\\t\\t\\t\\tNoah were to be found only among the lowest classes of\\n\\t\\t\\t\\ttheir society - thus indirectly implying that they might\\n\\t\\t\\t\\tperhaps lend ear to Noah if he would but rid himself of\\n\\t\\t\\t\\tthose people (cf.  26:111 ). The Prophet Muhammad had,\\n\\t\\t\\t\\tduring the early years of his mission, a similar\\n\\t\\t\\t\\texperience with the leaders of the pagan Quraysh; several\\n\\t\\t\\t\\tTraditions to this effect are quoted by Ibn Kathir in his\\n\\t\\t\\t\\tcommentary on  6:52 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "31",
    "NoteID": "51",
    "Body": "See  6:50  and  7:188 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "31",
    "NoteID": "52",
    "Body": "I.e., the poor and \"abject\" followers of Noah spoken of\\n\\t\\t\\t\\tin verse {27} (see also note [47] above)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "31",
    "NoteID": "53",
    "Body": "Lit., \"all that is within themselves\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "32",
    "NoteID": "54",
    "Body": "Sc., \"without convincing us\" (as is brought out fully in\\n\\t\\t\\t\\t{71:5-6}). The mounting annoyance with Noah on the part\\n\\t\\t\\t\\tof his unbelieving compatriots has already been alluded\\n\\t\\t\\t\\tto in his saying, \"If my presence [among you] and my\\n\\t\\t\\t\\tannouncement of God's messages are repugnant to you...\",\\n\\t\\t\\t\\tetc. (see  10:71 )."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "32",
    "NoteID": "55",
    "Body": "See the end of verse {26} above."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "34",
    "NoteID": "56",
    "Body": "According to some commentators, the expression an\r\\n\\t\\t\\t\\tyughwiyakum - which literally means \"that He shall cause\r\\n\\t\\t\\t\\tyou to err\" - is to be understood as \"that He shall\r\\n\\t\\t\\t\\tpunish you for your sins\" (Al-Hasan al-Basri, as quoted\r\\n\\t\\t\\t\\tby Razi), or \"that He shall destroy you\" (Tabari), or\r\\n\\t\\t\\t\\t\"that He shall deprive you of all good\" (Al-Jubba'i, as\r\\n\\t\\t\\t\\tquoted by Razi); this last interpretation is similar to\r\\n\\t\\t\\t\\tthe one adopted in my rendering of aghwaytani (\"Thou hast\r\\n\\t\\t\\t\\tthwarted me\") in  7:16  and explained in the\r\\n\\t\\t\\t\\tcorresponding note [11]. However, in the present context\r\\n\\t\\t\\t\\tI prefer the rendering \"if it be God's will that you\r\\n\\t\\t\\t\\tshall remain lost in grievous error\", in as much as it is\r\\n\\t\\t\\t\\tin conformity with the Qur'anic doctrine of \"God's way\"\r\\n\\t\\t\\t\\twith regard to those who persistently refuse to\r\\n\\t\\t\\t\\tacknowledge the truth (see surah {2}, note [7]). This\r\\n\\t\\t\\t\\tinterpretation is, moreover, supported by Zamakhshari in\r\\n\\t\\t\\t\\this commentary on the above verse: \"When God, knowing the\r\\n\\t\\t\\t\\tpersistence [in sinning] on the part of one who denies\r\\n\\t\\t\\t\\tthe truth (al-kafir), leaves him in this condition and\r\\n\\t\\t\\t\\tdoes not compel him [to repent], this [act of God] is\r\\n\\t\\t\\t\\tdescribed [in the Qur'an] as 'causing [one] to err'\r\\n\\t\\t\\t\\t(ighwa') and 'causing [one] to go astray' (idlal);\r\\n\\t\\t\\t\\tsimilarly, when He, knowing that a person will repent,\r\\n\\t\\t\\t\\tprotects him and is kind to him, this [act of God] is\r\\n\\t\\t\\t\\tdescribed as 'showing the right direction' (irshad) or\r\\n\\t\\t\\t\\t'[offering] guidance' (hidayah).\" (See also surah {14},\r\\n\\t\\t\\t\\tnote [4].)"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "35",
    "NoteID": "57",
    "Body": "Some of the classical commentators assume that this verse\\n\\t\\t\\t\\tforms part of the story of Noah and his people. This,\\n\\t\\t\\t\\thowever, is improbable in view of the sudden change from\\n\\t\\t\\t\\tthe past tense employed in the preceding and subsequent\\n\\t\\t\\t\\tverses (\"he said\", \"they said\") to the present tense (\"do\\n\\t\\t\\t\\tthey say\"). The only plausible explanation is that given\\n\\t\\t\\t\\tby Tabari and Ibn Kathir (and mentioned also by Baghawi\\n\\t\\t\\t\\ton the authority of Muqatil): namely, that the whole of\\n\\t\\t\\t\\tverse {35} is a parenthetic passage addressed to the\\n\\t\\t\\t\\tProphet Muhammad, relating in the first instance to the\\n\\t\\t\\t\\tstory of Noah as narrated in the Qur'an and, by\\n\\t\\t\\t\\timplication, to the Qur'an as such - in other words, a\\n\\t\\t\\t\\treiteration of the argument mentioned in verse {13} of\\n\\t\\t\\t\\tthis surah and in other places as well. This eminently\\n\\t\\t\\t\\tconvincing interpretation has also been adopted by Rashid\\n\\t\\t\\t\\tRida' (Manar XII, 71)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "35",
    "NoteID": "58",
    "Body": "Or: \"I have nothing to do with the sin of which you are\\n\\t\\t\\t\\tguilty\" - i.e., the sin of giving the lie to God's\\n\\t\\t\\t\\tmessages (cf.  10:41 ) or of inventing lies about God."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "37",
    "NoteID": "59",
    "Body": "I.e., \"under Our protection\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "37",
    "NoteID": "60",
    "Body": "This interpolation is necessitated by the definite\\n\\t\\t\\t\\tarticle preceding the noun fulk (lit., \"ship\", but\\n\\t\\t\\t\\trendered by me as \"ark\" owing to its familiar connotation\\n\\t\\t\\t\\tin European languages)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "38",
    "NoteID": "61",
    "Body": "Since it is obviously impossible to attribute to a\\n\\t\\t\\t\\tprophet the levity of scoffing (Baghawi), the meaning of\\n\\t\\t\\t\\tthe above phrase seems to be this: \"If you consider us\\n\\t\\t\\t\\tignorant because of what we believe and are doing, we\\n\\t\\t\\t\\tconsider you ignorant because of your refusal to\\n\\t\\t\\t\\tacknowledge the truth and your readiness to expose\\n\\t\\t\\t\\tyourselves to God's punishment\" (Zamakhshari and, in a\\n\\t\\t\\t\\tshorter form, Baghawi). Hence my interpolation of the\\n\\t\\t\\t\\twords \"and your ignorance\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "40",
    "NoteID": "62",
    "Body": "Lit., \"the face of the earth boiled over\" (fara\\n\\t\\t\\t\\t't-tannur). This phrase has been subject to several\\n\\t\\t\\t\\tconflicting interpretations, some of which are based on\\n\\t\\t\\t\\tno more than Talmudic legends (Manar XII, 75f.). The most\\n\\t\\t\\t\\tconvincing explanation is that given - among others - by\\n\\t\\t\\t\\tTabari, Baghawi and Ibn Kathir on the authority of Ibn\\n\\t\\t\\t\\t'Abbas and 'Ikrimah: \"At-tannur [lit., \"oven\"] denotes\\n\\t\\t\\t\\tthe face of the earth.\" Razi, too, mentions that \"the\\n\\t\\t\\t\\tArabs call the face of the earth tannur\", while the Qamus\\n\\t\\t\\t\\tgives as one of the meanings of tannur \"any place from\\n\\t\\t\\t\\twhich water gushes forth\". The verb fara - which\\n\\t\\t\\t\\tliterally means \"it boiled over\" - describes the raging\\n\\t\\t\\t\\ttorrents of water which \"turned the earth into springs\"\\n\\t\\t\\t\\t(Ibn Kathir; see also  54:12 ). This \"gushing forth of\\n\\t\\t\\t\\twater over the face of the earth\" seems to point to the\\n\\t\\t\\t\\tinundation of the huge valley now covered by the\\n\\t\\t\\t\\tMediterranean Sea (see surah {7}, note [47]) - an\\n\\t\\t\\t\\tinundation which, augmented by continuous, torrential\\n\\t\\t\\t\\trains (cf.  54:11 ), rapidly spread over the land-mass of\\n\\t\\t\\t\\tpresent-day Syria and northern 'Iraq and grew into the\\n\\t\\t\\t\\timmense deluge described in the Bible and in the Qur'an,\\n\\t\\t\\t\\tand also referred to in the myths of ancient Greece\\n\\t\\t\\t\\t(e.g., in the story of Deukalion and Pyrrhea), as well as\\n\\t\\t\\t\\tin Sumerian and Babylonian legends."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "40",
    "NoteID": "63",
    "Body": "The term zawj signifies, primarily, each of the two parts\\n\\t\\t\\t\\tof a pair, and is also used in the sense of \"a pair\". In\\n\\t\\t\\t\\tthe present context it obviously has the former meaning;\\n\\t\\t\\t\\tconsequently, the expression min kullin zawjayn ithnayn\\n\\t\\t\\t\\tis best rendered as above. - As regards the animals which\\n\\t\\t\\t\\tNoah was commanded to take with him in the ark, it is\\n\\t\\t\\t\\treasonable to assume that this referred to the\\n\\t\\t\\t\\tdomesticated animals already in his possession, and not\\n\\t\\t\\t\\tto all animals, as the Biblical narrative would have it."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "40",
    "NoteID": "64",
    "Body": "I.e., those who stand condemned in the sight of God\r\\n\\t\\t\\t\\tbecause of their persistent refusal to acknowledge the\r\\n\\t\\t\\t\\ttruth. See also verses {42-43} and {45-47}."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "42",
    "NoteID": "65",
    "Body": "The diminutive in ya bunayya (lit., \"O my little son\") is\\n\\t\\t\\t\\tan expression of endearment irrespective of a son's age:\\n\\t\\t\\t\\tfor instance, Noah's son appears in the above story as a\\n\\t\\t\\t\\tgrown man, while Joseph, similarly addressed by his\\n\\t\\t\\t\\tfather in  12:5 , was a child or, at the most, an\\n\\t\\t\\t\\tadolescent."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "44",
    "NoteID": "66",
    "Body": "This mountain, known in ancient Syriac as Qardu, is\\n\\t\\t\\t\\tsituated in the region of Lake Van, almost twenty-five\\n\\t\\t\\t\\tmiles north-east of the town Jazirat Ibn 'Umar, capital\\n\\t\\t\\t\\tof the modern Syrian district of Al-Jazirah. It \"owes its\\n\\t\\t\\t\\tfame to the Mesopotamian tradition which identifies it,\\n\\t\\t\\t\\tand not Mount Ararat, with the mountain on which Noah's\\n\\t\\t\\t\\tark rested.... This localization of the ark's\\n\\t\\t\\t\\tresting-place...is certainly based on Babylonian\\n\\t\\t\\t\\ttradition\" (Encyclopaedia of Islam I, 1059). We should,\\n\\t\\t\\t\\thowever, remember that the designation Ararat (the\\n\\t\\t\\t\\tAssyrian Urartu) at one time included the whole area to\\n\\t\\t\\t\\tthe south of Lake Van, in which Jabal Judi is situated:\\n\\t\\t\\t\\tthis might explain the Biblical statement that \"the ark\\n\\t\\t\\t\\trested...upon the mountains of Ararat\" (Genesis viii, 4)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "45",
    "NoteID": "67",
    "Body": "A reference to the divine command, mentioned in verse\\n\\t\\t\\t\\t{40} - \"Place on board this [ark]...thy family\" - which\\n\\t\\t\\t\\tNoah apparently understood as meaning that the whole of\\n\\t\\t\\t\\this family would be saved, thus overlooking the\\n\\t\\t\\t\\tqualifying clause, \"except those on whom sentence has\\n\\t\\t\\t\\talready been passed\". - Some of the commentators suppose\\n\\t\\t\\t\\tthat verses {45-47} connect with verse {43}, and thus\\n\\t\\t\\t\\tprecede, in point of time, the events narrated in verse\\n\\t\\t\\t\\t{44} - a supposition which has caused the modern\\n\\t\\t\\t\\ttranslators of the Qur'an to render Noah's prayer,\\n\\t\\t\\t\\terroneously, in the present tense (i.e., in the form of a\\n\\t\\t\\t\\tprayer for his son's rescue from drowning). It is,\\n\\t\\t\\t\\thowever, much more plausible to assume - as is done by\\n\\t\\t\\t\\tTabari and Ibn Kathir - that Noah's words were spoken\\n\\t\\t\\t\\tafter the ark had come to rest on Mount Judi (i.e., long\\n\\t\\t\\t\\tafter his son's death) and that they represented \"an\\n\\t\\t\\t\\tendeavour on the part of Noah to find out what would be\\n\\t\\t\\t\\tthe condition of his drowned son [in the hereafter]\" (Ibn\\n\\t\\t\\t\\tKathir). Consequently, the sentence relating to this son,\\n\\t\\t\\t\\tboth in Noah's prayer and in God's answer, must be\\n\\t\\t\\t\\trendered in the past tense."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "46",
    "NoteID": "68",
    "Body": "According to some commentators (e.g., Tabari and Razi),\\n\\t\\t\\t\\tthe phrase innahu 'amal ghayr salih relates to Noah's\\n\\t\\t\\t\\tprayer for his son, and constitutes a divine reproach -\\n\\t\\t\\t\\tin which case it should be rendered as \"verily, this\\n\\t\\t\\t\\t[prayer] is unrighteous conduct [on thy part]\". Others,\\n\\t\\t\\t\\thowever (e.g., Zamakhshari), reject this interpretation\\n\\t\\t\\t\\tand relate the above phrase to the son, in the manner\\n\\t\\t\\t\\trendered by me. This, I believe, is more in tune with the\\n\\t\\t\\t\\tstatement, \"he was not of thy family\" - i.e.,\\n\\t\\t\\t\\tspiritually, inasmuch as he was of, or preferred to\\n\\t\\t\\t\\tremain with, \"those who deny the truth\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "46",
    "NoteID": "69",
    "Body": "I.e., knowledge of the innermost reasons of God's decrees\\n\\t\\t\\t\\tand of the ultimate destiny of any human being in the\\n\\t\\t\\t\\thereafter: for, the answers to this \"why\" and this \"how\"\\n\\t\\t\\t\\tlie in the realm of things which are beyond the reach of\\n\\t\\t\\t\\thuman perception (al-ghayb)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "46",
    "NoteID": "70",
    "Body": "I.e., \"lest thou prove to be one of those ignorant who\\n\\t\\t\\t\\task God that He change His decrees in response to their\\n\\t\\t\\t\\town desires\" (Manar XII, 85 f.)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "48",
    "NoteID": "71",
    "Body": "The term salam - here translated as \"peace\" - comprises\\n\\t\\t\\t\\tthe notions of both external and internal security from\\n\\t\\t\\t\\tall that is evil. For a fuller explanation of the term,\\n\\t\\t\\t\\tsee surah {5}, note [29]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "48",
    "NoteID": "72",
    "Body": "The above interpolation is based on the consensus of most\\n\\t\\t\\t\\tof the classical commentators. The phrase \"the people [or\\n\\t\\t\\t\\t\"generations\"] from those who are with thee\" points to\\n\\t\\t\\t\\tgenerations as yet unborn; but since God's blessing\\n\\t\\t\\t\\textends to all believers, it eo ipso comprises the\\n\\t\\t\\t\\tbelievers of Noah's generation as well; and since \"those\\n\\t\\t\\t\\twho deny the truth\" (al-kafirun) are excluded from God's\\n\\t\\t\\t\\tblessing, only the righteous from among the offspring of\\n\\t\\t\\t\\tthese early believers are promised a share in His grace\\n\\t\\t\\t\\t(cf. a similar allusion, relating to Abraham's\\n\\t\\t\\t\\tdescendants, in  2:124 ): hence my interpolation of the\\n\\t\\t\\t\\twords \"as for the unrighteous that will spring from you\"\\n\\t\\t\\t\\tin the next sentence."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "49",
    "NoteID": "73",
    "Body": "See verse {35} above. Although the story of Noah had been\\n\\t\\t\\t\\tvaguely known to the Arabs even before the advent of the\\n\\t\\t\\t\\tProphet Muhammad, they - and the Prophet with them - were\\n\\t\\t\\t\\tentirely unaware of the details as narrated in the\\n\\t\\t\\t\\tpreceding Qur'anic account (Razi). The use of the plural\\n\\t\\t\\t\\tat the beginning of this parenthetic passage (\"These\\n\\t\\t\\t\\taccounts\") - in contrast with the singular form employed\\n\\t\\t\\t\\tin a similar phrase occurring in  3:44 ,  11:100  and\\n\\t\\t\\t\\t 12:102  (\"This account\") - seems, in my opinion, to\\n\\t\\t\\t\\tindicate that it refers not only to the preceding story\\n\\t\\t\\t\\tof Noah but also to the subsequent stories of other\\n\\t\\t\\t\\tprophets. In this connection it should be remembered -\\n\\t\\t\\t\\tand it cannot be stressed too often - that \"narrative\" as\\n\\t\\t\\t\\tsuch is never the purpose of the Qur'an. Whenever it\\n\\t\\t\\t\\trelates the stories of earlier prophets, or alludes to\\n\\t\\t\\t\\tancient legends or to historical events that took place\\n\\t\\t\\t\\tbefore the advent of Islam or during the lifetime of the\\n\\t\\t\\t\\tProphet, the aim is, invariably, a moral lesson; and\\n\\t\\t\\t\\tsince one and the same event, or even legend, has usually\\n\\t\\t\\t\\tmany facets revealing as many moral implications, the\\n\\t\\t\\t\\tQur'an reverts again and again to the same stories, but\\n\\t\\t\\t\\tevery time with a slight variation of stress on this or\\n\\t\\t\\t\\tthat aspect of the fundamental truths underlying the\\n\\t\\t\\t\\tQur'anic revelation as a whole."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "50",
    "NoteID": "74",
    "Body": "For particulars relating to the name Hud as well as the\\n\\t\\t\\t\\ttribe of 'Ad, see surah {7}, note [48]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "50",
    "NoteID": "75",
    "Body": "I.e., inventors of alleged deities that have no reality\\n\\t\\t\\t\\tin themselves (cf.  7:71 , which also relates to the\\n\\t\\t\\t\\tstory of Hud). Regarding the term muftarun, see surah\\n\\t\\t\\t\\t{7}, note [119]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "52",
    "NoteID": "76",
    "Body": "Lit., \"He will let loose  the sky over you with\\n\\t\\t\\t\\tabundance\". The term sama' - lit., \"sky\" - is often used\\n\\t\\t\\t\\tin classical Arabic as a metonym for \"rain\", and scarcity\\n\\t\\t\\t\\tof rains is a characteristic of the desert country called\\n\\t\\t\\t\\tAl-Ahqaf (\"The Sand-Dunes\"), the one-time habitat of the\\n\\t\\t\\t\\t- since vanished - tribe of 'Ad. As would appear from\\n\\t\\t\\t\\t 46:24 , the time to which the above passage alludes was\\n\\t\\t\\t\\ta period of severe drought, and so it is possible that\\n\\t\\t\\t\\tthe \"abundant blessings\" here denote rains."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "54",
    "NoteID": "77",
    "Body": "I.e., with madness."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "54",
    "NoteID": "78",
    "Body": "Or: \"that, verily, I am guiltless of your ascribing a\\n\\t\\t\\t\\tshare in [God's] divinity (mimma tushrikun)...\", etc. -\\n\\t\\t\\t\\tthus rejecting the sardonic suggestion of his compatriots\\n\\t\\t\\t\\tthat one of their imaginary deities might have stricken\\n\\t\\t\\t\\thim with madness."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "55",
    "NoteID": "79",
    "Body": "Cf. a very similar challenge in the last sentence of\\n\\t\\t\\t\\t 7:195 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "56",
    "NoteID": "80",
    "Body": "I.e., there is no living being over which He has not\\n\\t\\t\\t\\tcomplete control and which is not entirely dependent on\\n\\t\\t\\t\\tHim (cf. verse {6} of this surah). When describing a\\n\\t\\t\\t\\tperson's humility and subjection to another person, the\\n\\t\\t\\t\\tancient Arabs used to say, \"The forelock of so-and-so is\\n\\t\\t\\t\\tin the hand of so-and-so\". See in this connection\\n\\t\\t\\t\\t{96:15-16}, where this idiomatic expression occurs for\\n\\t\\t\\t\\tthe first time in the chronological order of Qur'anic\\n\\t\\t\\t\\trevelation."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "56",
    "NoteID": "81",
    "Body": "Lit., \"my Sustainer is on a straight way\" - implying that\\n\\t\\t\\t\\tHe governs all that exists in accordance with a system of\\n\\t\\t\\t\\ttruth and justice in the ultimate, absolute sense of\\n\\t\\t\\t\\tthese terms, never allowing the conscious evildoer to\\n\\t\\t\\t\\tescape the consequence of his deeds, and never letting\\n\\t\\t\\t\\trighteousness go unrewarded, either in this world or in\\n\\t\\t\\t\\tthe hereafter (since it is only in the combination of\\n\\t\\t\\t\\tthese two phases that human life can be considered in its\\n\\t\\t\\t\\tentirety)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "57",
    "NoteID": "82",
    "Body": "Lit., \"to succeed you\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "58",
    "NoteID": "83",
    "Body": "For the story of the destruction of the tribe of 'Ad\\n\\t\\t\\t\\tthrough violent storm-winds, see  54:19  and, more\\n\\t\\t\\t\\tparticularly, {69:6-8}."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "58",
    "NoteID": "84",
    "Body": "I.e., the suffering which was yet to befall the rest of\\n\\t\\t\\t\\tthe tribe of 'Ad. My addition, between brackets, of the\\n\\t\\t\\t\\twords \"in the life to come\" is based on the\\n\\t\\t\\t\\tinterpretation advanced by Tabari, Zamakhshari and Razi,\\n\\t\\t\\t\\taccording to whom the first mention of the saving of Hud\\n\\t\\t\\t\\tand his followers refers to the destruction of the people\\n\\t\\t\\t\\tof 'Ad in this world, and the second, to the latters'\\n\\t\\t\\t\\tchastisement in the hereafter."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "59",
    "NoteID": "85",
    "Body": "An allusion to \"the great ones among them, who refused to\\n\\t\\t\\t\\tacknowledge the truth\" ( 7:66 ). Regarding the above\\n\\t\\t\\t\\tinterpretation of the term jabbar, see note [58] on\\n\\t\\t\\t\\t 26:130 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "60",
    "NoteID": "86",
    "Body": "For my rendering of the term la'nah as \"[God's]\\n\\t\\t\\t\\trejection\", see note [37] above."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "61",
    "NoteID": "87",
    "Body": "A short account of the tribe of Thamud (the \"Second 'Ad\"\\n\\t\\t\\t\\tof pre-Islamic poetry) is found in surah {7}, note [56].\\n\\t\\t\\t\\tSalih is believed to have been the second prophet, after\\n\\t\\t\\t\\tHud, sent to the Arabs."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "61",
    "NoteID": "88",
    "Body": "I.e., out of organic substances which derive their\\n\\t\\t\\t\\tnourishment - and hence their capability of development,\\n\\t\\t\\t\\tproliferation and evolution - either directly or\\n\\t\\t\\t\\tindirectly from the earth (Razi). This is evidently also\\n\\t\\t\\t\\tthe meaning of the Qur'anic references to man as \"created\\n\\t\\t\\t\\tout of dust\" (cf.  3:59 ,  18:37 ,  22:5 , and  30:20 )."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "61",
    "NoteID": "89",
    "Body": "See  7:74  and the corresponding notes."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "61",
    "NoteID": "90",
    "Body": "See  2:186 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "62",
    "NoteID": "91",
    "Body": "Lit., \"Thou wert among us one in whom hope was placed ere\\n\\t\\t\\t\\tthis\": an allusion to Salih's outstanding intellect and\\n\\t\\t\\t\\tstrength of character, which had probably caused his\\n\\t\\t\\t\\ttribe to see in him their future leader - until he\\n\\t\\t\\t\\tstartled them by his passionate demand that they should\\n\\t\\t\\t\\tabandon their traditional beliefs and devote themselves\\n\\t\\t\\t\\tto the worship of the One God."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "62",
    "NoteID": "92",
    "Body": "Lit, \"we are indeed in disquieting doubt as to that to\r\\n\\t\\t\\t\\twhich thou invitest us\". It is to be borne in mind that\r\\n\\t\\t\\t\\tthe pre-Islamic Arabs regarded their gods, as well as the\r\\n\\t\\t\\t\\tangels (whom they believed to be \"God's daughters\"), as\r\\n\\t\\t\\t\\tlegitimate mediators between man and God, whose existence\r\\n\\t\\t\\t\\tas such they did not deny; consequently, they were\r\\n\\t\\t\\t\\tgreatly disturbed by their prophet's demand that they\r\\n\\t\\t\\t\\tshould abandon the worship of those allegedly divine or\r\\n\\t\\t\\t\\tsemi-divine beings. The above answer of the Thamud seems\r\\n\\t\\t\\t\\tto imply that they might consider Salih's claim to be a\r\\n\\t\\t\\t\\tprophet more favourably if he would but refrain from\r\\n\\t\\t\\t\\tinsisting that \"you have no deity other than Him\": a\r\\n\\t\\t\\t\\tsuggestion that fully explains Salih's retort in the next\r\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "63",
    "NoteID": "93",
    "Body": "I.e., \"if I were to suppress - in spite of all the\\n\\t\\t\\t\\tevidence obtained through divine revelation - the\\n\\t\\t\\t\\tfundamental truth that there is no deity save God, and\\n\\t\\t\\t\\tthat the ascribing of divinity or divine powers to anyone\\n\\t\\t\\t\\tor anything beside Him is an unforgivable sin\" (cf.\\n\\t\\t\\t\\t 4:48  and the corresponding note [65])."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "63",
    "NoteID": "94",
    "Body": "Lit., \"you do not add [anything] to me but perdition\".\\n\\t\\t\\t\\tAlthough this dialogue is related in the context of the\\n\\t\\t\\t\\tstory of Salih and the leaders of the Thamud, its\\n\\t\\t\\t\\timplications have - as is always the case with Qur'anic\\n\\t\\t\\t\\tstories and parables - a universal, timeless import. The\\n\\t\\t\\t\\tstress here is on the intrinsic impossibility of\\n\\t\\t\\t\\treconciling belief in the One God, whose omniscience and\\n\\t\\t\\t\\tomnipotence embraces all that exists, with an attribution\\n\\t\\t\\t\\tof divine or semi-divine qualities and functions to\\n\\t\\t\\t\\tanyone or anything else. The subtly-veiled suggestion of\\n\\t\\t\\t\\tthe Thamud (see note [92]) and its rejection by Salih has\\n\\t\\t\\t\\ta bearing on all religious attitudes based on a desire to\\n\\t\\t\\t\\t\"bring God closer to man\" through the interposition of\\n\\t\\t\\t\\talleged \"mediators\" between Him and man. In primitive\\n\\t\\t\\t\\treligions, this interposition led to the deification of\\n\\t\\t\\t\\tvarious forces of nature and, subsequently, to the\\n\\t\\t\\t\\tinvention of imaginary deities which were thought to act\\n\\t\\t\\t\\tagainst the background of an undefined, dimly-perceived\\n\\t\\t\\t\\tSupreme Power (for instance, the Moira of the ancient\\n\\t\\t\\t\\tGreeks). In higher religious concepts, this need for\\n\\t\\t\\t\\tmediation assumes the form of personified manifestations\\n\\t\\t\\t\\tof God through subordinate deities (as is the case, in\\n\\t\\t\\t\\tHinduism, with the personifications of the Absolute\\n\\t\\t\\t\\tBrahma of the Upanishads and the Vedanta in the forms of\\n\\t\\t\\t\\tVishnu or Shiva), or in His supposed incarnation in human\\n\\t\\t\\t\\tform (as represented in the Christian idea of Jesus as\\n\\t\\t\\t\\t\"God's son\" and the Second Person of the Trinity). And,\\n\\t\\t\\t\\tlastly, God is supposedly \"brought closer to man\" by the\\n\\t\\t\\t\\tinterposition of a hierarchy of saints, living or dead,\\n\\t\\t\\t\\twhose intercession is sought even by people who consider\\n\\t\\t\\t\\tthemselves to be \"monotheists\" - and this includes many\\n\\t\\t\\t\\tmisguided Muslims who do not realize that their belief in\\n\\t\\t\\t\\tsaints as \"mediators\" between men and God conflicts with\\n\\t\\t\\t\\tthe very essence of Islam. The ever-recurring Qur'anic\\n\\t\\t\\t\\tstress on the oneness and uniqueness of God, and the\\n\\t\\t\\t\\tcategorical denial of the idea that anyone or anything -\\n\\t\\t\\t\\twhether it be a concrete being or an abstract force -\\n\\t\\t\\t\\tcould have the least share in God's qualities or the\\n\\t\\t\\t\\tleast influence on the manner in which He governs the\\n\\t\\t\\t\\tuniverse aims at freeing man from the self-imposed\\n\\t\\t\\t\\tservitude to an imaginary hierarchy of \"mediating\\n\\t\\t\\t\\tpowers\", and at making him realize that \"wherever you\\n\\t\\t\\t\\tturn there is God's countenance\" (2:115), and that God is\\n\\t\\t\\t\\t\"[always] near, responding [to the call of whoever calls\\n\\t\\t\\t\\tunto Him]\" ( 2:186 ; also, in a condensed form, in verse\\n\\t\\t\\t\\t{61} of this surah)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "64",
    "NoteID": "95",
    "Body": "For an explanation of this passage, see surah {7}, note\\n\\t\\t\\t\\t[57]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "65",
    "NoteID": "96",
    "Body": "See surah {7}, note [61]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "65",
    "NoteID": "97",
    "Body": "Lit., \"promise\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "67",
    "NoteID": "98",
    "Body": "Lit., \"they became, in their homes, prostrate on the\r\\n\\t\\t\\t\\tground\". Ibn 'Abbas - as quoted by Razi - explains the\r\\n\\t\\t\\t\\tterm sayhah (lit., \"vehement cry\" or \"sound\") occurring\r\\n\\t\\t\\t\\tin this verse as a synonym of sa'iqah a \"thunderbolt\" or\r\\n\\t\\t\\t\\tthe \"sound of thunder\". Since the same event is described\r\\n\\t\\t\\t\\tin  7:78  as \"violent trembling\" (rajfah), which in that\r\\n\\t\\t\\t\\tcontext apparently denotes an earthquake, it is possible\r\\n\\t\\t\\t\\tthat the \"vehement sound\" mentioned here and in several\r\\n\\t\\t\\t\\tother places describes the subterranean rumbling which\r\\n\\t\\t\\t\\toften precedes and accompanies an earthquake and/or the\r\\n\\t\\t\\t\\tthunder-like noise of a volcanic eruption (see surah {7},\r\\n\\t\\t\\t\\tnote [62]). However, in view of the repeated use of this\r\\n\\t\\t\\t\\texpression in varying contexts, we may assume that it has\r\\n\\t\\t\\t\\tthe more general meaning of \"blast of punishment\" or - as\r\\n\\t\\t\\t\\tin  50:42 , where it indicates the Last Hour - of \"final\r\\n\\t\\t\\t\\tblast\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "69",
    "NoteID": "99",
    "Body": "The Qur'an does not state in so many words that these\r\\n\\t\\t\\t\\tguests of Abraham were angels; but since the term\r\\n\\t\\t\\t\\trusuluna (\"Our messengers\") is often used in the sense of\r\\n\\t\\t\\t\\theavenly messengers, all the classical commentators\r\\n\\t\\t\\t\\tinterpret it thus in the above context. For the contents\r\\n\\t\\t\\t\\tof the \"glad tiding\" referred to here, see verse {71}\r\\n\\t\\t\\t\\tbelow.-The reason for prefacing the story of Lot with an\r\\n\\t\\t\\t\\tepisode from Abraham's life lies in the latter's\r\\n\\t\\t\\t\\tsubsequent pleading in behalf of the sinful people of\r\\n\\t\\t\\t\\tSodom (verses {74-76}) and also, possibly, in God's\r\\n\\t\\t\\t\\tearlier promise to him, \"Behold, I shall make thee a\r\\n\\t\\t\\t\\tleader of men\" (see  2:124 ), which must have imbued him\r\\n\\t\\t\\t\\twith an enhanced sense of moral responsibility not only\r\\n\\t\\t\\t\\tfor his own family but also for the people with whom he\r\\n\\t\\t\\t\\twas indirectly connected through his nephew Lot (Lut in\r\\n\\t\\t\\t\\tArabic)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "69",
    "NoteID": "100",
    "Body": "Lit., \"and did not delay in bringing\". Regarding the\\n\\t\\t\\t\\tdeeper implications of the word \"peace\" (salam) as used\\n\\t\\t\\t\\tin this passage, see surah {5}, note [29]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "70",
    "NoteID": "101",
    "Body": "Lit., \"he did not know [what to make of] them and\\n\\t\\t\\t\\tconceived fear of them\". Since they were angels, they did\\n\\t\\t\\t\\tnot eat (contrary to the Biblical statement in Genesis\\n\\t\\t\\t\\txviii, 8); and since, in the Arabian tradition of\\n\\t\\t\\t\\thospitality, a stranger's refusal to partake of the food\\n\\t\\t\\t\\toffered him is an indication of unfriendly intent,\\n\\t\\t\\t\\tAbraham - who until then had not realized that his guests\\n\\t\\t\\t\\twere angels - became apprehensive of possible hostility\\n\\t\\t\\t\\ton their part."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "70",
    "NoteID": "102",
    "Body": "According to the Biblical account (not contradicted by\\n\\t\\t\\t\\tthe Qur'an), Lot, a son of Abraham's brother, lived to\\n\\t\\t\\t\\tthe east of the Jordan, in the vicinity of what is today\\n\\t\\t\\t\\tthe Dead Sea (called in Arabic Bahr Lut \"Lot's Sea\"). The\\n\\t\\t\\t\\t\"people of Lot\" were not actually the latter's community,\\n\\t\\t\\t\\tfor he - like Abraham - was a native of Ur in southern\\n\\t\\t\\t\\tBabylonia, and had migrated thence with his uncle: hence,\\n\\t\\t\\t\\tthroughout the Qur'an, the expression \"Lot's people\"\\n\\t\\t\\t\\tdesignates the inhabitants of the town (or country) of\\n\\t\\t\\t\\tSodom, among whom he had chosen to live, and with regard\\n\\t\\t\\t\\tto whom he was entrusted with a prophetic mission."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "71",
    "NoteID": "103",
    "Body": "I.e., on realizing that the strangers were God's\r\\n\\t\\t\\t\\tmessengers, and that she and Abraham had nothing to fear\r\\n\\t\\t\\t\\tfrom them (Zamakhshari): hence the interpolation of the\r\\n\\t\\t\\t\\twords \"with happiness\". This differs from the Biblical\r\\n\\t\\t\\t\\tstatement (Genesis xviii, 12-15), according to which\r\\n\\t\\t\\t\\tSarah \"laughed within herself\" at the announcement that\r\\n\\t\\t\\t\\tshe, an old woman, would give birth to a son: for in the\r\\n\\t\\t\\t\\tabove Qur'anic passage this announcement comes after the\r\\n\\t\\t\\t\\tstatement that she laughed, and is introduced by the\r\\n\\t\\t\\t\\tconjunctive fa, which in this context denotes \"and\r\\n\\t\\t\\t\\tthereupon\" or \"whereupon\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "72",
    "NoteID": "104",
    "Body": "This expression of grief obviously relates to her past\\n\\t\\t\\t\\tbarrenness as well as to her fear that this astonishing\\n\\t\\t\\t\\tannouncement might prove illusory."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "73",
    "NoteID": "105",
    "Body": "Lit., \"Art thou astonished at God's decree? - or: \"Dost\r\\n\\t\\t\\t\\tthou find God's decree strange?\" However, the real\r\\n\\t\\t\\t\\tmeaning of this rhetorical question can only be brought\r\\n\\t\\t\\t\\tout by paraphrasing it in the manner attempted by me:\r\\n\\t\\t\\t\\tnamely, as an echo of the statement, repeated several\r\\n\\t\\t\\t\\ttimes in the Qur'an: \"When God wills a thing to be, He\r\\n\\t\\t\\t\\tbut says unto it, 'Be' - and it is.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "74",
    "NoteID": "106",
    "Body": "According to all commentators, this means \"he pleaded\\n\\t\\t\\t\\t[lit., \"argued\"] with Our messengers\" (who, as is evident\\n\\t\\t\\t\\tfrom  29:31 , had announced to him the impending doom of\\n\\t\\t\\t\\tSodom and Gomorrah), and not with God Himself."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "77",
    "NoteID": "107",
    "Body": "Lit., \"he was straitened as regards the reach of his arm\\n\\t\\t\\t\\tin their behalf\" - an idiomatic phrase often used in\\n\\t\\t\\t\\tclassical Arabic, denoting here Lot's utter inability to\\n\\t\\t\\t\\tafford his guests protection from the people of Sodom,\\n\\t\\t\\t\\twhose homosexual propensities have ever since been\\n\\t\\t\\t\\tcommemorated in the term \"sodomy\". Since Lot thought that\\n\\t\\t\\t\\tthe strangers were no more than handsome young men, he\\n\\t\\t\\t\\tfelt certain that they would be sexually assaulted by his\\n\\t\\t\\t\\tsinful countrymen."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "78",
    "NoteID": "108",
    "Body": "Lit., \"towards him\" - but since their desire was\\n\\t\\t\\t\\tobviously directed at Lot's guests, and not at himself,\\n\\t\\t\\t\\tmy rendering would seem appropriate. It is to be noted\\n\\t\\t\\t\\tthat in its passive form, as used here, the verb yuhra'un\\n\\t\\t\\t\\tdoes not merely mean \"they came running\" but, rather,\\n\\t\\t\\t\\t\"running as if driven onward by some force\"\\n\\t\\t\\t\\t(Zamakhshari)- in this case, the force of their perverse\\n\\t\\t\\t\\tdesire."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "78",
    "NoteID": "109",
    "Body": "Most of the commentators are of the opinion that the\\n\\t\\t\\t\\tphrase \"these daughters of mine\" signifies here \"the\\n\\t\\t\\t\\tdaughters of my community\" (since a prophet is the\\n\\t\\t\\t\\tspiritual father of his people). But whether this is the\\n\\t\\t\\t\\tcase, or whether- as is more probable - Lot's words refer\\n\\t\\t\\t\\tto his actual daughters, there is no doubt that in their\\n\\t\\t\\t\\twider implication they point to the natural relationship\\n\\t\\t\\t\\tbetween man and woman as contrasted with the perverse\\n\\t\\t\\t\\tdesires of the men of Sodom."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "79",
    "NoteID": "110",
    "Body": "Lit., \"no claim whatever to thy daughters\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "80",
    "NoteID": "111",
    "Body": "Lit., \"or that I could betake myself to some mighty\\n\\t\\t\\t\\tsupport\". Although some of the commentators are of the\\n\\t\\t\\t\\topinion that this expression denotes \"tribal support\"\\n\\t\\t\\t\\t(which was, however, unavailable to Lot inasmuch as he\\n\\t\\t\\t\\twas a stranger in Sodom), we have a number of authentic\\n\\t\\t\\t\\tTraditions (extensively quoted by Tabarl) to the effect\\n\\t\\t\\t\\tthat what Lot meant was God's support: for the Prophet\\n\\t\\t\\t\\tMuhammad, referring to this Qur'anic passage, is reported\\n\\t\\t\\t\\tto have said \"God bestowed His grace upon Lot, for he\\n\\t\\t\\t\\tbetook himself indeed unto a mighty support!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "81",
    "NoteID": "112",
    "Body": "I.e., in an abstract sense, \"to what you are leaving\\n\\t\\t\\t\\tbehind\" (Razi)-evidently meaning the severing of all\\n\\t\\t\\t\\tassociations with the sinful city, and not a physical\\n\\t\\t\\t\\tlooking-back."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "81",
    "NoteID": "113",
    "Body": "Cf.  7:83  and the corresponding note, as well as\\n\\t\\t\\t\\t 66:10 , where it is mentioned that Lot's wife, who was\\n\\t\\t\\t\\tapparently a native of Sodom, had acted faithlessly\\n\\t\\t\\t\\ttowards her husband, i.e., had refused to believe in his\\n\\t\\t\\t\\tprophetic mission; and her story was thereupon\\n\\t\\t\\t\\t\"propounded as a parable of those who are bent on denying\\n\\t\\t\\t\\tthe truth\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "82",
    "NoteID": "114",
    "Body": "Lit., \"stones of sijjil\", which latter noun is regarded\\n\\t\\t\\t\\tby some philologists as the Arabicized form of the\\n\\t\\t\\t\\tPersian sang-i-gil (\"clay-stone\" or \"petrified clay\"):\\n\\t\\t\\t\\tcf. Qamus and Taj al-'Arus. If this supposition is\\n\\t\\t\\t\\tcorrect, the \"stones of petrified clay\" would be more or\\n\\t\\t\\t\\tless synonymous with \"brimstones\", which in its turn\\n\\t\\t\\t\\twould point to a volcanic eruption, probably in\\n\\t\\t\\t\\tconjunction with a severe earthquake (alluded to in the\\n\\t\\t\\t\\tpreceding phrase, \"We turned those [sinful towns] upside\\n\\t\\t\\t\\tdown\"). But there is also a strong probability, pointed\\n\\t\\t\\t\\tout by Zamakhshari and Razi, that the term sijjil is of\\n\\t\\t\\t\\tpurely Arabic origin - namely, a synonym of sijjil, which\\n\\t\\t\\t\\tprimarily signifies \"a writing\", and secondarily,\\n\\t\\t\\t\\t\"something that has been decreed\": in which case the\\n\\t\\t\\t\\texpression hijarah min sijjil can be understood in a\\n\\t\\t\\t\\tmetaphorical sense, namely, as \"stones of all the\\n\\t\\t\\t\\tchastisement laid down in God's decree\" (Zamakhshari and\\n\\t\\t\\t\\tRazi, both in conjunction with the above verse and in\\n\\t\\t\\t\\ttheir commentaries on  105:4 ). It is, I believe, this\\n\\t\\t\\t\\tmetaphorical meaning of \"stone-hard blows of chastisement\\n\\t\\t\\t\\tpre-ordained\", i.e., of God-willed doom, that the\\n\\t\\t\\t\\tconcluding sentence of the next verse alludes to."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "83",
    "NoteID": "115",
    "Body": "According to some of the earliest Qur'an-commentators\\n\\t\\t\\t\\t(e.g., Qatadah and 'Ikrimah, as quoted by Tabari), this\\n\\t\\t\\t\\tthreat of ultimate doom applies to evildoers of all times\\n\\t\\t\\t\\t- which further supports the assumption that the\\n\\t\\t\\t\\texpression hijarah min sijjil has a metaphorical\\n\\t\\t\\t\\tconnotation."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "84",
    "NoteID": "116",
    "Body": "See surah {7}, note [67]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "84",
    "NoteID": "117",
    "Body": "Thus, belief in the One God and justice in all dealings\r\\n\\t\\t\\t\\tbetween man and man (see surah {6}, note [150]) are here\r\\n\\t\\t\\t\\tplaced together as the twin postulates of all\r\\n\\t\\t\\t\\trighteousness. Some commentators assume that the people\r\\n\\t\\t\\t\\tof Madyan were of a particularly commercial bent of mind,\r\\n\\t\\t\\t\\tand given to fraudulent dealings. It is obvious, however,\r\\n\\t\\t\\t\\tthat the purport of this passage and of its sequence goes\r\\n\\t\\t\\t\\tfar beyond anything that might be construed by a purely\r\\n\\t\\t\\t\\t\"historical\" interpretation. What this version of\r\\n\\t\\t\\t\\tShu'ayb's story aims at is - as always in the Qur'an -\r\\n\\t\\t\\t\\tthe enunciation of a generally applicable principle of\r\\n\\t\\t\\t\\tethics: namely, the impossibility of one's being\r\\n\\t\\t\\t\\trighteous with regard to God unless one is righteous - in\r\\n\\t\\t\\t\\tboth the moral and social senses of this word - in the\r\\n\\t\\t\\t\\trealm of human relationships as well. This explains the\r\\n\\t\\t\\t\\tinsistence with which the above prohibition is re-stated\r\\n\\t\\t\\t\\tin a positive form, as an injunction, in the next verse."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "85",
    "NoteID": "118",
    "Body": "See surah {7}, note [68]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "86",
    "NoteID": "119",
    "Body": "I.e., the lasting merit achieved by virtue of good deeds\\n\\t\\t\\t\\tand fair dealings with one's fellow-men (cf. the\\n\\t\\t\\t\\texpression al-baqiyat as-salihat in  18:46  and  19:76 )."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "87",
    "NoteID": "120",
    "Body": "Lit., \"Do thy prayers command thee...\", etc."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "87",
    "NoteID": "121",
    "Body": "I.e., without regard to the rights and needs of others,\\n\\t\\t\\t\\tespecially the poor: hence their sarcastic reference, in\\n\\t\\t\\t\\tthe next sentence, to Shu'ayb's clemency and\\n\\t\\t\\t\\tright-mindedness."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "88",
    "NoteID": "122",
    "Body": "According to Zamakhshari, Razi and several other\\n\\t\\t\\t\\tcommentators, the clause interpolated here between\\n\\t\\t\\t\\tbrackets is elliptically implied in Shu'ayb's answer. His\\n\\t\\t\\t\\tstress on the fact that God has graced him amply with\\n\\t\\t\\t\\tworldly goods is meant to remind his countrymen that it\\n\\t\\t\\t\\tis not self-interest that causes him to ask them to be\\n\\t\\t\\t\\tfair in their dealings with their fellow-men."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "88",
    "NoteID": "123",
    "Body": "I.e., \"I do not aim at depriving you of what is\\n\\t\\t\\t\\trightfully yours\" - a reference to verse {85} above."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "89",
    "NoteID": "124",
    "Body": "As pointed out in surah {7}, note [67], the region\\n\\t\\t\\t\\tinhabited by Shu'ayb's people extended from what is known\\n\\t\\t\\t\\ttoday as the Gulf of 'Aqabah to the mountains of Moab,\\n\\t\\t\\t\\teast of the Dead Sea, in the vicinity of which Sodom and\\n\\t\\t\\t\\tGomorrah were situated."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "91",
    "NoteID": "125",
    "Body": "Cf.  6:25 . In the present instance, however, the\\n\\t\\t\\t\\tself-confessed lack of understanding on the part of the\\n\\t\\t\\t\\tpeople of Madyan may have a more subjective meaning,\\n\\t\\t\\t\\tsimilar to the half-indignant, half-embarrassed retort,\\n\\t\\t\\t\\t\"I don't know what you are talking about.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "91",
    "NoteID": "126",
    "Body": "Lit., \"we regard thee indeed as a weak one among us\" -\\n\\t\\t\\t\\ti.e., without any appreciable tribal support."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "92",
    "NoteID": "127",
    "Body": "In classical Arabic usage, as well as in the speech of\\n\\t\\t\\t\\tcertain bedouin tribes to this day, the phrase\\n\\t\\t\\t\\tittakhadhahu (or ja'lahu) zihriyyan (lit., \"he put him\\n\\t\\t\\t\\tbehind his back\") has the meaning of \"he held him in\\n\\t\\t\\t\\tcontempt\", or \"he forgot him\", or \"regarded him as\\n\\t\\t\\t\\tsomething that may be forgotten\". This last rendering\\n\\t\\t\\t\\tseems to be the most appropriate in the above context."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "94",
    "NoteID": "128",
    "Body": "See verse {67} of this surah and the corresponding note\\n\\t\\t\\t\\t[98]; also surah {7}, note [73]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "97",
    "NoteID": "129",
    "Body": "Lit., \"was not right-guided (rashid)\". The short passage\\n\\t\\t\\t\\tdealing with Pharaoh and his followers (verses {96-99})\\n\\t\\t\\t\\tconnects with, and amplifies, the reference to the tribe\\n\\t\\t\\t\\tof 'Ad, who \"followed the bidding of every arrogant enemy\\n\\t\\t\\t\\tof the truth\" (verse {59} of this surah). Thus, the main\\n\\t\\t\\t\\tpoint of this passage is the problem of immoral\\n\\t\\t\\t\\tleadership and, arising from it, the problem of man's\\n\\t\\t\\t\\tindividual, moral responsibility for wrongs committed in\\n\\t\\t\\t\\tobedience to a \"higher authority\". The Qur'an answers\\n\\t\\t\\t\\tthis question emphatically in the affirmative: the leader\\n\\t\\t\\t\\tand the led are equally guilty, and none can be absolved\\n\\t\\t\\t\\tof responsibility on the plea that he was but blindly\\n\\t\\t\\t\\tfollowing orders given by those above him. This indirect\\n\\t\\t\\t\\tallusion to man's relative free will - i.e., his freedom of\\n\\t\\t\\t\\tchoice between right and wrong - fittingly concludes the\\n\\t\\t\\t\\tstories of the earlier prophets and their wrongdoing\\n\\t\\t\\t\\tcommunities as narrated in this surah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "99",
    "NoteID": "130",
    "Body": "See note [37] on the last clause of verse {18} of this\\n\\t\\t\\t\\tsurah, as well as verse {60}, which refers in identical\\n\\t\\t\\t\\tterms to the destiny of the tribe of 'Ad."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "100",
    "NoteID": "131",
    "Body": "Lit., \"This of the accounts\" (a construction identical\\n\\t\\t\\t\\twith that employed in  3:44 ,  11:49  and  12:102 ),\\n\\t\\t\\t\\talluding to the fact that only certain aspects of the\\n\\t\\t\\t\\trelevant stories, and not the complete stories as such,\\n\\t\\t\\t\\tare presented here (cf. verse {120} below): the purpose\\n\\t\\t\\t\\tbeing, as always in the Qur'an, the illustration of an\\n\\t\\t\\t\\tethical principle or principles, and of men's varying\\n\\t\\t\\t\\treactions to the guidance which God offers them directly\\n\\t\\t\\t\\tthrough His prophets and indirectly through the\\n\\t\\t\\t\\tobservable phenomena of His creation (See in this\\n\\t\\t\\t\\tconnection the second part of note [73] on verse {49} of\\n\\t\\t\\t\\tthis surah.)"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "100",
    "NoteID": "132",
    "Body": "See preceding note."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "104",
    "NoteID": "133",
    "Body": "Lit., \"except till a term computed [by Us]\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "107",
    "NoteID": "134",
    "Body": "I.e., unless God wills to reprieve them (cf. the last\r\\n\\t\\t\\t\\tparagraph of  6:128  and the corresponding note [114], as\r\\n\\t\\t\\t\\twell as note [10] on  40:12 ). The phrase \"as long as the\r\\n\\t\\t\\t\\theavens and the earth endure\" has caused some perplexity\r\\n\\t\\t\\t\\tto most of the classical commentators in view of the many\r\\n\\t\\t\\t\\tQur'anic statements to the effect that the world as we\r\\n\\t\\t\\t\\tknow it will come to an end on the Last Day, which is\r\\n\\t\\t\\t\\tsynonymous with the Day of Resurrection. This difficulty,\r\\n\\t\\t\\t\\thowever, can be resolved if we remember - as Tabari\r\\n\\t\\t\\t\\tpoints out in his commentary on the above verse - that in\r\\n\\t\\t\\t\\tancient Arabic usage the expressions \"as long as the\r\\n\\t\\t\\t\\theavens and the earth endure\", or \"as long as night and\r\\n\\t\\t\\t\\tday alternate\", etc., were used metonymically in the\r\\n\\t\\t\\t\\tsense of \"time beyond count\" (abad). See also\r\\n\\t\\t\\t\\t{20:105-107} and the corresponding note [90], as well as\r\\n\\t\\t\\t\\tnote [63] on  14:48 ."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "108",
    "NoteID": "135",
    "Body": "I.e., unless God wills to bestow on them a yet greater\\n\\t\\t\\t\\treward (Razi; also Manar XII, 161); or - which to my mind\\n\\t\\t\\t\\tis more probable - unless He opens up to man a new, yet\\n\\t\\t\\t\\thigher stage of evolution."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "109",
    "NoteID": "136",
    "Body": "I.e., \"do not think that their beliefs are based on\\n\\t\\t\\t\\treason\": a reference, primarily, to the pagan Arabs who -\\n\\t\\t\\t\\tlike the wrongdoers spoken of in the preceding passages -\\n\\t\\t\\t\\trejected God's message on the plea that it conflicted\\n\\t\\t\\t\\twith their ancestral beliefs, and more generally, to all\\n\\t\\t\\t\\tpeople who are accustomed to worship (in the widest sense\\n\\t\\t\\t\\tof this word) false values handed down from their\\n\\t\\t\\t\\tancestors and who, consequently, observe false standards\\n\\t\\t\\t\\tof morality: an attitude which must unavoidably - as the\\n\\t\\t\\t\\tlast sentence of this verse shows - result in future\\n\\t\\t\\t\\tsuffering, be it in this world or in the hereafter, or in\\n\\t\\t\\t\\tboth."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "109",
    "NoteID": "137",
    "Body": "Lit., \"We shall repay them their portion in full,\\n\\t\\t\\t\\tundiminished\". For an explanation of this sentence, see\\n\\t\\t\\t\\tnote [27] on verses {15-16} of this surah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "110",
    "NoteID": "138",
    "Body": "Lit., \"and it was disagreed upon\", or \"discordant views\\n\\t\\t\\t\\tcame to be held about it\": meaning that, like Muhammad's\\n\\t\\t\\t\\tearly contemporaries, some of Moses' people accepted the\\n\\t\\t\\t\\tdivine writ, whereas others refused to submit to its\\n\\t\\t\\t\\tguidance."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "110",
    "NoteID": "139",
    "Body": "Lit., \"it would indeed have been decided between them\" -\\n\\t\\t\\t\\ti.e., they would have been punished, like those\\n\\t\\t\\t\\tcommunities of old, by utter destruction, had it not been\\n\\t\\t\\t\\tfor God's decree (kalimah, lit., \"word\") that their\\n\\t\\t\\t\\tpunishment should be deferred until the Day of\\n\\t\\t\\t\\tResurrection (cf. the last sentence of  10:93  and the\\n\\t\\t\\t\\tcorresponding note [114])."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "110",
    "NoteID": "140",
    "Body": "Cf.  2:55  - \"O Moses, indeed we shall not believe thee\\n\\t\\t\\t\\tuntil we see God face to face!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "112",
    "NoteID": "141",
    "Body": "Explaining this injunction, expressed in the second\r\\n\\t\\t\\t\\tperson plural, Ibn Kathir points out that it is addressed\r\\n\\t\\t\\t\\tto all believers, and that it refers to their behaviour\r\\n\\t\\t\\t\\ttowards everyone, be he believer or unbeliever; in this\r\\n\\t\\t\\t\\the obviously relies on the interpretation advanced by Ibn\r\\n\\t\\t\\t\\t'Abbas (and quoted by Razi): \"It means, 'Be humble before\r\\n\\t\\t\\t\\tGod and do not behave with false pride towards anyone'.\"\r\\n\\t\\t\\t\\tAccording to some later commentators (e.g., Tabari,\r\\n\\t\\t\\t\\tZamakhshari, Baghawi, Razi), the meaning is wider, namely,\r\\n\\t\\t\\t\\t\"do not overstep the bounds of what God has ordained\", or\r\\n\\t\\t\\t\\t\"do not exceed the limits of equity\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "113",
    "NoteID": "142",
    "Body": "The verb rakana comprises the concepts of inclining (in\r\\n\\t\\t\\t\\tone's feelings or opinions) towards, as well as of\r\\n\\t\\t\\t\\trelying on, someone or something, and cannot be\r\\n\\t\\t\\t\\ttranslated by a single word; hence my composite rendering\r\\n\\t\\t\\t\\tof the phrase la tarkanu. The use of the past tense in\r\\n\\t\\t\\t\\talladhina zalamu indicates - as is often the case in the\r\\n\\t\\t\\t\\tQur'an - deliberate and persistent evildoing; this term\r\\n\\t\\t\\t\\tis, therefore, suitably rendered as \"those who are bent\r\\n\\t\\t\\t\\ton evildoing\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "113",
    "NoteID": "143",
    "Body": "According to Zamakhshari, the particle thumma at the\\n\\t\\t\\t\\tbeginning of this last clause does not signify a sequence\\n\\t\\t\\t\\tin time (\"and then\" or \"afterwards\") but, rather, a\\n\\t\\t\\t\\tstress on the impossibility (istib'ad) of their ever\\n\\t\\t\\t\\tbeing succoured by God."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "114",
    "NoteID": "144",
    "Body": "Lit., \"at the two ends\"."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "114",
    "NoteID": "145",
    "Body": "This injunction circumscribes all the obligatory prayers\\n\\t\\t\\t\\twithout specifying either their form or the exact times\\n\\t\\t\\t\\tof their performance, both of which are clearly laid down\\n\\t\\t\\t\\tin the sunnah (i.e., the authenticated sayings and the\\n\\t\\t\\t\\tpractice) of the Prophet: namely, at dawn (fajr), shortly\\n\\t\\t\\t\\tafter mid-day (zuhr), in the afternoon ('asr),\\n\\t\\t\\t\\timmediately after sunset (maghrib), and in the first part\\n\\t\\t\\t\\tof the night ('isha'). Inasmuch as the above verse\\n\\t\\t\\t\\tstresses the paramount importance of prayer in general,\\n\\t\\t\\t\\tit is safe to assume that it refers not merely to the\\n\\t\\t\\t\\tfive obligatory prayers but to a remembrance of God at\\n\\t\\t\\t\\tall times of one's wakeful life."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "116",
    "NoteID": "146",
    "Body": "For my rendering of the particle law-la, at the beginning\r\\n\\t\\t\\t\\tof this sentence, as \"alas\", see surah {10}, note [119].\r\\n\\t\\t\\t\\tThe present passage connects with the statement in the\r\\n\\t\\t\\t\\tpreceding verse, \"God does not fail to requite the doers\r\\n\\t\\t\\t\\tof good\", as well as with verse {111} above, \"unto each\r\\n\\t\\t\\t\\tand all will thy Sustainer give their due for whatever\r\\n\\t\\t\\t\\t[good or evil] they may have done\". - For the wider\r\\n\\t\\t\\t\\timplications of the term qarn (\"generation\"), see surah\r\\n\\t\\t\\t\\t{6}, note [5]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "116",
    "NoteID": "147",
    "Body": "The verb tarifa means \"he enjoyed a life of ease and\\n\\t\\t\\t\\tplenty\", while the participle mutraf denotes \"one who\\n\\t\\t\\t\\tenjoys a life of ease and plenty\" or \"indulges in the\\n\\t\\t\\t\\tpleasures of life\", i.e., to the exclusion of moral\\n\\t\\t\\t\\tconsiderations. The form mutarraf has an additional\\n\\t\\t\\t\\tsignificance, namely, \"one whom a life of softness and\\n\\t\\t\\t\\tease has caused to behave insolently\", or \"one whom the\\n\\t\\t\\t\\t[exclusive] pursuit of the pleasures of life has\\n\\t\\t\\t\\tcorrupted\" (Mughni). Hence my above rendering of the\\n\\t\\t\\t\\tphrase ma utrifu fihi."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "117",
    "NoteID": "148",
    "Body": "See surah {6}, note [116]."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "117",
    "NoteID": "149",
    "Body": "This passage connects with the concluding clause of the\r\\n\\t\\t\\t\\tpreceding verse, \"and lost themselves in sinning\".\r\\n\\t\\t\\t\\tAccording to most of the classical commentators, the term\r\\n\\t\\t\\t\\tzulm (lit., \"wrong\" or \"evildoing\") is in this context\r\\n\\t\\t\\t\\tsynonymous with \"wrong beliefs\" amounting to a denial of\r\\n\\t\\t\\t\\tthe truths revealed by God through His prophets, a\r\\n\\t\\t\\t\\trefusal to acknowledge His existence, or the ascribing of\r\\n\\t\\t\\t\\tdivine powers or qualities to anyone or anything beside\r\\n\\t\\t\\t\\tHim. Explaining the above verse in this sense, Razi says:\r\\n\\t\\t\\t\\t\"God's chastisement does not afflict any people merely on\r\\n\\t\\t\\t\\taccount of their holding beliefs amounting to shirk and\r\\n\\t\\t\\t\\tkufr, but afflicts them only if they persistently commit\r\\n\\t\\t\\t\\tevil in their mutual dealings, and deliberately hurt\r\\n\\t\\t\\t\\t[other human beings] and act tyranically [towards them].\r\\n\\t\\t\\t\\tHence, those who are learned in Islamic Law (al-fuqaha')\r\\n\\t\\t\\t\\thold that men's obligations towards God rest on the\r\\n\\t\\t\\t\\tprinciple of [His] forgiveness and liberality, whereas\r\\n\\t\\t\\t\\tthe rights of man are of a stringent nature and must\r\\n\\t\\t\\t\\talways be strictly observed\" - the obvious reason being\r\\n\\t\\t\\t\\tthat God is almighty and needs no defender, whereas man\r\\n\\t\\t\\t\\tis weak and needs protection. (Cf. the last sentence of\r\\n\\t\\t\\t\\t 28:59  and the corresponding note [61].)"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "118",
    "NoteID": "150",
    "Body": "I.e., about everything, even about the truths revealed to\\n\\t\\t\\t\\tthem by God. - For a discussion of the term ummah wahidah\\n\\t\\t\\t\\t(\"one single community\") and its wider implications, see\\n\\t\\t\\t\\tsurah {2}, notes [197] and [198]; the second part of\\n\\t\\t\\t\\t 2:253  and the corresponding note [245]; and the second\\n\\t\\t\\t\\tpart of  5:48  and the corresponding notes [66] and [67].\\n\\t\\t\\t\\tThus, the Qur'an stresses once again that the unceasing\\n\\t\\t\\t\\tdifferentiation in men's views and ideas is not\\n\\t\\t\\t\\tincidental but represents a God-willed, basic factor of\\n\\t\\t\\t\\thuman existence. If God had willed that all human beings\\n\\t\\t\\t\\tshould be of one persuasion, all intellectual progress\\n\\t\\t\\t\\twould have been ruled out, and \"they would have been\\n\\t\\t\\t\\tsimilar in their social life to the bees and the ants,\\n\\t\\t\\t\\twhile in their spiritual life they would have been like\\n\\t\\t\\t\\tthe angels, constrained by their nature always to believe\\n\\t\\t\\t\\tin what is true and always to obey God\" (Manar XII, 193)\\n\\t\\t\\t\\t- that is to say, devoid of that relative free will which\\n\\t\\t\\t\\tenables man to choose between right and wrong and thus\\n\\t\\t\\t\\tendows his life - in distinction from all other sentient\\n\\t\\t\\t\\tbeings - with a moral meaning and a unique spiritual\\n\\t\\t\\t\\tpotential."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "119",
    "NoteID": "151",
    "Body": "I.e., those who avail themselves of His grace, consisting\\n\\t\\t\\t\\tof the God-given ability to realize His existence (cf.\\n\\t\\t\\t\\t 7:172  and the corresponding note [139]) and the\\n\\t\\t\\t\\tguidance which He offers to mankind through His prophets\\n\\t\\t\\t\\t(Razi)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "119",
    "NoteID": "152",
    "Body": "Some of the earliest commentators (e.g., Mujahid and\r\\n\\t\\t\\t\\t'Ikrimah) are of the opinion that the expression\r\\n\\t\\t\\t\\tli-dhalika (rendered by me as \"to this end\") refers to\r\\n\\t\\t\\t\\tGod's bestowal of His grace upon man, while others (e.g.,\r\\n\\t\\t\\t\\tAl-Hasan and 'Ata') relate it to men's ability to differ\r\\n\\t\\t\\t\\tintellectually from one another. According to\r\\n\\t\\t\\t\\tZamakhshari, it refers to the freedom of moral choice\r\\n\\t\\t\\t\\twhich characterizes man and is spoken of in the preceding\r\\n\\t\\t\\t\\tpassages: and since it is this freedom which constitutes\r\\n\\t\\t\\t\\tGod's special gift to man and raises him above all other\r\\n\\t\\t\\t\\tcreated beings (cf. the parable of Adam and the angels in\r\\n\\t\\t\\t\\t{2:30-34}), Zamakhshari's interpretation is, in my\r\\n\\t\\t\\t\\topinion, the most comprehensive of all."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "119",
    "NoteID": "153",
    "Body": "The \"word of God\" reiterated here as well as in  32:13 \\n\\t\\t\\t\\thas originally been pronounced in  7:18  with reference\\n\\t\\t\\t\\tto the \"followers of Satan\", i.e., those who reject the\\n\\t\\t\\t\\tguidance offered them by God; hence my interpolation at\\n\\t\\t\\t\\tthe beginning of the paragraph. As regards the meaning of\\n\\t\\t\\t\\tjinn (rendered by me in this and similar instances as\\n\\t\\t\\t\\t\"invisible beings\"), see Appendix III."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "120",
    "NoteID": "154",
    "Body": "I.e., the Qur'an does not intend to present those stories\\n\\t\\t\\t\\tas such, but uses them (or, rather, relevant parts of\\n\\t\\t\\t\\tthem) as illustrations of moral truths and as a means to\\n\\t\\t\\t\\tstrengthen the faith of the believer (see the second part\\n\\t\\t\\t\\tof note [73] as well as note [131] above)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "123",
    "NoteID": "155",
    "Body": "Lit., \"God's is [the knowledge of] the hidden reality\r\\n\\t\\t\\t\\tof...\", etc. For this meaning of the term al-ghayb, see\r\\n\\t\\t\\t\\tnote [3] on  2:3 ."
  }
]
