[
  {
    "Question": "Discover Islam",
    "BookCode": "DI",
    "ArticleNumber": "1",
    "ImageName": "1.jpg",
    "Text": "\"Read! In the name of your Lord Who created. Created man from clinging cells. Read! And your Lord is Most Bountiful. The One Who taught with the Pen. Taught man what he did not know.\" (Qur'an 96: 1-5)"
  },
  {
    "Question": "What Is Islam And Who Are Muslims?",
    "BookCode": "DI",
    "ArticleNumber": "2",
    "ImageName": "2.jpg",
    "Text": "Islam simply means to achieve peace - peace with God, peace with oneself, and peace with the creations of God - through wholly giving oneself God and accepting His guidance. Islam is not a new faith. Muslims believe that it is the same truth that God revealed through all His prophets to every people. For a fifth of the world's population, Islam is not just a personal religion, but a complete way of life. Muslims come from all races, nationalities and cultures across the globe. They have varied languages, foods, dress, and customs; even the way they practice Islam may differ. Yet they all consider themselves to be Muslim. Islam is a qualitative term - the quality of accepting God's supreme authority above one's own. As such, being a Muslim does not mean having to give up one's culture or traditions; rather it means adopting the simple and logical principles of Islam to better one's life and attain peace. Less than 15% of Muslims live the Arab world; a fifth are found in Sub-Saharan Africa; and the world's largest Muslim community is in Indonesia. Substantial parts of Asia, and almost all the Central Asian republics, are Muslim. Significant Muslim minorities are found in China, India, Russia, Europe, North America and South America."
  },
  {
    "Question": "What Do Muslims Believe?",
    "BookCode": "DI",
    "ArticleNumber": "3",
    "ImageName": "3.jpg",
    "Text": "Muslims believe in the One, Unique, Incomparable, Merciful God - the Sole Creator, Sustainer and Cherisher of the Universe; in the Angels created by Him; in the prophets through whom His revelations were brought to humankind; in the Day of Judgment, and in individual accountability for actions; in God's complete authority over destiny, be it good or bad and in life after death. Muslims believe that God sent His messengers and prophets to all people. Biblical prophets mentioned in the Qur'an include: Adam, Enoch, Noah, Abraham, Lot, Ishmael, Isaac, Job, Ezekiel, Jacob, Joseph, Jonah, Jethro, Moses, Aaron, Elijah, Elisha, David, Solomon, Zechariah, John the Baptist, and Jesus; peace be upon them all. God's final message to humanity was revealed to the last prophet, Muhammad (peace be upon him), through the Archangel Gabriel. It confirmed and finalized all previous revelations that were sent to humankind through God's messengers. One becomes a Muslim by believing and proclaiming that, \"There is no deity except God, and that Muhammad is the messenger of God.\" By this declaration the believer announces his or her faith in all of God's messengers, and in the scriptures revealed to them."
  },
  {
    "Question": "Who is ALLAH?",
    "BookCode": "DI",
    "ArticleNumber": "4",
    "ImageName": "4.jpg",
    "Text": "Allah is the proper Arabic name for God. Muslims believe in and worship the same One God that the Jews and Christians worship. Allah says in the Qur'an: \"And do not debate with the People of the Book, unless in the best of manners, but not with those who are unjust, and say: \"We believe in the Revelation that has come down to us and in that which has come down to you; Our God and your God is One, and to Him do we wholly give ourselves.\" (Qur'an 29:46) Allah is a unique term with no plural an no gender. It predates Muhammad and was also used in the form of El, Elah or Elohim by David, Moses, Jesus and other messengers of God, peace be upon them all. \"He is God, the One that there is no deity but He; the Knower of the unseen and the apparent; He is the Source of All Mercy, the Merciful. He is God, the One that there is no deity but He; the King, the Holy, the Source of All Peace, the Guardian of Faith, the Preserver, the Mighty, the Compeller, the Majestic; Glory to God, beyond their associations (of partners with Him)! He is God, the Creator, the Maker, the Fashioner. To Him belong the most beautiful names. All that is in the heavens and the earth magnifies Him; He is the Mighty, the Wise.\" (Qur'an 59:22-24)"
  },
  {
    "Question": "Do Islam, Christianity And Judaism Have Different Origins?",
    "BookCode": "DI",
    "ArticleNumber": "5",
    "ImageName": "5.jpg",
    "Text": "No. Muslims believe that the original, unchanged message given to Muhammad, Jesus, Moses and all other prophets came from the One same God. This common origin explains their similarities in many beliefs and values. \"Say: We Believe in God and what has been revealed to us, and what was revealed to Abraham and Ishmael and Isaac and Jacob and the tribes, and what was given to Moses and Jesus and to the prophets from their Lord; we do not make any distinction between any of them, and to Him (God) do we wholly give ourselves.\" (Qur'an 3:84) Jews, Christians and Muslims all consider Abraham their Patriarch. Abraham is mentioned in the Qur'an as one of the great prophets. He was blessed by God to be the father of many nations. From his second son, Isaac, descended the tribes of Israel, and through them, Moses and Jesus; and from his first son, Ishmael, came Muhammad (peace and blessings of God be upon all of His messengers). Abraham was commanded by God to rebuild the place of worship that Adam first built - the Ka'bah, in Makkah (Mecca). The Ka'bah is a simple stone structure, erected as a sanctuary for the worship of the One God. Muslims do not worship the Ka'bah; the cubical building is simply the unified direction toward which all Muslims face in Prayer to God, Almighty."
  },
  {
    "Question": "Who was Muhammad?",
    "BookCode": "DI",
    "ArticleNumber": "6",
    "ImageName": "6.jpg",
    "Text": "Muhammad (peace be upon him) was born in Makkah in the year 570, during the period of history Europeans called the Middle Ages. Muhammad was the son of Aamenah and Abdullah, from the tribe of Quraysh. He was a direct descendant of Ishmael, the eldest son of prophet Abraham. Muhammad's father died just before he was born, and his mother passed away when he was six. He was raised by this grandfather, the chief of Makkah; and upon his grandfather's death, Muhammad came under the care of his uncle, Abu Talib. Muhammad was a shepherd in his youth. As he grew up, he became known for his truthfulness, generosity, and sincerity; earning the title of al Amin, the trustworthy one. Muhammad was frequently called upon to arbitrate disputes and counsel his fellow Makkans. At age 25, Muhammad married Khadijah, an honorable and successful businesswoman. They were blessed with two sons and four daughters. It was an ideal marriage and they lived a happy family life. Muhammad was of a contemplative nature and had long detested the decadence and cruelty of his society. It became his habit to meditate from time to time in the cave of Hira' near the summit of Jabal an-Nur, the \"Mountain of Light\" on the outskirts of Makkah."
  },
  {
    "Question": "How did Muhammad become a Messenger of God?",
    "BookCode": "DI",
    "ArticleNumber": "7",
    "ImageName": "7.jpg",
    "Text": "At the age of 40, while engaged in a meditative retreat, Muhammad received his first revelation from God through the Archangel Gabriel. This revelation, which continued for twenty three years, is known as the Qur'an Muhammad began to share the revelations he received from God with the people of Makkah. They were idol worshippers, and rejected Muhammad's call to worship only One God. They opposed Muhammad and his small group of followers in every way. These early Muslims suffered bitter persecution. In 622, God gave the Muslim community the command to emigrate. This event, the hijrah or migration, in which they left Makkah for the city of Madinah, some 260 miles to the North, marks the beginning of the Muslim calendar. Madinah provided Muhammad and the Muslims a safe and nurturing haven in which the Muslim community grew. After several years, the Prophet and his followers returned to Makkah and forgave their enemies. Then, turning their attention to the Ka'bah (the sanctuary that Abraham built), they removed the idols and rededicated it to the worship of the One God. Before the Prophet died at the age of 63, most of the people of Arabia had embraced his message. In less than a century, Islam had spread to Spain in the west, as far east as China."
  },
  {
    "Question": "How Did The Spread Of Islam Affect The World?",
    "BookCode": "DI",
    "ArticleNumber": "8",
    "ImageName": "8.jpg",
    "Text": "The Muslim community constituted to grow after Prophet Muhammad's death. Within a few decades, vast numbers of people across three continents - Africa, Asia, and Europe - had chosen Islam as their way of life. One of the reasons for the rapid and peaceful spread of Islam was the purity of its doctrine - Islam calls for faith in only one God. This, coupled with the Islamic concepts of equality, justice and freedom, resulted in a united and peaceful community. People were free to travel from Spain to China without fear, and without crossing any borders. As millions of people embraced Islam, they brought with them the heritage of ancient civilizations like Egypt, Greece, India, Persia, and Rome. Muslims cherished these cultures' knowledge and took great pains to preserve their libraries and honor and the scholars residing in their cities. Many Muslim scholars traveled to these cities seeking knowledge. They translated into Arabic volumes of philosophical and scientific works from Greek and Syriac languages (the languages of Eastern Christian scholars), from Pahlavi (the scholarly language of Pre-Islamic Persia), and from Sanskrit (an ancient Indian language). As a result, Arabic became the language of worldly scholarship, and people migrated from all over the world to study in the Muslim Universities."
  },
  {
    "Question": "How did the spread of Islam affect the world? (continued)",
    "BookCode": "DI",
    "ArticleNumber": "9",
    "ImageName": "9.jpg",
    "Text": "By 850, most of the philosophical and scientific works of Aristotle; much of Plato and Pythagorean school; and the major works of Greek astronomy, mathematics and medicine such as the Almagest of Ptolemy, the Elements of Euclid, and the works of Hippocrates and Galen, were all rendered into Arabic. Furthermore, important works of astronomy, mathematics and medicine were translated from Pahlavi and Sanskrit. For the next 700 years, Arabic became the most important scientific language of the world and the repository of much of the wisdom and the sciences of antiquity. The achievement of scholars working in the Islamic tradition went far beyond translation and preservation of ancient learning. These scholars built upon the ancient heritage with their own scientific advances. These advancements were a direct cause of the Renaissance in Europe. Muslims excelled in art, architecture, astronomy, geography, history, language, literature, medicine, mathematics, and physics. Many crucial systems such as algebra, the Arabic numerals, and the very concept of zero (vital to the advancement of mathematics), were formulated by Muslim scholars and shared with medieval Europe. Muslims invented sophisticated instruments that made future European voyages of discovery possible: the astrolabe, the quadrant, and detailed navigational maps and charts."
  },
  {
    "Question": "Who were some of the great Muslim scientists and thinkers?",
    "BookCode": "DI",
    "ArticleNumber": "10",
    "ImageName": "10.jpg",
    "Text": "Like many of their later Renaissance counterparts, most Muslim scientists and thinkers were multidisciplinary, and produced remarkable works of in many fields. A few of the more famous scholars include: Ibn Hayyan (Geber, 738-813) - known as the father of chemistry. Al-Khawarizmi (Algorizm, 750-850) - invented algebra and was instrumental in the development of trigonometry, calculus, and the use of algorithms. Ibn Firnas (died 888) - developed the mechanics of flight before DaVinci; he also built a planetarium. Al-Razi (Rhazes, 864-930) - a great physician who identified and treated smallpox. Al-Zahravi (Albucasis, 936-1013) - recognized as the father of modern surgery. Ibn Sina (Avicenna, 981-1037) - a very well known physician, authored the \"Cannon of Medicine\" and the \"Book of Healing.\" His writings were considered the authority of medicine for over five hundred years. Al-Idrisi (Dreses, 1099-1166) - made the first world maps that clearly showed North, Central, and South America. Ibn Rushd (Averroes, 1128-1198) - a great philosopher, astronomer, and physician. Ibn Batuta (1304-1378) - an avid world traveler, writer and geographer; he visited most of then-known world from Spain, to parts of Africa, to China."
  },
  {
    "Question": "What is the Quran?",
    "BookCode": "DI",
    "ArticleNumber": "11",
    "ImageName": "11.jpg",
    "Text": "Muslims believe that the Qur'an is the very word of God Almighty: a complete record of the exact words revealed by God through the Archangel Gabriel to Prophet Muhammad (may the peace and blessings of God be upon him). The Qur'an was memorized by Prophet Muhammad and his followers, dictated to his companions, and written down by scribes, who cross-checked it during the Prophet's lifetime. Not one word of its 114 surahs (chapters) has been changed over the centuries. The Qur'an is in every detail the same unique and miraculous text that was revealed to Muhammad over fourteen centuries ago. The Qur'an is the principle source of every Muslim's faith and practice. It deals with all subjects that concern us as human beings, including wisdom, doctrine, worship and law; but its basic theme is the relationship between God and His creatures. At the same time, the Qur'an provides guidelines for a just society, proper human conduct and equitable economic principles. \"He (God) has sent down to you the Book (the Qur'an) with truth, confirming what was revealed before; And He sent down the Torah (of Moses) and the Gospel (of Jesus) before this as a guide in humankind; and He sent down the Criterion (the Qur'an).\" (Qur'an 3:3-4)"
  },
  {
    "Question": "Apart from the Quran is there any other Sacred Source?",
    "BookCode": "DI",
    "ArticleNumber": "12",
    "ImageName": "12.jpg",
    "Text": "Yes, the sunnah - the practice and example of the Prophet Muhammad (peace and blessings be upon him) is the second source of inspiration and instruction for Muslims. Belief in the sunnah is part of the Islamic faith. The Prophet's sunnah and sayings were documented extensively by his contemporaries and are known as hadith. Here are a few examples of hadith from the Prophet: \"None of you truly believe until he wishes for his brother what he wishes for himself.\" \"He who eats his fill while his neighbor goes without food is not a believer.\" \"God does not judge you according to your bodies and appearances, but He looks into your hearts and observes your deeds.\" \"Whoever does not express his gratitude to people shall never grateful to God.\" \"Show mercy to those on earth, the One in Heaven will show mercy to you.\" \"God is gentle and loves gentleness.\" \"The world is green and beautiful and God has appointed you His guardians over it.\" \"Forgive him who wrongs you; join him who cuts you off; do good to him who does evil to you; and speak the truth even if it be against yourself.\" \" 'A man walking along a path felt very thirsty. Reaching a well he descended into it, drank his fill and came up. Then he saw a dog with its tongue hanging out, trying to lick up mud to quench its thirst. The man saw that the dog was feeling the same thirst as he had felt, so he went down into the well again and filled his shoe with water and gave the dog a drink. God forgave his sins for this action.' The Prophet was asked: 'Messenger of God, are we rewarded for kindness towards animals?' He said, 'There is a reward for kindness to every living being.' \" \"O People, listen to me in earnest, worship God Almighty, perform your five daily prayers, fast during the month (of Ramadan), give regular charity and perform the pilgrimage if you can afford to... Know that every Muslim is the brother of another Muslim. You are equal. Nobody has superiority over others, except by piety and good actions... I leave behind two things, if you follow these you will never go astray: the Book of God (the Qur'an) and my example.\""
  },
  {
    "Question": "What are the five pillars of Islam? Testimony",
    "BookCode": "DI",
    "ArticleNumber": "13",
    "ImageName": "13.jpg",
    "Text": "The \"five pillars\" of Islam are the basis of Muslim life. Prophet Muhammad is reported to have said: \"Islam is founded on 5 pillars; to testify that 'there is no deity except God, and Muhammad is the messenger of God;' to establish the ritual prayers; to give charity (to the needy); to perform the pilgrimage to the House (of worship in Makkah); and to fast during the month of Ramadan.\" A practicing Muslim's life is centered on these pillars. The first and foremost of these is the testimony. \"There is no deity except God; Muhammad is the messenger of God.\" This simple declaration of faith is required of all those who accept Islam as their chosen way of life. The words have to be uttered with sincere conviction and under no coercion. The significance of this testimony is the belief that the only purpose of life is to serve and obey God; and this is achieved through following the example of Prophet Muhammad. Muslims believe that throughout history, God sent His chosen messengers to guide humankind. The testimony that these prophets taught was similar. The first commandment found in the Bible is \"I am the Lord, thy God; thou shalt not have other gods before Me.\" This belief in the Oneness of God is central to Islam and permeates all of Muslim life."
  },
  {
    "Question": "What are the five pillars of Islam? Prayer",
    "BookCode": "DI",
    "ArticleNumber": "14",
    "ImageName": "14.jpg",
    "Text": "A key element of Muslim life is the obligatory, ritual prayer. These prayers are performed five times a day, and are a direct link between the worshipper and God. This very personal relationship with the Creator allows one to fully depend, trust and love God; and to truly achieve inner peace and harmony, regardless of the trails one faces. Prophet Muhammad (peace be upon him) said: \"Indeed, when one of you prays, he speaks privately with his Lord.\" Prayers are performed at dawn, mid-day, late-afternoon, sunset and nightfall; reminding one of God throughout the day. Regular prayer helps prevent destructive deeds and gives one the opportunity to seek God's pardon for any misgivings. The Prophet once asked his companions: \"Do you think if there was a river by the door and one of you bathed in it five times a day; would there remain any dirt on him?\" The Prophet's companions answered in the negative. The Prophet then said: \"That is how it is with the five (daily) prayers; through them God washes away your sins.\" Friday is the day of congregation for Muslims. The mid-day prayer on Friday is different from all other prayers in that it includes a sermon. Prayer at other times are relatively simple, they include verses from the Qur'an and take only a few minutes to complete."
  },
  {
    "Question": "What are the five pillars of Islam? Prayer (continued)",
    "BookCode": "DI",
    "ArticleNumber": "15",
    "ImageName": "15.jpg",
    "Text": "Muslims are greatly encouraged to perform their five daily prayers in congregation, and in the Mosque. A Mosque, in its most basic form, is simply a clean area designated for prayers. Mosques throughout the world have taken on various architectural forms, reflected local cultures. They range from detached pavilions in China to elaborate courtyards in India; from massive domes in Turkey to glass and steel structures in the United States. However, one unique and obvious feature remains - the \"call to prayer.\" The first person to call Muslims to prayer was a freed African slave from Abyssinia, Bilal ibn Rabah. He was a beloved companion of Prophet Muhammad. Bilal's rich and melodious voice called the Muslims of Madinah to prayer five times a day. A translation of the call to prayer: God is Greater, God is Greater; God is Greater, God is Greater. I testify that there is no deity except God; I testify that there is no deity except God. I testify that Muhammad is the messenger of God; I testify that Muhammad is the messenger of God. Come to prayer! Come to prayer! Come to success! Come to success! God is Greater! God is Greater! There is no deity except God."
  },
  {
    "Question": "What are the five pillars of Islam? Charity",
    "BookCode": "DI",
    "ArticleNumber": "16",
    "ImageName": "16.jpg",
    "Text": "An important principle of Islam is that everything belongs to God; wealth is therefore held by human beings in trust. Obligatory charity or zakah means both \"purifications\" and \"growth.\" Our possessions are purified by setting aside a proportion for those in need and for society in general. Like the pruning of plants, this cutting back balances and encourages new growth. Each Muslim calculates his or own zakah individually. This involves the annual payments to those in need of 2.5% of one's assets, excluding such items as primary residence, car and professional tools. Zakah is a unique concept, compare to other forms of giving, in that it redistributes the wealth of society; when applied correctly, it effectively eliminates poverty. God places great emphasis on taking care of the needy in society; He says in the Qur'an: \"Those who spend of their wealth (in charity) by night and by day, and in secret and in public have their reward with their Lord, on them there shall be no fear, nor shall they grieve.\" (Qur'an 2:274) Giving beyond the obligatory charity is expected upon every Muslim and may take many forms. The Prophet said, \"Even meeting your brother with a smile is an act of charity.\" The Prophet further said that when one has nothing to give, he can stay away from evil; that too is charity."
  },
  {
    "Question": "What are the five pillars of Islam? Fasting",
    "BookCode": "DI",
    "ArticleNumber": "17",
    "ImageName": "17.jpg",
    "Text": "Fasting in the month of Ramadan is an essential part of being a Muslim. Muslims fast from dawn until sundown - abstaining from food and drink, and guarding themselves from destructive behavior. Those who are sick, elderly, or on a journey, and women who are pregnant or nursing, are permitted to break the fast and make up an equal number of days later in the year. Children begin to fast (and to observe prayers) from puberty, although many start earlier. God states in the Qur'an: \"O you who believe! Fasting is prescribed for you as it was prescribed to those before you that you may achieve greater awareness (of God).\" (Qur'an 2:183) Fasting is not only beneficial to health, but it also allows one to truly empathize with those less fortunate. However, fasting is mainly a method of self-purification and self-restraint. By cutting oneself from worldly comforts, even for a short time, a fasting person focuses on his or her purpose in life by constantly being aware of God. Ramadan is a special time for Muslims everywhere; a time for reflection and greater spirituality. The end of Ramadan is observed by a holiday - Eid al Fitr. On this day, Muslims all over the world celebrate with prayers and an exchange of gifts."
  },
  {
    "Question": "What are the five pillars of Islam? Pilgrimage",
    "BookCode": "DI",
    "ArticleNumber": "18",
    "ImageName": "18.jpg",
    "Text": "The pilgrimage to Makkah (the Hajj) is a once-in-a-lifetime obligation for those who are physically and financially able. Over two million people, from all corners of the globe, go for Hajj each year making it the largest gathering for peace. Hajj provides a unique opportunity for people from different nations meet one another. The annual Hajj begins in the twelfth month of the Islamic year. The Islamic year is lunar, consequently Hajj occurs throughout all seasons during one's lifetime. Pilgrims enter a state of sacredness where arguing and fighting, cutting a plant or even harming a fly is prohibited. They wear simple garments that strip away distinctions of class and culture, so that all stand equal before God. The rites of the Hajj go back to Abraham and his family. They include visiting the Ka'bah and standing together on the wide plains of 'Arafat (a large expanse of desert outside of Makkah). Here pilgrims pray for God's forgiveness, in what is often considered a preview of the Day of Judgment. The Hajj provides a unique opportunity for Muslims to reflect on their lives, to refocus on God, and to return to their families and homes spiritually rejuvenated. The close of the Hajj is marked by the Festival of Sacrifice, Eid al Adha. Pilgrims sacrifice a sheep or goat, commemorating Abraham's readiness to sacrifice his own son. The sacrificial meat is distributed to the needy. Muslims around the world celebrate this day with prayers, ritual sacrifice, and an exchange of gifts."
  },
  {
    "Question": "Is Islam respectful of other beliefs?",
    "BookCode": "DI",
    "ArticleNumber": "19",
    "ImageName": "19.jpg",
    "Text": "Yes. The Qur'an states unequivocally: \"There is no compulsion in religion. Truth stands out clearly from falsehood......\" (Qur'an 2:256) Freedom of conscience is an essential tenant of Islam. Truth can only be seen if it is not clouded by coercion. Protection of the rights of non-Muslims is an intrinsic part of Islamic law. The Prophet Muhammad is reported to have said: \"He who hurts a non-Muslim citizen of a Muslim State - I am his adversary and I shall be his adversary on the Day of Judgment.\" \"Beware on the Day of Judgment, I shall, myself, be the accuser against him who wrongs a non-Muslim citizen (of a Muslim State) or Lays on him a responsibility greater than he can bear, or deprives him of anything that belongs to him.\" History provides many examples of Muslims' respect towards other faiths. For instance, prior to the Spanish Inquisition, Jews and Christians lived and prospered in Spain for centuries under Muslim rule. Another well known example is when Omar, the second successor to Prophet Muhammad, entered Jerusalem. He refused to pray inside the Church of the Holy Sepulcher. He was concerned that some overzealous Muslim in the future might destroy the Church and build a Mosque in his honor."
  },
  {
    "Question": "How did Prophet Muhammad relate to Christians?",
    "BookCode": "DI",
    "ArticleNumber": "20",
    "ImageName": "20.jpg",
    "Text": "The earliest interfaith dialogue between Christians and Muslims occurred near the beginning of Muhammad's prophethood. The Prophet and his companions were greatly oppressed by the polytheists of Makkah. Muhammad sent some of his followers to seek refuge with the Negus of Abyssinia - a righteous and just Christian king. He listened to the Prophet's emissary with great respect and awe, especially the Qur'anic description of Mary and Jesus. This description led the king and his subjects to affirm that this indeed was God's revelation, and gladly grant the Muslims asylum they sought. The Prophet recognized Christians as one of the \"People of the Book.\" He treated them with respect and kindness, contracted treaties with the various Christian tribes, and he assured them the freedom to practice their faith and determine their own affairs while living under Islamic law. One noteworthy example is when a large delegation of Christians from Najran visited the Prophet in Madinah. He received them with great hospitality, and they stayed at the Prophet's Mosque. When they wanted to leave the Mosque and go outside to perform their church services, the Prophet surprised them by offering the use of his Mosque. Although they did not reach an agreement on all matters of faith, they left Madinah with a treaty of peace and cooperation given to them by the Prophet. This, and similar incidents, are the examples for Muslims and Christians to emulate in the pursuit of better interfaith relations."
  },
  {
    "Question": "What do Muslims think about Jesus?",
    "BookCode": "DI",
    "ArticleNumber": "21",
    "ImageName": "21.jpg",
    "Text": "Muslims love and respect Jesus. They consider him one of the greatest of God's prophets and messengers to humankind. A Muslim never refers to him simply as \"Jesus,\" but always adds the phrase \"may the peace and blessing of God be upon him.\" The Qur'an confirms his virgin birth, and a special chapter of the Qur'an is entitled \"Mary.\" The Qur'an describes the Annunciation as follows: \"The Angels said, 'O Mary! God has chosen you, and purified you, and chosen you above all the women of all nations...' 'O Mary, God gives you good news of a word from Him, whose name is the Messiah, Jesus son of Mary, honored in this world and in the Hereafter, and one of those brought near to God. He shall speak to the people in infancy and in old age, and shall be of the righteous.' She said: ' O my Lord! How shall I have a son when no man has touched me?' He said: 'Even so; God creates what he wills. When He decrees a thing, he says to it, \"Be!\" and it is.\"' (Qur'an 3:42, 45-7) Just as God created Adam without a mother or a father, He caused Jesus to be conceived without a father: \"Truly the example of Jesus in relation to God is as the example of Adam. He created him from dust and then said to him, \"Be!\" and he was.\" (Qur'an 3:59) During his prophetic mission, Jesus performed many miracles. The Qur'an tells us that he said: \"I have come to you with a sign from your Lord: I make for you out of clay, as it were, a figure of a bird, and breathe into it and it becomes a bird by God's leave. And I heal the blind, and the lepers, and I raise the dead by God's leave.\" (Qur'an 3:49) Jesus, like Muhammad, came to confirm and renew the basic doctrine of the belief in One God brought by earlier prophets. In the Qur'an, Jesus is reported as saying that he came: \"To attest the Torah that was before me. And to make lawful to you part of what was forbidden to you; I have come to you with a sign from your Lord; so be conscious of God and obey me.\" (Qur'an 3:50) The Prophet Muhammad said: \"Whoever believes that there is no deity except God, alone without partner, that Muhammad is his messenger, that Jesus is the servant and messenger of God; His word which he bestowed on Mary and a spirit proceeding from Him, and that Paradise and Hell are true, shall be received by God into Heaven.\""
  },
  {
    "Question": "Who are American Muslims?",
    "BookCode": "DI",
    "ArticleNumber": "22",
    "ImageName": "22.jpg",
    "Text": "There are over 8 million Muslims who live in the United States, representing every race, ethnicity and culture. They come from all social demographics, and contribute to American society as entrepreneurs, engineers, industrialists, physicians, scientists and teachers. Many were born in the United States; others migrated to America seeking a better life. The first Muslims in America were West Africans who traded with Native American tribes prior to Columbus. Later, large numbers of African Muslims were forcibly brought to the US to work on plantations as slaves. Very few retained their Islamic identity. Today, many African Americans are rediscovering their Islamic heritage. From the 1930's onward, the Nation of Islam (a different faith, not related to Islam) played a major role in bringing African Americans to mainstream Islam. Many who joined the Nation, such as Malcolm X, left it after realizing that the true teachings of Islam were universal and not restricted to a chosen race of people. Like their fellow contrymen, American Muslims were shocked and saddened when terrorists attacked their homeland on September 11th, 2001. In today's post 9-11 America, Muslims have taken on a new role - bridging the gap between the Muslim world and America, and educating the rest of America about the true and peaceful nature of Islam."
  },
  {
    "Question": "How are Islam and America related?",
    "BookCode": "DI",
    "ArticleNumber": "23",
    "ImageName": "23.jpg",
    "Text": "\"We hold these truths to be self-evident, that all men are created equal, that they are endorsed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\" These ideals are very much part of the Islamic faith. Muslims believe that all humans are created equal and are blessed by their Creator with certain rights - the right to life, the right to pursue eternal happiness and the right to liberty. Liberty, as Muslims see it, is not just defined as freedom of religion, assembly, and speech, but freedom from subservience to any creation of the Creator. It is the freedom to serve the Creator, God Almighty, alone. While many so-called Muslim nations are not, Islam is democratic in spirit. Islam advocates the right to vote, he right to self-governance and the right to self-determination. The Qur'an enjoins Muslims to rule themselves through consultation and consensus. Muslims believe that each person is responsible for his or her own deeds; and that all stand equal before God. This independent sprit on one hand, coupled with an egalitarian worldview on the other, are both uniquely American. The American ideals of independence, liberty, democracy, equality, and especially monotheism \"- one nation under God,\" are all found within Islam. Verily, this nation of yours is one nation and I am your Lord, so worship Me.\" (Qur'an 21:92)"
  },
  {
    "Question": "Why is Islam often misunderstood?",
    "BookCode": "DI",
    "ArticleNumber": "24",
    "ImageName": "24.jpg",
    "Text": "In today's turbulent world, Islam is often on the front page - mostly for the wrong reasons. Islam means peace; yet some have taken this peaceful way of life and hijacked it into a violent way, and distorted their ideology for personal and political gains. Seeing a faith through explosive world events, and judging it by the actions of a misguided few, is the primary reasons why Islam is often misunderstood. Islam is sometimes, intentionally misrepresented. Some politicians, religious leaders and media have found an ideal scapegoat in Islam. By associating Islam with the inhumane acts of a handful, they have been successful in driving larger numbers of people to vote for them; to donate towards their ministries; and to read their newspapers, watch their television programs and listen to their radio shows. However, with an increasing number of Muslims speaking out against this falsehood; the true and peaceful nature of Islam is becoming more evident. Muslims are standing up against terrorism, against the persecution and killing of innocent people, and against those who perpetrate such injustice in the name of any faith. The very word \"Islam\" means peace. A fifth of the world's population is reclaiming this peace as their chosen way of life."
  },
  {
    "Question": "What does Islam say about war?",
    "BookCode": "DI",
    "ArticleNumber": "25",
    "ImageName": "25.jpg",
    "Text": "Islam permits fighting in self-defense, in defense of one's faith, or on the part of those whose basic rights have been violated. It lays down strict rules of combat that include prohibitions against harming civilians and against destroying crops, trees, and livestock. As Muslims see it, injustice would be triumphant in the world if good people were not prepared to fight for a righteous cause. God says in the Qur'an: \"Permission (to defend) has been granted to those who are being fought against; that they have been oppressed. Verily, God has the power to help them. Those who were unjustly expelled from their homes for no other reason than their saying: 'God is our Lord.' If God were not to repel some human beings through others, monasteries, churches, synagogues, and mosques, wherein the name of God is mentioned, would have certainly been destroyed. God will definably help those who will help Him. Verily, God is Immensely Strong, Mighty.\" (Qur'an 22:39-40) War is the last resort, and is subject to the rigorous conditions laid down by the sacred law. The often misunderstood and overused term jihad literally means \"struggle\" and not \"holy war\" (a term not found anywhere in the Qur'an). Jihad, as Islamic concept, can be on a personal level - inner struggle against evil within oneself; struggle for decency and goodness on the social level; and struggle on the battlefield, if and when necessary."
  },
  {
    "Question": "How does Islam guarantee human rights?",
    "BookCode": "DI",
    "ArticleNumber": "26",
    "ImageName": "26.jpg",
    "Text": "According to the Qur'an, God has created all of humankind equal, and has given each the right to pursue their own destiny. The life, honor and property of all people in a Muslim society are considered sacred, whether the person is Muslim or not. Racism, sexism and prejudice of any sort are unacceptable in Islam. The Qur'an speaks of human equality in the following terms: \"O humankind! We created you from a male and female, and made you into nations and tribes, so that you may come to know one another. Truly, the most honored of you in God's sight is the greatest of you in piety. God is All-Knowing, All-Aware.\" (Qur'an 49:13) The right to life is the most basic of human rights; the Qur'an equates the unjust killing of a single person to killing all of humankind: \"And whoever kills a soul..., should be as though he has killed all of humankind.\" (Qur'an 5:32) Dealing equitably and protecting the rights of every individual is the cornerstone of a Muslim society. God further states in the Qur'an: \"O you who believe! Stand up firmly for God, as witnesses to fair dealing, and let not hatred of a people invite you to act inequitably; act justly, that is nearer to piety, and be conscious of (your duty to) God, surely God is aware of all that you do.\" (Qur'an 5:8)."
  },
  {
    "Question": "Why is the family so important to Muslims?",
    "BookCode": "DI",
    "ArticleNumber": "27",
    "ImageName": "27.jpg",
    "Text": "The family is the foundation of Islamic society. The peace and security offered by a stable family unit is greatly valued and seen as essential for the spiritual growth of its members. It is quite common in the Muslim community to find large, extended families living together; providing comfort, security and support to one another. Parents are greatly respected in the Islamic tradition. Mothers, in particular are greatly honored. God says in the Qur'an: \"And we have enjoined upon man to be good to his parents. With difficulty upon difficultly did his mother bear him, and wean him for two years. Show gratitude to Me and to your parents; to Me is your final goal!\" (Qur'an 31:14) Marrying and establishing a family is very strongly encouraged. \"And among His signs is that He created for you mates from among yourselves; that you may find peace with them. And He put between you love and compassion. Surely in this are signs for people who reflect.\" (Qur'an 30:21) A Muslim marriage is both a sacred act and a legal agreement, in which either the groom or the bride is free to include legitimate conditions. Marriage customs vary widely from country to country. Prophet Muhammad is reported to have said: \"When a servant of God marries, he completes half his faith.\" Marriage is the institution upon which families are based."
  },
  {
    "Question": "How does Islam elevate the status of women?",
    "BookCode": "DI",
    "ArticleNumber": "28",
    "ImageName": "28.jpg",
    "Text": "According to the Qur'an, men and women are equal before God; both created for the sole purpose of worshipping god through faith and good deeds. \"O humankind! Be conscious of your Lord Who created you from a single soul, and out of it created its mate, and out of the two spread countless men and women. Be conscious of your Lord through Whom you demand your mutual rights and honor the wombs; God always watches over you.\" (Qur'an 4:1) Islam recognizes women as individuals with specific rights. Among these are: the right to life, the right to learn; the right to earn, own and dispose property; the right to choose a husband; the right, as a wife, to her pre-marriage standard of living; the right to be treated equally; and the right to inherit. Women, like men, are rewarded by God for a righteously led life. Muslim women dress in a way that is modest and dignified. The purpose of clothing is not only to protect oneself from physical elements, but also to protect oneself from immorality and pride. Some traditions of dress, and more generally, the treatment of women in some Muslim countries and societies, are often a reflection of culture. This is very often inconsistent and even contrary to Islam teachings. Prophet Muhammad said: \"The most perfect in faith among you believers is he who is best in manner and kindest to his wife.\""
  },
  {
    "Question": "How do Muslim view the elderly, death, and the afterlife?",
    "BookCode": "DI",
    "ArticleNumber": "29",
    "ImageName": "29.jpg",
    "Text": "Muslims, by faith, are expected to respect and care of the elderly. It is quite common to find children, parents, grandparents and sometimes great grandparents all living together in one large home. In Islam, serving one's parents is a duty second only to worshipping God. It is considered despicable to express any irritation when, through no fault of their own, the old become difficult to handle. God says in the Qur'an: \"Your Lord has decreed that you worship none but Him, and be kind to your parents. If either or both of them reach old age with you, do not even say 'uff' to them or scold them, but speak to them in terms of honor and kindness. Lower to them the wing of humility, and say, 'My Lord! Have mercy on them, for they did care for me when I was young.'\" (Qur'an 17:23-4) When a Muslim dies, he or she is washed, usually be a family member, wrapped in a clean white cloth, and buried with a prayer, preferably the same day. Muslims believe that the present life is only a trial for the Hereafter. God says in the Qur'an: \"Every soul shall taste death. And you will be given your dues on the Day of Judgment. Only the one who is removed from the brink of Hellfire and admitted into Paradise has ultimately won; and life of this world is nothing but a material illusion.\" (Qur'an 3:185)"
  },
  {
    "Question": "Where can you get more information about Islam?",
    "BookCode": "DI",
    "ArticleNumber": "30",
    "ImageName": "30.jpg",
    "Text": "Further information about Islam and Muslims can easily be obtained by contacting your local Mosque, the Islamic Center in your area, or by contacting the following:<br /><br />\r\\n\r\\nTo order your own copy of the Discover Islam article Exhibit, please contact:<br /><br />\r\\n\r\\nTel : 703-738-3439 (\r\\nwww.discoverislam.com\r\\n)\r\\n"
  },
  {
    "Question": "Discover Islam: The Muslim Woman",
    "BookCode": "DI",
    "ArticleNumber": "31",
    "ImageName": "31.jpg",
    "Text": "\"For men and women who give themselves wholly (to God); for believing men and women; for devout men and women; for truthful men and women; for patient men and women; for men and women who are humble; for charitable men and women; for men and women who fast; for men and women who guard their chastity; and for men and women who engage in abundant praise of God. For them (all), God has prepared forgiveness and a magnificent reward.\" (Qur'an 33:35)"
  },
  {
    "Question": "What does the Quran say about Women's creation and purpose?",
    "BookCode": "DI",
    "ArticleNumber": "32",
    "ImageName": "32.jpg",
    "Text": "From a tiny drop that becomes an embryo, the girl-child is born to be an honored part of God's plan. God states in the Muslim holy book, the Qur'an: \"O humankind! Be conscious of your Lord Who created you from a single soul, and out of it created its mate, and out of the two spread countless men and women. Be conscious of your Lord through Whom you demand your mutual rights and honor the wombs; God always watches over you.\" (Qur'an 4:1) According to the Qur'an, there was a Garden of Eden. There was a forbidden tree, but no apple, no snake, and certainly no fault on Eve alone. Both Adam and Eve sinned at the same time. They felt shame, repented, and were forgiven together. God provided them with guidance, showing them a way back to Him. \"Each soul earns on its own account: and no bearer of burden shall bear the burden of another.\" (Qur'an 6:164) \"If any do deeds of righteousness, whether male or female, and have faith, they will enter Paradise and not the least injustice will be done to them.\" (Qur'an 4:124) The sole purpose and existence of both men and women is to worship God through faith and good deeds, fulfilling their role as God's honorable trustees and witnesses on this earth."
  },
  {
    "Question": "Does Islam give Women equal rights?",
    "BookCode": "DI",
    "ArticleNumber": "33",
    "ImageName": "33.jpg",
    "Text": "Yes, definitely. Islam teaches equality between women and men. However, in some Muslim countries and societies a patriarchal culture dominates, and women are denied of their God-given rights. Nowhere does the Qur'an state that one gender is superior to another. God makes it clear that the only criterion for superiority is piety and righteousness...virtues only He can judge. \"O humankind! We created you from a male and female, and made you into nations and tribes, so that you may come to know one another. Truly, the most honored of you in God's sight is the greatest of you in piety. God is All-Knowing, All-Aware.\" (Qur'an 49:13) Islam recognizes women as individuals with specific rights. Among these are: the right to life, the right to learn; the right to earn, own and dispose property; the right to choose a husband; the right to a marriage gift; the right to retain her maiden name; the right, as a wife, to her pre-marriage standard of living; the right to be treated equally; the right to seek divorce; the right to inherit; and the right to a final will. Women, like men, are rewarded for a righteously led life. \"...Whoever does good, whether male or female, and is a believer, will enter the Garden (of Paradise)...\" (Qur'an 40:39)"
  },
  {
    "Question": "What does Islam say about wives and husbands?",
    "BookCode": "DI",
    "ArticleNumber": "34",
    "ImageName": "34.jpg",
    "Text": "\"And among His signs is that He created for you mates from among yourselves, that you may live in tranquility with them; and He has brought between you love and mercy. Truly, in this are signs for those who reflect.\" (Qur'an 30:21) Marriage is based on mutual love and respect. The Islamic marriage is a sacred contract between a willing woman and willing man. There can be no coercion, and each party is free to include its own terms. The bride keeps her family name and her marriage gift from the groom. A Muslim marriage is completed with public festivities reflecting culture and customs. Husbands and wives are protectors of each other. They are equal partners and best friends, remaining faithful to one another. The husband provides, maintains, protects and is responsible for the family. He fulfills his duties with consultation and kindness. While the wife is not required to share her wealth and earnings, she may help her husband. Both spouses work together in the home - cooking and cleaning - and in raising good children. If couples are unable to live with one another peacefully, amicable divorce is permitted as a last resort. Mothers are given priority in the custody of children. Prophet Muhammad (may peace and blessings of God be upon him) said: \"Treat women well and be kind to them; they are your partners and committed helpers.\""
  },
  {
    "Question": "What is written in the Quran about motherhood",
    "BookCode": "DI",
    "ArticleNumber": "35",
    "ImageName": "35.jpg",
    "Text": "\"And We have enjoined upon man to be kind to his parents; in pain did his mother bear him, and in pain did she give him birth. The carrying of a child to his weaning is thirty months. At length, when he reaches the age of full strength and is forty years (old), he says, 'O my Lord! Grant me that I may be grateful for Your favors, that You bestowed me and upon both my parents; that I may do righteous deeds that are acceptable to You; and be gracious to me with regards to (my own) offspring. Surely, I turn to You repentant, and I wholly give myself (to You).\" (Qur'an 46:15) Mothers are accorded a special place of honor and respect in Islam. A man once came to Prophet Muhammad and asked, \"O Messenger of God! Who among the people is more worthy of my companionship?\" The Prophet replied, \"Your mother.\" Then man then asked who next, the Prophet replied \"Your mother\" again. The man repeated the question a third time and got the same answer. The man asked once again, \"Who next?\" Only then did the Prophet (peace and blessings be upon him) reply, \"Your father.\" These, and other references in the Qur'an and incidents from the life of the Prophet, clearly indicate the elevated status Islam has given to mothers. A Muslim sees a mother as an icon of strength and courage, tempered with compassion, kindness and love."
  },
  {
    "Question": "What do Muslims think about Mary, the mother of Jesus?",
    "BookCode": "DI",
    "ArticleNumber": "36",
    "ImageName": "36.jpg",
    "Text": ""
  },
  {
    "Question": "Does Islam want Women to be public and political?",
    "BookCode": "DI",
    "ArticleNumber": "37",
    "ImageName": "37.jpg",
    "Text": "Most certainly. Islam not only promotes, but charges women (and men) with the responsibility of using their minds for good, preventing evil as God's trustees on earth. \"The believing men and the believing women are protectors one of another; they enjoin good and forbid evil; they establish regular prayers; practice consistent charity; and they obey God and His Messenger. On them will God Pour His Mercy; for God is the Powerful, the Wise.\" (Qur'an 9:71) Several Qur'anic verses chronicle female thinkers and doers, such as: Mary, the mother of Jesus; Bilquis, the Queen of Sheba who ruled justly and believed in the One God; and Aasiya, the Pharaoh's wife who saved Prophet Moses. History also tells of many great women: Aishah , the wise teacher and philosopher wife of the Prophet, who taught people daily for over 50 years; and Zubaydah, the famous builder of an aqueduct system for pilgrims. In the first Islamic state in Madinah, Prophet Muhammad asked women to individually pledge loyalty (one person, one vote) to Islam and to his leadership. Women were expected then, as they are expected now, to assume their rightful role in society as committed partners. Muslim women today work for the public good as activists, artists, entrepreneurs, leaders, scholars, scientists, social workers and teachers. Muslim women excel in all fields, not in spite of their religious convictions, but because of them."
  },
  {
    "Question": "Why do Muslim women dress the way they do?",
    "BookCode": "DI",
    "ArticleNumber": "38",
    "ImageName": "38.jpg",
    "Text": "\"Say to the believing men that they should lower their gaze and guard their chastity; that will be purer for them. And God is well acquainted with all they do. And say to the believing women to lower their gaze and guard their chastity; that they should not display their beauty, except what (must ordinarily) appear thereof; that they should draw their coverings over their bosoms and not display their beauty except to their husbands, their fathers,...\" (Qur'an 24:30-31) God further states in the Qur'an: \"Such elderly women as are past the prospect of marriage - there is no blame on them if they cast aside their (outer) garments, provided they do not make a wanton display of their beauty; but it is best for them to be modest; and God the One Who sees and knows all things.\" (Qur'an 24:60) Muslim women dress in a way that is modest and dignified. The purpose of clothing is not only to protect oneself from the physical elements, but also to protect from immorality and pride. The Islamic concept of dress applies to both women and men. It sets expectations of moral and respectful interactions between the genders. As a result, both men and women are liberated from their baser instincts and can focus on higher pursuits. Islamic dress takes on many beautiful forms, reflecting the cultural diversity of Muslims from all over the world."
  },
  {
    "Question": "How does Islam protect Women from violence?",
    "BookCode": "DI",
    "ArticleNumber": "39",
    "ImageName": "39.jpg",
    "Text": "Islam means \"Peace\" - achieved when a person focuses on God, giving her entire mind, heart and soul to none other than the Creator. This liberates her from human subjection; replacing fear with self-respect; weakness with strength, and conflict with tranquility. God says in the Qur'an: \"...do not fear human beings, but be in awe of Me.\" (Qur'an 5:44) Islam strongly prohibits oppression or cruelty to any individual, group or living thing in the universe. God enjoins good conduct toward women from birth to death. Verbal, psychological, emotional, sexual, and physical violence are forbidden, as are false allegations against women's chastity and honor. Men are further reminded: \"Do not annoy women as to make their lives miserable.\" (Qur'an 65:6). Prophet Muhammad said: \"Only an honorable man treat women with honor and integrity. And only a mean, deceitful and dishonest man humiliates and insults women.\" Referring to physical abuse, he added: \"Never hit your wives, they are your partners and sincere helpers.\" He exemplified this by never, ever, hitting a women or child. The Prophet guaranteed protection of the life, honor, and property of women. \"And why should you not fight in the cause of God and on behalf of those, who being weak, are ill-treated and oppressed, men, women and children whose cry is, 'Our Lord! Rescue us from these oppressors, and raise for us, from You, one who will protect and help.'\" (Qur'an 4:75)"
  },
  {
    "Question": "Where can you get more information about Women in Islam?",
    "BookCode": "DI",
    "ArticleNumber": "40",
    "ImageName": "40.jpg",
    "Text": ""
  }
]
