[
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "1",
    "sectionHeading": "Things on which Zakat must be Paid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amr ibn Yahya\\n\\t\\t\\t\\tal-Mazini that his father said that he had heard Abu Said\\n\\t\\t\\t\\tal-Khudri say that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"There is no zakat\\n\\t\\t\\t\\ton less than five camels, there is no zakat on less than\\n\\t\\t\\t\\tfive awaq (two hundred dirhams of pure silver) and there\\n\\t\\t\\t\\tis no zakat on less than five awsuq (three hundred sa).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "2",
    "sectionHeading": "Things on which Zakat must be Paid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Abdullah\\n\\t\\t\\t\\tibn Abd arRahman ibn Abi Sasaca al-Ansari from al-Mazini\\n\\t\\t\\t\\tfrom his father from Abu Said al-Khudri that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"There is no zakat on less than five awsuq\\n\\t\\t\\t\\tof dates, there is no zakat on less than five awaq of\\n\\t\\t\\t\\tsilver and there is no zakat on less than five camels.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "3",
    "sectionHeading": "Things on which Zakat must be Paid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn Abd al-Aziz wrote to his governor in Damascus\\n\\t\\t\\t\\tabout zakat saying, \"Zakat is paid on the produce of\\n\\t\\t\\t\\tploughed land, on gold and silver, and on livestock.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Zakat is only paid on three things: the\\n\\t\\t\\t\\tproduce of ploughed land, gold and silver, and\\n\\t\\t\\t\\tlivestock.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "4",
    "sectionHeading": "The Zakat on Gold and Silver Coin",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Uqba,\\n\\t\\t\\t\\tthe mawla of az Zubayr, asked al-Qasim ibn Muhammad\\n\\t\\t\\t\\twhether he had to pay any zakat on a large sum given to\\n\\t\\t\\t\\thim by his slave to buy his freedom. Al-Qasim said, \"Abu\\n\\t\\t\\t\\tBakr as-Siddiq did not take zakat from anyone's property\\n\\t\\t\\t\\tuntil it had been in his possession for a year.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAl-Qasim ibn Muhammad continued, \"When Abu Bakr gave men\\n\\t\\t\\t\\ttheir allowances he would ask them, 'Do you have any\\n\\t\\t\\t\\tproperty on which zakat is due?' If they said, 'Yes,' he\\n\\t\\t\\t\\twould take the zakat on that property out of their\\n\\t\\t\\t\\tallowances. If they said, 'No,' he would hand over their\\n\\t\\t\\t\\tallowances to them without deducting anything from them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "5",
    "sectionHeading": "The Zakat on Gold and Silver Coin",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Urwa ibn Husayn from\\n\\t\\t\\t\\tA'isha bint Qudama that her father said, \"When I used to\\n\\t\\t\\t\\tcome to Uthman ibn Affan to collect my allowance he would\\n\\t\\t\\t\\task me, 'Do you have any property on which zakat is due?\\n\\t\\t\\t\\t'If  I said, 'Yes,' he would deduct the zakat on that\\n\\t\\t\\t\\tproperty from my allowance, and if I said, 'No,' he would\\n\\t\\t\\t\\tpay me my allowance (in full).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "6",
    "sectionHeading": "The Zakat on Gold and Silver Coin",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Zakat does not have to be paid on\\n\\t\\t\\t\\tproperty until a year has elapsed over it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "7",
    "sectionHeading": "The Zakat on Gold and Silver Coin",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said, \"The\\n\\t\\t\\t\\tfirst person to deduct zakat from allowances was Muawiya\\n\\t\\t\\t\\tibn Abi Sufyan.\" (i.e. the deduction being made\\n\\t\\t\\t\\tautomatically) .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The agreed sunna with us is that zakat has\\n\\t\\t\\t\\tto be paid on twenty dinars (of gold coin), in the same\\n\\t\\t\\t\\tway as it has to be paid on two hundred dirhams (of\\n\\t\\t\\t\\tsilver).\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no zakat to pay on (gold) that is\\n\\t\\t\\t\\tclearly less than twenty dinars (in weight) but if it\\n\\t\\t\\t\\tincreases so that by the increase the amount reaches a\\n\\t\\t\\t\\tfull twenty dinars in weight then zakat has to be paid.\\n\\t\\t\\t\\tSimilarly, there is no zakat to pay on (silver) that is\\n\\t\\t\\t\\tclearly less than two hundred dirhams (in weight), but if\\n\\t\\t\\t\\tit increases so that by the increase the amount reaches a\\n\\t\\t\\t\\tfull two hundred dirhams in weight then zakat has to be\\n\\t\\t\\t\\tpaid. If it passes the full weight then I think there is\\n\\t\\t\\t\\tzakat to pay, whether it be dinars or dirhams.\" (i.e. the\\n\\t\\t\\t\\tzakat is assessed by the weight and not the number of the\\n\\t\\t\\t\\tcoins.)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about a man who had one hundred and sixty\\n\\t\\t\\t\\tdirhams by weight, and the exchange rate in his town was\\n\\t\\t\\t\\teight dirhams to a dinar, that he did not have to pay any\\n\\t\\t\\t\\tzakat. Zakat had only to be paid on twenty dinars of gold\\n\\t\\t\\t\\tor two hundred dirhams.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, in the case of a man who acquired five dinars\\n\\t\\t\\t\\tfrom a transaction or in some other way which he then\\n\\t\\t\\t\\tinvested in trade, that, as soon as it increased to a\\n\\t\\t\\t\\tzakatable amount and then a year elapsed, he had to pay\\n\\t\\t\\t\\tzakat on it, even if the zakatable amount was reached one\\n\\t\\t\\t\\tday before or one day after the passing of a year. There\\n\\t\\t\\t\\twas then no zakat to pay on it from the day the zakat was\\n\\t\\t\\t\\ttaken until a year had elapsed over it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, in the similar case of a man who had in his\\n\\t\\t\\t\\tpossession ten dinars which he invested in trade and\\n\\t\\t\\t\\twhich reached twenty dinars by the time one year had\\n\\t\\t\\t\\telapsed over them, that he paid zakat on them right then\\n\\t\\t\\t\\tand did not wait until a year had elapsed over them,\\n\\t\\t\\t\\t(counting) from the day when they actually reached the\\n\\t\\t\\t\\tzakatable amount. This was because a year had elapsed\\n\\t\\t\\t\\tover the original dinars and there were now twenty of\\n\\t\\t\\t\\tthem in his possession. After that there was no zakat to\\n\\t\\t\\t\\tpay on them from the day the zakat was paid until another\\n\\t\\t\\t\\tyear had elapsed over them.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What we are agreed upon (here in Madina)\\n\\t\\t\\t\\tregarding income from hiring out slaves, rent from\\n\\t\\t\\t\\tproperty, and the sums received when a slave buys his\\n\\t\\t\\t\\tfreedom, is that no zakat is due on any of it, whether\\n\\t\\t\\t\\tgreat or small, from the day the owner takes possession\\n\\t\\t\\t\\tof it until a year has elapsed over it from the day when\\n\\t\\t\\t\\tthe owner takes possession of it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, in the case of gold and silver which was\\n\\t\\t\\t\\tshared between two co-owners, that zakat was due from any\\n\\t\\t\\t\\tone whose share reached twenty dinars of gold, or two\\n\\t\\t\\t\\thundred dirhams of silver, and that no zakat was due from\\n\\t\\t\\t\\tanyone whose share fell short of this zakatable amount.\\n\\t\\t\\t\\tIf all the shares reached the zakatable amount and the\\n\\t\\t\\t\\tshares were not equally divided, zakat was taken from\\n\\t\\t\\t\\teach man according to the measure of his share. This\\n\\t\\t\\t\\tapplied only when the share of each man among them\\n\\t\\t\\t\\treached the zakatable amount, because the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, had said,\\n\\t\\t\\t\\t\"There is no zakat to pay on less than five awaq of\\n\\t\\t\\t\\tsilver.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"This is what I prefer most out of what\\n\\t\\t\\t\\tI have heard about the matter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a man has gold and silver dispersed\\n\\t\\t\\t\\tamong various people he must add it all up together and\\n\\t\\t\\t\\tthen take out the zakat due on the total sum .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No zakat is due from some one who acquires\\n\\t\\t\\t\\tgold or silver until a year has elapsed over his\\n\\t\\t\\t\\tacquisition from the day it became his.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "8",
    "sectionHeading": "The Zakat On Mines",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman from more than one source that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, assigned\\n\\t\\t\\t\\tthe mines of al Qabaliyya, which is in the direction of\\n\\t\\t\\t\\tal-Fur, to Bilal ibn Harith al-Mazini, and nothing has\\n\\t\\t\\t\\tbeen taken from them up to this day except zakat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"In my opinion, and Allah knows best, nothing\\n\\t\\t\\t\\tis taken from what comes out of mines until what comes\\n\\t\\t\\t\\tout of them reaches a value of twenty gold dinars or two\\n\\t\\t\\t\\thundred silver dirhams. When it reaches that amount there\\n\\t\\t\\t\\tis zakat to pay on it where it is on the spot. Zakat is\\n\\t\\t\\t\\tlevied on anything over that, according to how much of it\\n\\t\\t\\t\\tthere is as long as there continues to be a supply from\\n\\t\\t\\t\\tthe mine. If the vein runs out, and then after a while\\n\\t\\t\\t\\tmore becomes obtainable, the new supply is dealt with in\\n\\t\\t\\t\\tthe same way as the first, and payment of zakat on it is\\n\\t\\t\\t\\tbegun on it as it was begun on the first.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Mines are dealt with like crops, and the\\n\\t\\t\\t\\tsame procedure is applied to both. Zakat is deducted from\\n\\t\\t\\t\\twhat comes out of a mine on the day it comes out, without\\n\\t\\t\\t\\twaiting for a year, just as a tenth is taken from a crop\\n\\t\\t\\t\\tat the time it is harvested, without waiting for a year\\n\\t\\t\\t\\tto elapse over it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "9",
    "sectionHeading": "The Zakat on Buried Treasure (Rikaz)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab and from Abu Salama ibn Abd ar-Rahman\\n\\t\\t\\t\\tfrom Abu Hurayra that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace ,said, \"There is a tax of a\\n\\t\\t\\t\\tfifth on buried treasure.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position which we are agreed upon, and\\n\\t\\t\\t\\twhich I have heard the people of knowledge mentioning, is\\n\\t\\t\\t\\tthat rikaz refers to treasure which has been found which\\n\\t\\t\\t\\twas buried during the jahiliyya, as long as neither\\n\\t\\t\\t\\tcapital is required, nor expense, great labour or\\n\\t\\t\\t\\tinconvenience incurred in recovering it. If capital is\\n\\t\\t\\t\\trequired or great labour is incurred, or on one occasion\\n\\t\\t\\t\\tthe mark is hit and on another it is missed, then it is\\n\\t\\t\\t\\tnot rikaz.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "10",
    "sectionHeading": "Things on Which there is No Zakat, in the Way of Jewellery, Bits of Gold and Silver, and Amber",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, used to\\n\\t\\t\\t\\tlook after the orphaned daughters of her brother in her\\n\\t\\t\\t\\thouse. They had jewellery (which they wore) and she did\\n\\t\\t\\t\\tnot take zakat from this jewellery of theirs.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "11",
    "sectionHeading": "Things on Which there is No Zakat, in the Way of Jewellery, Bits of Gold and Silver, and Amber",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to adorn his daughters and slave-girls with\\n\\t\\t\\t\\tgold jewellery and he did not take any zakat from their\\n\\t\\t\\t\\tjewellery.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Anyone who has unminted gold or silver, or\\n\\t\\t\\t\\tgold and silver jewellery which is not used for wearing,\\n\\t\\t\\t\\tmust pay zakat on it every year. It is weighed and\\n\\t\\t\\t\\tone-fortieth is taken, unless it falls short of twenty\\n\\t\\t\\t\\tdinars of gold or two hundred dirhams of silver, in which\\n\\t\\t\\t\\tcase there is no zakat to pay. Zakat is paid only when\\n\\t\\t\\t\\tjewellery is kept for purposes other than wearing. Bits\\n\\t\\t\\t\\tof gold and silver or broken jewellery which the owner\\n\\t\\t\\t\\tintends to mend to wear are in the same position as goods\\n\\t\\t\\t\\twhich are worn by their owner - no zakat has to be paid\\n\\t\\t\\t\\ton them by the owner.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no zakat (to pay) on pearls, musk\\n\\t\\t\\t\\tor amber.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "12",
    "sectionHeading": "The Zakat on the Property of Orphans and Trading on their Behalf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab said, \"Trade with the property of\\n\\t\\t\\t\\torphans and then it will not be eaten away by zakat.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "13",
    "sectionHeading": "The Zakat on the Property of Orphans and Trading on their Behalf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that his father said, ''A'isha used to look\\n\\t\\t\\t\\tafter me and one of my brothers - we were orphans - in\\n\\t\\t\\t\\ther house, and she would take the zakat from our\\n\\t\\t\\t\\tproperty.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "14",
    "sectionHeading": "The Zakat on the Property of Orphans and Trading on their Behalf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to give the property of the orphans\\n\\t\\t\\t\\tthat were in her house to whoever would use it to trade\\n\\t\\t\\t\\twith on their behalf.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "15",
    "sectionHeading": "The Zakat on the Property of Orphans and Trading on their Behalf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said bought\\n\\t\\t\\t\\tsome property on behalf of his brother's sons who were\\n\\t\\t\\t\\torphans in his house, and that that property was sold\\n\\t\\t\\t\\tafterwards for a great deal of profit.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in using the property of\\n\\t\\t\\t\\torphans to trade with on their behalf if the one in\\n\\t\\t\\t\\tcharge of them has permission. Furthermore, I do not\\n\\t\\t\\t\\tthink that he is under any liability.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "16",
    "sectionHeading": "The Zakat on Inheritance",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"I consider that if\\n\\t\\t\\t\\ta man dies and he has not paid zakat on his property,\\n\\t\\t\\t\\tthen zakat is taken from the third of his property (from\\n\\t\\t\\t\\twhich he can make bequests), and the third is not\\n\\t\\t\\t\\texceeded and the zakat is given priority over bequests.\\n\\t\\t\\t\\tIn my opinion it is the same as if he had a debt, which\\n\\t\\t\\t\\tis why I think it should be given priority over\\n\\t\\t\\t\\tbequests.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"This applies if the deceased has asked\\n\\t\\t\\t\\tfor the zakat to be deducted. If the deceased has not\\n\\t\\t\\t\\tasked for it to be deducted but his family do so then\\n\\t\\t\\t\\tthat is good, but it is not binding upon them if they do\\n\\t\\t\\t\\tnot do it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"The sunna which we are all agreed upon\\n\\t\\t\\t\\tis that zakat is not due from someone who inherits a debt\\n\\t\\t\\t\\t(i.e. wealth that was owed to the deceased), or goods, or\\n\\t\\t\\t\\ta house, or a male or female slave, until a year has\\n\\t\\t\\t\\telapsed over the price realised from whatever he sells\\n\\t\\t\\t\\t(i.e. slaves or a house, which are not zakatable) or over\\n\\t\\t\\t\\tthe wealth he inherits, from the day he sold the things,\\n\\t\\t\\t\\tor took possession of them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna with us is that zakat does not\\n\\t\\t\\t\\thave to be paid on wealth that is inherited until a year\\n\\t\\t\\t\\thas elapsed over it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "17",
    "sectionHeading": "The Zakat on Debts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tas-Sa'ib ibn Yazid that Uthman ibn Affan used to say,\\n\\t\\t\\t\\t\"This is the month for you to pay your zakat. If you have\\n\\t\\t\\t\\tany debts then pay them off so that you can sort out your\\n\\t\\t\\t\\twealth and take the zakat from it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "18",
    "sectionHeading": "The Zakat on Debts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Abi Tamima\\n\\t\\t\\t\\tas-Sakhtayani that Umar ibn Abd al-Aziz, when writing\\n\\t\\t\\t\\tabout wealth that one of his governors had collected\\n\\t\\t\\t\\tunjustly, ordered it to be returned to its owner and\\n\\t\\t\\t\\tzakat to be taken from it for the years that had passed.\\n\\t\\t\\t\\tThen shortly afterwards he revised his order with a\\n\\t\\t\\t\\tmessage that zakat should only be taken from it once,\\n\\t\\t\\t\\tsince it was not wealth in hand.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "19",
    "sectionHeading": "The Zakat on Debts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Khusayfa\\n\\t\\t\\t\\tthat he had asked Sulayman ibn Yasar whether zakat was\\n\\t\\t\\t\\tdue from a man who had wealth in hand but also owed a\\n\\t\\t\\t\\tdebt for the same amount, and he replied, \"No.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position that we are agreed upon\\n\\t\\t\\t\\tconcerning a debt is that the lender of it does not pay\\n\\t\\t\\t\\tzakat on it until he gets it back. Even if it stays with\\n\\t\\t\\t\\tthe borrower for a number of years before the lender\\n\\t\\t\\t\\tcollects it, the lender only has to pay zakat on it once.\\n\\t\\t\\t\\tIf he collects an amount of the debt which is not\\n\\t\\t\\t\\tzakatable, and has other wealth which is zakatable, then\\n\\t\\t\\t\\twhat he has collected of the debt is added to the rest of\\n\\t\\t\\t\\this wealth and he pays zakat on the total sum.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"If he has no ready money other than\\n\\t\\t\\t\\tthat which he has collected from his debt, and that does\\n\\t\\t\\t\\tnot reach a zakatable amount, then he does not have to\\n\\t\\t\\t\\tpay any zakat. He must, however, keep a record of the\\n\\t\\t\\t\\tamount that he has collected and if, later, he collects\\n\\t\\t\\t\\tanother amount which, when added to what he has already\\n\\t\\t\\t\\tcollected, brings zakat into effect, then he has to pay\\n\\t\\t\\t\\tzakat on it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"Zakat is due on this first amount,\\n\\t\\t\\t\\ttogether with what he has further collected of the debt\\n\\t\\t\\t\\towed to him, regardless of whether or not he has used up\\n\\t\\t\\t\\twhat he first collected. If what he takes back reaches\\n\\t\\t\\t\\ttwenty dinars of gold, or two hundred dirhams of silver\\n\\t\\t\\t\\the pays zakat on it. He pays zakat on anything else he\\n\\t\\t\\t\\ttakes back afte rthat, whether it be a large or small\\n\\t\\t\\t\\tamount, according to the amount.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What shows that zakat is only taken once\\n\\t\\t\\t\\tfrom a debt which is out of hand for some years before it\\n\\t\\t\\t\\tis recovered is that if goods remain with a man for\\n\\t\\t\\t\\ttrading purposes for some years before he sells them, he\\n\\t\\t\\t\\tonly has to pay zakat on their prices once. This is\\n\\t\\t\\t\\tbecause the one who is owed the debt, or owns the goods,\\n\\t\\t\\t\\tshould not have to take the zakat on the debt, or the\\n\\t\\t\\t\\tgoods, from anything else, since the zakat on anything is\\n\\t\\t\\t\\tonly taken from the thing itself, and not from anything\\n\\t\\t\\t\\telse.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Our position regarding some onewho owes a\\n\\t\\t\\t\\tdebt, and has goods which are worth enough to pay off the\\n\\t\\t\\t\\tdebt, and also has an amount of ready money which is\\n\\t\\t\\t\\tzakatable, is that he pays the zakat on the ready money\\n\\t\\t\\t\\twhich he has to hand.  If, however, he only has enough\\n\\t\\t\\t\\tgoods and ready money to pay off the debt, then he does\\n\\t\\t\\t\\tnot have to pay any zakat. But if the ready money that he\\n\\t\\t\\t\\thas reaches a zakatable amount over and above the amount\\n\\t\\t\\t\\tof the debt that he owes, then he must pay zakat on it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "20",
    "sectionHeading": "The Zakat on Merchandise",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tZurayq ibn Hayyan, who was in charge of Egypt in the time\\n\\t\\t\\t\\tof al-Walid, Sulayman, and Umar ibn Abd al-'Aziz,\\n\\t\\t\\t\\tmentioned that Umar ibn Abd al-Aziz had written to him\\n\\t\\t\\t\\tsaying, \"Assess the muslims that you come across and take\\n\\t\\t\\t\\tfrom what is apparent of their wealth and whatever\\n\\t\\t\\t\\tmerchandise is in their charge, one dinar for every forty\\n\\t\\t\\t\\tdinars, and the same proportion from what is less than\\n\\t\\t\\t\\tthat down to twenty dinars, and if the amount falls short\\n\\t\\t\\t\\tof that by one third of a dinar then leave it and do not\\n\\t\\t\\t\\ttake anything from it.\\tAs for the people of the Book\\n\\t\\t\\t\\tthat you come across, take from the merchandise in their\\n\\t\\t\\t\\tcharge one dinar for every twenty dinars, and the same\\n\\t\\t\\t\\tproportion from what is less than that down to ten\\n\\t\\t\\t\\tdinars, and if the amount falls short by one third of a\\n\\t\\t\\t\\tdinar leave it and do not take anything from it. Give\\n\\t\\t\\t\\tthem a receipt for what you have taken f rom them until\\n\\t\\t\\t\\tthe same time next year.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position among us (in Madina) concerning\\n\\t\\t\\t\\tgoods which are being managed for trading purposes is\\n\\t\\t\\t\\tthat if a man pays zakat on his wealth, and then buys\\n\\t\\t\\t\\tgoods with it, whether cloth, slaves or something\\n\\t\\t\\t\\tsimilar, and then sells them before a year has elapsed\\n\\t\\t\\t\\tover them, he does not pay zakat on that wealth until a\\n\\t\\t\\t\\tyear elapses over it from the day he paid zakat on it. He\\n\\t\\t\\t\\tdoes not have to pay zakat on any of the goods if he does\\n\\t\\t\\t\\tnot sell them for some years, and even if he keeps them\\n\\t\\t\\t\\tfor a very long time he still only has to pay zakat on\\n\\t\\t\\t\\tthem once when he sells them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position among us concerning a man who\\n\\t\\t\\t\\tuses gold or silver to buy wheat, dates, or whatever, for\\n\\t\\t\\t\\ttrading purposes and keeps it until a year has elapsed\\n\\t\\t\\t\\tover it and then sells it, is that he only has to pay\\n\\t\\t\\t\\tzakat on it if and when he sells it, if the price reaches\\n\\t\\t\\t\\ta zakatable amount. This is therefore not the same as the\\n\\t\\t\\t\\tharvest crops that a man reaps from his land, or the\\n\\t\\t\\t\\tdates that he harvests from his palms.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A man who has wealth which he invests in\\n\\t\\t\\t\\ttrade, but which does not realise a zakatable profit for\\n\\t\\t\\t\\thim, fixes a month in the year when he takes stock of\\n\\t\\t\\t\\twhat goods he has for trading, and counts the gold and\\n\\t\\t\\t\\tsilver that he has in ready money, and if all of it comes\\n\\t\\t\\t\\tto a zakatable amount he pays zakat on it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position is the same for muslims who\\n\\t\\t\\t\\ttrade and muslims who do not. They only have to pay zakat\\n\\t\\t\\t\\tonce in any one year, whether they trade in that year or\\n\\t\\t\\t\\tnot.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "21",
    "sectionHeading": "Wealth which has been Hidden Away (Kanz)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"I heard Abdullah ibn Umar being asked what kanz\\n\\t\\t\\t\\twas and he said, 'It is wealth on which zakat has not\\n\\t\\t\\t\\tbeen paid.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "22",
    "sectionHeading": "Wealth which has been Hidden Away (Kanz)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abu's-Salih as-Samman that Abu Hurayra used to say,\\n\\t\\t\\t\\t\"Anyone who has wealth on which he has not paid zakat\\n\\t\\t\\t\\twill, on the day of rising, find his wealth made to\\n\\t\\t\\t\\tresemble a whiteheaded serpent with a sac of venom in\\n\\t\\t\\t\\teach cheek which will seek him out until it has him in\\n\\t\\t\\t\\tits power, saying, 'I am the wealth that you had hidden\\n\\t\\t\\t\\taway.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "23",
    "sectionHeading": "The Zakat on Livestock",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had read what Umar\\n\\t\\t\\t\\tibn al-Khattab had written about zakat, and in it he\\n\\t\\t\\t\\tfound: \\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"In the name of Allah, the Merciful, the ompassionate.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Book of Zakat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn twenty-four camels or less zakat is paid with sheep,\\n\\t\\t\\t\\tone ewe for every five camels.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to thirty-five camels, a\\n\\t\\t\\t\\tshe-camel in its second year, and, if there is no she\\n\\t\\t\\t\\tcamel in its second year, a male camel in its third year.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to forty-five camels, a\\n\\t\\t\\t\\tshe-camel in its third year.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to sixty camels, a she camel\\n\\t\\t\\t\\tin its fourth year that is ready to be sired.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to seventy-five camels, a\\n\\t\\t\\t\\tshe-camel in its fifth year.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to ninety camels, two\\n\\t\\t\\t\\tshe-camels in their third year.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to one hundred and twenty\\n\\t\\t\\t\\tcamels, two she-camels in their fourth year that are\\n\\t\\t\\t\\tready to be sired.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn any number of camels above that, for every forty\\n\\t\\t\\t\\tcamels, a she-camel in its third year, and for every\\n\\t\\t\\t\\tfifty, a she-camel in its fourth year.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn grazing sheep and goats, if they come to forty or\\n\\t\\t\\t\\tmore, up to one hundred and twenty head, one ewe.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to two hundred head, two ewes.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, up to three hundred, three ewes.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn anything above that, for every hundred, one ewe.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA ram should not be taken for zakat. nor an old or an\\n\\t\\t\\t\\tinjured ewe, except as the zakat-collector thinks fit.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThose separated should not be gathered together nor\\n\\t\\t\\t\\tshould those gathered together be separated in order to\\n\\t\\t\\t\\tavoid paying zakat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWhatever belongs to two associates is settled between\\n\\t\\t\\t\\tthem proportionately.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOn silver, if it reaches five awaq (two hundred dirhams),\\n\\t\\t\\t\\tone fortieth is paid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "24",
    "sectionHeading": "The Zakat on Cattle",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd ibn Qays\\n\\t\\t\\t\\tal-Makki from Tawus al Yamani that from thirty cows,\\n\\t\\t\\t\\tMuadh ibn Jabal took one cow in its second year, and from\\n\\t\\t\\t\\tforty cows, one cow in its third or fourth year, and when\\n\\t\\t\\t\\tless than that (i.e. thirty cows) was brought to him he\\n\\t\\t\\t\\trefused to take anything from it. He said, \"I have not\\n\\t\\t\\t\\theard anything about it from the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace. When I meet him, I\\n\\t\\t\\t\\twill ask him.\" But the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, died before Muadh ibn\\n\\t\\t\\t\\tJabal returned.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The best that I have heard\\n\\t\\t\\t\\tabout some one who has sheep or goats with two or more\\n\\t\\t\\t\\tshepherds in different places is that they are added\\n\\t\\t\\t\\ttogether and the owner then pays the zakat on them. This\\n\\t\\t\\t\\tis the same situation as a man who has gold and silver\\n\\t\\t\\t\\tscattered in the hands of various people. He must add it\\n\\t\\t\\t\\tall u p and pay whatever zakat there is to pay on the sum\\n\\t\\t\\t\\ttotal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, about a man who had both\\n\\t\\t\\t\\tsheep and goats, that they were added up together for the\\n\\t\\t\\t\\tzakat to be assessed, and if between them they came to a\\n\\t\\t\\t\\tnumber on which zakat was due, he paid zakat on them.\\n\\t\\t\\t\\tMalik added, \"They are all considered as sheep, and in\\n\\t\\t\\t\\tUmar ibn al-Khattab's book it says, 'On grazing sheep and\\n\\t\\t\\t\\tgoats, if they come to forty or more, one ewe.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If there are more sheep than goats and their\\n\\t\\t\\t\\towner only has to pay one ewe, the zakat collector takes\\n\\t\\t\\t\\tthe ewe from the sheep. If there are more goats than\\n\\t\\t\\t\\tsheep, he takes it from the goats. If there is an equal\\n\\t\\t\\t\\tnumber of sheep and goats, he takes the ewe from\\n\\t\\t\\t\\twhichever kind he wishes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"Similarly, Arabian camels\\n\\t\\t\\t\\tand Bactrian camels are added up together in order to\\n\\t\\t\\t\\tassess the zakat that the owner has to pay. They are all\\n\\t\\t\\t\\tconsidered as camels. If there are more Arabian camels\\n\\t\\t\\t\\tthan Bactrians and the owner only has to pay one camel,\\n\\t\\t\\t\\tthe zakat collector takes it from the Arabian ones. If,\\n\\t\\t\\t\\thowever, there are more Bactrian camels he takes it from\\n\\t\\t\\t\\tthose. If there is an equal number of both, he takes the\\n\\t\\t\\t\\tcamel from whichever kind he wishes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Similarly, cows and water buffaloes are\\n\\t\\t\\t\\tadded up together and are all considered as cattle. If\\n\\t\\t\\t\\tthere are more cows than water buffalo and the owner only\\n\\t\\t\\t\\thas to pay one cow, the zakat collector takes it from the\\n\\t\\t\\t\\tcows. If there are more water buffalo, he takes it from\\n\\t\\t\\t\\tthem. If there is an equal number of both, he takes the\\n\\t\\t\\t\\tcow from whichever kind he wishes.  So if zakat is\\n\\t\\t\\t\\tnecessary, it is assessed taking both kinds as one\\n\\t\\t\\t\\tgroup.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"No zakat is due from anyone\\n\\t\\t\\t\\twho comes into possession of livestock, whether camels or\\n\\t\\t\\t\\tcattle or sheep and goats, until a year has elapsed over\\n\\t\\t\\t\\tthem from the day he acquired them, unless he already had\\n\\t\\t\\t\\tin his possession a nisab of livestock. (The nisab is the\\n\\t\\t\\t\\tminimum amount on which zakat has to be paid, either five\\n\\t\\t\\t\\thead of camels, or thirty cattle, or forty sheep and\\n\\t\\t\\t\\tgoats). If he already had five head of camels, or thirty\\n\\t\\t\\t\\tcattle, or forty sheep and goats, and he then acquired\\n\\t\\t\\t\\tadditional camels, or cattle, or sheep and goats, either\\n\\t\\t\\t\\tby trade, or gift, or inheritance, he must pay zakat on\\n\\t\\t\\t\\tthem when he pays the zakat on the livestock he already\\n\\t\\t\\t\\thas, even if a year has not elapsed over the acquisition.\\n\\t\\t\\t\\tAnd even if the additional livestock that he acquired has\\n\\t\\t\\t\\thad zakat taken from it the day before he bought it, or\\n\\t\\t\\t\\tthe day before he inherited it, he must still pay the\\n\\t\\t\\t\\tzakat on it when he pays the zakat on the livestock he\\n\\t\\t\\t\\talready has \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"This is the same situation\\n\\t\\t\\t\\tas some one who has some silver on which he pays the\\n\\t\\t\\t\\tzakat and then uses to buy some goods with from somebody\\n\\t\\t\\t\\telse. He then has to pay zakat on those goods when he\\n\\t\\t\\t\\tsells them. It could be that one man will have to pay\\n\\t\\t\\t\\tzakat on them one day, and by the following day the other\\n\\t\\t\\t\\tman will also have to pay.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, in the case of a man who had sheep and goats\\n\\t\\t\\t\\twhich did not reach the zakatable amount, and who then\\n\\t\\t\\t\\tbought or inherited an additional number of sheep and\\n\\t\\t\\t\\tgoats well above the zakatable amount, that he did not\\n\\t\\t\\t\\thave to pay zakat on all his sheep and goats until a year\\n\\t\\t\\t\\thad elapsed over them from the day he acquired the new\\n\\t\\t\\t\\tanimals, whether he bought them or inherited them.This\\n\\t\\t\\t\\twas because none of the livestock that a man had, whether\\n\\t\\t\\t\\tit be camels, or cattle, or sheep and goats, was counted\\n\\t\\t\\t\\tas a nisab until there was enough of any one kind for him\\n\\t\\t\\t\\tto have to pay zakat on it. This was the nisab which is\\n\\t\\t\\t\\tused for assessing the zakat on what the owner had\\n\\t\\t\\t\\tadditionally acquired, whether it were a large or small\\n\\t\\t\\t\\tamount of livestock.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man has enough camels, or cattle, or\\n\\t\\t\\t\\tsheep and goats, for him to have to pay zakat on each\\n\\t\\t\\t\\tkind, and then he acquires another camel, or cow, or\\n\\t\\t\\t\\tsheep, or goat, it must be included with the rest of his\\n\\t\\t\\t\\tanimals when he pays zakat on them \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"This is what I like most out\\n\\t\\t\\t\\tof what I heard about the matter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, in the case of a man who does not have the\\n\\t\\t\\t\\tanimal required of him for the zakat, \"If it is a\\n\\t\\t\\t\\ttwo-year-old she-camel that he does not have, a\\n\\t\\t\\t\\tthree-year-old male camel is taken instead. If it is a\\n\\t\\t\\t\\tthree- or four- or five-year-old she-camel that he does\\n\\t\\t\\t\\tnot have, then he must buy the required animal so that he\\n\\t\\t\\t\\tgives the collector what is due. I do not like it if the\\n\\t\\t\\t\\towner gives the collector the equivalent value.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about camels used for carrying water, and\\n\\t\\t\\t\\tcattle used for working water-wheels or ploughing, \"In my\\n\\t\\t\\t\\topinion such animals are included when assessing zakat.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "25",
    "sectionHeading": "The Zakat of Associates",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, concerning two associates,\\n\\t\\t\\t\\t\"If they share one herdsman, one male animal, one pasture\\n\\t\\t\\t\\tand one watering place then the two men are associates,\\n\\t\\t\\t\\tas long as each one of them knows his own property from\\n\\t\\t\\t\\tthat of his companion If someone cannot tell his property\\n\\t\\t\\t\\tapart from that of his fellow, he is not an associate,\\n\\t\\t\\t\\tbut rather, a co-owner \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not obligatory for both associates to\\n\\t\\t\\t\\tpay zakat unless both of them have a zakatable amount (of\\n\\t\\t\\t\\tlivestock). If, for instance, one of the associates has\\n\\t\\t\\t\\tforty or more sheep and goats and the other has less than\\n\\t\\t\\t\\tforty sheep and goats, then the one who has forty has to\\n\\t\\t\\t\\tpay zakat and the one who has less does not. If both of\\n\\t\\t\\t\\tthem have a zakatable amount (of livestock) then both of\\n\\t\\t\\t\\tthem are assessed together (i.e the flock is assessed as\\n\\t\\t\\t\\tone) and both of them have to pay zakat. If one of them\\n\\t\\t\\t\\thas a thousand sheep, or less, that he has to pay zakat\\n\\t\\t\\t\\ton, and the other has forty, or more, then they are\\n\\t\\t\\t\\tassociates, and each one pays his contribution according\\n\\t\\t\\t\\tto the number of animals he has - so much from the one\\n\\t\\t\\t\\twith a thousand, and so much from the one with forty.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Two associates in camels are the same as two\\n\\t\\t\\t\\tassociates in sheep and goats, and, for the purposes of\\n\\t\\t\\t\\tzakat, are assessed together if each one of them has a\\n\\t\\t\\t\\tzakatable amount (of camels). That is because the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'There is no zakat on less than five head of\\n\\t\\t\\t\\tcamels,' and Umar ibn al-Khattab said, 'On grazing sheep\\n\\t\\t\\t\\tand goats, if they come to forty or more - one ewe.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"This is what I like most out\\n\\t\\t\\t\\tof what I have heard about the matter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that when Umar ibn al-Khattab said, \"Those\\n\\t\\t\\t\\tseparated should not be gathered together nor should\\n\\t\\t\\t\\tthose gathered together be separated in order to avoid\\n\\t\\t\\t\\tpaying zakat,\" what he meant was the owners of livestock.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What he meant when he said, 'Those separated\\n\\t\\t\\t\\tshould not be gathered together' is, for instance, that\\n\\t\\t\\t\\tthere is a group of three men, each of whom has forty\\n\\t\\t\\t\\tsheep and goats, and each of whom thus has to pay zakat.\\n\\t\\t\\t\\tThen, when the zakat collector is on his way ,they gather\\n\\t\\t\\t\\ttheir flocks together so that they only owe one ewe\\n\\t\\t\\t\\tbetween them. This they are forbidden to do. What he\\n\\t\\t\\t\\tmeant when he said, 'nor should those gathered together\\n\\t\\t\\t\\tbe separated,' is, for instance, that there are two\\n\\t\\t\\t\\tassociates, each one of whom has a hundred and one sheep\\n\\t\\t\\t\\tand goats, and each of whom must therefore pay three\\n\\t\\t\\t\\tewes. Then, when the zakat collector is on his way, they\\n\\t\\t\\t\\tsplit up their flocks so that they only have to pay one\\n\\t\\t\\t\\tewe each. This they are forbidden to do. And so it is\\n\\t\\t\\t\\tsaid, 'Those separated should not be gathered together\\n\\t\\t\\t\\tnor should those gathered together be separated in order\\n\\t\\t\\t\\tto avoid paying zakat.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I have heard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "26",
    "sectionHeading": "Counting Lambs and Kids when Assessing Zakat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili from a son of Abdullah ibn Sufyan ath-Thaqafi\\n\\t\\t\\t\\tfrom his grandfather Sufyan ibn Abdullah that Umar ibn\\n\\t\\t\\t\\tal-Khattab once sent him to collect zakat. He used to\\n\\t\\t\\t\\tinclude sakhlas (when assessing zakat), and they said,\\n\\t\\t\\t\\t\"Do you include sakhlas even though you do not take them\\n\\t\\t\\t\\t(as payment)?\"\\tHe returned to Umar ibn al-Khattab and\\n\\t\\t\\t\\tmentioned that to him and Umar said, \"Yes, you include a\\n\\t\\t\\t\\tsakhla which the shepherd is carrying, but you do not\\n\\t\\t\\t\\ttake it. Neither do you take an akula, or a rubba, or a\\n\\t\\t\\t\\tmakhid, or male sheep and goats in their second and third\\n\\t\\t\\t\\tyears, and this is a just compromise between the young of\\n\\t\\t\\t\\tsheep and goats and the best of them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A sakhla is a newborn lamb or kid. A rubba\\n\\t\\t\\t\\tis a mother that is looking after her offspring, a makhid\\n\\t\\t\\t\\tis a pregnant ewe or goat, and an akula is a sheep or\\n\\t\\t\\t\\tgoat that is being fattened for meat.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about a man who had sheep and goats on which\\n\\t\\t\\t\\the did not have to pay any zakat, but which increased by\\n\\t\\t\\t\\tbirth to a zakatable amount on the day before the zakat\\n\\t\\t\\t\\tcollector came to them, \"If the number of sheep and goats\\n\\t\\t\\t\\talong with their (newborn) offspring reaches a zakatable\\n\\t\\t\\t\\tamount then the man has to pay zakat on them. That is\\n\\t\\t\\t\\tbecause the offspring of the sheep are part of the flock\\n\\t\\t\\t\\titself. It is not the same situation as when some one\\n\\t\\t\\t\\tacquires sheep by buying them, or is given them, or\\n\\t\\t\\t\\tinherits them. Rather, it is like when merchandise whose\\n\\t\\t\\t\\tvalue does not come to a zakatable amount is sold, and\\n\\t\\t\\t\\twith the profit that accrues it then comes to a zakatable\\n\\t\\t\\t\\tamount. The owner must then pay zakat on both his profit\\n\\t\\t\\t\\tand his original capital, taken together. If his profit\\n\\t\\t\\t\\thad been a chance acquisition or an inheritance he would\\n\\t\\t\\t\\tnot have had to pay zakat on it until one year had\\n\\t\\t\\t\\telapsed over it from the day he had acquired it or\\n\\t\\t\\t\\tinherited it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The young of sheep and goats are part of the\\n\\t\\t\\t\\tflock, in the same way that profit from wealth is part of\\n\\t\\t\\t\\tthat wealth. There is, however, one difference, in that\\n\\t\\t\\t\\twhen a man has a zakatable amount of gold and silver, and\\n\\t\\t\\t\\tthen acquires an additional amount of wealth, he leaves\\n\\t\\t\\t\\taside the wealth he has acquired and does not pay zakat\\n\\t\\t\\t\\ton it when he pays the zakat on his original wealth but\\n\\t\\t\\t\\twaits until a year has elapsed over what he has acquired\\n\\t\\t\\t\\tfrom the day he acquired it. Whereas a man who has a\\n\\t\\t\\t\\tzakatable amount of sheep and goats, or cattle, or\\n\\t\\t\\t\\tcamels, and then acquires another camel, cow, sheep or\\n\\t\\t\\t\\tgoat, pays zakat on it at the same time that he pays the\\n\\t\\t\\t\\tzakat on the others of its kind, if he already has a\\n\\t\\t\\t\\tzakatable amount of livestock of that particular kind.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the best of what I have heard about\\n\\t\\t\\t\\tthis. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "27",
    "sectionHeading": "What to do about the Zakat when Two Years are Assessed together",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The position with us\\n\\t\\t\\t\\tconcerning a man who has zakat to pay on one hundred\\n\\t\\t\\t\\tcamels but then the zakat collector does not come to him\\n\\t\\t\\t\\tuntil zakat is due for a second timeand by that time all\\n\\t\\t\\t\\this camels have died except five, is that the zakat\\n\\t\\t\\t\\tcollector assesses from the five camels the two amounts\\n\\t\\t\\t\\tof zakat that are due from the owner of the animals,\\n\\t\\t\\t\\twhich in this case is only two sheep, one for each year.\\n\\t\\t\\t\\tThis is because the only zakat which an owner of\\n\\t\\t\\t\\tlivestock has to pay is what is due from him on the day\\n\\t\\t\\t\\tthat the zakat is (actually) assessed. His livestock may\\n\\t\\t\\t\\thave died or it may have increased, and the zakat\\n\\t\\t\\t\\tcollector only assesses the zakat on what he (actually)\\n\\t\\t\\t\\tfinds on the day he makes the assessment. If more than\\n\\t\\t\\t\\tone payment of zakat is due from the owner of the\\n\\t\\t\\t\\tlivestock, he still only has to pay zakat according to\\n\\t\\t\\t\\twhat the zakat collector (actually) finds in his\\n\\t\\t\\t\\tpossession, and if his livestock has died, or several\\n\\t\\t\\t\\tpayments of zakat are due from him and nothing is taken\\n\\t\\t\\t\\tuntil all his livestock has died, or has been reduced to\\n\\t\\t\\t\\tan amount below that on which he has to pay zakat, then\\n\\t\\t\\t\\the does not have to pay any zakat, and there is no\\n\\t\\t\\t\\tliability (on him) for what has died or for the years\\n\\t\\t\\t\\tthat have passed.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "28",
    "sectionHeading": "The Prohibition against Making Things Difficult for People when Taking Zakat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban from al-Qasim ibn Muhammad\\n\\t\\t\\t\\tthat A'isha, the wife of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Sheep from the zakat were\\n\\t\\t\\t\\tbrought past Umar ibn al-Khattab and he saw amongst them\\n\\t\\t\\t\\ta sheep with a large udder, ready to give milk, and he\\n\\t\\t\\t\\tsaid, 'What is this sheep doing here?' and they replied,\\n\\t\\t\\t\\t'It is one of the sheep from the zakat.'  Umar said, 'The\\n\\t\\t\\t\\towners did not give this sheep willingly. Do not subject\\n\\t\\t\\t\\tpeople to trials. Do not take from the muslims those of\\n\\t\\t\\t\\ttheir animals which are the best food-producers.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "29",
    "sectionHeading": "The Prohibition against Making Things Difficult for People when Taking Zakat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban said, \"Two men from the\\n\\t\\t\\t\\tAshja tribe told me that Muhammad ibn Maslama al-Ansari\\n\\t\\t\\t\\tused tocome to them to collect their zakat, and he would\\n\\t\\t\\t\\tsay to anyone who owned livestock, 'Select (the animal\\n\\t\\t\\t\\tfor) the zakat on your livestock and bring it to me,' and\\n\\t\\t\\t\\the would accept any sheep that was brought to him\\n\\t\\t\\t\\tprovided it met the requirements of what the man owed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna with us, and what I have seen the\\n\\t\\t\\t\\tpeople of knowledge doing in our city, is that things are\\n\\t\\t\\t\\tnot made difficult for the muslims in their paying zakat,\\n\\t\\t\\t\\tand whatever they offer of their livestock is accepted\\n\\t\\t\\t\\tfrom them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "30",
    "sectionHeading": "Receiving Zakat, and Who is Permitted to Receive It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Zayd ibn Aslam from Ata ibn\\n\\t\\t\\t\\tYasar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Zakat is not permissible for\\n\\t\\t\\t\\tsomeone who is not in need except for five: someone\\n\\t\\t\\t\\tfighting in the way of Allah, someone who collects zakat,\\n\\t\\t\\t\\tsomeone who has suffered (financial) loss (at the hands\\n\\t\\t\\t\\tof debtors), someone who buys it with his own money, and\\n\\t\\t\\t\\tsome one who has a poor neighbour who receives some zakat\\n\\t\\t\\t\\tand gives some as a present to the one who is not in\\n\\t\\t\\t\\tneed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position with us concerning the dividing\\n\\t\\t\\t\\tup of zakat is that it is up to the individual judgement\\n\\t\\t\\t\\tof the man in charge (wali). Whichever categories of\\n\\t\\t\\t\\tpeople are in most need and are most numerous are given\\n\\t\\t\\t\\tpreference, according to how the man in charge sees fit.\\n\\t\\t\\t\\tIt is possible that that may change after one year, or\\n\\t\\t\\t\\ttwo, or more, but it is always those who are in need and\\n\\t\\t\\t\\tare most numerous that are given preference, whatever\\n\\t\\t\\t\\tcategory they may belong to. This is what I have seen\\n\\t\\t\\t\\tdone by people of knowledge with which I am satisifed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no fixed share for the collector of\\n\\t\\t\\t\\tthe zakat, except according to what the imam sees fit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "31",
    "sectionHeading": "Collecting Zakat and Being Firm In Doing So",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abu\\n\\t\\t\\t\\tBakr as-Siddiq said, \"If they withhold even a hobbling\\n\\t\\t\\t\\tcord I will fight them over it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "32",
    "sectionHeading": "Collecting Zakat and Being Firm In Doing So",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Zayd ibn Aslam said,\\n\\t\\t\\t\\t''Umar ibn al Khattab drank some milk which he liked\\n\\t\\t\\t\\t(very much) and he asked the man who had given it to him,\\n\\t\\t\\t\\t'Where did this milk come from?'  The man told him that\\n\\t\\t\\t\\the had come to a watering-place, which he named, and had\\n\\t\\t\\t\\tfound grazing livestock from the zakat watering there. He\\n\\t\\t\\t\\twas given some of their milk, which he then put into his\\n\\t\\t\\t\\twater-skin, and that was the milk in question. Umar ibn\\n\\t\\t\\t\\tal-Khattab then put his hand into his mouth to make\\n\\t\\t\\t\\thimself vomit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position with us is that if anyone\\n\\t\\t\\t\\trefuses to honour one of the obligatory demands of Allah,\\n\\t\\t\\t\\tand the muslims are unable to get it, then they have the\\n\\t\\t\\t\\tright to fight him until they get itfrom him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "33",
    "sectionHeading": "Collecting Zakat and Being Firm In Doing So",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that one\\n\\t\\t\\t\\tof the administrators of Umar ibn Abd al-'Aziz wrote to\\n\\t\\t\\t\\thim mentioning that a man had refused to pay zakat on his\\n\\t\\t\\t\\tproperty. Umar wrote to the administrator and told him to\\n\\t\\t\\t\\tleave the man alone and not to take any zakat from him\\n\\t\\t\\t\\twhen he took it from the other muslims. The man heard\\n\\t\\t\\t\\tabout this and the situation became unbearable for him,\\n\\t\\t\\t\\tand after that he paid the zakat on his property. The\\n\\t\\t\\t\\tadministrator wrote to Umar and mentioned that to him,\\n\\t\\t\\t\\tand Umar wrote back telling him to take the zakat from\\n\\t\\t\\t\\thim.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "34",
    "sectionHeading": "The Zakat on Estimated Yields of Date Palms and Vines",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a reliable source\\n\\t\\t\\t\\tfrom Sulayman ibn Yasar and from Busr ibn Said that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"On land that is watered by rain or springs\\n\\t\\t\\t\\tor any natural means there is (zakat to pay of) a tenth.\\n\\t\\t\\t\\tOn irrigated land there is (zakat of) a twentieth (to\\n\\t\\t\\t\\tpay).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "35",
    "sectionHeading": "The Zakat on Estimated Yields of Date Palms and Vines",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ziyad ibn Sad that\\n\\t\\t\\t\\tIbn Shihab said, \"Neither jurur, nor musran al-fara, nor\\n\\t\\t\\t\\tadhq ibn hubayq should be taken as zakat from dates. They\\n\\t\\t\\t\\tshould be included in the assessment but not taken as\\n\\t\\t\\t\\tzakat. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the same as with sheep and goats,\\n\\t\\t\\t\\twhose young are included in the assessment but are not\\n\\t\\t\\t\\t(actually) taken as zakat. There are also certain kinds\\n\\t\\t\\t\\tof fruit which are not taken as zakat, such as burdi\\n\\t\\t\\t\\tdates (one of the finest kinds of dates), and similar\\n\\t\\t\\t\\tvarieties.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tNeither the lowest quality (of any property) nor the\\n\\t\\t\\t\\thighest should be taken. Rather, zakat should be taken\\n\\t\\t\\t\\tfrom average quality property.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position that we are agreed upon\\n\\t\\t\\t\\tconcerning fruit is that only dates and grapes are\\n\\t\\t\\t\\testimated while on the tree. They are estimated when\\n\\t\\t\\t\\ttheir usability is clear and they are halal to sell. This\\n\\t\\t\\t\\tis because the fruit of date-palms and vines is eaten\\n\\t\\t\\t\\tstraightaway in the form of fresh dates and grapes, and\\n\\t\\t\\t\\tso the assessment is done by estimation to make things\\n\\t\\t\\t\\teasier for people and to avoid causing them trouble.\\n\\t\\t\\t\\tTheir produce is estimated and then they are given a free\\n\\t\\t\\t\\thand in using their produce as they wish, and later they\\n\\t\\t\\t\\tpay the zakat on it according to the estimation that was\\n\\t\\t\\t\\tmade.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"crops which are not eaten fresh, such as\\n\\t\\t\\t\\tgrains and seeds, which are only eaten after they have\\n\\t\\t\\t\\tbeen harvested, are not estimated. The owner, after he\\n\\t\\t\\t\\thas harvested, threshed and sifted the crop, so that it\\n\\t\\t\\t\\tis then in the form of grain or seed, has to fulfil his\\n\\t\\t\\t\\ttrust himself and deduct the zakat he owes if the amount\\n\\t\\t\\t\\tis large enough for him to have to pay zakat. This is the\\n\\t\\t\\t\\tposition that we are all agreed upon here (in Madina).\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position that we are all agreed upon\\n\\t\\t\\t\\there (in Madina) is that the produce of date palms is\\n\\t\\t\\t\\testimated while it is still on the tree, after it has\\n\\t\\t\\t\\tripened and become halal to sell, and the zakat on it is\\n\\t\\t\\t\\tdeducted in the form of dried dates at the time of\\n\\t\\t\\t\\tharvest. If the fruit is damaged after it has been\\n\\t\\t\\t\\testimated and the damage affects all the fruit then no\\n\\t\\t\\t\\tzakat has to be paid. If some of the fruit remains\\n\\t\\t\\t\\tunaffected, and this fruit amounts to five awsuq or more\\n\\t\\t\\t\\tusing the sa of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, then zakat is deducted from it. Zakat\\n\\t\\t\\t\\tdoes not have to be paid, however, on the fruit that was\\n\\t\\t\\t\\tdamaged . Grapevines are dealt with in the same way.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf a man owns various pieces of property in various\\n\\t\\t\\t\\tplaces, or is a co-owner of various pieces of property in\\n\\t\\t\\t\\tvarious places, none of which individually comes to a\\n\\t\\t\\t\\tzakatable amount, but which, when added together, do come\\n\\t\\t\\t\\tto a zakatable amount, then he adds them together and\\n\\t\\t\\t\\tpays the zakat that is due on them .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "36",
    "sectionHeading": "The Zakat on Seeds and Olives",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Ibn Shihab\\n\\t\\t\\t\\tabout olives and he said, \"There is a tenth on them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The tenth that is taken from olives is taken\\n\\t\\t\\t\\tafter they have been pressed, and the olives must come to\\n\\t\\t\\t\\ta minimum amount of five awsuq and there must be at least\\n\\t\\t\\t\\tfive awsuq of olives. If there are less than five awsuq\\n\\t\\t\\t\\tof olives, no zakat has to be paid.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOlive trees are like date palms insofar as there is a\\n\\t\\t\\t\\ttenth on whatever is watered by rain or springs or any\\n\\t\\t\\t\\tnatural means, and a twentieth on whatever is irrigated.\\n\\t\\t\\t\\tHowever, olives are not estimated while on the tree. The\\n\\t\\t\\t\\tsunna with us as far as grain and seeds which people\\n\\t\\t\\t\\tstore and eat is concerned is that a tenth is taken from\\n\\t\\t\\t\\twhatever has been watered by rain or springs or any\\n\\t\\t\\t\\tnatural means, and a twentieth from whatever has been\\n\\t\\t\\t\\tirrigated, that is, as long as the amount comes to five\\n\\t\\t\\t\\tawsuq or more using the aforementioned sa, that is, the\\n\\t\\t\\t\\tsa of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace. Zakat must be paid on anything above five awsuq\\n\\t\\t\\t\\taccording to the amount involved.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The kinds of grain and seeds on which there\\n\\t\\t\\t\\tis zakat are:  wheat, barley, sult (a kind of barley),\\n\\t\\t\\t\\tsorghum, pearl millet, rice, lentils, peas, beans, sesame\\n\\t\\t\\t\\tseeds and other such grains and seeds which are used for\\n\\t\\t\\t\\tfood.  Zakat is taken from them after they have been\\n\\t\\t\\t\\tharvested and are in the form of grai n or seed.\" He\\n\\t\\t\\t\\tsaid, \"People are entrusted with the assessment and\\n\\t\\t\\t\\twhatever they hand over is accepted .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether the tenth or the twentieth was\\n\\t\\t\\t\\ttaken out of olives before they were sold or after and he\\n\\t\\t\\t\\tsaid, \"The sale is not taken into consideration. It is\\n\\t\\t\\t\\tthe people who produce the olives that are asked about\\n\\t\\t\\t\\tthe olives, just as it is the people who produce\\n\\t\\t\\t\\tfoodstuffs that are asked about it, and zakat is taken\\n\\t\\t\\t\\tfrom them by what they say. Someone who gets five awsuq\\n\\t\\t\\t\\tor more of olives from his olive trees has a tenth taken\\n\\t\\t\\t\\tfrom the oil after pressing. Whereas someone who does not\\n\\t\\t\\t\\tget five awsuq from his trees does not have to pay any\\n\\t\\t\\t\\tzakat on the oil.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who sells his crops when they are\\n\\t\\t\\t\\tripe and are ready in the husk has to pay zakat on them\\n\\t\\t\\t\\tbut the one who buys them does not. The sale of crops is\\n\\t\\t\\t\\tnot valid until they are ready in the husk and no longer\\n\\t\\t\\t\\tneed water.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning the word of Allah the Exalted,\\n\\t\\t\\t\\t\"And give its due on the day of its harvesting,\" that it\\n\\t\\t\\t\\treferred to zakat, and that he had heard people saying\\n\\t\\t\\t\\tthat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone sells his garden or his land, on\\n\\t\\t\\t\\twhich are crops or fruit which have not yet ripened, then\\n\\t\\t\\t\\tit is the buyer who has to pay the zakat. If, however,\\n\\t\\t\\t\\tthey have ripened, it is the seller who has to pay the\\n\\t\\t\\t\\tzakat, unless paying the zakat is one of the conditions\\n\\t\\t\\t\\tof the sale.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "37",
    "sectionHeading": "Fruit on which Zakat does Not have to be Paid",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"If a man has four awsuq of dates he has\\n\\t\\t\\t\\tharvested, four awsuq of grapes he has picked, or four\\n\\t\\t\\t\\tawsuq of wheat he has reaped or four awsuq of pulses he\\n\\t\\t\\t\\thas harvested, the different categories are not added\\n\\t\\t\\t\\ttogether, and he does not have to pay zakat on any of the\\n\\t\\t\\t\\tcateg ries - the dates, the grapes, the wheat or the\\n\\t\\t\\t\\tpulses - until any one of them comes to five awsuq using\\n\\t\\t\\t\\tthe sa of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, as the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'There is no zakat (to pay) on\\n\\t\\t\\t\\tanything less than five awsuq of dates. 'lf any of the\\n\\t\\t\\t\\tcategories comes to five awsuq, then zakat must be paid.\\n\\t\\t\\t\\tIf none of the categories comes to five awsuq, then there\\n\\t\\t\\t\\tis no zakat to pay. The explanation of this is that when\\n\\t\\t\\t\\ta man harvests five awsuq of dates (from his palms), he\\n\\t\\t\\t\\tadds them all together and deducts the zakat from them\\n\\t\\t\\t\\teven if they are all of different kinds and varieties. It\\n\\t\\t\\t\\tis the same with different kinds of cereal, such as brown\\n\\t\\t\\t\\twheat, white wheat, barley and sult, which are all\\n\\t\\t\\t\\tconsidered as one category. If a man reaps five awsuq of\\n\\t\\t\\t\\tany of these, he adds it all together and pays zakat on\\n\\t\\t\\t\\tit. If it does not come to that amount he does not have\\n\\t\\t\\t\\tto pay any zakat. It is the same (also) with grapes,\\n\\t\\t\\t\\twhether they be black or red. If a man picks five awsuq\\n\\t\\t\\t\\tof them he has to pay zakat on them, but if they do not\\n\\t\\t\\t\\tcome to that amount he does not have to pay any zakat.\\n\\t\\t\\t\\tPulses also are considered as one category, like cereals,\\n\\t\\t\\t\\tdates and grapes, even if they are of different varieties\\n\\t\\t\\t\\tand are called by different names. Pulses include\\n\\t\\t\\t\\tchick-peas, lentils, beans, peas, and anything which is\\n\\t\\t\\t\\tagreed by everybody to be a pulse. If a man harvests five\\n\\t\\t\\t\\tawsuq of pulses, measuring by the aforementioned sa, the\\n\\t\\t\\t\\tsa of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, he collects them all together and must pay zakat\\n\\t\\t\\t\\ton them, even if they are of every kind of pulse and not\\n\\t\\t\\t\\tjust one kind.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, ''Umar ibn al-Khattab drew a distinction\\n\\t\\t\\t\\tbetween pulses and wheat when he took zakat from the\\n\\t\\t\\t\\tNabatean christians. He considered all pulses to be one\\n\\t\\t\\t\\tcategory and took a tenth from them, and from cereals and\\n\\t\\t\\t\\traisins he took a twentieth.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If some one asks, 'How can pulses be added\\n\\t\\t\\t\\tup all together when assessing the zakat so that there is\\n\\t\\t\\t\\tjust one payment, when a man can barter two of one kind\\n\\t\\t\\t\\tfor one of another, while cereals can not be bartered at\\n\\t\\t\\t\\ta rate of two to one?', then tell him, 'Gold and silver\\n\\t\\t\\t\\tare collected together when assessing the zakat, even\\n\\t\\t\\t\\tthough an amount of gold dinars can be exchanged for many\\n\\t\\t\\t\\ttimes tha tamount of silver dirhams.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, regarding date palms which are shared equally\\n\\t\\t\\t\\tbetween two men, and from which eight awsuq of dates are\\n\\t\\t\\t\\tharvested, \"They do not have to pay any zakat on them. If\\n\\t\\t\\t\\tone man owns five awsuq of what is harvested from one\\n\\t\\t\\t\\tpiece of land, and the other owns four awsuq or less, the\\n\\t\\t\\t\\tone who owns the five awsuq has to pay zakat, and the\\n\\t\\t\\t\\tother one, who harvested four awsuq or less, does not\\n\\t\\t\\t\\thave to pay zakat. This is how things are done whenever\\n\\t\\t\\t\\tthere are associates in any crop, whether the crop is\\n\\t\\t\\t\\tgrain or seeds that are reaped, or dates that are\\n\\t\\t\\t\\tharvested, or grapes that are picked . Any one of them\\n\\t\\t\\t\\tthat harvests five awsuq of dates, or picks five awsuq of\\n\\t\\t\\t\\tgrapes, or reaps five awsuq of wheat, has to pay zakat,\\n\\t\\t\\t\\tand whoever's portion is less than five awsuq does not\\n\\t\\t\\t\\thave to pay zakat. Zakat only has to be paid by someone\\n\\t\\t\\t\\twhose harvesting or picking or reaping comes to five\\n\\t\\t\\t\\tawsuq.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna with us regarding anything from\\n\\t\\t\\t\\tany of these categories, i.e. wheat, dates, grapes and\\n\\t\\t\\t\\tany kind of grain o rseed, which has had the zakat\\n\\t\\t\\t\\tdeducted from it and is then stored by its owner for a\\n\\t\\t\\t\\tnumber of years after he has paid the zakat on it until\\n\\t\\t\\t\\the sell sit, is that he does not have to pay any zakat on\\n\\t\\t\\t\\tthe price he sells it for until a year has elapsed over\\n\\t\\t\\t\\tit from the day he made the sale, as long as he got it\\n\\t\\t\\t\\tthrough (chance) acquisition or some other means and it\\n\\t\\t\\t\\twas not intended for trading. Cereals, seeds and\\n\\t\\t\\t\\ttrade-goods are the same, in that if a man acquires some\\n\\t\\t\\t\\tand keeps them for a number of years and then sells them\\n\\t\\t\\t\\tfor gold or silver, he does not have to pay zakat on\\n\\t\\t\\t\\ttheir price until a year has elapsed over it from the day\\n\\t\\t\\t\\tof sale. If, however, the goods were intended for trade\\n\\t\\t\\t\\tthen the owner must pay zakat on them when he sells them,\\n\\t\\t\\t\\tas long as he has had them for a year from the day when\\n\\t\\t\\t\\the paid zakat on the property with which he bought them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "37",
    "sectionHeading": "Fruits, Animal Fodder and Vegetables for which No Zakat has to be Paid",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The sunna that we are all agreed upon here\\n\\t\\t\\t\\t(in Madina) and which I have heard from the people of\\n\\t\\t\\t\\tknowledge, is that there is no zakat on any kind of fresh\\n\\t\\t\\t\\t(soft) fruit, whether it be pomegranates, peaches, figs\\n\\t\\t\\t\\tor anything that is like them or not like them as long as\\n\\t\\t\\t\\tit is fruit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe continued, \"No zakat has to be paid on animal fodder\\n\\t\\t\\t\\tor herbs and vegetables of any kind, and there is no\\n\\t\\t\\t\\tzakat to pay on the price realised on their sale until a\\n\\t\\t\\t\\tyear has elapsed over it from the day of sale which\\n\\t\\t\\t\\tcounts as the time the owner receives the sum.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "38",
    "sectionHeading": "The Zakat on Slaves, Horses and Honey",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Umar\\n\\t\\t\\t\\tfrom Sulayman ibn Yasar from Irak ibn Malik from Abu\\n\\t\\t\\t\\tHurayra that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"A muslim does not have to pay\\n\\t\\t\\t\\tany zakat on his slave or his horse.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "39",
    "sectionHeading": "The Zakat on Slaves, Horses and Honey",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tSulayman ibn Yasar that the people of Syria said to Abu\\n\\t\\t\\t\\tUbayda ibn al-Jarrah, \"Take zakat from our horses and\\n\\t\\t\\t\\tslaves,\" and he refused. Then he wrote to Umar ibn\\n\\t\\t\\t\\tal-Khattab and he (also) refused. Again they talked to\\n\\t\\t\\t\\thim and again he wrote to Umar, and Umar wrote back to\\n\\t\\t\\t\\thim saying, \"If they want, take it from them and (then)\\n\\t\\t\\t\\tgive it back to them and give their slaves provision.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What he means, may Allah have mercy upon\\n\\t\\t\\t\\thim, by the words 'and give it back to them' is, 'to\\n\\t\\t\\t\\ttheir poor.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "40",
    "sectionHeading": "The Zakat on Slaves, Horses and Honey",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Amr ibn Hazim said, \"A message came from Umar ibn Abd\\n\\t\\t\\t\\tal-Aziz to my father when he was in Mina telling him not\\n\\t\\t\\t\\tto take zakat from either honey or horses.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "41",
    "sectionHeading": "The Zakat on Slaves, Horses and Honey",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"I asked Said ibn al-Musayyab about zakat on\\n\\t\\t\\t\\twork-horses, and he said, 'Is there any zakat on horses\\n\\t\\t\\t\\t?' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "42",
    "sectionHeading": "Jizya on People of the Book and Magians",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said, \"I\\n\\t\\t\\t\\thave heard that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, took jizya from the magians of\\n\\t\\t\\t\\tBahrain, that Umar ibn al-Khattab took it from the\\n\\t\\t\\t\\tmagians of Persia and that Uthman ibn Affan took it from\\n\\t\\t\\t\\tthe Berbers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "43",
    "sectionHeading": "Jizya on People of the Book and Magians",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tibn Ali from his father that Umar ibn al-Khattab\\n\\t\\t\\t\\tmentioned the magians and said, \"I do not know what to do\\n\\t\\t\\t\\tabout them.\" Abd ar-Rahman ibn Awf said, \"I bear witness\\n\\t\\t\\t\\tthat I heard the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, say, 'Follow the same sunna with\\n\\t\\t\\t\\tthem that you follow with the people of the Book . ' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "44",
    "sectionHeading": "Jizya on People of the Book and Magians",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Aslam, the\\n\\t\\t\\t\\tmawla of Umar ibn al-Khattab, that Umar ibn al-Khattab\\n\\t\\t\\t\\timposed a jizya tax of four dinars on those living where\\n\\t\\t\\t\\tgold was the currency, and forty dirhams on those living\\n\\t\\t\\t\\twhere silver was the currency. In addition, they had to\\n\\t\\t\\t\\tprovide for the muslims and receive them as guests for\\n\\t\\t\\t\\tthree days.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "45",
    "sectionHeading": "Jizya on People of the Book and Magians",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\this father that he said to Umar ibn al-Khattab, \"There is\\n\\t\\t\\t\\ta blind she-camel behind the house,'' soUmar said, \"Hand\\n\\t\\t\\t\\tit over to a household so that they can make (some) use\\n\\t\\t\\t\\tof it.\" He said, \"But she is blind.\" Umar replied, \"Then\\n\\t\\t\\t\\tput it in a line with other camels.\" He said, \"How will\\n\\t\\t\\t\\tit be able to eat from the ground?\" Umar asked, \"Is it\\n\\t\\t\\t\\tfrom the livestock of the jizya or the zakat?\" and Aslam\\n\\t\\t\\t\\treplied, \"From the livestock of the jizya.\" Umar said,\\n\\t\\t\\t\\t\"By AIIah, you wish to eat it.\" Aslam said, \"It has the\\n\\t\\t\\t\\tbrand of the jizya on it.\" So Umar ordered it to be\\n\\t\\t\\t\\tslaughtered. He had nine platters, and on each of the\\n\\t\\t\\t\\tplatters he put some of every fruit and delicacy that\\n\\t\\t\\t\\tthere was and then sent them to the wives of the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, and the one he\\n\\t\\t\\t\\tsent to his daughter Hafsa was the last of them all, and\\n\\t\\t\\t\\tif there was any deficiency in any of them it was in\\n\\t\\t\\t\\tHafsa's portion.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"He put meat from the slaughtered animal on the platters\\n\\t\\t\\t\\tand sent them to the wives of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and he ordered what was\\n\\t\\t\\t\\tleft of the meat of the slaughtered animal to be\\n\\t\\t\\t\\tprepared. Then he invited the Muhajirun and the Ansar to\\n\\t\\t\\t\\teat it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not think that livestock should be\\n\\t\\t\\t\\ttaken from people who pay the jizya except as jizya.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "46",
    "sectionHeading": "Jizya on People of the Book and Magians",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn Abd al-Aziz wrote to his governors telling them\\n\\t\\t\\t\\tto relieve any people who payed the jizya from paying the\\n\\t\\t\\t\\tjizya if they became muslims.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna is that there is no jizya due from\\n\\t\\t\\t\\twomen or children of people of the Book, and that jizya\\n\\t\\t\\t\\tis only taken from men who have reached puberty. The\\n\\t\\t\\t\\tpeople of dhimma and the magians do not have to pay any\\n\\t\\t\\t\\tzakat on their palms or their vines or their crops or\\n\\t\\t\\t\\ttheir livestock. This is because zakat is imposed on the\\n\\t\\t\\t\\tmuslims to purify them and to be given back to their\\n\\t\\t\\t\\tpoor, whereas jizya is imposed on the people of the Book\\n\\t\\t\\t\\tto humble them. As long as they are in the country they\\n\\t\\t\\t\\thave agreed to live in, they do not have to pay anything\\n\\t\\t\\t\\ton their property except the jizya. If, however, they\\n\\t\\t\\t\\ttrade in muslim countries, coming and going in them, a\\n\\t\\t\\t\\ttenth is taken from what they invest in such trade. This\\n\\t\\t\\t\\tis because jizya is only imposed on them on conditions,\\n\\t\\t\\t\\twhich they have agreed on, namely that they will remain\\n\\t\\t\\t\\tin their own countries, and that war will be waged for\\n\\t\\t\\t\\tthem on any enemy of theirs, and that if they then leave\\n\\t\\t\\t\\tthat land to go anywhere else to do business they will\\n\\t\\t\\t\\thaveto pay a tenth. Whoever among them does business with\\n\\t\\t\\t\\tthe people of Egypt, and then goes to Syria, and then\\n\\t\\t\\t\\tdoes business with the people of Syria and then goes to\\n\\t\\t\\t\\tIraq and does business with them and then goes on to\\n\\t\\t\\t\\tMadina, or Yemen, or other similar places, has to pay a\\n\\t\\t\\t\\ttenth.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tPeople of the Book and magians do not have to pay any\\n\\t\\t\\t\\tzakat on any of their property, livestock, produce or\\n\\t\\t\\t\\tcrops. The sunna still continues like that. They remain\\n\\t\\t\\t\\tin the deen they were in, and they continue to do what\\n\\t\\t\\t\\tthey used to do. If in any one year they frequently come\\n\\t\\t\\t\\tand go in muslim countries then they have to pay a tenth\\n\\t\\t\\t\\tevery time they do so, since that is outside what they\\n\\t\\t\\t\\thave agreed upon, and not one of the conditions\\n\\t\\t\\t\\tstipulated for them. This is what I have seen the people\\n\\t\\t\\t\\tof knowledge of our city doing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "47",
    "sectionHeading": "Tithes for the People of Dhimma",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Ibn Shihab from Salim ibn\\n\\t\\t\\t\\tAbdullah from his father that Umar ibn al-Khattab used to\\n\\t\\t\\t\\ttake a twentieth from the cereals and olive oil of the\\n\\t\\t\\t\\tNabatean christians, intending by that to increase the\\n\\t\\t\\t\\tcargo to Madina. He would take a tenth from pulses.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "48",
    "sectionHeading": "Tithes for the People of Dhimma",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tas-Sa'ib ibn Yazid said, \"As a young man I used to work\\n\\t\\t\\t\\twith Abdullah ibn Utba ibn Masud in the market of Madina\\n\\t\\t\\t\\tin the time of Umar ibn al-Khattab and we used to take a\\n\\t\\t\\t\\ttenth from the Nabateans.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "49",
    "sectionHeading": "Tithes for the People of Dhimma",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had asked Ibn\\n\\t\\t\\t\\tShihab why Umar ibn al Khattab used to take a tenth from\\n\\t\\t\\t\\tthe Nabateans, and Ibn Shihab replied, \"It used to be\\n\\t\\t\\t\\ttaken from them in the jahiliyya, and Umar imposed it on\\n\\t\\t\\t\\tthem.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "50",
    "sectionHeading": "Selling Sadaqa and Taking it Back",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Zayd ibn Aslam that his father\\n\\t\\t\\t\\tsaid that he had heard Umar ibn al-Khattab say, \"I once\\n\\t\\t\\t\\tgave a noble horse to carry somebody in the way of Allah,\\n\\t\\t\\t\\tand the man neglected it. I wished to buy it back from\\n\\t\\t\\t\\thim and I thought that he would sell it cheaply. I asked\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, about it and he said, 'Do not buy it, even if he\\n\\t\\t\\t\\tgives it to you for one dirham, for someone who takes\\n\\t\\t\\t\\tback his sadaqa is like a dog swallowing its own vomit.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "51",
    "sectionHeading": "Selling Sadaqa and Taking it Back",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Umaribnal-Khattab gave a horse to carry\\n\\t\\t\\t\\tsome one in the way of Allah, and then he wished to buy\\n\\t\\t\\t\\tit back. So he asked the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, about it, and he said, \"Do\\n\\t\\t\\t\\tnot buy or take back your sadaqa.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about whether a man who\\n\\t\\t\\t\\tgave some sadaqa, and then found it being offered back to\\n\\t\\t\\t\\thim for sale by some one other than the man to whom he\\n\\t\\t\\t\\thad given it, could buy it or not, and he said, \"I prefer\\n\\t\\t\\t\\tthat he leaves it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "52",
    "sectionHeading": "Who Pays the Zakat al-Fitr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to pay the zakat al-fitr for those slaves\\n\\t\\t\\t\\tof  his that were at Wadi'l-Qura and Khaybar.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"The best that I\\n\\t\\t\\t\\thave heard about the zakat al-fitr is that a man has to\\n\\t\\t\\t\\tpay for every person that he is responsible for\\n\\t\\t\\t\\tsupporting and whom he must support.-He has to pay forall\\n\\t\\t\\t\\this mukatabs, his mudabbars, and his ordinary slaves,\\n\\t\\t\\t\\twhether they are present or absent, as long as they are\\n\\t\\t\\t\\tmuslim, and whether or not they are fortrade. However, he\\n\\t\\t\\t\\tdoes not have to pay zakat on any of them that are not\\n\\t\\t\\t\\tmuslim.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning a runaway slave, \"I think that his\\n\\t\\t\\t\\tmaster should pay the zakat fo rhim whether or not he\\n\\t\\t\\t\\tknows where he is, if it has not been long since the\\n\\t\\t\\t\\tslave ran away and his master hopes that he is still\\n\\t\\t\\t\\talive and will return. If it has been a long time since\\n\\t\\t\\t\\the ran away and his master has despaired of him returning\\n\\t\\t\\t\\tthen I do not think that he should pay zakat for him.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The zakat al-fitr has to be paid by people\\n\\t\\t\\t\\tliving in the desert (i.e. nomadic people) just as it has\\n\\t\\t\\t\\tto be paid by people living in villages (i.e. settled\\n\\t\\t\\t\\tpeople), because the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, made the zakat al-fitr at the\\n\\t\\t\\t\\tend of Ramadan obligatory on every muslim, whether\\n\\t\\t\\t\\tfreeman or slave, male or female.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "53",
    "sectionHeading": "Who Pays the Zakat al-Fitr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, made the zakat of breaking the fast\\n\\t\\t\\t\\tat the end of Ramadan obligatory on every muslim, whether\\n\\t\\t\\t\\tfreeman or slave, male or female, and stipulated it as a\\n\\t\\t\\t\\tsa of dates or a sa of barley.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "54",
    "sectionHeading": "Who Pays the Zakat al-Fitr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tlyad ibn Abdullah ibn Sad ibn Abi Sarh al-Amiri that he\\n\\t\\t\\t\\thad heard Abu Said al-Khudri say, \"We used to pay the\\n\\t\\t\\t\\tzakat al-fitr with a sa of wheat, or a sa of barley, or a\\n\\t\\t\\t\\tsa of dates, or a sa of dried sour milk, or a sa of\\n\\t\\t\\t\\traisins, using the sa of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace . \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "55",
    "sectionHeading": "Who Pays the Zakat al-Fitr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar would always pay the zakat al-fitr in dates,\\n\\t\\t\\t\\texcept once, when he paid it in barley.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMaliksaid, \"Payment of all types of kaffara, of zakat\\n\\t\\t\\t\\tal-fitr and of the zakat on grains for which a tenth or a\\n\\t\\t\\t\\ttwentieth is due, is made using the smaller mudd, which\\n\\t\\t\\t\\tis the mudd of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, except in the case of dhihar divorce, when the\\n\\t\\t\\t\\tkaffara is paid using the mudd of Hisham, which is the\\n\\t\\t\\t\\tlarger mudd.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "56",
    "sectionHeading": "When to Send the Zakat al-Fitr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to send the zakat al-fitr to the one with\\n\\t\\t\\t\\twhom it was collected together two or three days before\\n\\t\\t\\t\\tthe day of breaking the fast.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "57",
    "sectionHeading": "When to Send the Zakat al-Fitr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik had seen that the people\\n\\t\\t\\t\\tof knowledge used to like to pay the zakat al-fitr after\\n\\t\\t\\t\\tdawn had broken on the day of the Fitr before they went\\n\\t\\t\\t\\tto the place of prayer.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is leeway in this, if Allah wills, in\\n\\t\\t\\t\\tthat it can be paid either before setting out (for the\\n\\t\\t\\t\\tprayer) on the day of Fitr or afterwards.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "17",
    "hadithNumber": "58",
    "sectionHeading": "People for Whom it is Not Obligatory to Pay the Zakat al-Fitr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"A man does not have\\n\\t\\t\\t\\tto pay zakat for the slaves of his slaves, or for some\\n\\t\\t\\t\\tone employed by him, or for his wife's slaves, except for\\n\\t\\t\\t\\tanyone who serves him and whose services are\\n\\t\\t\\t\\tindispensable to him, in which case he must pay zakat. He\\n\\t\\t\\t\\tdoes not have to pay zakat for any of his slaves that are\\n\\t\\t\\t\\tkafir and have not become muslim, whether they be for\\n\\t\\t\\t\\ttrade or otherwise.\"\\n\\t\\t\\t</p>"
  }
]
