[
  {
    "BookCode": "AMH",
    "VolumeNumber": "52",
    "hadithNumber": "1",
    "sectionHeading": "Visions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha al-Ansari from Anas ibn Malik that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The good dream of a man who is salih is a\\n\\t\\t\\t\\tforty-sixth part of prophecy.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related the like of that to me from Malik from\\n\\t\\t\\t\\tAbu'z-Zinad from al-Araj from Abu Hurayra from the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "52",
    "hadithNumber": "2",
    "sectionHeading": "Visions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha from Zufar ibn Sasaca from his father from\\n\\t\\t\\t\\tAbu Hurayra that when the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, left the morning prayer,\\n\\t\\t\\t\\the would say, \"Has any of you had a dream last night? All\\n\\t\\t\\t\\tthat will remain of prophecy after me will be the true\\n\\t\\t\\t\\tdream .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "52",
    "hadithNumber": "3",
    "sectionHeading": "Visions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"All that will be\\n\\t\\t\\t\\tleft of prophecy after me are the mubashshirat.\" They\\n\\t\\t\\t\\tsaid, \"What are the mubashshirat, Messenger of Allah?\" He\\n\\t\\t\\t\\tsaid, \"The true dream which a man who is salih sees - or\\n\\t\\t\\t\\twhich is shown to him - is a forty-sixth part of\\n\\t\\t\\t\\tprophecy.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "52",
    "hadithNumber": "4",
    "sectionHeading": "Visions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAbu Salama ibn Abd ar-Rahman said, \"I heard Abu Qatada\\n\\t\\t\\t\\tibn Ribiyy say that he heard the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, say, 'The good dream\\n\\t\\t\\t\\tis from Allah, and the bad dream is from shaytan. When\\n\\t\\t\\t\\tyou see what you dislike, spit to your left side three\\n\\t\\t\\t\\ttimes when you wake up, and seek refuge with Allah from\\n\\t\\t\\t\\tits evil. It will not harm you then, Allah willing.' \"\\n\\t\\t\\t\\tAbu Salama said, \"I would see dreams which weighed on me\\n\\t\\t\\t\\tmore heavily than a mountain. When I heard this hadith, I\\n\\t\\t\\t\\twas not concerned about it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "52",
    "hadithNumber": "5",
    "sectionHeading": "Visions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said about this ayat, \"You have good news in\\n\\t\\t\\t\\tthe life of this world and the next world,\" (Sura 10 ayat\\n\\t\\t\\t\\t64), that it was the good dream which the man who was\\n\\t\\t\\t\\tsalih saw or which was shown to him.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "52",
    "hadithNumber": "6",
    "sectionHeading": "Games of Dice",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Musa ibn Maysara from\\n\\t\\t\\t\\tSaid ibn Abi Hind from Abu Musa al-Ashari that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Whoever plays games of dice has disobeyed\\n\\t\\t\\t\\tAllah and His Messenger. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Alqama from his\\n\\t\\t\\t\\tmother that A'isha, the wife of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, heard that the people who\\n\\t\\t\\t\\tlived in a room in her house had some dice. She sent a\\n\\t\\t\\t\\tmessage to them, \"If you do not remove them, I will\\n\\t\\t\\t\\tremove you from my house,\" and she reproached them for\\n\\t\\t\\t\\tit.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "52",
    "hadithNumber": "7",
    "sectionHeading": "Games of Dice",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that when he found one of his family playing\\n\\t\\t\\t\\tdice he beat him and destroyed the dice.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"There is no good in\\n\\t\\t\\t\\tchess, and he disapproved of it.\" Yahya said, \"I heard\\n\\t\\t\\t\\thim disapprove of playing it and other worthless games.\\n\\t\\t\\t\\tHe recited this ayat, 'What is there after the truth\\n\\t\\t\\t\\texcept going the wrong way.' \" (Sura l0 ayat 32).\\n\\t\\t\\t</p>"
  }
]
