[
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "1",
    "sectionHeading": "Judgement on the Mudabbar",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"What is done in our\\n\\t\\t\\t\\tcommunity in the case of a man who makes his slave-girl a\\n\\t\\t\\t\\tmudabbara and she gives birth to children after that, and\\n\\t\\t\\t\\tthen the slave-girl dies before the one who gave her a\\n\\t\\t\\t\\ttadbir is that her children are in her position. The\\n\\t\\t\\t\\tconditions which were confirmed for her are confirmed for\\n\\t\\t\\t\\tthem. The death of their mother does not harm them. If\\n\\t\\t\\t\\tthe one who made her mudabbara dies, they are free if\\n\\t\\t\\t\\ttheir value is less than one third of his total\\n\\t\\t\\t\\tproperty.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"For every mother by birth as opposed to\\n\\t\\t\\t\\tmother by suckling, her children are in her position. If\\n\\t\\t\\t\\tshe is free and she gives birth after she is free, her\\n\\t\\t\\t\\tchildren are free. If she is a mudabbara or mukataba, or\\n\\t\\t\\t\\tfreed after a number of years in service, or part of her\\n\\t\\t\\t\\tis free or pledged or she is an umm walad, each of her\\n\\t\\t\\t\\tchildren are in the same position as their mother. They\\n\\t\\t\\t\\tare set free when she is set free and they are slaves\\n\\t\\t\\t\\twhen she is a slave.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about the mudabbara given a tadbir while she\\n\\t\\t\\t\\twas pregnant, \"Her children are in her position. That is\\n\\t\\t\\t\\talso the position of a man who frees his slave-girl while\\n\\t\\t\\t\\tshe is pregnant and does not know that she is pregnant.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna about such women is that their\\n\\t\\t\\t\\tchildren follow them and are set free by their being set\\n\\t\\t\\t\\tfree.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is the same as if a man had bought a\\n\\t\\t\\t\\tslave-girl while she was pregnant. The slave-girl and\\n\\t\\t\\t\\twhat is in her womb belong to the one who bought her\\n\\t\\t\\t\\twhether or not the buyer stipulates that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"It is not halal for the seller to make\\n\\t\\t\\t\\tan exception about what is in her womb because that is an\\n\\t\\t\\t\\tuncertain transaction. It reduces her price and he does\\n\\t\\t\\t\\tnot know if that will reach him or not. That is as if one\\n\\t\\t\\t\\tsold the foetus in the womb of the mother. That is not\\n\\t\\t\\t\\thalal because it is an uncertain transaction .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about the mukatab or mudabbar who bought a\\n\\t\\t\\t\\tslave-girl and had intercourse with her and she became\\n\\t\\t\\t\\tpregnant by him and gives birth, \"The children of both of\\n\\t\\t\\t\\tthem by a slave-girl are in his position. They are set\\n\\t\\t\\t\\tfree when he is set free and they are slaves when he is a\\n\\t\\t\\t\\tslave.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When he is set free, the umm walad is part\\n\\t\\t\\t\\tof his property which is surrendered to him when he is\\n\\t\\t\\t\\tset free.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "2",
    "sectionHeading": "General Section on Tadbir",
    "text": "<p>\\n\\t\\t\\t\\tMalik spoke about a mudabbar who said to his master,\\n\\t\\t\\t\\t\"Free me immediately and I will give fifty dinars which I\\n\\t\\t\\t\\twill have to pay in instalments.\" His master said, \"Yes.\\n\\t\\t\\t\\tYou are free and you must pay fifty dinars, and you will\\n\\t\\t\\t\\tpay me ten dinars every year.\" The slave was satisfied\\n\\t\\t\\t\\twith this. Then the master dies one, two or three days\\n\\t\\t\\t\\tafter that. He said, \"The freeing is confirmed and the\\n\\t\\t\\t\\tfifty dinars become a debt against him. His testimony is\\n\\t\\t\\t\\tpermitted, his inviolability as a free man is confirmed,\\n\\t\\t\\t\\tas are his inheritance and his liability to the full\\n\\t\\t\\t\\thudud punishments. The death of his master, however, does\\n\\t\\t\\t\\tnot reduce the debt for him at all.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man who made his slave a mudabbar\\n\\t\\t\\t\\tdied and he had some property at hand and some absent\\n\\t\\t\\t\\tproperty, and in the property at hand there was not\\n\\t\\t\\t\\tenough (in the third he was allowed to bequeath) to cover\\n\\t\\t\\t\\tthe value of the mudabbar, the mudabbar was kept there\\n\\t\\t\\t\\ttogether with this property, and his tax (kharaj) was\\n\\t\\t\\t\\tgathered until the master's absent property was clear.\\n\\t\\t\\t\\tThen if a third of what his master left would cover his\\n\\t\\t\\t\\tvalue, he was freed with his property and what had\\n\\t\\t\\t\\tgathered of his tax. If there was not enough to cover his\\n\\t\\t\\t\\tvalue in what his master had left, as much of him was\\n\\t\\t\\t\\tfreed as the third would allow, and his property was left\\n\\t\\t\\t\\tin his hands.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "3",
    "sectionHeading": "Bequests involving Tadbir",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of doing things\\n\\t\\t\\t\\tin our community is that any setting-free which a man\\n\\t\\t\\t\\tmakes in a bequest that he wills in health or illness can\\n\\t\\t\\t\\tbe rescinded by him when he likes and changed when he\\n\\t\\t\\t\\tlikes as long as it is not a tadbir. There is no way to\\n\\t\\t\\t\\trescind a tadbir once he has made it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"As for every child born to him by a slave-girl who he\\n\\t\\t\\t\\twills to be set free but he does not make mudabbara, her\\n\\t\\t\\t\\tchildren are not freed with her when she is freed. That\\n\\t\\t\\t\\tis because her master can change his will when he likes\\n\\t\\t\\t\\tand rescind it when he likes, and being set free is not\\n\\t\\t\\t\\tconfirmed for her. She is in the position of a slave-girl\\n\\t\\t\\t\\twhose master says, 'If so-and-so remains with me until I\\n\\t\\t\\t\\tdie, she is free.' \" (i.e. he does not make a definite\\n\\t\\t\\t\\tcontract.)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If she fulfils that, that is hers. If he\\n\\t\\t\\t\\twishes, before that, he can sell her and her child\\n\\t\\t\\t\\tbecause he has not entered her child into any condition\\n\\t\\t\\t\\the has made for her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"The bequest in setting free is different from the\\n\\t\\t\\t\\ttadbir. The precedent of the sunna makes a distinction\\n\\t\\t\\t\\tbetween them. Had a bequest been in the position of a\\n\\t\\t\\t\\ttadbir, no testator would be able to change his will and\\n\\t\\t\\t\\twhat he mentioned in it of setting free. His property\\n\\t\\t\\t\\twould be tied up and he would not be able to use it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who made all his slaves mudabbar\\n\\t\\t\\t\\twhile he was well and they were his only property, \"If he\\n\\t\\t\\t\\tmade some of them mudabbar before the others, one begins\\n\\t\\t\\t\\twith the first until the third of his property is\\n\\t\\t\\t\\treached. (i.e. their value is matched against the third,\\n\\t\\t\\t\\tand those whose value is covered are free.) If he makes\\n\\t\\t\\t\\tthe mall mudabbar in his illness, and says in one\\n\\t\\t\\t\\tstatement, 'So-and-so is free. So-and-so is free.\\n\\t\\t\\t\\tSo-and-so is free if my death occurs in this illness,' or\\n\\t\\t\\t\\the makes them all mudabbar in one statement, they are\\n\\t\\t\\t\\tmatched against the third and one does not begin with any\\n\\t\\t\\t\\tof them before the others. It is a bequest and they have\\n\\t\\t\\t\\ta third of his property divided between them in shares.\\n\\t\\t\\t\\tThen the third of his property frees each of them\\n\\t\\t\\t\\taccording to the extent of his share.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"No single one of them is given preference when that all\\n\\t\\t\\t\\toccurs in his illness.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a master who made his slave a mudabbar\\n\\t\\t\\t\\tand then he died and the only property he had was the\\n\\t\\t\\t\\tmudabbar slave and the slave had property. He said, \"A\\n\\t\\t\\t\\tthird of the mudabbar is freed and his property remains\\n\\t\\t\\t\\tin his possession.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a mudabbar whose master gave him a\\n\\t\\t\\t\\tkitaba and then the master died and did not leave any\\n\\t\\t\\t\\tproperty other than him, \"A third of him is freed and a\\n\\t\\t\\t\\tthird of his kitaba is reduced, and he owes two-thirds.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who freed half of his slave while\\n\\t\\t\\t\\the was ill and made irrevocable his freeing half of him\\n\\t\\t\\t\\tor all of him, and he had made another slave of his\\n\\t\\t\\t\\tmudabbar before that. He said, \"One begins with the slave\\n\\t\\t\\t\\the made mudabbar before the one he freed while he was\\n\\t\\t\\t\\till. That is because the man cannot revoke what he has\\n\\t\\t\\t\\tmade mudabbar and cannot follow it with a matter which\\n\\t\\t\\t\\twill rescind it. When this mudabbar is freed, then what\\n\\t\\t\\t\\tremains of the third goes to the one who had half of him\\n\\t\\t\\t\\tfreed so as to complete his setting-free entirely in the\\n\\t\\t\\t\\tthird of the property of the deceased. If what is left of\\n\\t\\t\\t\\tthe third does not cover that, whatever is covered by\\n\\t\\t\\t\\twhat is left of the third is freed after the first\\n\\t\\t\\t\\tmudabbar is freed . \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "4",
    "sectionHeading": "A Master's Intercourse with His Slave-girl when he has Made her Mudabbara",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that Abdullah ibn Umar made\\n\\t\\t\\t\\ttwo of his slave-girls mudabbara, and he had intercourse\\n\\t\\t\\t\\twith them while they were mudabbara.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "5",
    "sectionHeading": "A Master's Intercourse with His Slave-girl when he has Made her Mudabbara",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said that Said ibn\\n\\t\\t\\t\\tal-Musayyab used to say, \"When a man makes his slave-girl\\n\\t\\t\\t\\tmudabbara, he can have intercourse with her. He cannot\\n\\t\\t\\t\\tsell her or give her away and her children are in the\\n\\t\\t\\t\\tsame position as her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "6",
    "sectionHeading": "Selling Mudabbars",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tin our community about a mudabbar is that the owner\\n\\t\\t\\t\\tcannot sell him or change the position in which he has\\n\\t\\t\\t\\tput him. If a debt overtakes the master, his creditors\\n\\t\\t\\t\\tcannot sell the mudabbar as long as the master is alive.\\n\\t\\t\\t\\tIf the master dies and has no debts, the mudabbar is\\n\\t\\t\\t\\tincluded in the third (of the bequest) because he\\n\\t\\t\\t\\texpected his work from him as long as he lived. He cannot\\n\\t\\t\\t\\tserve him all his life, and then he frees him from his\\n\\t\\t\\t\\theirs out of the main portion of his property when he\\n\\t\\t\\t\\tdies. If the master of the mudabbar dies and has no\\n\\t\\t\\t\\tproperty other than him, one third of him is freed, and\\n\\t\\t\\t\\ttwo thirds of him belong to the heirs. If the master of\\n\\t\\t\\t\\tthe mudabbar dies and owes a debt which encompasses the\\n\\t\\t\\t\\tmudabbar, he is sold to meet the debt because he can only\\n\\t\\t\\t\\tbe freed in the third (which is allowed for bequest) .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"If the debt only includes half of the slave,\\n\\t\\t\\t\\thalf of him is sold for the debt. Then a third of what\\n\\t\\t\\t\\tremains after the debt is freed. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not permitted to sell a mudabbar and\\n\\t\\t\\t\\tit is not permitted for anyone to buy him unless the\\n\\t\\t\\t\\tmudabbar buys himself from his master. He is permitted to\\n\\t\\t\\t\\tdo that. Or else some one gives the master of the\\n\\t\\t\\t\\tmudabbar money and his master who made him a mudabbar\\n\\t\\t\\t\\tfrees him. That is also permitted for him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"His wala' belongs to his master who made him\\n\\t\\t\\t\\ta mudabbar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not permitted to sell the service of a\\n\\t\\t\\t\\tmudabbar because it is an uncertain transaction since one\\n\\t\\t\\t\\tdoes not know how long his master will live. That is\\n\\t\\t\\t\\tuncertain and it is not good.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a slave who was shared between two men,\\n\\t\\t\\t\\tand one of them made his portion mudabbar. He said, \"They\\n\\t\\t\\t\\testimate his value between them. If the one who made him\\n\\t\\t\\t\\tmudabbar buys him, he is all mudabbar. If he does not buy\\n\\t\\t\\t\\thim, his tadbir is revoked unless the one who retains\\n\\t\\t\\t\\townership of him wishes to give his partner who made him\\n\\t\\t\\t\\tmudabbar his value. If he gives him to him for his value,\\n\\t\\t\\t\\tthat is binding, and he is all mudabbar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about the christian man who made a christian\\n\\t\\t\\t\\tslave of his mudabbar and then the slave became muslim.\\n\\t\\t\\t\\tHe said, \"One separates the master and the slave, and the\\n\\t\\t\\t\\tslave is removed from his christian master and is not\\n\\t\\t\\t\\tsold until his situation becomes clear. If the christian\\n\\t\\t\\t\\tdies and has a debt, his debt is paid from the price of\\n\\t\\t\\t\\tthe slave unless he has in his estate what will pay the\\n\\t\\t\\t\\tdebt. Then the mudabbar is set free.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "7",
    "sectionHeading": "Injuries Caused by Mudabbars",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that Umar ibn Abd\\n\\t\\t\\t\\tal-Aziz gave a judgement about the mudabbar who did an\\n\\t\\t\\t\\tinjury. He said, \"The master must surrender what he owns\\n\\t\\t\\t\\tof him to the injured person. He is made to serve the\\n\\t\\t\\t\\tinjured person and recompense (in the form of service) is\\n\\t\\t\\t\\ttaken from him as the blood-money of the injury. If he\\n\\t\\t\\t\\tcompletes that before his master dies, he reverts to his\\n\\t\\t\\t\\tmaster.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tin our community about a mudabbar who does an injury and\\n\\t\\t\\t\\tthen his master dies and the master has no property\\n\\t\\t\\t\\texcept him is that the third (allowed to be bequeathed)\\n\\t\\t\\t\\tis freed, and then the blood-money for the in jury is\\n\\t\\t\\t\\tdivided into thirds. A third of the blood-money is\\n\\t\\t\\t\\tagainst the third of him which was set free, and\\n\\t\\t\\t\\ttwo-thirds are against the two-thirds which the heirs\\n\\t\\t\\t\\thave. If they wish, they surrender what they have of him\\n\\t\\t\\t\\tto the party with the injury, and if they wish, they give\\n\\t\\t\\t\\tthe injured person two-thirds of the blood-money and keep\\n\\t\\t\\t\\ttheir portion of the slave. That is because that injury\\n\\t\\t\\t\\tis a criminal action by the slave and it is not a debt\\n\\t\\t\\t\\tagainst the master by which whatever setting free and\\n\\t\\t\\t\\ttadbir the master had done would be abrogated. If there\\n\\t\\t\\t\\twere a debt to people held against the master of the\\n\\t\\t\\t\\tslave, as well as the criminal action of the slave, part\\n\\t\\t\\t\\tof the mudabbar would be sold in proportion to the\\n\\t\\t\\t\\tblood-money of the injury and according to the debt. Then\\n\\t\\t\\t\\tone would begin with the blood-money which was for the\\n\\t\\t\\t\\tcriminal action of the slave and it would be paid from\\n\\t\\t\\t\\tthe price of the slave. Then the debt of his master would\\n\\t\\t\\t\\tbe paid, and then one would look at what remained after\\n\\t\\t\\t\\tthat of the slave. His third would b be set free, and\\n\\t\\t\\t\\ttwo-thirds of him would belong to the heirs. That is\\n\\t\\t\\t\\tbecause the criminal action of the slave is more\\n\\t\\t\\t\\timportant than the debt of his master. That is because,\\n\\t\\t\\t\\tif the man dies and leaves a mudabbar slave whose value\\n\\t\\t\\t\\tis one hundred and fifty dinars, and the slave strikes a\\n\\t\\t\\t\\tfree man on the head with a blow that lays open the\\n\\t\\t\\t\\tskull, and the blood-money is fifty dinars, and the\\n\\t\\t\\t\\tmaster of the slave has a debt of fifty dinars, one\\n\\t\\t\\t\\tbegins with the fifty dinars which are the blood-money of\\n\\t\\t\\t\\tthe head wound, and it is paid from the price of the\\n\\t\\t\\t\\tslave. Then the debt of the master is paid. Then one\\n\\t\\t\\t\\tlooks at what remains of the slave, and a third of him is\\n\\t\\t\\t\\tset free and two-thirds of him remain for the heirs. The\\n\\t\\t\\t\\tblood-money is more pressing against his person than the\\n\\t\\t\\t\\tdebt of his master. The debt of his master is more\\n\\t\\t\\t\\tpressing than the tadbir which is a bequest from the\\n\\t\\t\\t\\tthird of the property of the deceased. None of the tadbir\\n\\t\\t\\t\\tis permitted while the master of the mudabbar has a debt\\n\\t\\t\\t\\twhich is not paid. It is a bequest. That is because\\n\\t\\t\\t\\tAllah, the Blessed, the Exalted, said, 'After any bequest\\n\\t\\t\\t\\tthat is made or any debt.' \" (Sura 4 ayat 10)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If there is enough in the third property\\n\\t\\t\\t\\tthat the deceased can bequeath to free all the mudabbar,\\n\\t\\t\\t\\the is freed and the blood-money due from his criminal\\n\\t\\t\\t\\taction is held as a debt against him which follows him\\n\\t\\t\\t\\tafter he is set free even if that blood-money is the full\\n\\t\\t\\t\\tblood-money. It is not a debt on the master.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mudabbar who injured a man and his\\n\\t\\t\\t\\tmaster surrendered him to the injured party, and then the\\n\\t\\t\\t\\tmaster died and had a debt and did not leave any property\\n\\t\\t\\t\\tother than the mudabbar, and the heirs said, \"We\\n\\t\\t\\t\\tsurrender the mudabbar to the party,\" whilst the creditor\\n\\t\\t\\t\\tsaid, \"My debt exceeds that.\" Malik said that if the\\n\\t\\t\\t\\tcreditor's debt did exceed that at all , he was more\\n\\t\\t\\t\\tentitled to it and it was taken from the one who owed the\\n\\t\\t\\t\\tdebt, according to what the creditor was owed in excess\\n\\t\\t\\t\\tof the blood-money of the injury. If his debt did not\\n\\t\\t\\t\\texceed it at all, he did not take the slave.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mudabbar who did an injury and had\\n\\t\\t\\t\\tproperty, and his master refused to ransom him. He said,\\n\\t\\t\\t\\t\"The injured party takes the property of the mudabbar for\\n\\t\\t\\t\\tthe blood-money of his injury. If there is enough to pay\\n\\t\\t\\t\\tit, the injured party is paid in full for the blood-money\\n\\t\\t\\t\\tof his injury and the mudabbar is returned to his master.\\n\\t\\t\\t\\tIf there is not enough to pay it, he takes it from the\\n\\t\\t\\t\\tblood-money and uses the mudabbar for what remains of the\\n\\t\\t\\t\\tblood-money.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "40",
    "hadithNumber": "8",
    "sectionHeading": "Injuries Caused by the Umm Walad",
    "text": "<p>\\n\\t\\t\\t\\tMalik said in the case of an umm walad who injured\\n\\t\\t\\t\\tsomeone, \"The blood-money of that injury is the\\n\\t\\t\\t\\tresponsibility of her master from his property, unless\\n\\t\\t\\t\\tthe blood-money of the injury is greater than the value\\n\\t\\t\\t\\tof the umm walad. Her master does not have to pay more\\n\\t\\t\\t\\tthan her value. That is because when the master of a\\n\\t\\t\\t\\tslave or slave-girl surrenders his slave or slave-girl\\n\\t\\t\\t\\tfor an injury which one of them has done, he does not owe\\n\\t\\t\\t\\tany more than that, even if the blood-money is greater.\\n\\t\\t\\t\\tAs the master of the umm walad cannot surrender her\\n\\t\\t\\t\\tbecause of the precedent of the sunna, when he pays her\\n\\t\\t\\t\\tprice, it is as if he had surrendered her. He does not\\n\\t\\t\\t\\thave to pay more than that. This is the best of what I\\n\\t\\t\\t\\thave heard about the matter. The master is not obliged to\\n\\t\\t\\t\\tassume responsibility for more than an umm walad's value\\n\\t\\t\\t\\tbecause of her criminal action.\"\\n\\t\\t\\t</p>"
  }
]
