[
  {
    "SurahNumber": "96",
    "AyahFrom": "0",
    "AyahTo": "0",
    "AyahText": "<ayahtext>Introduction</ayahtext>\\n",
    "Text": "<note id=\"0\">\\n<H2><B>Name</B></H2> <P>\\n<SPAN>The Surah is so entitled after the word </SPAN><EM><SPAN>`alaq</SPAN></EM><SPAN> in the second verse. </SPAN> </P> <H2><B>Period of Revelation</B></H2> <P>\\n<SPAN>This Surah has two parts: the first part consists of vv. 1-5, and the second of vv. 6-19. About the first part a great majority of the Islamic scholars are agreed that it forms the very first Revelation to be sent down to the Holy Prophet (upon whom be Allah's peace and blessings). In this regard, the </SPAN><EM><SPAN>Hadith</SPAN></EM><SPAN> from Hadrat Aishah, which Imam Ahmad, Bukhari, Muslim, and other traditionists have related with several chains of authorities, is one of the most authentic </SPAN><EM><SPAN>Ahadith</SPAN></EM><SPAN> on the subject. In it Hadrat Aishah has narrated the full story of the beginning of revelation as she herself heard it from the Holy Messenger of Allah. Besides, Ibn Abbas, Abu Musa al-Ashari and a group of the Companions also are reported to have stated that these were the very first verses of the Quran to be revealed to the Holy Prophet. The second part was sent down afterwards when the Holy Prophet (upon whom be peace) began to perform the prescribed Prayer in the precincts of the Kabah and Abu Jahl tried to prevent him from this with threats. </SPAN> </P> <H2><B>Beginning of Revelation</B></H2> <P>\\n<SPAN>The traditionists have related on the strength of their respective authorities the story of the beginning of revelation from Imam Az-Zuhri, who had it from Hadrat Urwah bin Zubair, who had it from Hadrat Aishah, his aunt. She states that revelations to the Holy Prophet (upon whom be peace) began in the form of true (according to other traditions, good) visions. Whichever vision he saw it seemed as though he saw it in broad daylight. Afterwards solitude became dear to him and he would go to the Cave of Hira to engage in worship there for several days and nights (Hadrat Aishah has used the word </SPAN><EM><SPAN>tahannuth</SPAN></EM><SPAN>, which Imam Zuhri has explained as </SPAN><EM><SPAN>ta'abbud</SPAN></EM><SPAN>: devotional exercises. This was some kind of worship which he performed, for until then he had not been taught the method of performing the Prayer by Allah). He would take provisions with him and stay there for several days, then would return to Hadrat Khadijah who would again provide for him for a few more days. One day when he was in the Cave of Hira, Revelation came down to him unexpectedly and the Angel said, to him: &quot;Read&quot;.</SPAN>\\n</P> <P>\\n<SPAN>After this Hadrat Aishah reports the words of the Holy Prophet himself, to the effect, &quot;I said: I cannot read! There upon the Angel took me and pressed me until I could bear it no more. Then he left me and said: Read. I said: I cannot read! He pressed me a second time until I could bear it no more. Then he left me and said: Read. I again said: I cannot read! He pressed me for the third time until I could bear it no more. Then he left me and said: </SPAN><EM><SPAN>Iqra bismi Rabbi kal- ladhi khalaqa</SPAN></EM><SPAN>: (Read in the name of your Lord Who created) till he reached </SPAN><EM><SPAN>ma lam ya lam</SPAN></EM><SPAN> (what he did not know).</SPAN>\\n</P> <P> Then the Holy Messenger (upon whom be peace) returned home to Hadrat Khadijah trembling with fear, and said to her: `Cover me, cover me', and he was covered. When terror left him, he said: `O Khadijah, what has happened to me?' Then he narrated to her whatever had happened, and said: `I fear for my life'. She said; `No never! Be of good cheer. By God, never will God debase you: you treat the kindred well, you speak the truth, (one tradition adds: you restore what is entrusted to you), you bear the burden of the helpless, you help the poor, you entertain the guests, and you cooperate in good works.'  </P> <P> Then she took him to Waraqah bin Naufal, who was her cousin. He had become a Christian in pre-Islamic days, wrote the Gospel in Arabic and Hebrew, and had become very old and blind. Hadrat Khadijah said: `Brother, listen to the son of your brother.' Waraqah said to the Holy Prophet: `What have you seen, nephew?' The Holy Prophet described what he had seen. Waraqah said; `This is the same Gabriel (the Angel of Revelation) which Allah had sent down to Moses. Would that I were a young man during your Prophethood! Would that I were alive when your tribe would expel you!' The Holy Prophet said: `Will they expel me?' Waraqah said; `Yes, never has it so happened that a person brought what you have brought and was not treated as an enemy. If I live till then I would help you with all the power at my command.' But not very long after this Waraqah died.</P> <P> This narrative is explicit that even until a moment before the coming Angel the Holy Messenger of Allah (upon whom be His peace) was without any expectation that he was going to be appointed a Prophet. Nothing to say of any such wish or expectation, he did not even have any idea that he would meet with such an experience. Coming down of the Revelation and appearing of the Angel face to face was an unexpected accident for him the first effect of which on him was precisely the same as could naturally be on a person meeting with such a tremendous experience, in the absence of any preparation. That is why when he proclaimed the message of Islam, the people of Makkah raised all sorts of objections, but no one said that they were already apprehending that he would make a claim, for he had been making preparations since long to become a Prophet.  </P> <P> From this narrative another thing which also becomes obvious is how pure was the Holy Prophet's life and how sublime was his character before Prophethood, Hadrat Khadijah was no young lady: she was 55 years old at the time this event took place and had been the Holy Prophet's life companion for 15 years. No weakness of the husband can remain hidden from the wife. She had during this long period of married life found him to be such a generous and noble man that when he told her of his experience in the Cave of Hira', she admitted without the least hesitation that it was indeed Allah's own Angel who had come to him with Revelation. Likewise, Waraqah bin Naufal also was an old inhabitant of Makkah, who had seen the Holy Prophet grow up from childhood. Particularly, for the past 15 years because of the close relationship he was even more intimately aware of his life, his Affairs and dealings. When he also heard of his experience, he did not regard it as an evil suggestion, but immediately said that it was the same Gabriel who had descended on Moses (peace be upon him). This meant that even according to him the Holy Prophet was such a sublime person that there was nothing surprising in his being elevated to the office of Prophethood.  </P> <H2><B>Occasion of Revelation of verses 6-19</B></H2> <P>\\n<SPAN>This second part of thee Surah was revealed when the Holy Messenger of Allah began to perform the Prayer in the Islamic way in the Ka'bahand Abu Jahl threatened and tried to prevent him from this. It so happened that after his appointment to Prophethood even before he could start preaching Islam openly, he began to perform the Prayer in the precincts of the Ka'bahin the way Allah taught him; and from this the Quraish felt for the first time that he had adopted a new religion. The other people were watching it with curiosity, but Abu Jahl in his arrogance and pride threatened the Holy Prophet and forbade him to worship in that way in the Ka'bah. In this connection, quite a number of the </SPAN><EM><SPAN>Ahadith</SPAN></EM><SPAN> have been related from Hadarat Abdullah ibn Abbas and Hadrat Abu Huraira, which mention the foolish behaviour of Abu Jahl. </SPAN> </P> <P> Hadrat Abu Huraira says that Abu Jahl asked the people of Quraish: &quot;Does Muhammad (upon whom be Allah's peace and blessings) set his face on the ground before you?&quot;When they replied in the affirmative, he said:&quot;By Lat and Uzza, if I ever catch him in that act of worship, I would set my foot on his neck and rub his face in the dust.&quot;Then it so happened that he saw the Holy Messenger in that posture and came forward to set his foot on his neck, but suddenly turned back as if in a fright and being asked what was the matter, he said there was a ditch of fire and a terrible apparition between himself and Muhammad (upon whom be Allah's peace and blessings) and some wings. On hearing this the Holy Prophet remarked:&quot;Had he come near me, the angels would have smitten and torn him to pieces.&quot; (Ahmad, Muslim, Nasai, Ibn Jarir, Ibn AbI Hatim, Ibn al-Mundhir, lbn Marduyah, Abu Nu'aim Isfahani, Baihaqi).  </P> <P> According to lbn Abbas, Abu Jahl said:&quot;If I caught Muhammad (upon whom be Allah's peace and blessings) performing his Prayer by the Ka'bah, I would trample his neck down.&quot; When the Holy Prophet heard of it, he said: &quot;If he acted so, the angels would seize him there and then?&quot; (Bukhari, Tirmidhi, Nasai, Ibn Jarir, Abdur Razzaq, Abd bin Humaid, Ibn al- Mundhir, Ibn Marduyah).  </P> <P>\\n<SPAN>According to another tradition from Ibn Abbas, the Holy Prophet was performing his Prayer at the </SPAN><EM><SPAN>Maqam Ibrahim</SPAN></EM><SPAN>. Abu Jahl passed that way and said: &quot;O Muhammad, did I not forbid you this, and then he started to threaten him.&quot; In reply the Holy Prophet (upon whom be peace) rebuked him severely. There upon he said:&quot;O Muhammad, on what strength do you rebuke me? By God, my followers in this valley far exceed yours in number.&quot; (Ahmad, Tirmidhi, Nasai, Ibn Jarir, lbn Abi Shaibah, Ibn al-Mundhir, Tabarani, Ibn Marduyah). </SPAN> </P> <P>\\n<SPAN>Because of these very incidents the portion of this Surah beginning with </SPAN><EM><SPAN>Kalla inn al-insana la yat gha</SPAN></EM><SPAN> was sent down. Naturally the place of this part should be the same as assigned to it in this Surah of the Quran, for after the coming down of the first Revelation the Holy Prophet had given expression to Islam first of all by the act of Prayer, and his conflict with the pagans. </SPAN> </P> <P ALIGN=\"RIGHT\"></P>   \\n\\t\\t\\t</note>"
  },
  {
    "SurahNumber": "96",
    "AyahFrom": "1",
    "AyahTo": "5",
    "AyahText": "<ayahtext>\\n<P ALIGN=\"LEFT\"> [1-5] Read<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote1anc\" HREF=\"#sdfootnote1sym\"><SUP>1</SUP></A> in the name of your Lord<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote2anc\" HREF=\"#sdfootnote2sym\"><SUP>2</SUP></A> Who created.<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote3anc\" HREF=\"#sdfootnote3sym\"><SUP>3</SUP></A> Created man from a clot of congealed blood.<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote4anc\" HREF=\"#sdfootnote4sym\"><SUP>4</SUP></A> Read, and your Lord is Most Generous. Who taught knowledge by the pen,<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote5anc\" HREF=\"#sdfootnote5sym\"><SUP>5</SUP></A> taught man what he did not know.<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote6anc\" HREF=\"#sdfootnote6sym\"><SUP>6</SUP></A>\\n</P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> \\n\\t\\t\\t</ayahtext>\\n",
    "Text": "<note id=\"1\">\\n<DIV ID=\"sdfootnote1\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote1sym\" HREF=\"#sdfootnote1anc\">1</A>As we have explained in the Introduction, when the Angel said to the Holy Prophet, &quot;Read&quot;, the latter replied, &quot;I cannot read!&quot;&quot; This indicates that the Angel had presented these words of the Revelation before him in the written form and had asked him to read them. For if the Angel had meant that he should repeat what he recited, he should not have replied, saying &quot;I cannot read!&quot;  </P> </DIV> \\n<DIV ID=\"sdfootnote2\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote2sym\" HREF=\"#sdfootnote2anc\">2</A>&quot;Read in the name of your Lord&quot;: Bismillah and read. This shows that the Holy Prophet (upon whom be peace) even before the coming down of this Revelation regarded and acknowledged Allah alone as his Lord. That is why there was no need to ask who his Lord was, but it was said: &quot;Read in the name of your Lord.&quot;  </P> </DIV> \\n<DIV ID=\"sdfootnote3\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote3sym\" HREF=\"#sdfootnote3anc\">3</A>Only the word khalaqa (created) 'has been used absolutely, and the object of creation has not been mentioned, This automatically gives the meaning: &quot;Read in the name of the Lord, Who is the Creator, Who created the whole universe and everything in it.&quot;  </P> </DIV> \\n<DIV ID=\"sdfootnote4\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote4sym\" HREF=\"#sdfootnote4anc\">4</A>After making mention generally of the creation of the universe, mention has been made of man in particular, saying how Allah made him a perfect man starting his creation from an insignificant and humble state. 'Alaq is plural of 'alaqah, which means congealed blood. This is the primary state of the embryo which appears a few days after conception. Then it assumes the form of a lump of flesh, then afterwards it gradually takes human shape. (For details, see AI-Hajj: 5 and the corresponding E.N.'s 5 to 7).  </P> </DIV> \\n<DIV ID=\"sdfootnote5\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote5sym\" HREF=\"#sdfootnote5anc\">5</A>That is, &quot;It is a great favor of Allah that starting man's creation from a most insignificant state He made him possessor of knowledge which is the noblest attribute of creation, and He made him not only possessor of knowledge but also taught him the art of writing by the use of pen, which became the means of propagation, progress, dissemination and preservation of knowledge on a large scale. Had He not given man the knowledge of the art of pen and writing (by inspiration) his intellectual faculty would have stagnated, and it would have had no opportunity to develop, expand and become a means of transmission of knowledge from one generation to the next and make future progress.  </P> </DIV> \\n<DIV ID=\"sdfootnote6\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote6sym\" HREF=\"#sdfootnote6anc\">6</A>That is, Man originally was absolutely illiterate. Whatever of knowledge he obtained, he obtained it as a gift from Allah. Whatever doors of knowledge at any stage did Allah will to open for man, they went on opining up before him. This same thing has been expressed in the verse of the Throne, thus: &quot;And the people cannot comprehend anything of His knowledge save what He Himself may please to reveal.&quot; (Al-Baqarah: 255). Whatever man looks upon as his own scientific discovery was, in fact, unknown to him before. Allah gave him its knowledge whenever He willed without his realizing that Allah by His grace had blessed him with the knowledge of it.  </P> <P CLASS=\"sdfootnote-western\">These verses were the very first to be revealed to the Holy Prophet (upon whom be peace), as is stated in the Hadith reported by Hadrat `A'ishah. This first experience was so intense and tremendous that the Holy Prophet could not bear it any more. Therefore, at that time he was only made aware that the Being Whom he already knew and acknowledged as his Lord and Sustainer was in direct communion with him, had started sending down Revelations to him, and had appointed him as His Prophet. Then after an intermission the opening verses of Surah al-Muddaththir were revealed in which he was told what mission he had to perform after his appointment to Prophethood. (For explanation, see Introduction to Al-Muddaththir)  </P> </DIV> \\n\\t\\t\\t</note>"
  },
  {
    "SurahNumber": "96",
    "AyahFrom": "6",
    "AyahTo": "10",
    "AyahText": "<ayahtext>\\n<P ALIGN=\"LEFT\"> [6-10] Indeed not!<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote7anc\" HREF=\"#sdfootnote7sym\"><SUP>7</SUP></A> Man behaves rebelliously for he deems himself to be self-sufficient,<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote8anc\" HREF=\"#sdfootnote8sym\"><SUP>8</SUP></A> (although) towards your Lord indeed is the return.<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote9anc\" HREF=\"#sdfootnote9sym\"><SUP>9</SUP></A> Have you seen the one who forbids a servant when he prays?<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote10anc\" HREF=\"#sdfootnote10sym\"><SUP>10</SUP></A>\\n</P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> <P ALIGN=\"RIGHT\"></P> \\n\\t\\t\\t</ayahtext>\\n",
    "Text": "<note id=\"2\">\\n<DIV ID=\"sdfootnote7\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote7sym\" HREF=\"#sdfootnote7anc\">7</A>That is, man should never adopt an attitude of ignorance and rebellion against the Bountiful God Who has been so generous to him.</P> </DIV> \\n<DIV ID=\"sdfootnote8\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote8sym\" HREF=\"#sdfootnote8anc\">8</A>That is, when the man has attained wealth, honor and rank and whatever else he desired to attain in the world, he becomes rebellious instead of being grateful and transgresses the boundaries of servitude to Allah.  </P> </DIV> \\n<DIV ID=\"sdfootnote9\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote9sym\" HREF=\"#sdfootnote9anc\">9</A>That is, &quot;Whatever he might have attained in the world, which makes ,him behave arrogantly and rebelliously, in the end he has to return to your Lord. Then he will realize what fate awaits him in consequence of his such attitude and behavior.&quot;  </P> </DIV> \\n<DIV ID=\"sdfootnote10\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote10sym\" HREF=\"#sdfootnote10anc\">10</A>&quot;A Servant&quot; : the Holy Messenger of Allah himself. The Holy Prophet has been mentioned by this epithet at several places in the Qur'an. For example, &quot;Glory be to Him Who transported His servant one night from the Masjid al Haram to the distant Temple.&quot; (Bani Isra'il: 1); &quot;All praise is for Allah Who has sent down this Book to His servant.&quot; (AI-Kahf: 1); &quot;And that when the servant of Allah stood up to pray, the people got ready to assault him.&quot; (Al-Jinn: 19). This shows that it is a special style of love by which Allah makes mention of His Messenger Muhammad (upon whom be His peace and blessings) in His Book. Besides, it also shows that Allah after appointing His Messenger to Prophethood had taught him the method of performing the Prayer. There is no mention of this method anywhere in the Qur'an, saying: &quot;O Prophet, perform the Prayer in this and this way.&quot; Hence, this is another proof that the Revelation sent down to the Holy Prophet did not only consist of what has been recorded in the Qur'an, but besides this, other things also were taught to him by revelation, which are not recorded in the Qur'an.  </P> </DIV> \\n\\t\\t\\t</note>"
  },
  {
    "SurahNumber": "96",
    "AyahFrom": "11",
    "AyahTo": "19",
    "AyahText": "<ayahtext>\\n<P ALIGN=\"LEFT\"> [11-19] What do you think: if (the Servant) be on the right path, or be exhorting to piety? What do you think, if the one forbidding be belying (the Truth) and turning away? Does he not know that Allah sees?<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote11anc\" HREF=\"#sdfootnote11sym\"><SUP>11</SUP></A> By no means!<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote12anc\" HREF=\"#sdfootnote12sym\"><SUP>12</SUP></A> If he does not desist, We shall drag him by his forelock, the forelock that is lying and utterly sinful.<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote13anc\" HREF=\"#sdfootnote13sym\"><SUP>13</SUP></A> So let him call his band of supporters.<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote14anc\" HREF=\"#sdfootnote14sym\"><SUP>14</SUP></A> We, too, shall call the angels of torment.<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote15anc\" HREF=\"#sdfootnote15sym\"><SUP>15</SUP></A> Nay, never! Do not obey him, and prostrate yourself and draw closer (to your Lord).<A CLASS=\"sdfootnoteanc\" NAME=\"sdfootnote16anc\" HREF=\"#sdfootnote16sym\"><SUP>16</SUP></A>\\n</P> \\n\\t\\t\\t</ayahtext>\\n",
    "Text": "<note id=\"3\">\\n<DIV ID=\"sdfootnote11\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote11sym\" HREF=\"#sdfootnote11anc\">11</A>The audience here apparently is every just man, who is being asked: Have you watched the act of the person who prevents a Servant from God's worship? What do you think: if the Servant be rightly guided, or warning the people to fear God and refrain from evil, and this forbidden be denying the Truth and turning away from it, what will his act be like? Could this man adopt such an attitude had he known that Allah is watching the man who is exhorting others to piety as well as him who is denying the truth and turning away from it? Allah's watching the oppressor and his wrongdoing and the oppressed and his misery by itself implies that He will punish the oppressor and redress the grievances of the wronged and down-trodden person. \\t</P> </DIV> \\n<DIV ID=\"sdfootnote12\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote12sym\" HREF=\"#sdfootnote12anc\">12</A>That is, the person who threatens that he would trample the neck of Muhammad (upon whom be Allah's peace and blessings) down when he performed the Prayer, would never be able to do so.</P> </DIV> \\n<DIV ID=\"sdfootnote13\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote13sym\" HREF=\"#sdfootnote13anc\">13</A>&quot;The forelock&quot; here implies the person with the forelock.  </P> </DIV> \\n<DIV ID=\"sdfootnote14\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote14sym\" HREF=\"#sdfootnote14anc\">14</A>As we have explained in the Introduction, when the Holy Prophet (upon whom be peace) rebuked Abu Jahl on his foolish behavior, he had retorted: &quot;O Muhammad, on what strength do you threaten me? By God, my supporters in this valley far exceed yours in number.&quot; At this it is being said: &quot;Let him call his band of supporters.&quot;  </P> </DIV> \\n<DIV ID=\"sdfootnote15\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote15sym\" HREF=\"#sdfootnote15anc\">15</A>According to the explanation given by Qatadah, the word zabaniyah in the original, is used for the police in Arabic idiom, and zaban actually means to push away. The kings too kept armed attendants who would push out the one with whom the king was annoyed and angry. Therefore, what Allah means is: &quot;Let him call his supporters; We too shall summon Our Police, i.e. the angels of torment, to deal with him and his supporters.&quot;  </P> </DIV> \\n<DIV ID=\"sdfootnote16\"> <P CLASS=\"sdfootnote-western\">\\n<A CLASS=\"sdfootnotesym\" NAME=\"sdfootnote16sym\" HREF=\"#sdfootnote16anc\">16</A>&quot;Sajdah&quot; (prostration) here implies the Prayer, so as to say: &quot;O Prophet, continue to perform your Prayer fearlessly as you have been in the past, and seek your Lord's presence through it.&quot; In the Sahih of Muslim and other books of Hadith there is a tradition from Hadrat Abu Huraira to the effect: &quot;The servant is nearest to his Lord when he is in the state of prostration&quot;, and in Muslim there is also a tradition from Hadrat Abu Hurairah that when the Holy Prophet recited this verse, he performed a sajdah of recital.  </P> </DIV> \\n\\t\\t\\t</note>"
  }
]
