[
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "1",
    "Text": "Whatever is in the heavens and the earth glorifies Allah, for He is the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "2",
    "Text": "To Him belongs the kingdom of the heavens and the earth. He gives life and causes death. And He is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "3",
    "Text": "He is the First and the Last, the Most High and Most Near,<span class='fn' foot_note=29949>1</span>&nbsp;and He has &#761;perfect&#762; knowledge of all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "4",
    "Text": "He is the One Who created the heavens and the earth in six Days,<span class='fn' foot_note=29950>1</span>&nbsp;then established Himself on the Throne. He knows whatever goes into the earth and whatever comes out of it, and whatever descends from the sky and whatever ascends into it. And He is with you wherever you are.<span class='fn' foot_note=29951>2</span>&nbsp;For Allah is All-Seeing of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "5",
    "Text": "To Him belongs the kingdom of the heavens and the earth. And to Allah all matters are returned."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "6",
    "Text": "He merges the night into day and the day into night. And He knows best what is &#761;hidden&#762; in the heart."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "7",
    "Text": "Believe in Allah and His Messenger, and donate from what He has entrusted you with. So those of you who believe and donate will have a mighty reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "8",
    "Text": "Why do you not believe in Allah while the Messenger is inviting you to have faith in your Lord, although He has already taken your covenant,<span class='fn' foot_note=29952>1</span>&nbsp;if you will ever believe."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "9",
    "Text": "He is the One Who sends down clear revelations to His servant to bring you out of darkness and into light. For indeed Allah is Ever Gracious and Most Merciful to you."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "10",
    "Text": "And why should you not spend in the cause of Allah, while Allah is the &#761;sole&#762; inheritor of the heavens and the earth? Those of you who donated and fought before the victory &#761;over Mecca&#762; are unparalleled. They are far greater in rank than those who donated and fought afterwards.<span class='fn' foot_note=29953>1</span>&nbsp;Yet Allah has promised each a fine reward. And Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "11",
    "Text": "Who is it that will lend to Allah a good loan which Allah will multiply &#761;many times over&#762; for them, and they will have an honourable reward?<span class='fn' foot_note=29954>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "12",
    "Text": "On that Day you will see believing men and women with their light shining ahead of them and on their right. &#761;They will be told,&#762; &ldquo;Today you have good news of Gardens, under which rivers flow, &#761;for you&#762; to stay in forever. This is &#761;truly&#762; the ultimate triumph.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "13",
    "Text": "On that Day hypocrite men and women will beg the believers, &ldquo;Wait for us so that we may have some of your light.&rdquo; It will be said &#761;mockingly&#762;, &ldquo;Go back &#761;to the world&#762; and seek a light &#761;there&#762;!&rdquo; Then a &#761;separating&#762; wall with a gate will be erected between them. On the near side will be grace and on the far side will be torment.<span class='fn' foot_note=29955>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "14",
    "Text": "The tormented will cry out to those graced, &ldquo;Were we not with you?&rdquo; They will reply, &ldquo;Yes &#761;you were&#762;. But you chose to be tempted &#761;by hypocrisy&#762;, &#761;eagerly&#762; awaited &#761;our demise&#762;, doubted &#761;the truth&#762;, and were deluded by false hopes until Allah&rsquo;s decree &#761;of your death&#762; came to pass. And &#761;so&#762; the Chief Deceiver<span class='fn' foot_note=29956>1</span>&nbsp;deceived you about Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "15",
    "Text": "So Today no ransom will be accepted from you &#761;hypocrites&#762;, nor from the disbelievers. Your home is the Fire&mdash;it is the &#761;only&#762; fitting place for you. What an evil destination!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "16",
    "Text": "Has the time not yet come for believers&rsquo; hearts to be humbled at the remembrance of Allah and what has been revealed of the truth, and not be like those given the Scripture before&mdash;&#761;those&#762; who were spoiled for so long that their hearts became hardened. And many of them are &#761;still&#762; rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "17",
    "Text": "Know that Allah revives the earth after its death.<span class='fn' foot_note=29957>1</span>&nbsp;We have certainly made the signs clear for you so perhaps you will understand."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "18",
    "Text": "Indeed, those men and women who give in charity and lend to Allah a good loan will have it multiplied for them, and they will have an honourable reward.<span class='fn' foot_note=29958>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "19",
    "Text": "&#761;As for&#762; those who believe in Allah and His messengers, it is they who are &#761;truly&#762; the people of truth. And the martyrs, with their Lord, will have their reward and their light. But &#761;as for&#762; those who disbelieve and reject Our signs, it is they who will be the residents of the Hellfire."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "20",
    "Text": "Know that this worldly life is no more than play, amusement, luxury, mutual boasting, and competition in wealth and children. This is like rain that causes plants to grow, to the delight of the planters. But later the plants dry up and you see them wither, then they are reduced to chaff. And in the Hereafter there will be either severe punishment or forgiveness and pleasure of Allah, whereas the life of this world is no more than the delusion of enjoyment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "21",
    "Text": "&#761;So&#762; compete with one another for forgiveness from your Lord and a Paradise as vast as the heavens and the earth, prepared for those who believe in Allah and His messengers. This is the favour of Allah. He grants it to whoever He wills. And Allah is the Lord of infinite bounty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "22",
    "Text": "No calamity &#761;or blessing&#762; occurs on earth or in yourselves without being &#761;written&#762; in a Record before We bring it into being. This is certainly easy for Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "23",
    "Text": "&#761;We let you know this&#762; so that you neither grieve over what you have missed nor boast over what He has granted you. For Allah does not like whoever is arrogant, boastful&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "24",
    "Text": "those who are stingy and promote stinginess among people. And whoever turns away &#761;should know that&#762; Allah &#761;alone&#762; is truly the Self-Sufficient, Praiseworthy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "25",
    "Text": "Indeed, We sent Our messengers with clear proofs, and with them We sent down the Scripture and the balance &#761;of justice&#762; so that people may administer justice. And We sent down iron with its great might, benefits for humanity, and means for Allah to prove who &#761;is willing to&#762; stand up for Him and His messengers without seeing Him. Surely Allah is All-Powerful, Almighty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "26",
    "Text": "And indeed, We sent Noah and Abraham and reserved prophethood and revelation for their descendants. Some of them are &#761;rightly&#762; guided, while most are rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "27",
    "Text": "Then in the footsteps of these &#761;prophets&#762;, We sent Our messengers, and &#761;after them&#762; We sent Jesus, son of Mary, and granted him the Gospel, and instilled compassion and mercy into the hearts of his followers. As for monasticism, they made it up&mdash;We never ordained it for them&mdash;only seeking to please Allah, yet they did not &#761;even&#762; observe it strictly. So We rewarded those of them who were faithful. But most of them are rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "28",
    "Text": "O people of faith! Fear Allah and believe in His Messenger. &#761;And&#762; He will grant you a double share of His mercy, provide you with a light to walk in &#761;on Judgment Day&#762;, and forgive you. For Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "57",
    "AyahNumber": "29",
    "Text": "&#761;This is so&#762; that the People of the Book &#761;who deny the Prophet&#762; may know that they do not have any control over Allah&rsquo;s grace, and that all grace is in Allah&rsquo;s Hands. He grants it to whoever He wills. For Allah is the Lord of infinite bounty."
  }
]
