[
  {
    "BookCode": "AMH",
    "VolumeNumber": "34",
    "hadithNumber": "1",
    "sectionHeading": "Renting Land",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abd\\n\\t\\t\\t\\tar-Rahman from Handhala ibn Qays az-Zuraqi from Rafi ibn\\n\\t\\t\\t\\tKhadij that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade renting out fields.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHandhala said, \"I asked Rafi ibn Khadij, about paying in\\n\\t\\t\\t\\tgold and silver, and he said, 'There is no harm in it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "34",
    "hadithNumber": "2",
    "sectionHeading": "Renting Land",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Ibn Shihab said, \"I asked Said\\n\\t\\t\\t\\tibn al-Musayyab about renting land for gold or silver,\\n\\t\\t\\t\\tand he said, 'There is no harm in it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "34",
    "hadithNumber": "3",
    "sectionHeading": "Renting Land",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab that he asked Salim\\n\\t\\t\\t\\tibn 'Abdullah ibn Umar about renting out fields. He said,\\n\\t\\t\\t\\t\"There is no harm in it for gold or silver.\" Ibn Shihab\\n\\t\\t\\t\\tsaid, \"I said to him, 'What do you think of the hadith\\n\\t\\t\\t\\twhich is mentioned from Rafi ibn Khadij?'\" He said,\\n\\t\\t\\t\\t''Rafi has exaggerated. If I had a field, I would rent it\\n\\t\\t\\t\\tout.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "34",
    "hadithNumber": "4",
    "sectionHeading": "Renting Land",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Abd ar-Rahman\\n\\t\\t\\t\\tibn Awf rented land, and he continued to have it in his\\n\\t\\t\\t\\tpossession until he died. His son said, \"I thought that\\n\\t\\t\\t\\tit was ours because of the length of time which it had\\n\\t\\t\\t\\tremained in his hands, until he mentioned it to us at his\\n\\t\\t\\t\\tdeath. He ordered us to pay some rent which he owed in\\n\\t\\t\\t\\tgold or silver.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "34",
    "hadithNumber": "5",
    "sectionHeading": "Renting Land",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa that his father\\n\\t\\t\\t\\tused to rent out his land for gold and silver.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who rented his field for 100\\n\\t\\t\\t\\tsa of dates or part of its produce of wheat or from other\\n\\t\\t\\t\\tthan its produce. He disapproved of that.\\n\\t\\t\\t</p>"
  }
]
