[
  {
    "SurahNumber": "33",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "Lit., \"what is revealed to thee from thy Sustainer\" -\\n\\t\\t\\t\\tindicating that He is the source of all revelation."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "Lit., \"within him\". In the first instance, this connects\\n\\t\\t\\t\\twith the preceding passage, implying that man cannot be\\n\\t\\t\\t\\ttruly conscious of God and at the same time defer to the\\n\\t\\t\\t\\tviews of \"the deniers of the truth and the hypocrites\"\\n\\t\\t\\t\\t(Razi). Beyond this, however, the above sentence forms a\\n\\t\\t\\t\\tconceptual link with the sequence, which states that it\\n\\t\\t\\t\\tis against the God-willed laws of nature - and,\\n\\t\\t\\t\\ttherefore, unreasonable and morally inadmissible - to\\n\\t\\t\\t\\tattribute to one and the same person two mutually\\n\\t\\t\\t\\tincompatible roles within the framework of human\\n\\t\\t\\t\\trelationships (Zamakhshari)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "This is a reference to the pre-Islamic Arabian custom\\n\\t\\t\\t\\tcalled zihar, whereby a husband could divorce his wife by\\n\\t\\t\\t\\tsimply declaring, \"Thou art [henceforth as unlawful] to\\n\\t\\t\\t\\tme as my mother's back\", the term zahr (\"back\") being in\\n\\t\\t\\t\\tthis case a metonym for \"body\". In pagan Arab society,\\n\\t\\t\\t\\tthis mode of divorce was considered final and\\n\\t\\t\\t\\tirrevocable; but a woman thus divorced was not allowed to\\n\\t\\t\\t\\tremarry, and had to remain forever in her former\\n\\t\\t\\t\\thusband's custody. As is evident from the first four\\n\\t\\t\\t\\tverses of surah {58} (Al-Mujadalah) - which was revealed\\n\\t\\t\\t\\tsomewhat earlier than the present surah - this cruel\\n\\t\\t\\t\\tpagan custom had already been abolished by the time of\\n\\t\\t\\t\\tthe revelation of the above verse, and is mentioned here\\n\\t\\t\\t\\tonly as an illustration of the subsequent dictum that the\\n\\t\\t\\t\\t\"figures of speech [lit., \"your sayings\"] which you utter\\n\\t\\t\\t\\twith your mouths\" do not necessarily coincide with the\\n\\t\\t\\t\\treality of human relations."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "I.e., in the sense of blood relationship: hence, the\\n\\t\\t\\t\\tmarriage restrictions applying to real sons - and, by\\n\\t\\t\\t\\tobvious implication, daughters as well - do not apply to\\n\\t\\t\\t\\tadoptive children. This statement has a definite bearing\\n\\t\\t\\t\\ton verses {37} ff. below."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Sc., by bringing into being the factual, biological\\n\\t\\t\\t\\trelationship of parent and child in distinction from all\\n\\t\\t\\t\\tman-made, social relationships like husband and wife, or\\n\\t\\t\\t\\tfoster-parent and adoptive child. In this connection it\\n\\t\\t\\t\\tshould be borne in mind that the Qur'an frequently uses\\n\\t\\t\\t\\tthe metaphor of God's \"speech\" to express His creative\\n\\t\\t\\t\\tactivity."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "5",
    "NoteID": "6",
    "Body": "I.e., \"make it clear that your relationship is an\\n\\t\\t\\t\\tadoptive one, and do not create the impression that they\\n\\t\\t\\t\\tare your real children\" - thus safeguarding their true\\n\\t\\t\\t\\tidentity."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "I.e., by making a mistake in the attribution of the\\n\\t\\t\\t\\tchild's parentage, or by calling him or her, out of love,\\n\\t\\t\\t\\t\"my son\" or \"my daughter\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "Thus, connecting with the preceding mention of voluntary,\\n\\t\\t\\t\\telective relationships (as contrasted with those by\\n\\t\\t\\t\\tblood), this verse points to the highest manifestation of\\n\\t\\t\\t\\tan elective, spiritual relationship: that of the\\n\\t\\t\\t\\tGod-inspired Prophet and the person who freely chooses to\\n\\t\\t\\t\\tfollow him. The Prophet himself is reported to have said:\\n\\t\\t\\t\\t\"None of you has real faith unless I am dearer unto him\\n\\t\\t\\t\\tthan his father, and his child, and all mankind\" (Bukhari\\n\\t\\t\\t\\tand Muslim, on the authority of Anas, with several almost\\n\\t\\t\\t\\tidentical versions in other compilations). The Companions\\n\\t\\t\\t\\tinvariably regarded the Prophet as the spiritual father\\n\\t\\t\\t\\tof his community. Some of them - e.g., Ibn Mas'ud (as\\n\\t\\t\\t\\tquoted by Zamakhshari) or Ubayy ibn Ka'b, Ibn 'Abbas and\\n\\t\\t\\t\\tMu'awiyah (as quoted by Ibn Kathir) - hardly ever recited\\n\\t\\t\\t\\tthe above verse without adding, by way of explanation,\\n\\t\\t\\t\\t\"seeing that he is [as] a father to them\"; and many of\\n\\t\\t\\t\\tthe tabi'in - including Mujahid, Qatadah, 'Ikrimah and\\n\\t\\t\\t\\tAl-Hasan (cf. Tabari and Ibn Kathir) - did the same:\\n\\t\\t\\t\\thence my interpolation, between brackets, of this phrase.\\n\\t\\t\\t\\t(However, see also verse {40} of this surah and the\\n\\t\\t\\t\\tcorresponding note [50].) As regards the status of the\\n\\t\\t\\t\\tProphet's wives as the \"mothers of the believers\", this\\n\\t\\t\\t\\tarises primarily from the fact of their having shared the\\n\\t\\t\\t\\tlife of God's Apostle in its most intimate aspect.\\n\\t\\t\\t\\tConsequently, they could not remarry after his death (see\\n\\t\\t\\t\\tverse {53} below), since all the believers were,\\n\\t\\t\\t\\tspiritually, their \"children\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "6",
    "NoteID": "9",
    "Body": "See note [86] on the last but one sentence of  8:75 . As\\n\\t\\t\\t\\texplained in that note, neither of these two passages\\n\\t\\t\\t\\t( 8:75  and  33:6 ) can be satisfactorily interpreted as\\n\\t\\t\\t\\tbearing on the laws of inheritance: all endeavours to\\n\\t\\t\\t\\tinterpret them in that sense only do violence to the\\n\\t\\t\\t\\tlogical build-up and inner cohesion of the Qur'anic\\n\\t\\t\\t\\tdiscourse. On the other hand, it is obvious that both\\n\\t\\t\\t\\tpassages have basically a similar (namely, spiritual)\\n\\t\\t\\t\\timport - with the difference only that whereas the\\n\\t\\t\\t\\tconcluding sentences of Al-Anfal refer to the brotherhood\\n\\t\\t\\t\\tof all believers in general, the present passage lays\\n\\t\\t\\t\\tstress on the yet deeper, special relationship between\\n\\t\\t\\t\\tevery true believer and God's Apostle."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "6",
    "NoteID": "10",
    "Body": "I.e., towards all other believers, as stressed so often\\n\\t\\t\\t\\tin the Qur'an, and particularly in  8:75  (see preceding\\n\\t\\t\\t\\tnote): in other words, a believer's exalted love for the\\n\\t\\t\\t\\tProphet should not blind him to the fact that \"all\\n\\t\\t\\t\\tbelievers are brethren\" ( 49:10 ). The extremely complex\\n\\t\\t\\t\\tterm ma'ruf, rendered by me in this context as \"utmost\\n\\t\\t\\t\\tgoodness\", may be defined as \"any act [or attitude] the\\n\\t\\t\\t\\tgoodness whereof is evident to reason\" (Raghib)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "7",
    "NoteID": "11",
    "Body": "This parenthetic passage connects with verses {1-3}\\n\\t\\t\\t\\tabove, and relates to every prophet's \"pledge\" - i.e.,\\n\\t\\t\\t\\tsacred duty - to convey God's message to man, and thus to\\n\\t\\t\\t\\tact as \"a bearer of glad tidings and a warner\". (For my\\n\\t\\t\\t\\trendering of idh, in this context, as \"lo\", see surah\\n\\t\\t\\t\\t{2}, note [21].)"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "8",
    "NoteID": "12",
    "Body": "Cf.  5:109  and, more particularly,  7:6  - \"We shall\\n\\t\\t\\t\\tmost certainly call to account all those unto whom Our\\n\\t\\t\\t\\tmessage was sent, and We shall most certainly call to\\n\\t\\t\\t\\taccount the message-bearers [themselves]\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "9",
    "NoteID": "13",
    "Body": "Cf. {3:124-125} and the corresponding note [93]. The\\n\\t\\t\\t\\tpresent passage (verses {9-27}) relates to the War of the\\n\\t\\t\\t\\tConfederates (al-ahzab) - also called the War of the\\n\\t\\t\\t\\tTrench (al-khandaq) - which took place in 5 H. At the\\n\\t\\t\\t\\tinstigation of the Jewish tribe of Banu 'n-Nadir, who had\\n\\t\\t\\t\\tbeen expelled from Yathrib (Medina) after they had broken\\n\\t\\t\\t\\tthe treaty binding them to the Muslims, several of the\\n\\t\\t\\t\\tmost powerful Arabian tribes formed a confederacy with a\\n\\t\\t\\t\\tview to overcoming, once and for all, the threat posed by\\n\\t\\t\\t\\tIslam to the beliefs and many of the customs of pagan\\n\\t\\t\\t\\tArabia. In the month of Shawwal, 5 H., a force of well\\n\\t\\t\\t\\tover 12,000 men, composed of the Quraysh and their allies\\n\\t\\t\\t\\t- the Banu Kinanah, Banu Asad and the people of the\\n\\t\\t\\t\\tcoastlands (the Tihamah), as well as the great Najdi\\n\\t\\t\\t\\ttribe of Ghatafan and its allies, the Hawazin (or Banu\\n\\t\\t\\t\\t'Amir) and Banu Sulaym - converged upon Medina.\\n\\t\\t\\t\\tForewarned of their coming, the Prophet had ordered a\\n\\t\\t\\t\\tdeep trench to be dug around the town - a defensive\\n\\t\\t\\t\\tmeasure unknown in pre-Islamic Arabia - and thus brought\\n\\t\\t\\t\\tthe assault of the Confederates to a halt. At that point,\\n\\t\\t\\t\\thowever, another danger arose for the Muslims: the Jewish\\n\\t\\t\\t\\ttribe of Banu Qurayzah, who lived in the outskirts of\\n\\t\\t\\t\\tMedina and until then had been allied with the Muslims,\\n\\t\\t\\t\\tbroke the treaty of alliance and openly joined the\\n\\t\\t\\t\\tConfederates. Nevertheless, during a siege lasting\\n\\t\\t\\t\\tseveral weeks all the attempts of the latter to cross the\\n\\t\\t\\t\\ttrench - manned by the numerically much weaker and less\\n\\t\\t\\t\\twell-armed Muslims - were repulsed with heavy losses to\\n\\t\\t\\t\\tthe attackers; dissensions, based on mutual distrust,\\n\\t\\t\\t\\tgradually undermined the much-vaunted alliance between\\n\\t\\t\\t\\tthe Jewish and the pagan Arab tribes; in the month of Dhu\\n\\t\\t\\t\\t'l-Qa'dah their frustration became complete when a\\n\\t\\t\\t\\tbitterly-cold stormwind raged for several days, making\\n\\t\\t\\t\\tlife unbearable even for hardened warriors. And so,\\n\\t\\t\\t\\tfinally, the siege was raised and the Confederates\\n\\t\\t\\t\\tdispersed, thus ending the last attempt of the pagans to\\n\\t\\t\\t\\tdestroy the Prophet and his community."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "10",
    "NoteID": "14",
    "Body": "The Ghatafan group tried to take the trench by assault\\n\\t\\t\\t\\tfrom the upper, eastern part of the Medina plain, while\\n\\t\\t\\t\\tthe Quraysh and their allies launched an attack from its\\n\\t\\t\\t\\tlower, i.e., western part (Zamakhshari), and this\\n\\t\\t\\t\\tobviously in consonance with their original lines of\\n\\t\\t\\t\\tapproach - the Ghatafan having come from the highlands\\n\\t\\t\\t\\t(Najd), and the Quraysh from the coastal lowlands (the\\n\\t\\t\\t\\tTihamah)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "10",
    "NoteID": "15",
    "Body": "Lit., \"[when] you thought all [manner of] thoughts about\\n\\t\\t\\t\\tGod\": i.e., \"whether He would save you or allow your\\n\\t\\t\\t\\tenemies to triumph\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "12",
    "NoteID": "16",
    "Body": "This phrase obviously denotes here the weak of faith\\n\\t\\t\\t\\tamong the believers."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "12",
    "NoteID": "17",
    "Body": "This is a reference to Muhammad's prophetic vision, at\\n\\t\\t\\t\\tthe time of digging the trench, of the future Muslim\\n\\t\\t\\t\\tconquest of the whole Arabian Peninsula as well as of the\\n\\t\\t\\t\\tPersian and Byzantine Empires (Tabari). Several authentic\\n\\t\\t\\t\\tTraditions testify to the Prophet's announcement of this\\n\\t\\t\\t\\tvision at the time in question."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "13",
    "NoteID": "18",
    "Body": "I.e., outside the city, defending the trench."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "14",
    "NoteID": "19",
    "Body": "Lit., \"if entry to them had been forced\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "14",
    "NoteID": "20",
    "Body": "Lit., \"and would not have tarried more than a little\\n\\t\\t\\t\\t[while]\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "16",
    "NoteID": "21",
    "Body": "Lit., \"for then\" or \"in that case\" (idhan), signifying\\n\\t\\t\\t\\there \"however it may be\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "20",
    "NoteID": "22",
    "Body": "Sc., \"but would come back in force and resume the siege\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "20",
    "NoteID": "23",
    "Body": "Lit., \"they would not fight except a little\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "21",
    "NoteID": "24",
    "Body": "This verse (and the passage that follows) connects with\\n\\t\\t\\t\\tverses {9-11} above, and especially with verse 11 -\\n\\t\\t\\t\\t\"there and then were the believers tried, and shaken with\\n\\t\\t\\t\\ta shock severe\" - which summarizes, as it were, their\\n\\t\\t\\t\\texperiences during the critical days and weeks of the War\\n\\t\\t\\t\\tof the Trench. Although it is addressed, in the first\\n\\t\\t\\t\\tinstance, to those early defenders of Medina who were\\n\\t\\t\\t\\tthus exhorted to emulate the Prophet's faith, courage and\\n\\t\\t\\t\\tsteadfastness, the above verse is timeless in its import\\n\\t\\t\\t\\tand its validity for all situations and conditions. -\\n\\t\\t\\t\\tSince the verb rajawa, as well as the noun-forms rajw,\\n\\t\\t\\t\\trujuww and raja' derived from it, carry the connotation\\n\\t\\t\\t\\tof both \"hope\" and \"fear\" (or \"awe\"), I have rendered\\n\\t\\t\\t\\tyarju accordingly."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "22",
    "NoteID": "25",
    "Body": "These seem to be allusions to  29:2  (which may have been\\n\\t\\t\\t\\tone of the last Meccan revelations) as well as to  2:155 \\n\\t\\t\\t\\tand {214} (i.e., verses of the first surah of the Medina\\n\\t\\t\\t\\tperiod)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "23",
    "NoteID": "26",
    "Body": "Specifically, this verse is said to apply to certain of\\n\\t\\t\\t\\tthe Companions who vowed, at the time of the early\\n\\t\\t\\t\\tcampaigns, that they would fight until death at the\\n\\t\\t\\t\\tProphet's side (Zamakhshari); in its wider sense,\\n\\t\\t\\t\\thowever, it relates to all efforts involving a supreme\\n\\t\\t\\t\\tsacrifice in God's cause."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "24",
    "NoteID": "27",
    "Body": "Cf.  6:12  - \"God, who has willed upon Himself the law of\\n\\t\\t\\t\\tgrace and mercy\" - and the corresponding note [10]."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "25",
    "NoteID": "28",
    "Body": "I.e., the pagans among the Confederates (see note [13]\\n\\t\\t\\t\\tabove); their Jewish allies are mentioned separately in\\n\\t\\t\\t\\tthe next verse."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "26",
    "NoteID": "29",
    "Body": "Lit., \"them\", i.e., the tribes allied against Muhammad\\n\\t\\t\\t\\tand his community. The \"followers of earlier revelation\"\\n\\t\\t\\t\\t(ahl al-kitab) referred to here were the Jews of the\\n\\t\\t\\t\\ttribe of Banu Qurayzah, who despite their monotheistic\\n\\t\\t\\t\\tfaith had betrayed the Muslims and made common cause with\\n\\t\\t\\t\\tthe pagan Confederates. After the dismal rout of the\\n\\t\\t\\t\\tlatter, the Banu Qurayzah, anticipating the vengeance of\\n\\t\\t\\t\\tthe community which they had betrayed, withdrew to their\\n\\t\\t\\t\\tfortresses in the vicinity of Medina. After a siege\\n\\t\\t\\t\\tlasting twenty-five days they surrendered to the Muslims,\\n\\t\\t\\t\\tforfeiting all that they possessed."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "27",
    "NoteID": "30",
    "Body": "I.e., lands which the Muslims were to conquer and hold in\\n\\t\\t\\t\\tthe future. This clause - with its allusion to yet more\\n\\t\\t\\t\\tprosperous times to come - provides a connection between\\n\\t\\t\\t\\tthe present passage and the next."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "28",
    "NoteID": "31",
    "Body": "By the time this verse was revealed (see note [65] on\\n\\t\\t\\t\\tverse {52} of this surah) the Muslims had conquered the\\n\\t\\t\\t\\trich agricultural region of Khaybar, and the community\\n\\t\\t\\t\\thad grown more prosperous. But while life was becoming\\n\\t\\t\\t\\teasier for most of its members, this ease was not\\n\\t\\t\\t\\treflected in the household of the Prophet who, as before,\\n\\t\\t\\t\\tallowed himself and his family only the absolute minimum\\n\\t\\t\\t\\tnecessary for the most simple living. In view of the\\n\\t\\t\\t\\tchanged circumstances, it was no more than natural that\\n\\t\\t\\t\\this wives were longing for a share in the comparative\\n\\t\\t\\t\\tluxuries which other Muslim women could now enjoy: but an\\n\\t\\t\\t\\tacquiescence by Muhammad to their demand would have\\n\\t\\t\\t\\tconflicted with the principle, observed by him throughout\\n\\t\\t\\t\\this life, that the standard of living of God's Apostle\\n\\t\\t\\t\\tand his family should not be higher than that of the\\n\\t\\t\\t\\tpoorest of the believers."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "29",
    "NoteID": "32",
    "Body": "When, immediately after their revelation, the Prophet\\n\\t\\t\\t\\trecited the above two verses to his wives, all of them\\n\\t\\t\\t\\temphatically rejected all thought of separation and\\n\\t\\t\\t\\tdeclared that they had chosen \"God and His Apostle and\\n\\t\\t\\t\\tthe [good of the] hereafter\" (recorded in several\\n\\t\\t\\t\\tcompilations of ahadith, among them Bukhari and Muslim).\\n\\t\\t\\t\\tSome of the earliest Islamic scholars (e.g., Qatadah and\\n\\t\\t\\t\\tAl-Hasan, as quoted by Tabari) held that the subsequent\\n\\t\\t\\t\\trevelation of verse {52} of this surah constituted God's\\n\\t\\t\\t\\treward, as it were, for this attitude."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "30",
    "NoteID": "33",
    "Body": "Regarding this connotation of the term fahishah, see\\n\\t\\t\\t\\tsurah {4}, note [14]. According to Zamakhshari, in his\\n\\t\\t\\t\\tcommentary on the present verse, this term comprises all\\n\\t\\t\\t\\tthat may be described as a \"gross sin\" (kabirah)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "31",
    "NoteID": "34",
    "Body": "See note [5] on  8:4 ."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "32",
    "NoteID": "35",
    "Body": "Sc., \"and, thus, conscious of your special position as\\n\\t\\t\\t\\tthe consorts of God's Apostle and mothers of the\\n\\t\\t\\t\\tbelievers\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "33",
    "NoteID": "36",
    "Body": "The term jahiliyyah denotes the period of a people's - or\\n\\t\\t\\t\\tcivilization's - moral ignorance between the obliteration\\n\\t\\t\\t\\tof one prophetic teaching and the emergence of another;\\n\\t\\t\\t\\tand, more specifically, the period of Arabian paganism\\n\\t\\t\\t\\tbefore the advent of Muhammad. Apart from these\\n\\t\\t\\t\\thistorical connotations, however, the term describes the\\n\\t\\t\\t\\tstate of moral ignorance or unconsciousness in its\\n\\t\\t\\t\\tgeneral sense, irrespective of time or social\\n\\t\\t\\t\\tenvironment. (See also note [71] on  5:50 .)"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "34",
    "NoteID": "37",
    "Body": "For the meaning of the term latif as applied to God,\\n\\t\\t\\t\\tespecially in combination with the term khabir, see note\\n\\t\\t\\t\\t[89] on  6:103 ."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "35",
    "NoteID": "38",
    "Body": "The term sa'im, usually rendered as \"fasting\", has here\\n\\t\\t\\t\\tits primary connotation of \"one who abstains [from\\n\\t\\t\\t\\tanything]\" or \"denies to himself [anything]\": cf.\\n\\t\\t\\t\\t 19:26 , where the noun sawm denotes \"abstinence from\\n\\t\\t\\t\\tspeech\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "35",
    "NoteID": "39",
    "Body": "Lit., \"the men who guard their private parts and the\\n\\t\\t\\t\\twomen who guard [them]\": see note [36] on  24:30 ."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "36",
    "NoteID": "40",
    "Body": "I.e., whenever a specific law has been formulated as such\\n\\t\\t\\t\\tin the Qur'an or in an injunction promulgated by the\\n\\t\\t\\t\\tProphet."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "36",
    "NoteID": "41",
    "Body": "Lit., \"to have a choice in their concern (min amrihim)\" -\\n\\t\\t\\t\\ti.e., to let their attitude or course of action be\\n\\t\\t\\t\\tdetermined, not by the relevant law, but by their\\n\\t\\t\\t\\tpersonal interests or predilections."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "42",
    "Body": "For this rendering of the particle idh, see surah {2},\\n\\t\\t\\t\\tnote [21]. - With the above verse, the discourse returns\\n\\t\\t\\t\\tto the problem of \"elective\" relationships touched upon\\n\\t\\t\\t\\tin verses {4} ff. Several years before Muhammad's call to\\n\\t\\t\\t\\tprophethood, his wife Khadijah made him a present of a\\n\\t\\t\\t\\tyoung slave, Zayd ibn Harithah, a descendant of the\\n\\t\\t\\t\\tNorth-Arabian tribe of Banu Kalb, who had been taken\\n\\t\\t\\t\\tcaptive as a child in the course of one of the many\\n\\t\\t\\t\\ttribal wars and then sold into slavery at Mecca. As soon\\n\\t\\t\\t\\tas he became the boy's owner, Muhammad freed him, and\\n\\t\\t\\t\\tshortly afterwards adopted him as his son; and Zayd, in\\n\\t\\t\\t\\this turn, was among the first to embrace Islam. Years\\n\\t\\t\\t\\tlater, impelled by the desire to break down the ancient\\n\\t\\t\\t\\tArabian prejudice against a slave's or even a freedman's\\n\\t\\t\\t\\tmarrying a \"free-born\" woman, the Prophet persuaded Zayd\\n\\t\\t\\t\\tto marry his (Muhammad's) own cousin, Zaynab bint Jahsh,\\n\\t\\t\\t\\twho, without his being aware of it, had been in love with\\n\\t\\t\\t\\tMuhammad ever since her childhood. Hence, she consented\\n\\t\\t\\t\\tto the proposed marriage with great reluctance, and only\\n\\t\\t\\t\\tin deference to the authority of the Prophet. Since Zayd,\\n\\t\\t\\t\\ttoo, was not at all keen on this alliance (being already\\n\\t\\t\\t\\thappily married to another freed slave, Umm Ayman, the\\n\\t\\t\\t\\tmother of his son Usamah), it was not surprising that the\\n\\t\\t\\t\\tmarriage did not bring happiness to either Zaynab or\\n\\t\\t\\t\\tZayd. On several occasions the latter was about to\\n\\t\\t\\t\\tdivorce his new wife who, on her part, did not make any\\n\\t\\t\\t\\tsecret of her dislike of Zayd; and each time they were\\n\\t\\t\\t\\tpersuaded by the Prophet to persevere in patience and not\\n\\t\\t\\t\\tto separate. In the end, however, the marriage proved\\n\\t\\t\\t\\tuntenable, and Zayd divorced Zaynab in the year 5 H.\\n\\t\\t\\t\\tShortly afterwards the Prophet married her in order to\\n\\t\\t\\t\\tredeem what he considered to be his moral responsibility\\n\\t\\t\\t\\tfor her past unhappiness."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "43",
    "Body": "I.e., Zayd ibn Harithah, whom God had caused to become\\n\\t\\t\\t\\tone of the earliest believers, and whom the Prophet had\\n\\t\\t\\t\\tadopted as his son."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "44",
    "Body": "Namely, that the marriage of Zayd and Zaynab, which had\\n\\t\\t\\t\\tbeen sponsored by Muhammad himself, and on which he had\\n\\t\\t\\t\\tso strongly insisted, was a total failure and could only\\n\\t\\t\\t\\tend in divorce (see also next note)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "45",
    "Body": "Lit., \"whereas God was more worthy (ahaqq) that thou\\n\\t\\t\\t\\tshouldst stand in awe of Him\". Referring to this divine\\n\\t\\t\\t\\treprimand (which, in itself, disproves the allegation\\n\\t\\t\\t\\tthat the Qur'an was \"composed by Muhammad\"), A'ishah is\\n\\t\\t\\t\\treliably quoted as having said, \"Had the Apostle of God\\n\\t\\t\\t\\tbeen inclined to suppress anything of what was revealed\\n\\t\\t\\t\\tto him, he would surely have suppressed this verse\"\\n\\t\\t\\t\\t(Bukhari and Muslim)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "46",
    "Body": "Lit., \"ended his want of [or \"claim on\"] her\", sc., by\\n\\t\\t\\t\\tdivorcing her (Zamakhshari)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "47",
    "Body": "Thus, apart from the Prophet's desire to make amends for\\n\\t\\t\\t\\tZaynab's past unhappiness, the divine purpose in causing\\n\\t\\t\\t\\thim to marry the former wife of his adopted son (stressed\\n\\t\\t\\t\\tin the phrase, \"We gave her to thee in marriage\") was to\\n\\t\\t\\t\\tshow that - contrary to what the pagan Arabs believed -\\n\\t\\t\\t\\tan adoptive relationship does not involve any of the\\n\\t\\t\\t\\tmarriage-restrictions which result from actual,\\n\\t\\t\\t\\tbiological parent-and-child relations (cf. note [3] on\\n\\t\\t\\t\\tverse {4} of this surah)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "38",
    "NoteID": "48",
    "Body": "I.e., his marriage with Zaynab, which was meant to\\n\\t\\t\\t\\texemplify a point of canon law as well as to satisfy what\\n\\t\\t\\t\\tthe Prophet regarded as his personal moral duty."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "38",
    "NoteID": "49",
    "Body": "I.e., the prophets who preceded Muhammad, in all of whom,\\n\\t\\t\\t\\tas in him, all personal desires coincided with their\\n\\t\\t\\t\\twillingness to surrender themselves to God: an inborn,\\n\\t\\t\\t\\tharmonious disposition of the spirit which characterizes\\n\\t\\t\\t\\tGod's elect and - as the subsequent, parenthetic clause\\n\\t\\t\\t\\tdeclares - is their \"destiny absolute\" (qadar maqdur)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "40",
    "NoteID": "50",
    "Body": "I.e., he is the spiritual \"father\" of the whole community\\n\\t\\t\\t\\t(cf. note [8] on verse {6} of this surah), and not of any\\n\\t\\t\\t\\tone person or particular persons - thus, incidentally,\\n\\t\\t\\t\\trefuting the erroneous idea that physical descent from a\\n\\t\\t\\t\\tprophet confers, by itself, any merit on the persons\\n\\t\\t\\t\\tconcerned."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "40",
    "NoteID": "51",
    "Body": "I.e., the last of the prophets, just as a seal (khatam)\\n\\t\\t\\t\\tmarks the end of a document; apart from this, the term\\n\\t\\t\\t\\tkhatam is also synonymous with khitam, the \"end\" or\\n\\t\\t\\t\\t\"conclusion\" of a thing: from which it follows that the\\n\\t\\t\\t\\tmessage revealed through Muhammad - the Qur'an - must be\\n\\t\\t\\t\\tregarded as the culmination and the end of all prophetic\\n\\t\\t\\t\\trevelation (cf. note [66] on the first sentence of the\\n\\t\\t\\t\\tsecond paragraph of  5:48 , and note [126] on  7:158 ).\\n\\t\\t\\t\\tSee also note [102] on  21:107 ."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "42",
    "NoteID": "52",
    "Body": "Lit., \"at morn and evening\", i.e., at all times."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "46",
    "NoteID": "53",
    "Body": "I.e., at His behest (Tabari)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "48",
    "NoteID": "54",
    "Body": "Or: \"yet [withal,] abstain from injuring them\"\\n\\t\\t\\t\\t(Zamakhshari) - depending on whether adhahum is taken to\\n\\t\\t\\t\\tmean \"the hurt caused by them\" or \"done to them\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "49",
    "NoteID": "55",
    "Body": "Lit., \"you have no waiting-period whatever upon them\\n\\t\\t\\t\\twhich you should count\" - i.e., \"which either of you\\n\\t\\t\\t\\tshould take into account as an obligation\": cf. the first\\n\\t\\t\\t\\tpart of  2:228 , and the corresponding note [215]. Since\\n\\t\\t\\t\\tthe question of pregnancy does not arise if the marriage\\n\\t\\t\\t\\thas not been consummated, a waiting-period on the part of\\n\\t\\t\\t\\tthe divorced wife would be meaningless and of no benefit\\n\\t\\t\\t\\teither to her or to her former husband."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "49",
    "NoteID": "56",
    "Body": "This injunction, relating to certain marital problems\\n\\t\\t\\t\\twhich affect the believers in general, forms an\\n\\t\\t\\t\\tintroduction, as it were, to a resumption, in the next\\n\\t\\t\\t\\tverse, of the discourse on the marital laws applying\\n\\t\\t\\t\\texclusively to the Prophet: thus, it connects with the\\n\\t\\t\\t\\tpassage beginning with the words, \"O wives of the\\n\\t\\t\\t\\tProphet! You are not like any of the [other] women\"\\n\\t\\t\\t\\t(verse {32}), as well as with the subsequent reference to\\n\\t\\t\\t\\this marriage with Zaynab (verses {37} f.)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "57",
    "Body": "The term ajr is in this context synonymous with faridah\\n\\t\\t\\t\\tin its specific sense of \"dower\" (mahr): see surah {2},\\n\\t\\t\\t\\tnote [224]."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "58",
    "Body": "As pointed out in several places (see, in particular,\\n\\t\\t\\t\\tnote [32] on  4:25 ), Islam does not countenance any form\\n\\t\\t\\t\\tof concubinage, and categorically prohibits sexual\\n\\t\\t\\t\\trelations between a man and a woman unless they are\\n\\t\\t\\t\\tlawfully married to one another. In this respect, the\\n\\t\\t\\t\\tonly difference between a \"free\" woman and a slave is\\n\\t\\t\\t\\tthat whereas the former must receive a dower from her\\n\\t\\t\\t\\thusband, no such obligation is imposed on a man who\\n\\t\\t\\t\\tmarries his rightfully owned slave (lit., \"one whom his\\n\\t\\t\\t\\tright hand possesses\") - that is, a woman taken captive\\n\\t\\t\\t\\tin a \"holy war\" (jihad ) waged in defence of the Faith or\\n\\t\\t\\t\\tof liberty (note [167] on  2:190  and note [72] on\\n\\t\\t\\t\\t 8:67 ) - : for, in such a case, the freedom conferred\\n\\t\\t\\t\\tupon the bride by the very act of marriage is considered\\n\\t\\t\\t\\tto be equivalent to a dower."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "59",
    "Body": "This was - in addition to his not being allowed to\\n\\t\\t\\t\\tdivorce any of his wives (see verse {52} below) - a\\n\\t\\t\\t\\tfurther restriction imposed on the Prophet in the matter\\n\\t\\t\\t\\tof marriage: whereas all other Muslims are free to marry\\n\\t\\t\\t\\tany of their paternal or maternal cousins, the Prophet\\n\\t\\t\\t\\twas allowed to marry only such from among them as had\\n\\t\\t\\t\\tproved their strong, early attachment to Islam by having\\n\\t\\t\\t\\taccompanied him on his exodus (the hijrah) from Mecca to\\n\\t\\t\\t\\tMedina. In the opinion of Baghawi - an opinion obviously\\n\\t\\t\\t\\tbased on the corresponding, ancient Arabian usage - the\\n\\t\\t\\t\\tterm \"daughters of thy paternal uncles and aunts\"\\n\\t\\t\\t\\tcomprises in this context not only the actual paternal\\n\\t\\t\\t\\tcousins but, in general, all women of the tribe of\\n\\t\\t\\t\\tQuraysh, to which Muhammad's father belonged, while the\\n\\t\\t\\t\\tterm \"daughters of thy maternal uncles and aunts\"\\n\\t\\t\\t\\tcomprises all women of his mother's tribe, the Banu\\n\\t\\t\\t\\tZuhrah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "60",
    "Body": "The relevant clause reads, literally, \"if she offered\\n\\t\\t\\t\\therself as a gift (in wahabat nafsaha) to the Prophet\".\\n\\t\\t\\t\\tMost of the classical commentators take this to mean\\n\\t\\t\\t\\t\"without demanding or expecting a dower (mahr)\", which,\\n\\t\\t\\t\\tas far as ordinary Muslims are concerned, is an essential\\n\\t\\t\\t\\titem in a marriage agreement (cf.  4:4  and {24}, and the\\n\\t\\t\\t\\tcorresponding notes; also surah {2}, note [224])."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "61",
    "Body": "The above parenthetic sentence refers to the previously\\n\\t\\t\\t\\trevealed, general laws relating to marriage (see  2:221 ,\\n\\t\\t\\t\\t{4:3-4} and {19-25}, as well as the corresponding notes), and particularly the laws bearing on the question of dower."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "62",
    "Body": "Thus, the Prophet was told that he need not observe a\\n\\t\\t\\t\\tstrict \"rotation\" in the conjugal attentions due to his\\n\\t\\t\\t\\twives, although he himself, impelled by an inborn sense\\n\\t\\t\\t\\tof fairness, always endeavoured to give them a feeling of\\n\\t\\t\\t\\tabsolute equality."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "63",
    "Body": "I.e., by the inner certainty that whenever he turned to\\n\\t\\t\\t\\tany of them, he did so on impulse, out of genuine\\n\\t\\t\\t\\taffection, and not out of a sense of marital\\n\\t\\t\\t\\t\"obligation\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "64",
    "Body": "According to a hadith on the authority of A'ishah,\\n\\t\\t\\t\\trecorded in the Musnad of Ibn Hanbal, the Prophet \"used\\n\\t\\t\\t\\tto divide his attentions equitably among his wives, and\\n\\t\\t\\t\\tthen would pray: 'O God! I am doing whatever is in my\\n\\t\\t\\t\\tpower: do not, then, blame me for [failing in] something\\n\\t\\t\\t\\twhich is in Thy power [alone], and not in mine!'- thus\\n\\t\\t\\t\\talluding to his heart, and to loving some [of his wives]\\n\\t\\t\\t\\tmore than others.\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "52",
    "NoteID": "65",
    "Body": "Some commentators (e.g., Tabari) assume that this\\n\\t\\t\\t\\trestriction relates to the four categories of women\\n\\t\\t\\t\\tenumerated in verse {50} above: it is, however, much more\\n\\t\\t\\t\\tprobable that it is a prohibition barring the Prophet\\n\\t\\t\\t\\tfrom marrying any woman in addition to those to whom he\\n\\t\\t\\t\\twas already married (Baghawi, Zamakhshari). Some of the\\n\\t\\t\\t\\tearliest, most outstanding authorities on the Qur'an,\\n\\t\\t\\t\\tlike Ibn 'Abbas, Mujahid, Ad-Dahhak, Qatadah, Ibn Zayd\\n\\t\\t\\t\\t(all of them cited by Ibn Kathir), or Al-Hasan al-Basri\\n\\t\\t\\t\\t(quoted by Tabari in his commentary on verses {28-29}),\\n\\t\\t\\t\\tlink this prohibition of further marriages with the\\n\\t\\t\\t\\tchoice between the charms of worldly life and the good of\\n\\t\\t\\t\\tthe hereafter with which the wives of the Prophet were\\n\\t\\t\\t\\tconfronted on the strength of verses {28-29}, and their\\n\\t\\t\\t\\temphatic option for \"God and His Apostle\" (cf. note [32]\\n\\t\\t\\t\\tabove). All those early authorities describe the\\n\\t\\t\\t\\trevelation of verse {52} - and the assurance which it was\\n\\t\\t\\t\\tmeant to convey to the wives of the Prophet - as God's\\n\\t\\t\\t\\treward, in this world, of their faith and fidelity. Since\\n\\t\\t\\t\\tit is inconceivable that the Prophet could have\\n\\t\\t\\t\\tdisregarded the categorical injunction, \"No [other] women\\n\\t\\t\\t\\tshall henceforth be lawful to thee\", the passage in\\n\\t\\t\\t\\tquestion cannot have been revealed earlier than the year\\n\\t\\t\\t\\t7 H., that is, the year in which the conquest of Khaybar\\n\\t\\t\\t\\tand the Prophet's marriage with Safiyyah - his last\\n\\t\\t\\t\\tmarriage - took place. Consequently, verses {28-29} (with\\n\\t\\t\\t\\twhich, as we have seen, verse {52} is closely connected)\\n\\t\\t\\t\\tmust have been revealed at that later period, and not, as\\n\\t\\t\\t\\tsome commentators think, in the year 5 H. (i.e., at the\\n\\t\\t\\t\\ttime of the Prophet's marriage with Zaynab)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "52",
    "NoteID": "66",
    "Body": "I.e., to divorce any of them with a view to taking\\n\\t\\t\\t\\tanother wife in her stead (with the prohibitive accent on\\n\\t\\t\\t\\tthe \"supplanting\" - i.e., divorcing - of any of his\\n\\t\\t\\t\\twives)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "52",
    "NoteID": "67",
    "Body": "In my opinion, the expression ma malakat yaminuka (lit.,\\n\\t\\t\\t\\t\"what thy right hand possesses\", or \"has come to\\n\\t\\t\\t\\tpossess\") has here the same meaning as in  4:24 , namely,\\n\\t\\t\\t\\t\"those whom thou hast come to possess through wedlock\"\\n\\t\\t\\t\\t(see surah {4}, note [26]); thus, the above verse is to\\n\\t\\t\\t\\tbe understood as limiting the Prophet's marriages to\\n\\t\\t\\t\\tthose already contracted."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "NoteID": "68",
    "Body": "Connecting with the reference, in verses {45-48}, to the\\n\\t\\t\\t\\tProphet's mission, the above passage is meant to stress\\n\\t\\t\\t\\this unique position among his contemporaries; but as is\\n\\t\\t\\t\\tso often the case with Qur'anic references to historical\\n\\t\\t\\t\\tevents and situations, the ethical principle enunciated\\n\\t\\t\\t\\there is not restricted to a particular time or\\n\\t\\t\\t\\tenvironment. By exhorting the Prophet's Companions to\\n\\t\\t\\t\\trevere his person, the Qur'an reminds all believers, at\\n\\t\\t\\t\\tall times, of his exalted status (cf. note [85] on\\n\\t\\t\\t\\t 2:104 ); beyond that, it teaches them certain rules of\\n\\t\\t\\t\\tbehaviour bearing on the life of the community as such:\\n\\t\\t\\t\\trules which, however insignificant they may appear at\\n\\t\\t\\t\\tfirst glance, are of psychological value in a society\\n\\t\\t\\t\\tthat is to be governed by a genuine feeling of\\n\\t\\t\\t\\tbrotherhood, mutual consideration, and respect for the\\n\\t\\t\\t\\tsanctity of each other's personality and privacy."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "NoteID": "69",
    "Body": "The term hijab denotes anything that intervenes between\\n\\t\\t\\t\\ttwo things, or conceals, shelters or protects the one\\n\\t\\t\\t\\tfrom the other; it may be rendered, according to the\\n\\t\\t\\t\\tcontext, as \"barrier\", \"obstacle\", \"partition\", \"screen\",\\n\\t\\t\\t\\t\"curtain\", \"veil\", etc., in both the concrete and\\n\\t\\t\\t\\tabstract connotations of these words. The prohibition to\\n\\t\\t\\t\\tapproach the Prophet's wives otherwise than \"from behind\\n\\t\\t\\t\\ta screen\" or \"curtain\" may be taken literally - as indeed\\n\\t\\t\\t\\tit was taken by most of the Companions of the Prophet -\\n\\t\\t\\t\\tor metaphorically, indicating the exceptional reverence\\n\\t\\t\\t\\tdue to these \"mothers of the faithful\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "NoteID": "70",
    "Body": "Lit., \"to marry his wives after him\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "55",
    "NoteID": "71",
    "Body": "I.e., the wives of the Prophet (connecting with the\\n\\t\\t\\t\\tinjunction, in verse {53} above, that they should be\\n\\t\\t\\t\\tspoken to \"from behind a screen\")."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "55",
    "NoteID": "72",
    "Body": "This interpolation is conditioned by the feminine gender\\n\\t\\t\\t\\tof the subsequent plural imperative ittaqina."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "57",
    "NoteID": "73",
    "Body": "In classical Arabic, the term la'nah is more or less\\n\\t\\t\\t\\tsynonymous with ib'ad (\"removal into distance\" or\\n\\t\\t\\t\\t\"banishment\"); hence, God's la'nah denotes \"His rejection\\n\\t\\t\\t\\tof a sinner from all that is good\" (Lisan al-'Arab) or\\n\\t\\t\\t\\t\"exclusion from His grace\" (Manar II, 50). The term\\n\\t\\t\\t\\tmal'un which occurs in verse {61} below signifies,\\n\\t\\t\\t\\ttherefore, \"one who is bereft of God's grace\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "59",
    "NoteID": "74",
    "Body": "Cf. the first two sentences of  24:31  and the\\n\\t\\t\\t\\tcorresponding notes [37] and [38]."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "59",
    "NoteID": "75",
    "Body": "The specific, time-bound formulation of the above verse\\n\\t\\t\\t\\t(evident in the reference to the wives and daughters of\\n\\t\\t\\t\\tthe Prophet), as well as the deliberate vagueness of the\\n\\t\\t\\t\\trecommendation that women \"should draw over themselves\\n\\t\\t\\t\\tsome of their outer garments (min jalabibihinna)\" when in\\n\\t\\t\\t\\tpublic, makes it clear that this verse was not meant to\\n\\t\\t\\t\\tbe an injunction (hukm) in the general, timeless sense of\\n\\t\\t\\t\\tthis term but, rather, a moral guideline to be observed\\n\\t\\t\\t\\tagainst the ever-changing background of time and social\\n\\t\\t\\t\\tenvironment. This finding is reinforced by the concluding\\n\\t\\t\\t\\treference to God's forgiveness and grace."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "60",
    "NoteID": "76",
    "Body": "For my above rendering of la'in, see surah {30}, note\\n\\t\\t\\t\\t[45]. With this passage, the discourse returns to the\\n\\t\\t\\t\\ttheme touched upon in verse {1} and more fully dealt with\\n\\t\\t\\t\\tin verses {9-27}: namely, the opposition with which the\\n\\t\\t\\t\\tProphet and his followers were faced in their early years\\n\\t\\t\\t\\tat Yathrib (which by that time had come to be known as\\n\\t\\t\\t\\tMadinat an-Nabi, \"the City of the Prophet\")."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "60",
    "NoteID": "77",
    "Body": "See note [16] above."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "60",
    "NoteID": "78",
    "Body": "Thus Zamakhshari, explaining the term al-murjifun in the\\n\\t\\t\\t\\tabove context."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "60",
    "NoteID": "79",
    "Body": "I.e., \"there will be open warfare between thee and them\",\\n\\t\\t\\t\\twhich will result in their expulsion from Medina: a\\n\\t\\t\\t\\tprediction which was fulfilled in the course of time."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "61",
    "NoteID": "80",
    "Body": "Lit., \"slain with [a great] slaying\". See in this\\n\\t\\t\\t\\tconnection note [168] on  2:191 . For my rendering of\\n\\t\\t\\t\\tmal'unin as \"bereft of God's grace\", see note [73] above."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "62",
    "NoteID": "81",
    "Body": "Cf. {35:42-44}, and particularly the last paragraph of\\n\\t\\t\\t\\tverse {43}."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "63",
    "NoteID": "82",
    "Body": "See  7:187 ."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "66",
    "NoteID": "83",
    "Body": "As in several other instances in the Qur'an, the \"face\",\\n\\t\\t\\t\\tbeing the noblest and most expressive part of a human\\n\\t\\t\\t\\tperson, represents here man's \"personality\" in its\\n\\t\\t\\t\\tentirety; and its being \"tossed about in the fire\" is\\n\\t\\t\\t\\tsymbolic of the annihilation of the sinner's will and his\\n\\t\\t\\t\\treduction to utter passivity."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "68",
    "NoteID": "84",
    "Body": "Lit., \"reject them (il'anhum) with a great rejection\" ,\\n\\t\\t\\t\\ti.e., \"from Thy grace\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "69",
    "NoteID": "85",
    "Body": "This is an allusion to the aspersions occasionally cast\\n\\t\\t\\t\\tupon Moses by some of his followers and mentioned in the\\n\\t\\t\\t\\tOid Testament (e.g., Numbers xii, 1-13), as well as to\\n\\t\\t\\t\\tthe blasphemous demands of which the Qur'an speaks -\\n\\t\\t\\t\\te.g., \"O Moses, indeed we shall not believe thee until we\\n\\t\\t\\t\\tsee God face to face\" ( 2:55 ) or, \"Go forth, thou and\\n\\t\\t\\t\\tthy Sustainer, and fight, both of you!\" ( 5:24 ). These\\n\\t\\t\\t\\tinstances are paralleled here with the frequently cited\\n\\t\\t\\t\\taccusations that Muhammad had \"invented\" the Qur'an and\\n\\t\\t\\t\\tthen falsely attributed it to God, that he was a madman,\\n\\t\\t\\t\\tand so forth, as well as with frivolous demands to prove\\n\\t\\t\\t\\this prophethood by bringing about miracles or - as is\\n\\t\\t\\t\\tre-stated in verse {63} of this surah - by predicting the\\n\\t\\t\\t\\tdate of the Last Hour."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "70",
    "NoteID": "86",
    "Body": "The expression qawl sadid signifies, literally, \"a saying\\n\\t\\t\\t\\tthat hits the mark\", i.e., is truthful, relevant and to\\n\\t\\t\\t\\tthe point. In the only other instance where this\\n\\t\\t\\t\\texpression is used in the Qur'an (at the end of  4:9 ) it\\n\\t\\t\\t\\tmay be appropriately rendered as \"speaking in a just\\n\\t\\t\\t\\tmanner\"; in the present instance, however, it obviously\\n\\t\\t\\t\\trelates to speaking of others in a manner devoid of all\\n\\t\\t\\t\\thidden meanings, insinuations and frivolous suspicions,\\n\\t\\t\\t\\taiming at no more and no less than the truth."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "87",
    "Body": "The classical commentators give all kinds of laborious\\n\\t\\t\\t\\texplanations to the term amanah (\"trust\") occurring in\\n\\t\\t\\t\\tthis parable, but the most convincing of them (mentioned\\n\\t\\t\\t\\tin {Lane I, 102}, with reference to the above verse) are\\n\\t\\t\\t\\t\"reason\", or \"intellect\", and \"the faculty of volition\" -\\n\\t\\t\\t\\ti.e., the ability to choose between two or more possible\\n\\t\\t\\t\\tcourses of action or modes of behaviour, and thus between\\n\\t\\t\\t\\tgood and evil."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "88",
    "Body": "Sc., \"and then failed to measure up to the moral\\n\\t\\t\\t\\tresponsibility arising from the reason and the\\n\\t\\t\\t\\tcomparative free will with which he has been endowed\"\\n\\t\\t\\t\\t(Zamakhshari). This obviously applies to the human race\\n\\t\\t\\t\\tas such, and not necessarily to all of its individuals."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "73",
    "NoteID": "89",
    "Body": "In other words, on those who offend against what their\\n\\t\\t\\t\\town reason and conscience would have them do. This\\n\\t\\t\\t\\tsuffering, whether in this world or in the hereafter, is\\n\\t\\t\\t\\tbut a causal consequence - as the lam al-'aqibah at the\\n\\t\\t\\t\\tbeginning of this sentence shows - of man's moral\\n\\t\\t\\t\\tfailure, and not an arbitrary act of God. (Cf. in this\\n\\t\\t\\t\\tconnection note [7] on  2:7 . which speaks of God's\\n\\t\\t\\t\\t\"sealing\" the hearts of those who are bent on denying the\\n\\t\\t\\t\\ttruth.)"
  }
]
