[
  {
    "SurahNumber": "6",
    "AyahNumber": "1",
    "Text": "All praise be to Allah, the One Who has created the heavens and\\n\\t\\t\\tthe earth and made darkness and the light; yet the unbelievers\\n\\t\\t\\tset up equal partners with their Rabb."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "2",
    "Text": "He is the One Who has created you from clay, then decreed a fixed\\n\\t\\t\\tterm of life and set a deadline for you Himself; yet you go on\\n\\t\\t\\tdoubting!"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "3",
    "Text": "He is the same One Allah in both the heavens and the earth. He\\n\\t\\t\\tknows what you conceal, what you reveal and what you do."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "4",
    "Text": "Yet the reaction of the people has been that whenever a\\n\\t\\t\\trevelation came to them from their Rabb, they neglected it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "5",
    "Text": "Now that the truth has come to them they have denied it. Soon\\n\\t\\t\\tthey will come to know the reality which they are ridiculing."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "6",
    "Text": "Have they not seen how many generations We have destroyed before\\n\\t\\t\\tthem? We had made those nations more powerful in the land than\\n\\t\\t\\tyourselves. We sent down for them abundant rain from the sky and\\n\\t\\t\\tmade the rivers to flow beneath their feet: yet for their sins We\\n\\t\\t\\tdestroyed them all and raised up other generations in their\\n\\t\\t\\tplaces."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "7",
    "Text": "O Prophet, if We had sent to you a Book written on paper and they\\n\\t\\t\\tcould have touched it with their own hands, the unbelievers would\\n\\t\\t\\tstill have said: \"This is nothing but plain sorcery!\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "8",
    "Text": "They ask: \"Why has no angel been sent down to us?\" Well, if We\\n\\t\\t\\thad sent down an angel, the matter would have been settled at\\n\\t\\t\\tonce and no respite would have been granted after that;"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "9",
    "Text": "and if We had sent an angel, We would have certainly send him in\\n\\t\\t\\ta human form and thus involved them in the same confusion as they\\n\\t\\t\\tare in at this time."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "10",
    "Text": "O Muhammad many Rasools before you were also ridiculed, but in\\n\\t\\t\\tthe long run those who ridiculed were hemmed in by the very thing\\n\\t\\t\\tthey were ridiculing."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "11",
    "Text": "O Muhammad, say: \"Travel through the earth and see what was the\\n\\t\\t\\tend of those who denied the truth.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "12",
    "Text": "Ask them: \"To whom belongs all that is in the heavens and in the\\n\\t\\t\\tearth?\" If they don't respond, tell them: \"To Allah!\" He has\\n\\t\\t\\tdecreed mercy for Himself, that is why He does not punish you for\\n\\t\\t\\tyour misdeeds right away. He will certainly gather you all\\n\\t\\t\\ttogether on the Day of Resurrection; there is no doubt about it.\\n\\t\\t\\tYet those who have lost their souls will not believe."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "13",
    "Text": "To Him belongs all that takes rest in the night and in the day.\\n\\t\\t\\tHe is the Hearer, the Knower."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "14",
    "Text": "Say: \"Should I take as my protector anyone other than Allah, who\\n\\t\\t\\tis the Creator of the heavens and the earth. Who feeds all and is\\n\\t\\t\\tfed by none?\" Say: \"Nay! I am commanded to be the first of those\\n\\t\\t\\twho submit to Allah in Islam and not of those who commit shirk.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "15",
    "Text": "Say: \"I will never disobey my Rabb, for I fear the torment of a\\n\\t\\t\\tMighty Day.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "16",
    "Text": "He who is delivered from the torment of that Day, has indeed\\n\\t\\t\\treceived Allah's Mercy; and this is a clear cut achievement."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "17",
    "Text": "If Allah afflicts you with any harm, none can relieve you other\\n\\t\\t\\tthan Him; and if He blesses you with happiness, you should know\\n\\t\\t\\tthat He has power over everything."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "18",
    "Text": "He is the Supreme Authority over His servants; and He is the\\n\\t\\t\\tWise, the Aware."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "19",
    "Text": "Ask them: \" Whose testimony is the most reliable? \" When they say\\n\\t\\t\\tAllah, then tell them: \"Let Allah be Witness between me and you\\n\\t\\t\\t(that I am the Rasool of Allah) and this Qur'an has been revealed\\n\\t\\t\\tto me by Him so that I may warn you thereby and all those whom it\\n\\t\\t\\tmay reach. Can you really testify that there are other gods\\n\\t\\t\\tbesides Allah?\" Tell them: \"As far as I am concerned I will never\\n\\t\\t\\ttestify to this!\" Say: \"Indeed He is the One and the Only God and\\n\\t\\t\\tI am absolutely disgusted with the shirk you commit."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "20",
    "Text": "Those to whom We have given the Book know this fact as they know\\n\\t\\t\\ttheir own sons. In fact those who have lost their souls, will not\\n\\t\\t\\tbelieve."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "21",
    "Text": "Who can be more wicked than a person who forges a lie against\\n\\t\\t\\tAllah or denies His revelations? Surely the wrongdoers shall\\n\\t\\t\\tnever get salvation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "22",
    "Text": "On the Day of Judgement when We shall gather them all together,\\n\\t\\t\\tWe shall ask the mushrikin: \"Where are those deities whom you\\n\\t\\t\\tascribed to be My partners?\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "23",
    "Text": "They will have no argument but to say: \"By Allah, our Rabb, we\\n\\t\\t\\twere not at all mushrik.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "24",
    "Text": "See how they will lie against their own souls, and how the\\n\\t\\t\\tdeities of their own inventions will leave them in the lurch."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "25",
    "Text": "Of them there are some who pretend that they listen to you; but\\n\\t\\t\\ttheir prejudices have dulled their faculties and We have cast\\n\\t\\t\\tveils over their hearts and deafness in their ears so they are\\n\\t\\t\\tunable to understand. Even if they see every one of Our Signs,\\n\\t\\t\\tthey will not believe. So much so, that when they come to you,\\n\\t\\t\\tthey argue with you. The unbelievers say: \"These are nothing but\\n\\t\\t\\ttales of the old times.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "26",
    "Text": "They themselves have turned away from the truth and also forbid\\n\\t\\t\\tother people to believe in it. With such a behavior they harm\\n\\t\\t\\tnone but their own souls but they do not perceive it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "27",
    "Text": "If you could witness the scene, when they will be made to stand\\n\\t\\t\\tbefore the hellfire! They will say: \"We wish we could return to\\n\\t\\t\\tearthly life again; then we would not deny the revelations of our\\n\\t\\t\\tRabb, and we would join the believers!\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "28",
    "Text": "In fact, they will say this because they had come to know the\\n\\t\\t\\treality which they were concealing before. As a matter of fact\\n\\t\\t\\teven if they be sent back, they would certainly repeat the same\\n\\t\\t\\tthings which they had been forbidden to do. Indeed they are\\n\\t\\t\\tliars."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "29",
    "Text": "Today they say: \"There is no other life except the life on this\\n\\t\\t\\tearth and we shall never be raised to life again.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "30",
    "Text": "If you could witness the scene when they will be brought before\\n\\t\\t\\ttheir Rabb; He will ask, \"Is this not a reality?\" They will say:\\n\\t\\t\\t\"Yes, our Rabb, this is the reality.\" He will order: \"Well, then\\n\\t\\t\\ttaste the punishment for denying this reality.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "31",
    "Text": "Those people are indeed lost who deny that they will ever meet\\n\\t\\t\\tAllah. When the hour of Doomsday will overtake them all of a\\n\\t\\t\\tsudden, they will exclaim: \"Alas! How negligent we have been\\n\\t\\t\\tabout this Hour.\" They will be carrying the burden of their sins\\n\\t\\t\\ton their backs; and evil indeed are the burdens that they carry!"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "32",
    "Text": "The life of this world is nothing but play and amusement, but the\\n\\t\\t\\tlife of the Hereafter will be better for those who are righteous.\\n\\t\\t\\tWill you not use your common sense?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "33",
    "Text": "O Muhammad We know it well that what they say grieves you: it is\\n\\t\\t\\tnot you that they deny, these wrongdoers actually deny the\\n\\t\\t\\trevelations of Allah."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "34",
    "Text": "Many Rasools before you were denied but patiently bore with their\\n\\t\\t\\tdenial and persecution until Our help came down to them: for none\\n\\t\\t\\tcan change the decrees of Allah. You have already received the\\n\\t\\t\\tnews of what happened to those Rasools."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "35",
    "Text": "If you find their aversion hard to bear, then see if you can make\\n\\t\\t\\ta tunnel in the ground or put a ladder to ascend in the skies by\\n\\t\\t\\twhich you can bring them a sign. O Prophet, you know well that if\\n\\t\\t\\tAllah wanted, He would have given guidance to all. So do not be\\n\\t\\t\\tlike the ignorant."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "36",
    "Text": "Surely those who listen to Our revelations with open mind will\\n\\t\\t\\taccept the Truth. As for the dead (those with closed minds),\\n\\t\\t\\tAllah will bring them back to life, on the Day of Judgement, to\\n\\t\\t\\tbe produced in His court."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "37",
    "Text": "They ask: \"Why has a sign not been sent down to him from his\\n\\t\\t\\tRabb?\" Tell them: \"Allah is surely able to send down a Sign if He\\n\\t\\t\\twants; but most of them do not understand the wisdom behind it.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "38",
    "Text": "If you really want to see the signs of Allah, just look at any\\n\\t\\t\\tanimal that walks upon the earth and any bird that flies in the\\n\\t\\t\\tair; they too are the communities like you. We have not left out\\n\\t\\t\\tanything from the Book in determining the courses of their lives.\\n\\t\\t\\tThey all shall be gathered before their Rabb."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "39",
    "Text": "Those who deny Our Revelations are deaf and dumb, living in many\\n\\t\\t\\tlayers of darkness. Allah confounds whom He will, and guides to\\n\\t\\t\\tthe Right Way whom He pleases."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "40",
    "Text": "Ask them to think carefully and answer: \"When you face a disaster\\n\\t\\t\\tor the last Hour approaches you, do you call for help anyone\\n\\t\\t\\tother than Allah? Answer me if you are truthful!\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "41",
    "Text": "No, on Him Alone you will call, and forget those whom you have\\n\\t\\t\\tset up as His partners; then if He pleases, He relieves you from\\n\\t\\t\\tthe affliction about which you have prayed to Him."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "42",
    "Text": "We did send Rasools before you to other nations and afflicted\\n\\t\\t\\tthem with suffering and adversities so that they might learn\\n\\t\\t\\thumility."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "43",
    "Text": "Why did they not humble themselves when the sufferings overtook\\n\\t\\t\\tthem? On the contrary their hearts became hardened and Shaitan\\n\\t\\t\\tmade their sinful acts seem fair to them."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "44",
    "Text": "When they neglected the warning they had received, then, instead\\n\\t\\t\\tof punishment, We opened the gates of every kind of prosperity\\n\\t\\t\\tfor them; but just as they were rejoicing in what they were\\n\\t\\t\\tgiven, We suddenly seized them; lo! They were plunged into\\n\\t\\t\\tdespair!"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "45",
    "Text": "Thus We cut off the roots of the wrongdoers. All praises are due\\n\\t\\t\\tto Allah the Rabb of the worlds."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "46",
    "Text": "Ask them: \"Just think, if Allah takes away your hearing and your\\n\\t\\t\\tsight and seals up your hearts, is there any deity other than\\n\\t\\t\\tAllah who could restore them to you?\" See how We present Our\\n\\t\\t\\trevelations over and over again and yet they turn away."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "47",
    "Text": "Say: \"Just think if the punishment of Allah comes to you whether\\n\\t\\t\\tsuddenly or openly, would any be destroyed other than the\\n\\t\\t\\twrongdoers?\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "48",
    "Text": "We have sent the Rasools only to give good news and to warn: then\\n\\t\\t\\twhoever believe and mend their ways shall have nothing to fear or\\n\\t\\t\\tto regret."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "49",
    "Text": "But those who deny Our Revelations shall be punished for their\\n\\t\\t\\ttransgression."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "50",
    "Text": "Say: \"I do not claim that I possess the treasures of Allah, or\\n\\t\\t\\tthat I know the unseen nor do I claim that I am an angel. What I\\n\\t\\t\\tsay is, that I follow only that which is revealed to me.\" Ask\\n\\t\\t\\tthem: \"Are the blind and the seeing alike? Why don't you think?\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "51",
    "Text": "O Muhammad, admonish with this (The Qur'an), those who have the\\n\\t\\t\\tfear of being assembled before their Rabb in such a condition\\n\\t\\t\\tthat there will be no one to protect them or intercede on their\\n\\t\\t\\tbehalf other than Him. It may be that, by this admonition, they\\n\\t\\t\\tmay become righteous."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "52",
    "Text": "Do not drive away those (poor people like Bilal, Ammar and\\n\\t\\t\\tSuhaib) who call on their Rabb morning and evening, seeking only\\n\\t\\t\\tto gain His favor. You are in no way accountable for their deeds\\n\\t\\t\\tnor they are in any way accountable for yours. So if you drive\\n\\t\\t\\tthem away you shall be counted among the wrongdoers."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "53",
    "Text": "That's how We have made some of them (poor and slaves who\\n\\t\\t\\taccepted Islam) a means for testing the others (the chiefs of\\n\\t\\t\\tQureysh), so that they should say: \"Are these the people whom\\n\\t\\t\\tAllah favors among us (the poor, indigent and low class)?\" Well,\\n\\t\\t\\tdoes Allah not know best those who are grateful?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "54",
    "Text": "When those who believe in Our revelations come to you, say:\\n\\t\\t\\t\"Peace be upon you. Your Rabb has decreed mercy upon Himself. If\\n\\t\\t\\tanyone among you commits evil because of ignorance and thereafter\\n\\t\\t\\trepents and mends his ways; you will find Allah Forgiving,\\n\\t\\t\\tMerciful.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "55",
    "Text": "Thus, We spell out Our revelations, so that the way of the\\n\\t\\t\\tculprits may become evident."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "56",
    "Text": "O Muhammad, tell them: \"I am forbidden to worship those whom you\\n\\t\\t\\tcall upon besides Allah.\" Say: \"I am not going to follow your\\n\\t\\t\\twishes: if I do, I would be lost and cease to be from the rightly\\n\\t\\t\\tguided.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "57",
    "Text": "Say: \"I am on a clear proof from my Rabb which you have denied,\\n\\t\\t\\tbut the scourge of Allah, which you are in such a rush to see is\\n\\t\\t\\tnot in my power. No one has the authority of passing judgement\\n\\t\\t\\texcept Allah: He declares the truth and He is the best of\\n\\t\\t\\tJudges.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "58",
    "Text": "Say: \"If what you rush to see was in my power, the matter between\\n\\t\\t\\tyou and me would have been settled long ago; but Allah knows best\\n\\t\\t\\thow to deal with wrongdoers."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "59",
    "Text": "He Alone has the keys of the unseen treasures, of which no one\\n\\t\\t\\tknows except Him. He knows whatever is in the land and in the\\n\\t\\t\\tsea; there is not a single leaf that falls without His knowledge,\\n\\t\\t\\tthere is neither a grain in the darkness of the earth nor\\n\\t\\t\\tanything fresh or dry which has not been recorded in a Clear\\n\\t\\t\\tBook."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "60",
    "Text": "He is the One Who takes your souls at night (makes you go to\\n\\t\\t\\tsleep) and knows what you do during the day, then next day raises\\n\\t\\t\\tyou up again to complete your allotted span of life. To Him you\\n\\t\\t\\tshall all return, then He will notify you of all that you have\\n\\t\\t\\tdone.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "61",
    "Text": "He is the Irresistible (reigns supreme) over his servants and\\n\\t\\t\\tsends guardian angels over you. At length, when death approaches\\n\\t\\t\\tanyone of you, Our angels take his soul and they are not\\n\\t\\t\\tnegligent in performing their duty."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "62",
    "Text": "Then those souls are brought back to Allah, their real Master.\\n\\t\\t\\tBeware! He is the Judge and He is the swiftest in settling\\n\\t\\t\\taccounts."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "63",
    "Text": "Ask them: \"Who delivers you from calamities in the darkness of\\n\\t\\t\\tthe land and of the sea, when you call upon Him in open humility\\n\\t\\t\\tand silent terror: If You deliver us from this affliction, we\\n\\t\\t\\tshall become truly grateful.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "64",
    "Text": "Say: \"Allah delivers you from these and all other calamities, yet\\n\\t\\t\\tyou commit shirk (worship false gods)!\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "65",
    "Text": "Say: \"He has the power to send calamities on you from above and\\n\\t\\t\\tfrom below or to split you into discordant factions to make you\\n\\t\\t\\ttaste the violence of one another. See how We present Our\\n\\t\\t\\trevelations over and over again so that they may understand the\\n\\t\\t\\treality."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "66",
    "Text": "But your people are rejecting this (The Qur'an), although it is\\n\\t\\t\\tthe very truth.\" Tell them: \"I am not appointed as your\\n\\t\\t\\tcaretaker."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "67",
    "Text": "For every prophecy there is an appointed time, and soon you will\\n\\t\\t\\tcome to know.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "68",
    "Text": "When you see those who are engaged in arguments about Our\\n\\t\\t\\trevelations, turn away from them until they change their topic of\\n\\t\\t\\tdiscussion. If Shaitan ever makes you forget this commandment,\\n\\t\\t\\tthen as soon as you realize, withdraw from the company of\\n\\t\\t\\twrongdoers."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "69",
    "Text": "Though righteous people will not be held responsible for\\n\\t\\t\\twrongdoers' actions, yet it is their duty to admonish them;\\n\\t\\t\\tperhaps they may refrain from evil deeds."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "70",
    "Text": "Leave those people alone, who take their religion as mere play\\n\\t\\t\\tand amusement and are deceived by the life of this world.\\n\\t\\t\\tHowever, keep on admonishing them with this (The Qur'an), lest\\n\\t\\t\\ttheir souls be damned by their own sinful deeds. They will not\\n\\t\\t\\thave any protector or intercessor to rescue them from Allah, and\\n\\t\\t\\tif they seek to offer every imaginable ransom, it shall not be\\n\\t\\t\\taccepted from them. Such are those who are damned by their own\\n\\t\\t\\tsinful deeds. They will get boiling water to drink and painful\\n\\t\\t\\ttorture for their rejection of the Truth."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "71",
    "Text": "Ask the mushrikin: \"Should we call on those, instead of Allah,\\n\\t\\t\\twho can neither benefit us nor harm us? Should we turn upon our\\n\\t\\t\\theels after Allah has guided us to the Right Way? Like the one\\n\\t\\t\\twhom Shaitan has misled and is wandering around in the land,\\n\\t\\t\\twhile his friends are calling him to the right way, shouting:\\n\\t\\t\\t\"Come this way!\" Tell them: \"Allah's guidance is the only\\n\\t\\t\\tguidance. We are commanded to surrender (become Muslims) to the\\n\\t\\t\\tRabb of the worlds,"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "72",
    "Text": "to establish Salah and fear Him, before Whom you shall all be\\n\\t\\t\\tassembled on the Day of Judgement."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "73",
    "Text": "He is the One Who has created the heavens and the earth to\\n\\t\\t\\tmanifest the Truth. On the Day when He will say: \"Be,\" it shall\\n\\t\\t\\tbe (the Day of Resurrection). His Word is the truth. He shall be\\n\\t\\t\\tthe sole Sovereign on the Day when the trumpet will be blown. He\\n\\t\\t\\thas the full knowledge of the invisible and the visible. He is\\n\\t\\t\\tthe Wise, the Aware."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "74",
    "Text": "Tell them about Ibrahim (Abraham), who said to Azer, his father:\\n\\t\\t\\t\"Are you taking idols for gods? Surely, I see you and your people\\n\\t\\t\\tin manifest error.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "75",
    "Text": "We showed Ibrahim the kingdom of the heavens and the earth , as\\n\\t\\t\\tWe show you with examples from nature, so he became one of the\\n\\t\\t\\tfirm believers."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "76",
    "Text": "When the night drew its shadow over him, he saw a star and said,\\n\\t\\t\\t\"this is my Rabb.\" But when it set, he said: \"I do not love to\\n\\t\\t\\tworship such a god that fades away.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "77",
    "Text": "Afterwards he saw the moon shining, he said; \"This is my Rabb.\"\\n\\t\\t\\tBut when it also set, he cried: \"If my Rabb does not guide me, I\\n\\t\\t\\tshall certainly become one of those who go astray.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "78",
    "Text": "Then when he saw the sun with its brighter shine, and he said:\\n\\t\\t\\t\"This must be my Rabb; it is larger than the other two.\" But when\\n\\t\\t\\tit also set, he exclaimed: \"O my people! I am done with your\\n\\t\\t\\tshirk (associating partners with Allah)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "79",
    "Text": "As far as I am concerned, I will turn my face, being upright, to\\n\\t\\t\\tHim Who has created the heavens and the earth, and I am not one\\n\\t\\t\\tof the mushrikin.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "80",
    "Text": "When his people started arguing with him, he told them: \"Will you\\n\\t\\t\\targue with me about Allah, whereas He Himself has guided me? I do\\n\\t\\t\\tnot fear those whom you take for gods besides Him, none can harm\\n\\t\\t\\tme unless my Rabb so wills, the knowledge of my Rabb encompasses\\n\\t\\t\\teverything, why don't you get admonition?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "81",
    "Text": "Why should I fear your idols, when you are not afraid of your\\n\\t\\t\\tactions of making them partners with Allah, for which He has not\\n\\t\\t\\tgiven you any sanction? Which one from the two parties of us\\n\\t\\t\\tdeserves to feel secure? Tell me, if you know the truth."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "82",
    "Text": "As a matter of fact those who believe and do not taint their\\n\\t\\t\\tfaith with wrongdoings will feel more secure and will be better\\n\\t\\t\\tguided.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "83",
    "Text": "This was the argument which We furnished Ibrahim (Abraham)\\n\\t\\t\\tagainst his people. We exalt in ranks whom We please; surely your\\n\\t\\t\\tRabb is Wise, Aware."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "84",
    "Text": "We gave him Ishaq (Isaac) and Ya'qoob (Jacob) and guided them all\\n\\t\\t\\tas We guided Nuh (Noah) before them, and among his descendants\\n\\t\\t\\twere Dawood (David), Sulaiman (Solomon), Ayub (Job), Yusuf\\n\\t\\t\\t(Joseph), Musa (Moses) and Haroon (Aaron); thus do We reward\\n\\t\\t\\tthose who do good to others."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "85",
    "Text": "Other descendants include Zakariya, Yahya (John), Isa (Jesus),\\n\\t\\t\\tand Ilyas (Elias); all of them were righteous;"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "86",
    "Text": "and Isma`il (Ishmael), Al-Yas'a (Elisha), Yunus (Jonah) and Lut\\n\\t\\t\\t(Lot). We exalted every one of them over the worlds"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "87",
    "Text": "as We exalted some of their forefather, their children and their\\n\\t\\t\\tbrothers. We chose them for Our service and guided them to the\\n\\t\\t\\tRight Way."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "88",
    "Text": "This is the guidance from Allah; He bestows it upon whom He\\n\\t\\t\\tpleases of His devotees. If they had committed shirk (worshiped\\n\\t\\t\\tanyone else besides Allah) all their deeds would have become\\n\\t\\t\\tvoid."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "89",
    "Text": "Such were the people to whom We gave the Book, wisdom and\\n\\t\\t\\tProphethood. Now if these people deny this guidance, it does not\\n\\t\\t\\tmatter; We would bestow this guidance upon other people who would\\n\\t\\t\\tnot disbelieve."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "90",
    "Text": "O Muhammad, those were the people who were rightly guided by\\n\\t\\t\\tAllah, therefore, follow their guidance and tell these people: \"I\\n\\t\\t\\tam not asking you any compensation for this work of delivering\\n\\t\\t\\tthe Message to you, this message is nothing but a reminder to all\\n\\t\\t\\tthe worlds.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "91",
    "Text": "Those people have not valued the attributes of Allah, the way His\\n\\t\\t\\tattributes should be valued, who say: \"Allah has never revealed\\n\\t\\t\\tanything to a human being.\" Ask them: \"Who then sent down the\\n\\t\\t\\tBook (Torah) which Musa brought, a light and guidance for\\n\\t\\t\\tmankind? You have transcribed it on separate sheets, publishing\\n\\t\\t\\tsome and suppressing much of that given knowledge, which neither\\n\\t\\t\\tyou nor your forefathers previously possessed.\" If they do not\\n\\t\\t\\tanswer, then just say: \"Allah\" and leave them alone with the\\n\\t\\t\\tdiscourse of their useless arguments."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "92",
    "Text": "This is the blessed Book, like the one given to Musa (Moses),\\n\\t\\t\\twhich We have revealed, confirming what came before it, that you,\\n\\t\\t\\tO Muhammad, may warn the people living in the Mother City\\n\\t\\t\\t(Makkah) and those who live around her. Those who believe in the\\n\\t\\t\\thereafter, will believe in this (Book) and will be steadfast in\\n\\t\\t\\ttaking care of their Salah (prescribed prayers)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "93",
    "Text": "Who can be more wicked than the one who invents a lie against\\n\\t\\t\\tAllah, or says: \"This was revealed to me,\" while nothing was\\n\\t\\t\\trevealed to him? Or the one who says: \"I can reveal the like of\\n\\t\\t\\twhat Allah has revealed?\" If you could only see these wrongdoers\\n\\t\\t\\twhen they are in the agonies of death and the angels stretch\\n\\t\\t\\tforth their hands saying, \"Take out your soul! Today you will be\\n\\t\\t\\trewarded with a disgraceful punishment for saying falsehood\\n\\t\\t\\tagainst Allah which you had no right to say and showing arrogance\\n\\t\\t\\tagainst His revelations!\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "94",
    "Text": "Allah adds to what the angels said, \"So you have come back to Us\\n\\t\\t\\tAlone as We created you at the first time, leaving behind all\\n\\t\\t\\tthat which We gave you in that world and We don't see with you\\n\\t\\t\\tyour intercessors, whom you claimed to be Allah's partners in\\n\\t\\t\\tyour affairs; all your ties have been cut off and what you\\n\\t\\t\\tpresumed has failed you.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "95",
    "Text": "Surely it is Allah Who causes the seed and the fruit-stone to\\n\\t\\t\\tsplit and sprout. He brings forth the living from the dead and\\n\\t\\t\\tthe dead from the living. It is Allah, Who does all this; then\\n\\t\\t\\twhy are you being misled?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "96",
    "Text": "He causes the daybreak from the dark. He makes the night for rest\\n\\t\\t\\tand makes the rising and setting of the sun and the moon for you\\n\\t\\t\\tto determine times ( days, weeks, months and years), these are\\n\\t\\t\\tthe arrangements of the Almighty, the All-Knowing."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "97",
    "Text": "He is the One Who has made the stars for you, so that you might\\n\\t\\t\\tfind your way thereby in the darkness whether you are on the land\\n\\t\\t\\tor the sea. We have spelled out Our revelations very clearly for\\n\\t\\t\\tpeople of common sense."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "98",
    "Text": "He is the One Who has created you from a single soul and granted\\n\\t\\t\\tyou dwelling on Earth and a resting place in the hereafter. We\\n\\t\\t\\thave spelled out Our revelation very clearly for people of\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "99",
    "Text": "It is He Who sends down rainwater from the sky and therewith\\n\\t\\t\\tproduces vegetation of all kinds: He brings forth green crops\\n\\t\\t\\tproducing grain piled up in the ear, palm-trees laden with\\n\\t\\t\\tclusters of dates hanging within reach, gardens of grapes,\\n\\t\\t\\tolives, and pomegranates; though their fruit resembles in kind\\n\\t\\t\\tyet is different in variety. Look at their fruits as they yield\\n\\t\\t\\tand ripen. Behold! In these things there are signs for true\\n\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "100",
    "Text": "Yet they make the Jinns (Genies: creature which has been created\\n\\t\\t\\tout of fire) as the partners with Allah, whereas He is their\\n\\t\\t\\tCreator; and also ascribe to Him sons and daughters without\\n\\t\\t\\thaving any knowledge. Glory to Him! He is highly exalted far\\n\\t\\t\\tabove what they ascribe."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "101",
    "Text": "He is the creator of the heavens and the earth. How could He have\\n\\t\\t\\ta son when He has no consort? He has created everything and is\\n\\t\\t\\taware of everything."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "102",
    "Text": "That is Allah your Rabb! There is no god but Him, the creator of\\n\\t\\t\\teverything. Therefore, worship Him, He is the Guardian of\\n\\t\\t\\teverything."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "103",
    "Text": "No vision can grasp Him while He grasps all visions. He is the\\n\\t\\t\\tSubtle, the Aware."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "104",
    "Text": "Now there have come to you clear proofs from your Rabb to open\\n\\t\\t\\tyour eyes. Therefore, anyone who will open his eyes, it is good\\n\\t\\t\\tfor his own soul and anyone who will play blind, it is to his own\\n\\t\\t\\tharm, and I am the Prophet, not assigned as a keeper over you."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "105",
    "Text": "Thus do We explain Our revelations over and over again so that\\n\\t\\t\\tthe unbelievers may say: \"You have learned from someone, but not\\n\\t\\t\\tfrom Allah\" and that this may become clear to people of\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "106",
    "Text": "Follow what is revealed to you from your Rabb, there is no god\\n\\t\\t\\tbut Him and turn aside from the mushrikin."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "107",
    "Text": "If Allah wanted they would not be mushrikin. We have neither\\n\\t\\t\\tappointed you their keeper nor made you their guardian."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "108",
    "Text": "O believers, do not insult those, whom these mushrikin call upon\\n\\t\\t\\tbesides Allah, lest in retaliation they call bad names to Allah\\n\\t\\t\\tout of their ignorance. Thus We have made the deeds of every\\n\\t\\t\\tgroup of people seem fair to them. In the end they will all\\n\\t\\t\\treturn to their Rabb and then, He will inform them of the reality\\n\\t\\t\\tof all that they have done."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "109",
    "Text": "These mushrikin solemnly swear by Allah that if a Sign came to\\n\\t\\t\\tthem they would most certainly believe in your Prophethood. Say:\\n\\t\\t\\t\"All signs are vouchsafed by Allah.\" What should make you\\n\\t\\t\\tunderstand that if a sign comes to them they will still not\\n\\t\\t\\tbelieve?."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "110",
    "Text": "We will turn away their hearts and their eyes from the Truth\\n\\t\\t\\tbecause of their attitude which prompted them to disbelieve in\\n\\t\\t\\tthe first place, and We will leave them to wander in their\\n\\t\\t\\trebellious wrongdoing."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "111",
    "Text": "Even if We had sent to them the angels, made the dead speak to\\n\\t\\t\\tthem, and presented all the different things of the world before\\n\\t\\t\\tthem as proof, they would have not believed, unless Allah wanted\\n\\t\\t\\totherwise (and forcing someone to believe is not what He wants):\\n\\t\\t\\tYet most of them act out of ignorance."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "112",
    "Text": "Like this Rasool, We had granted each Rasool his opponents -\\n\\t\\t\\tshaitans from among the human beings and Jinns - some of them\\n\\t\\t\\tinspire the others with seductive discourses of deception. If\\n\\t\\t\\tyour Rabb wanted, they would not have done so. Therefore, neglect\\n\\t\\t\\tthem as well as what they invent,"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "113",
    "Text": "so that the hearts of those who do not believe in the hereafter\\n\\t\\t\\tmay be inclined to what they say, and be pleased with it; and so\\n\\t\\t\\tthat they can earn what they wish to earn."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "114",
    "Text": "Say: Should I seek a judge other than Allah, when He is the One\\n\\t\\t\\tWho has revealed this Book (The Qur'an) with full details? Those\\n\\t\\t\\twhom We gave the Book, before you, know very well that it is\\n\\t\\t\\trevealed to you from your Rabb with the Truth; therefore, you\\n\\t\\t\\tshould not be of those who have doubts."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "115",
    "Text": "The Words of your Rabb have been completed with credibility and\\n\\t\\t\\tjustice; there is no way to change His Words. He is the Hearer,\\n\\t\\t\\tthe Knower."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "116",
    "Text": "If you obey (other than the Rasool then you should know that)\\n\\t\\t\\tmost of the people on earth will lead you away from the Way of\\n\\t\\t\\tAllah, for they follow nothing but guesswork and preach nothing\\n\\t\\t\\tbut falsehood."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "117",
    "Text": "In fact, your Rabb knows best those people who have strayed from\\n\\t\\t\\tHis Way and He knows best those who are on the Right Way."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "118",
    "Text": "So eat of that meat on which Allah's name has been pronounced if\\n\\t\\t\\tyou truly believe in His revelations."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "119",
    "Text": "Why should you not eat that on which Allah's name has been\\n\\t\\t\\tpronounced, when He has clearly spelled out for you in detail\\n\\t\\t\\twhat is forbidden - except in a case of extreme helplessness? In\\n\\t\\t\\tfact, many do mislead people by their appetites unchecked by\\n\\t\\t\\tknowledge. Your Rabb knows best those who transgress."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "120",
    "Text": "Eschew all sin whether open or secret: surely those who earn sin\\n\\t\\t\\twill get due punishment for their wrongdoings."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "121",
    "Text": "Do not eat of that meat on which Allah's name has not been\\n\\t\\t\\tpronounced, since that is most surely a transgression. In fact\\n\\t\\t\\tthe shaitans inspire their friends that they should argue with\\n\\t\\t\\tyou, and if you obey them, most surely you will be considered a\\n\\t\\t\\tmushrik."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "122",
    "Text": "Can a person who was dead (ignorant), and whom We raised to life\\n\\t\\t\\tand gave the Light to walk with among people, be like the one who\\n\\t\\t\\tis in the depths of darkness from which he can never come out?\\n\\t\\t\\tSince they treat both of them alike, the actions of the\\n\\t\\t\\tunbelievers are made lucrative to them,"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "123",
    "Text": "and that is why in every town We have placed the criminals as\\n\\t\\t\\ttheir ring leaders to plot therein, they plot against none but\\n\\t\\t\\ttheir own souls, though they do not perceive it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "124",
    "Text": "Whenever there comes to them a sign (verses of The Qur'an) they\\n\\t\\t\\tsay: \"We shall not believe until we are given directly that which\\n\\t\\t\\tis given to the Rasools of Allah.\" Allah knows best to whom He\\n\\t\\t\\tshould give His Message. Soon these criminals will be overtaken\\n\\t\\t\\tby humiliation and by a severe punishment from Allah for their\\n\\t\\t\\tevil plots."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "125",
    "Text": "Whomever Allah wills to guide, He opens his chest to Islam and\\n\\t\\t\\twhomever He intends to confound, He makes his chest narrow and\\n\\t\\t\\tsqueezes so tight that, at the very idea of Islam, he feel as if\\n\\t\\t\\this soul is going to climb up towards the sky. That is how Allah\\n\\t\\t\\tplaces a blight on those who do not believe,"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "126",
    "Text": "whereas in fact this way (Al-Islam) is the Right Way of your Rabb\\n\\t\\t\\tand We have spelled out Our revelations very clearly for the\\n\\t\\t\\tpeople who use their common sense."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "127",
    "Text": "For them there will be a home of peace with their Rabb. He will\\n\\t\\t\\tbe their protector because of their good deeds."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "Text": "On the Day when He will assemble them all together, ( Allah will\\n\\t\\t\\taddress the Jinns): \"O assembly of Jinns! You seduced mankind in\\n\\t\\t\\tgreat number.\" And their votaries from among mankind will say:\\n\\t\\t\\t\"Our Rabb, we have both enjoyed each other's fellowship but alas!\\n\\t\\t\\tNow we have reached the end of our term which You had decreed for\\n\\t\\t\\tus.\" Then Allah will say: \"Now hellfire is your dwelling-place;\\n\\t\\t\\tyou will live therein forever unless Allah ordains otherwise.\"\\n\\t\\t\\tSurely your Rabb is Wise, Knowledgeable."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "129",
    "Text": "That is how, in the hereafter, We will make wrongdoers the\\n\\t\\t\\tcomrades of one another on account of what they earned during\\n\\t\\t\\ttheir life on Earth with evil friendship."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "130",
    "Text": "At that time Allah will also ask: \"O Assembly of Jinns and\\n\\t\\t\\tmankind! Did not there come to you the Rasools from amongst you\\n\\t\\t\\twho proclaimed to you My revelations and warned you about the\\n\\t\\t\\tmeeting of this Day?\" They will reply: \"Yes they did, We bear\\n\\t\\t\\twitness against our own souls.\" Today this worldly life has\\n\\t\\t\\tdeceived them but on that Day they will testify against\\n\\t\\t\\tthemselves that they were indeed kuffar (unbelievers)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "131",
    "Text": "This testimony will be taken in order to prove, that your Rabb\\n\\t\\t\\twould not destroy towns without just cause while their residents\\n\\t\\t\\twere ignorant of the Reality."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "132",
    "Text": "All will be awarded ranks according to their deeds, and your Rabb\\n\\t\\t\\tis not unaware of what they do."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "133",
    "Text": "Your Rabb is Self-Sufficient, Lord of Mercy. If He wants, He can\\n\\t\\t\\tdestroy you all and replace you with others as He pleases, just\\n\\t\\t\\tas He raised you from the offspring of other people."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "134",
    "Text": "Surely what you are being threatened with, must come to pass and\\n\\t\\t\\tyou can do nothing about it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "135",
    "Text": "O Muhammad, tell them: \"O my people! If you don't listen to me,\\n\\t\\t\\tdo whatever you want and I'll do whatever I deem right; you will\\n\\t\\t\\tsoon find out who is to gain the reward of the hereafter; rest\\n\\t\\t\\tassured that the wrongdoers will not get salvation.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "136",
    "Text": "They set aside a share of their produce and of their cattle for\\n\\t\\t\\tAllah, saying: \"This is for Allah\" - so they pretend - \"and this\\n\\t\\t\\tfor our shoraka' (their assigned partners of Allah).\" Their\\n\\t\\t\\tshoraka's share does not reach Allah, but the share of Allah is\\n\\t\\t\\twholly given to shoraka'. What an evil decision they make!"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "137",
    "Text": "Their shoraka' have induced many mushrikin to kill their own\\n\\t\\t\\tchildren in order to ruin them and confuse them in their\\n\\t\\t\\treligion. If Allah wanted, they would not have done so.\\n\\t\\t\\tTherefore, leave them alone with their false inventions."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "138",
    "Text": "These mushrikin say that such and such cattle and crops are\\n\\t\\t\\treserved, in the name of such and such temple, and no one should\\n\\t\\t\\teat except those whom we permit - in fact these restrictions they\\n\\t\\t\\tthemselves have imposed. Then there are some animals which they\\n\\t\\t\\thave prohibited from riding or carrying loads, and there are\\n\\t\\t\\tstill other animals over which they do not pronounce the name of\\n\\t\\t\\tAllah. They have falsely attributed all these things to Him. Soon\\n\\t\\t\\tHe will requite them for their invented lies."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "139",
    "Text": "They also say: \"The offspring of these cattle is specially\\n\\t\\t\\treserved for our males and forbidden to our females but if it is\\n\\t\\t\\tstillborn then all can share together.\" Soon He will punish them\\n\\t\\t\\tfor their attribution of such superstitions to Allah. Surely He\\n\\t\\t\\tis Wise, Knowledgeable."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "140",
    "Text": "Actual losers are those who kill their own children foolishly\\n\\t\\t\\twithout knowledge and forbid food which Allah has provided them,\\n\\t\\t\\tfalsely ascribing prohibitions to Allah. Certainly they have gone\\n\\t\\t\\tastray and are not at all rightly guided."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "141",
    "Text": "It is He who has created all kinds of plants, trellised and\\n\\t\\t\\tuntrellised, the palm trees, the field crops with produce of\\n\\t\\t\\tdifferent kinds, the olives and pomegranates, similar in kind yet\\n\\t\\t\\tdifferent in taste. Eat of their fruit in their season and give\\n\\t\\t\\taway their Zakah on the harvest day. Do not be spendthrift,\\n\\t\\t\\tsurely He does not love the spendthrifts."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "142",
    "Text": "Of the animals you have, some are for transportation and some for\\n\\t\\t\\tslaughter. Eat of that which Allah has provided for you and do\\n\\t\\t\\tnot follow the footsteps of Shaitan; surely he is your open\\n\\t\\t\\tenemy."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "143",
    "Text": "For eight heads of cattle, male and female, there are\\n\\t\\t\\tsuperstitions. Take a pair of sheep and a pair of goats, for\\n\\t\\t\\texample, and ask them, \"Of these, has He forbidden you the males,\\n\\t\\t\\tfemales or their fetuses? Answer me based on knowledge, not\\n\\t\\t\\tsuperstition, if what you say is true.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "144",
    "Text": "Likewise ask them about a pair of camels and a pair of cows, \"Of\\n\\t\\t\\tthese, has He forbidden you the males, females or their fetuses?\"\\n\\t\\t\\tIf they answer, then ask them: \"Were you present when Allah gave\\n\\t\\t\\tyou these commandments?\" If not then Who can be more unjust than\\n\\t\\t\\tthe one who forges a lie against Allah, so that he may mislead\\n\\t\\t\\tmankind without having any knowledge? Surely Allah does not guide\\n\\t\\t\\tthe unjust people."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "145",
    "Text": "O Muhammad tell them: I did not find in what has been revealed to\\n\\t\\t\\tme anything forbidden to be eaten by one who wishes to eat it,\\n\\t\\t\\texcept the meat of an already dead animal, or running blood or\\n\\t\\t\\tthe flesh of swine (pork) - for these are unclean - or flesh of\\n\\t\\t\\tan animal which has become profane because of slaughtering in the\\n\\t\\t\\tnames other than Allah. Even so, if anyone is forced in a\\n\\t\\t\\thelpless situation, intending neither disobedience nor\\n\\t\\t\\ttransgression, you will find your Rabb Forgiving, Merciful."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "146",
    "Text": "For those who are Jews, We forbade every animal with undivided\\n\\t\\t\\thoofs and the fat of oxen and sheep except what is attached to\\n\\t\\t\\ttheir backs or their intestines or is mixed with their bones.\\n\\t\\t\\tThis was the punishment We had inflicted for their wilful\\n\\t\\t\\tdisobedience. What We said is true."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "147",
    "Text": "Now if they disbelieve you, say: \"Your Rabb is the owner of\\n\\t\\t\\tboundless Mercy; but His scourge cannot be averted from criminal\\n\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "148",
    "Text": "In response to this the mushrikin will promptly say: \"If Allah\\n\\t\\t\\twanted, neither we nor our forefathers would have been mushrikin,\\n\\t\\t\\tor we could have made anything unlawful.\" That is how their\\n\\t\\t\\tancestors rejected the truth in the past until they tasted of Our\\n\\t\\t\\tpunishment. If they say so, then ask them: \"Do you have any\\n\\t\\t\\tevidence that you can put before us? The fact of the matter is,\\n\\t\\t\\tyou believe in nothing but conjecture and follow nothing but\\n\\t\\t\\tfalsehood.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "149",
    "Text": "Say: \"In contrast to your position, Allah's argument is\\n\\t\\t\\tconclusive; if it had been His will He could indeed have guided\\n\\t\\t\\tyou all.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "150",
    "Text": "Say: \"Bring your witnesses to prove that Allah did forbid so and\\n\\t\\t\\tso.\" Even if they so testify, do not testify with them, nor yield\\n\\t\\t\\tto the wishes of those who deny Our revelations, disbelieve in\\n\\t\\t\\tthe hereafter, and set up others as equals with their Rabb."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "151",
    "Text": "O Muhammad, say: \"Come, I will recite what your Rabb has\\n\\t\\t\\tforbidden to you: not to commit shirk with Him, to be kind to\\n\\t\\t\\tyour parents, not to kill your children making the excuse of\\n\\t\\t\\tinability to support them - We provide sustenance for you and for\\n\\t\\t\\tthem - not to commit shameful deeds whether open or secret, not\\n\\t\\t\\tto kill any soul forbidden by Allah except for the requirements\\n\\t\\t\\tof justice. These are the things which He enjoined you so that\\n\\t\\t\\tyou may learn wisdom."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "152",
    "Text": "Furthermore, not to go near the property of an orphan except in\\n\\t\\t\\tthe best way (to improve it). Until he attains maturity, give\\n\\t\\t\\tfull measure and just weight - We never charge a soul with more\\n\\t\\t\\tthan it can bear. Whenever you speak, be just, even if it affects\\n\\t\\t\\tyour own relatives, and fulfill your covenant with Allah. These\\n\\t\\t\\tare the things which He has enjoined on you so that you may be\\n\\t\\t\\tmindful."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "153",
    "Text": "He has also said: Verily this is My way, the Right Way; therefore\\n\\t\\t\\tfollow it and do not follow other ways, for they will lead you\\n\\t\\t\\taway from Him. This is what He enjoined on you so that you may\\n\\t\\t\\tguard yourselves against evil."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "154",
    "Text": "Moreover, He said, We gave Musa (Moses) the Book to complete Our\\n\\t\\t\\tfavor on those who would do good to others; it contained details\\n\\t\\t\\tof all things, and was a guide and a mercy, so that they should\\n\\t\\t\\tbelieve in the ultimate meeting with their Rabb.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "155",
    "Text": "We have revealed this Book, similar to the Book given to Musa, as\\n\\t\\t\\ta blessing; therefore, follow it and adopt a Godfearing attitude\\n\\t\\t\\tso that you may receive mercy."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "156",
    "Text": "Lest you say: \"The Book was revealed only to two parties before\\n\\t\\t\\tus and we were unaware of what they read,\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "157",
    "Text": "or lest you say: \"If the Book had been revealed to us, we could\\n\\t\\t\\thave followed its guidance better than them,\" a veritable sign\\n\\t\\t\\thas now come to you from your Rabb as a guidance and mercy. Who\\n\\t\\t\\tthen is more unjust than the one who denies the revelations of\\n\\t\\t\\tAllah and turns away from them? Very soon those who turn away\\n\\t\\t\\tfrom Our revelations will face dreadful punishment for their\\n\\t\\t\\taversion."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "158",
    "Text": "Are they waiting for the angels or your Rabb to come down to them\\n\\t\\t\\tor are they waiting to be given a certain sign of your Rabb! On\\n\\t\\t\\tthe Day when that certain sign of your Rabb appears, the belief\\n\\t\\t\\twill not profit that soul which did not believe before, or who,\\n\\t\\t\\twhile professing to believe did not do good deeds. Say to them:\\n\\t\\t\\t\"Wait if you will; we too are waiting.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "159",
    "Text": "Surely those who divide the religion into sects and identify\\n\\t\\t\\tthemselves as a sect, O Muhammad, you have nothing to do with\\n\\t\\t\\tthem. Their case will be called to account by Allah Himself, He\\n\\t\\t\\twill inform them as to what they did."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "160",
    "Text": "Whoever does one good deed, he will be given credit for ten\\n\\t\\t\\tsimilar good deeds, and whoever does one bad deed will be\\n\\t\\t\\tpunished for only one, and no one will be treated unjustly."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "161",
    "Text": "O Muhammad, tell them: \"As for me, surely my Rabb has guided me\\n\\t\\t\\tto the Right Way, the ever true Deen, the faith of Ibrahim\\n\\t\\t\\t(Abraham) the upright and he was not of the mushrikin.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "162",
    "Text": "Also declare: \"Surely my Salah, my devotion, my life, and my\\n\\t\\t\\tdeath are all for Allah the Rabb of the Worlds."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "163",
    "Text": "He has no peer; thus am I commanded and I am the first of the\\n\\t\\t\\tMuslims.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "164",
    "Text": "Say: \"Should I seek another Rabb besides Allah when He is the\\n\\t\\t\\tRabb of everything?\" Every soul will reap the fruits of its own\\n\\t\\t\\tdeeds; no bearer of burdens shall bear the burden of another.\\n\\t\\t\\tUltimately you will return to your Rabb, and He will resolve for\\n\\t\\t\\tyou your disputes."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "165",
    "Text": "He is the One Who has made you the inheritors of the earth and\\n\\t\\t\\traised some of you in ranks over others so that He may test you\\n\\t\\t\\tin what He has given you. Surely your Rabb is swift in\\n\\t\\t\\tretribution; yet He is also very Forgiving, Merciful.\""
  }
]
