[
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "1",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom Amra bint Abd ar-Rahman that A'isha, umm al-muminin\\n\\t\\t\\t\\tinformed her that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was with her and she heard the\\n\\t\\t\\t\\tvoice of a man asking permission to enter the room of\\n\\t\\t\\t\\tHafsa. A'isha said that she had said, \"Messenger of\\n\\t\\t\\t\\tAllah! There is a man asking permission to enter your\\n\\t\\t\\t\\thouse!\" The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"I think it is so-and-so\"\\n\\t\\t\\t\\t(referring to a paternal uncle of Hafsa by suckling).\\n\\t\\t\\t\\tA'isha said, \"Messenger of Allah! If so-and-so were alive\\n\\t\\t\\t\\t(referring to her paternal uncle by suckling) could he\\n\\t\\t\\t\\tenter where I am?\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Yes. Suckling makes\\n\\t\\t\\t\\tharam as birth makes haram.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "2",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, umm al-muminin said, \"My paternal\\n\\t\\t\\t\\tuncle by suckling came to me and I refused to give him\\n\\t\\t\\t\\tpermission to enter until I had asked the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, about it.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came and I asked him about it. He said, 'He is\\n\\t\\t\\t\\tyour paternal uncle, so give him permission.' So I said,\\n\\t\\t\\t\\t'Messenger of Allah! The woman nursed me not the man.' He\\n\\t\\t\\t\\tsaid, 'He is your paternal uncle, so let him enter.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha said, \"That was after the veil had been imposed on\\n\\t\\t\\t\\tus.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha added, \"What is haram by birth is made haram by\\n\\t\\t\\t\\tsuckling.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "3",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr that A'isha umm al-muminin told him that\\n\\t\\t\\t\\tAflah, the brother of Abu'l-Quays came and asked\\n\\t\\t\\t\\tpermission to visit her after the veil had been lowered,\\n\\t\\t\\t\\tand he was her paternal uncle by suckling. She said, \"I\\n\\t\\t\\t\\trefusedto give him permission to enter. When the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came, I told him about what I had done, and he\\n\\t\\t\\t\\tordered me to give him permission to enter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "4",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili that Abdullah ibn Abbas said, \"The milk which a\\n\\t\\t\\t\\tchild under two years old sucks, even if it is only one\\n\\t\\t\\t\\tsuck, makes the foster relatives haram.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "5",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Amr\\n\\t\\t\\t\\tibn ash-Sharid that Abdullah ibn Abbas was asked whether,\\n\\t\\t\\t\\tif a man had two wives, and one of them nursed a\\n\\t\\t\\t\\tslave-boy, and the other had nursed a slave-girl, could\\n\\t\\t\\t\\tthe slave-boy marry the slave-girl. He said, \"No. The\\n\\t\\t\\t\\thusband is the same.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "6",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"There is no kinship by suckling except\\n\\t\\t\\t\\tfor a person who is nursed when he is small. There is no\\n\\t\\t\\t\\tkinship by suckling over the age of two years.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "7",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Salim ibn\\n\\t\\t\\t\\tAbdullah ibn Umar informed him that A'isha umm al-muminin\\n\\t\\t\\t\\tsent him away while he was being nursed to her sister Umm\\n\\t\\t\\t\\tKulthum bint Abi Bakr as-Siddiq and said, \"Suckle him ten\\n\\t\\t\\t\\ttimes so that he can come in to see me.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSalim said, \"Umm Kulthum nursed me three times and then\\n\\t\\t\\t\\tfell ill, so that she only nursed me three times. I could\\n\\t\\t\\t\\tnot go in to see A'isha because Umm Kulthum did not\\n\\t\\t\\t\\tfinish for me the ten times.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "8",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Safiyya\\n\\t\\t\\t\\tbint Abi Ubayd told him that Hafsa, umm al-muminin, sent\\n\\t\\t\\t\\tAsim ibn Abdullah ibn Sad to her sister Fatima bint Umar\\n\\t\\t\\t\\tibn al-Khattab for her to suckle him ten times so that he\\n\\t\\t\\t\\tcould come in to see her. She did it, so he used to come\\n\\t\\t\\t\\tin to see her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "9",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that his father told him that A'isha, the wife\\n\\t\\t\\t\\tof the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tadmitted those whom her sisters and the daughters of her\\n\\t\\t\\t\\tbrother had nursed, and she did not admit those who were\\n\\t\\t\\t\\tnursed by the wives of her brothers.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "10",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibrahim ibn Uqba\\n\\t\\t\\t\\tasked Said ibn al-Musayyab about suckling. Said said,\\n\\t\\t\\t\\t\"All that occurs in the first two years, even if it is\\n\\t\\t\\t\\tonly a drop, makes haram. Whatever is after two years, is\\n\\t\\t\\t\\tonly food that is eaten.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbrahim ibn Uqba said, ''Then I asked Urwa ibn az-Zubayr\\n\\t\\t\\t\\tand he told me the same as what Said ibn al-Musayyab\\n\\t\\t\\t\\tsaid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "11",
    "sectionHeading": "Suckling of the Young",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat he heard Said ibn al-Musayyab say, \"Suckling is only\\n\\t\\t\\t\\twhile the child is in the cradle. If not, it does not\\n\\t\\t\\t\\tcause flesh and blood relations.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that he\\n\\t\\t\\t\\tsaid, \"Suckling however little or much, makes haram.\\n\\t\\t\\t\\tKinship by suckling makes men mahram.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"Suckling,\\n\\t\\t\\t\\thowever little or much when it is in the first two years,\\n\\t\\t\\t\\tmakes haram. As for what is after the first two years,\\n\\t\\t\\t\\tlittle or much, it does not make anything haram. It is\\n\\t\\t\\t\\tlike food.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "12",
    "sectionHeading": "Suckling of Older People",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that he\\n\\t\\t\\t\\twas asked about the suckling of an older person. He said,\\n\\t\\t\\t\\t''Urwa ibn az-Zubayr informed me that Abu Hudhayfa ibn\\n\\t\\t\\t\\tUtba ibn Rabia, one of the companions of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, who was\\n\\t\\t\\t\\tpresent at Badr, adopted Salim (who is called Salim, the\\n\\t\\t\\t\\tmawla of Abu Hudhayfa) as the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, adopted Zayd ibn\\n\\t\\t\\t\\tHaritha. He thought of him as his son, and Abu Hudhayfa\\n\\t\\t\\t\\tmarried him to his brother's sister, Fatima bint al-Walid\\n\\t\\t\\t\\tibn Utba ibn Rabia, who was at that time among the first\\n\\t\\t\\t\\temigrants. She was one of the best unmarried women of the\\n\\t\\t\\t\\tQuraysh. When Allah the Exalted sent down in His Book\\n\\t\\t\\t\\twhat He sent down about Zayd ibn Haritha, 'Call them\\n\\t\\t\\t\\tafter their true fathers. That is more equitable in the\\n\\t\\t\\t\\tsight of Allah. If you do not know who their fathers were\\n\\t\\t\\t\\tthen they are your brothers in the deen and your mawali,'\\n\\t\\t\\t\\t(Sura 33 ayat 5) people in this position were traced back\\n\\t\\t\\t\\tto their fathers. When the father was not known, they\\n\\t\\t\\t\\twere traced to their mawla.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"Sahla bint Suhayl who was the wife of Abu Hudhayfa, and\\n\\t\\t\\t\\tone of the tribe of Amr ibn Luayy, came to the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, and\\n\\t\\t\\t\\tsaid, 'Messenger of Allah! We think of Salim as a son and\\n\\t\\t\\t\\the comes in to see me while I am uncovered. We only have\\n\\t\\t\\t\\tone room, so what do you think about the situation?' The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'Give him five drinks of your milk and he\\n\\t\\t\\t\\twill be mahram by it.' She then saw him as a foster son.\\n\\t\\t\\t\\tA'isha umm al-muminin took that as a precedent for\\n\\t\\t\\t\\twhatever men she wanted to be able to come to see her.\\n\\t\\t\\t\\tShe ordered her sister, Umm Kulthum bint Abi Bakr\\n\\t\\t\\t\\tas-Siddiq and the daughters of her brother to give milk\\n\\t\\t\\t\\tto whichever men she wanted to be able to come in to see\\n\\t\\t\\t\\ther. The rest of the wives of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, refused to let anyone come\\n\\t\\t\\t\\tin to them by such nursing. They said, 'No! By Allah! We\\n\\t\\t\\t\\tthink that what the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, ordered Sahla bint Suhayl to do\\n\\t\\t\\t\\twas only an indulgence concerning the nursing of Salim\\n\\t\\t\\t\\talone. No! By Allah! No one will come in upon us by such\\n\\t\\t\\t\\tnursing!'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"This is what the wives of the Prophet, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, thought about the suckling of an\\n\\t\\t\\t\\tolder person.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "13",
    "sectionHeading": "Suckling of Older People",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"A man came to Abdullah ibn Umar when I waswith him\\n\\t\\t\\t\\tat the place where judgments were given and asked him\\n\\t\\t\\t\\tabout the suckling of an older person. Abdullah ibn Umar\\n\\t\\t\\t\\treplied, 'A man came to Umar ibn al-Khattab and said, 'I\\n\\t\\t\\t\\thave a slave-girl and I used to have intercourse with\\n\\t\\t\\t\\ther. My wife went to her and suckled her. When I went to\\n\\t\\t\\t\\tthe girl, my wife told me to watch out, because she had\\n\\t\\t\\t\\tsuckled her!' Umar told him to beat his wife and to go to\\n\\t\\t\\t\\this slave-girl because kinship by suckling was only by\\n\\t\\t\\t\\tthe suckling of the young.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "14",
    "sectionHeading": "Suckling of Older People",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that a\\n\\t\\t\\t\\tman said to Abu Musa al-Ashari, \"I drank some milk from\\n\\t\\t\\t\\tmy wife's breasts and it went into my stomach.\" Abu Musa\\n\\t\\t\\t\\tsaid, \"I can only but think that she is haram for you.\"\\n\\t\\t\\t\\tAbdullah ibn Masud said, \"Look at what opinion you are\\n\\t\\t\\t\\tgiving the man.\" Abu Musa said, \"Then what do you say?\"\\n\\t\\t\\t\\tAbdullah ibn Masud said, \"There is only kinship by\\n\\t\\t\\t\\tsuckling in the first two years.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Musa said, \"Do not ask me about anything while this\\n\\t\\t\\t\\tlearned man is among you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "15",
    "sectionHeading": "Suckling in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Sulayman ibn Yasar and from Urwa ibn az-Zubayr from\\n\\t\\t\\t\\tA'isha umm al-muminin, that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \" What is\\n\\t\\t\\t\\tharam by birth is haram by suckling.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "16",
    "sectionHeading": "Suckling in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Nawfal said, ''Urwa ibn az-Zubayr informed\\n\\t\\t\\t\\tme from A'isha umm al-muminin that Judama bint Wahb\\n\\t\\t\\t\\tal-Asadiyya informed her that she heard the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, say, 'I\\n\\t\\t\\t\\tintended to prohibit ghila but I remembered that the\\n\\t\\t\\t\\tGreeks and Persians do that without it causing any injury\\n\\t\\t\\t\\tto their children.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik explained, \"Ghila is that a man has intercourse\\n\\t\\t\\t\\twith his wife while she is suckling.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "30",
    "hadithNumber": "17",
    "sectionHeading": "Suckling in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazm from Amra bint Abd ar-Rahman that A'isha, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Amongst what was sent down of the Qur'an\\n\\t\\t\\t\\twas 'ten known sucklings make haram' - then it was\\n\\t\\t\\t\\tabrogated by 'five known sucklings'. When the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, died,\\n\\t\\t\\t\\tit was what is now recited of the Qur'an.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"One does not act on this.\"\\n\\t\\t\\t</p>"
  }
]
