[
  {
    "SurahNumber": "46",
    "AyahNumber": "1",
    "NoteID": "4774",
    "Body": "See Introduction to S. xi."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "2",
    "NoteID": "4775",
    "Body": "This verse is the same as the second verse of the last\\n\\t\\t\\t\\tSura, but the theme is worked out differently in the two\\n\\t\\t\\t\\tSura. In S. xlv. was shown how deniers of Revelation will\\n\\t\\t\\t\\tat last be humbled until they can no longer deny its\\n\\t\\t\\t\\ttruth and power. In this Sura is shown how Truth and\\n\\t\\t\\t\\tRevelation will be vindicated by patience and constancy\\n\\t\\t\\t\\t(xlvi. 35)."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "3",
    "NoteID": "4776",
    "Body": "Cf. xlv. 22. Many things may appear to us in the present\\n\\t\\t\\t\\tworld as strange and inexplicable. But everything made by\\n\\t\\t\\t\\tAllah has a just purpose which must be fulfilled. Nothing\\n\\t\\t\\t\\tin this world is permanent: everything is for an\\n\\t\\t\\t\\tappointed term. The Word of Allah alone abides. All else\\n\\t\\t\\t\\twill pass away after it has fulfilled its purpose. But\\n\\t\\t\\t\\tUnbelievers refuse to face the danger of which they are\\n\\t\\t\\t\\twarned."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "4",
    "NoteID": "4777",
    "Body": "Some people may rush thoughtlessly into false worship,\\n\\t\\t\\t\\tbecause it is the fashion or an ancestral custom, etc.\\n\\t\\t\\t\\tThey are asked to pause and see for themselves. Have the\\n\\t\\t\\t\\tfalse gods or falsehood created anything? (They destroy\\n\\t\\t\\t\\tmuch). Or have they any share or lot in the things we\\n\\t\\t\\t\\tassociate with the heavens,-spiritual well-being, etc.?"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "4",
    "NoteID": "4778",
    "Body": "'Or is there any warrant for you from any earlier\\n\\t\\t\\t\\trevelation, assuming that you do not believe in this\\n\\t\\t\\t\\tRevelation? Or can you point to the least scrap or\\n\\t\\t\\t\\tremnant of real knowledge on which you can base what We\\n\\t\\t\\t\\tcondemn as your false life?' No, you cannot."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "5",
    "NoteID": "4779",
    "Body": "As there is no argument at all in favour of your sham\\n\\t\\t\\t\\tworship, what sense is there in it? Either your false\\n\\t\\t\\t\\tgods are senseless stocks and stones which will never\\n\\t\\t\\t\\tanswer you to the end of Time, being themselves devoid of\\n\\t\\t\\t\\tunderstanding, or they are real objects which will disown\\n\\t\\t\\t\\tyou at the last. If you worshipped Self, your own misused\\n\\t\\t\\t\\tfaculties will witness against you at the last (xli.\\n\\t\\t\\t\\t20-23). If you worshipped good men or prophets, like\\n\\t\\t\\t\\tJesus, they will disown you (v. 119). Similarly, if you\\n\\t\\t\\t\\tworshipped angels, they will disown you (xxxiv. 40-41)."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "7",
    "NoteID": "4780",
    "Body": "When the truth is actually brought to their doors, they\\n\\t\\t\\t\\tcall it sorcery! Cf. xxxvii. 12-15, and n. 4042."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "8",
    "NoteID": "4781",
    "Body": "'If I forged a message from myself as one purporting to\\n\\t\\t\\t\\tcome from Allah, you would not be able to see me enjoy\\n\\t\\t\\t\\tany of the blessings from Allah which I enjoy: you would\\n\\t\\t\\t\\tnot see me calm and relying on Allah, nor would you see\\n\\t\\t\\t\\tme bear the reputation of being a trustworthy man. A liar\\n\\t\\t\\t\\tcomes to an evil end. But what about those who talk so\\n\\t\\t\\t\\tglibly and freely about things which they know not? Allah\\n\\t\\t\\t\\tknows all and He is my witness! According to Ibn Kathir,\\n\\t\\t\\t\\tthe verse means that if the Prophet's claim to be Allah's\\n\\t\\t\\t\\tmessenger would have been a false one, he would have been\\n\\t\\t\\t\\tstricken by a severe punishment from Allah and none had\\n\\t\\t\\t\\tthe power to avert that punishment."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "9",
    "NoteID": "4782",
    "Body": "'What is there to forge? All prophets have taught the\\n\\t\\t\\t\\tUnity of Allah and our duty to mankind. I bring no new\\n\\t\\t\\t\\tfangled doctrine, but etemal truths that have been known\\n\\t\\t\\t\\tto good men through the ages. It is to reclaim you that I\\n\\t\\t\\t\\thave come. I do not know what will be your fate for all\\n\\t\\t\\t\\tthis callousness, nor what you will do to me. But this I\\n\\t\\t\\t\\tknow, that I am preaching truth and righteousness as\\n\\t\\t\\t\\tinspired by Allah. My duty is only to proclaim aloud and\\n\\t\\t\\t\\tclearly the Message entrusted to me by Allah. The rest I\\n\\t\\t\\t\\tleave to Allah.'"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "10",
    "NoteID": "4783",
    "Body": "Another side of the argument is now presented. 'You pagan\\n\\t\\t\\t\\tArabs! You are puffed up with pride, though you are an\\n\\t\\t\\t\\tignorant nation. Among Israel there are men who\\n\\t\\t\\t\\tunderstand the previous scriptures, and who find in the\\n\\t\\t\\t\\tQur-an and its Preacher a true confirmation of the\\n\\t\\t\\t\\tprevious scriptures. They accept Islam as a fulfilment of\\n\\t\\t\\t\\tthe revelation of Moses himself! (See Deut. xviii.\\n\\t\\t\\t\\t18-19). And yet you hold back, though the Qur-an has come\\n\\t\\t\\t\\tin your own language, in order to help you to understand.\\n\\t\\t\\t\\tHow unjust and how shameful! In that case, with what face\\n\\t\\t\\t\\tcan you seek guidance from Allah?'"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "10",
    "NoteID": "4784",
    "Body": "There were learned Jews (and Christians) who saw in the\\n\\t\\t\\t\\tholy Prophet the Messenger of Allah foreshadowed in\\n\\t\\t\\t\\tprevious Revelations, and accepted Islam. As this is a\\n\\t\\t\\t\\tMakkan Sura we need not construe this as a reference to\\n\\t\\t\\t\\tAbdullah ibn Salam, whose conversion was in Madinah only\\n\\t\\t\\t\\ttwo years before the Prophet's death, unless we accept\\n\\t\\t\\t\\tthis particular verse to be so late in date. The sincere\\n\\t\\t\\t\\tJews were in a position to understand how this Revelation\\n\\t\\t\\t\\tfitted in with all they had learnt about Revelation."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "11",
    "NoteID": "4785",
    "Body": "A great many of the early Muslims were in humble\\n\\t\\t\\t\\tpositions, and were despised by the Quraish leaders. 'If\\n\\t\\t\\t\\tsuch men could see any good in Islam,' they said, 'there\\n\\t\\t\\t\\tcould be no good in it: if there had been any good in it,\\n\\t\\t\\t\\twe should have been the first to see it!' The spiritually\\n\\t\\t\\t\\tblind have such a good conceit of themselves! As they\\n\\t\\t\\t\\treject it, and as the Revelation is proved to have\\n\\t\\t\\t\\thistoric foundations, they can only call it \"an old, old\\n\\t\\t\\t\\tfalsehood\"!"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "12",
    "NoteID": "4786",
    "Body": "The last revealed Book which was a Code of Life\\n\\t\\t\\t\\t(Shari'at) was the Book of Moses; for that of Jesus was\\n\\t\\t\\t\\tnot such a Code, but merely moral precepts to sweep away\\n\\t\\t\\t\\tthe corruptions that had crept in. The Qur-an has the\\n\\t\\t\\t\\tsame attitude to it as the teaching of Jesus had to the\\n\\t\\t\\t\\tLaw. Jesus said (Matt. v. 17): \"Think not that I am come\\n\\t\\t\\t\\tto destroy the Law or the prophets: I am not come to\\n\\t\\t\\t\\tdestroy, but to fulfil.\" But the corruptions took new\\n\\t\\t\\t\\tforms in Christian Churches: an entirely new Shari'at\\n\\t\\t\\t\\tbecame necessary, and this was provided in Islam."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "13",
    "NoteID": "4787",
    "Body": "To say, \"Our Lord is Allah\" is to acknowledge that we owe\\n\\t\\t\\t\\tno service to any creature, and shall render none: Allah\\n\\t\\t\\t\\tshall have our exclusive devotion. \"To remain firm on\\n\\t\\t\\t\\tthat Path\" is shown by our conduct: we prove that we love\\n\\t\\t\\t\\tAllah and all His creatures, and will unflinchingly do\\n\\t\\t\\t\\tour duty in all circumstances."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "13",
    "NoteID": "4788",
    "Body": "Cf. ii. 38. The phrase occurs in numerous other places,\\n\\t\\t\\t\\twith a new application on each occasion. Here, if our\\n\\t\\t\\t\\tclaim is true that 'our Lord is Allah', what fear can\\n\\t\\t\\t\\tpossibly come on us, or what calamity can there be to\\n\\t\\t\\t\\tcause us grief? For our Lord is our Cherisher, Defender,\\n\\t\\t\\t\\tand Helper, our Hope and our Comfort, which can never\\n\\t\\t\\t\\tfail."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "15",
    "NoteID": "4789",
    "Body": "Cf. xxix. 8 and xxxi. 14."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "15",
    "NoteID": "4790",
    "Body": "In xxxi. 14 the time of weaning was stated to be at the\\n\\t\\t\\t\\tage of two years, i.e., 24 months. See also ii. 233. That\\n\\t\\t\\t\\tleaves six months as the minimum period of human\\n\\t\\t\\t\\tgestation after which the child is known to be viable.\\n\\t\\t\\t\\tThis is in accordance with the latest ascertained\\n\\t\\t\\t\\tscientific facts. The average period is 280 days, or ten\\n\\t\\t\\t\\ttimes the inter-menstrual period, and of course the\\n\\t\\t\\t\\taverage period of weaning is much less than 24 months.\\n\\t\\t\\t\\tThe maximum period of breast-feeding (2 years) is again\\n\\t\\t\\t\\tin accordance with the time that the first dentition is\\n\\t\\t\\t\\tordinarily completed in a human child. The lower milk\\n\\t\\t\\t\\tincisors in the centre come out between the 6th and 9th\\n\\t\\t\\t\\tmonths; then come out the milk teeth at intervals, until\\n\\t\\t\\t\\tthe canines appear. The second molars come out at about\\n\\t\\t\\t\\t24 months, and with them the child has a complete\\n\\t\\t\\t\\tapparatus of milk teeth. Nature now expects him to chew\\n\\t\\t\\t\\tand masticate and be independent of his mother's milk\\n\\t\\t\\t\\tcompletely. On the other hand it hurts the mother to feed\\n\\t\\t\\t\\tfrom the breast after the child has a complete set of\\n\\t\\t\\t\\tmilk teeth. The permanent teeth begin at the sixth year,\\n\\t\\t\\t\\tand the second molars come at 12 years. The third molars\\n\\t\\t\\t\\tare the wisdom teeth, which may appear at 18 to 20 years,\\n\\t\\t\\t\\tor not at all."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "15",
    "NoteID": "4791",
    "Body": "The age of full strength (ashudd) is held to be between\\n\\t\\t\\t\\t18 and 30 or 32. Between 30 and 40 the man is in his best\\n\\t\\t\\t\\tmanhood. After that he begins to look to his growing\\n\\t\\t\\t\\tissue, and rightly commends the new generation to Allah.\\n\\t\\t\\t\\tPerhaps his spiritual faculties also gain the upper hand\\n\\t\\t\\t\\tafter 40."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "16",
    "NoteID": "4792",
    "Body": "Cf. xxix. 7 and n. 3429."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "17",
    "NoteID": "4793",
    "Body": "A godly man often has an ungodly son, who flouts all that\\n\\t\\t\\t\\tthe father held sacred, and looks upon his father himself\\n\\t\\t\\t\\tas old-fashioned and unworthy of respect or regard. The\\n\\t\\t\\t\\tcontrast in an individual family may be matched by the\\n\\t\\t\\t\\tcontrast in the passing and the rising generations of\\n\\t\\t\\t\\tmankind. All this happens as a passing phase in the\\n\\t\\t\\t\\tnominal evolution of mankind, and there is nothing in\\n\\t\\t\\t\\tthis to be despondent about. What we have to do is for\\n\\t\\t\\t\\tthe mature generations to bring up their successors in\\n\\t\\t\\t\\tgodly ways, and for the younger generations to realise\\n\\t\\t\\t\\tthat age and experience count for something, especially\\n\\t\\t\\t\\tin the understanding of spiritual matters and other\\n\\t\\t\\t\\tmatters of the highest moment to man."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "18",
    "NoteID": "4794",
    "Body": "Cf. xli. 25 and n. 4494, Each individual, each\\n\\t\\t\\t\\tgeneration, and each people is responsible for its own\\n\\t\\t\\t\\tgood deeds or misdeeds. The law of actions and their\\n\\t\\t\\t\\tfruits applies: you cannot blame one for another. The\\n\\t\\t\\t\\tonly remedy lies in seeking for Allah's Grace and Mercy,\\n\\t\\t\\t\\tnot only for ourselves but for others in brotherly or\\n\\t\\t\\t\\tfatherly love. This verse is in balanced contrast to\\n\\t\\t\\t\\tverse 16 above."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "19",
    "NoteID": "4795",
    "Body": "There is fine grading in the Hereafter. Every deed, good\\n\\t\\t\\t\\tor bad, is judged and weighed to the minutest degree,\\n\\t\\t\\t\\twith its motives, intentions, results, and relevant\\n\\t\\t\\t\\tcircumstances. It is not a mere rough classification. The\\n\\t\\t\\t\\tfruits of evil will be exactly according to the degree of\\n\\t\\t\\t\\tevil. But, as stated in other passages (e.g., xxviii.\\n\\t\\t\\t\\t84), the reward of good deeds will be far beyond their\\n\\t\\t\\t\\tmerits, on account of the Mercy and unbounded Bounty of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "20",
    "NoteID": "4796",
    "Body": "\"Squandered your good things\" implies (in Arabic)\\n\\t\\t\\t\\tgrabbing at them, being greedy of them, seeking them as\\n\\t\\t\\t\\tfleeting pleasures rather than the more serious things of\\n\\t\\t\\t\\tlife, sacrificing the spiritual for the material."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "20",
    "NoteID": "4797",
    "Body": "They will be told: 'You took your choice, and you must\\n\\t\\t\\t\\tpay the price. You did wrong in a rebellious spirit, and\\n\\t\\t\\t\\tprided yourselves on your wrong-doing, not occasionally,\\n\\t\\t\\t\\tbut of set purpose and constantly. Now you will be\\n\\t\\t\\t\\thumbled in the dust, as a fitting punishment.'"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "21",
    "NoteID": "4798",
    "Body": "Cf. vii. 65. and note 1040. The point is that the Warner\\n\\t\\t\\t\\twho was raised among the 'Ad people-as among other\\n\\t\\t\\t\\tpeoples-was not a stranger, but one of their own\\n\\t\\t\\t\\tbrethren, even as the holy Prophet began his preaching\\n\\t\\t\\t\\twith a call to his own brethren the Quraish."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "21",
    "NoteID": "4799",
    "Body": "Winding Sand-tracts: Ahqaf: see Introduction to this\\n\\t\\t\\t\\tSura. The very things, which, under irrigation and with\\n\\t\\t\\t\\tAllah's Grace, gave them prosperity and power, were to be\\n\\t\\t\\t\\ttheir undoing when they broke Allah's Law and defied His\\n\\t\\t\\t\\tGrace. See verses 24-26 below."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "22",
    "NoteID": "4800",
    "Body": "They were too much wedded to their evil ways-to the false\\n\\t\\t\\t\\tgods that they worshipped-to appreciate the sincere\\n\\t\\t\\t\\tadvice of the prophet of Allah. They defied him and\\n\\t\\t\\t\\tdefied Allah Who had sent him. Mockingly they challenged\\n\\t\\t\\t\\thim to bring on the threatened punishment! For they did\\n\\t\\t\\t\\tnot believe a word of what he said."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "23",
    "NoteID": "4801",
    "Body": "The coming of the Punishment for evil was (and is always)\\n\\t\\t\\t\\tcertain. At what particular time it would come he could\\n\\t\\t\\t\\tnot tell. It is not for the prophet, but for Allah, to\\n\\t\\t\\t\\tbring on the Penalty. But he saw that it was useless to\\n\\t\\t\\t\\tappeal to them on account of the ignorance in which they\\n\\t\\t\\t\\twere content to dwell."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "24",
    "NoteID": "4802",
    "Body": "The Punishment came suddenly, and when they least\\n\\t\\t\\t\\texpected it. They wanted rain, and they saw a cloud and\\n\\t\\t\\t\\trejoiced. Behold, it was coming towards their own tracts,\\n\\t\\t\\t\\twinding through the hills. Their irrigation channels\\n\\t\\t\\t\\twould be full, their fields would be green, and their\\n\\t\\t\\t\\tseason would be fruitful. But no! What is this? It is a\\n\\t\\t\\t\\ttremendous hurricane, carrying destruction on its wings!\\n\\t\\t\\t\\tA violent blast, with dust and sand! Its fury destroys\\n\\t\\t\\t\\teverything in its wake! Lives lost! Fields covered with\\n\\t\\t\\t\\tsand-hills! The morning dawns on a scene of desolation!\\n\\t\\t\\t\\tWhere were the men who boasted and defied their Lord!\\n\\t\\t\\t\\tThere are only the ruins of their houses to witness to\\n\\t\\t\\t\\tthe past!"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "25",
    "NoteID": "4803",
    "Body": "Here is the figure of speech known in rhetoric as\\n\\t\\t\\t\\taposiopesis, to heighten the effect of the suddenness and\\n\\t\\t\\t\\tcompleteness of the calamity. In the Arabic text, the\\n\\t\\t\\t\\tverb asbahu, in the third person plural, leads us to\\n\\t\\t\\t\\texpect that we shall be told what they were doing in the\\n\\t\\t\\t\\tmorning. But no! They had been wiped out, and any small\\n\\t\\t\\t\\tremnant had fled (see n. 1040 to vii. 65). Nothing was to\\n\\t\\t\\t\\tbe seen but the ruins of their houses."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "26",
    "NoteID": "4804",
    "Body": "The 'Ad and their successors the Thamud were more richly\\n\\t\\t\\t\\tendowed with the faculties of the arts, sciences, and\\n\\t\\t\\t\\tculture than ever were the Quraish before Islam. \"Hearing\\n\\t\\t\\t\\tand seeing\" refer to the experimental faculties; the word\\n\\t\\t\\t\\t\"heart\" in Arabic includes intellect, or the rational\\n\\t\\t\\t\\tfaculties, as well as the instruments of feeling and\\n\\t\\t\\t\\temotion, the aesthetic faculties. The Second 'Ad, or\\n\\t\\t\\t\\tThamud, have left interesting traces of their\\n\\t\\t\\t\\tarchitecture in the country round the Hijr: see n. 1043\\n\\t\\t\\t\\tto vii. 73, and notes 2002- 2003 to xv. 80-82."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "26",
    "NoteID": "4805",
    "Body": "The highest talents and faculties of this world are\\n\\t\\t\\t\\tuseless in the next world if we reject the laws of Allah\\n\\t\\t\\t\\tand thus become outlaws in the Hereafter."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "26",
    "NoteID": "4806",
    "Body": "See n. 4770 to xlv. 33. They used to mock at Allah's\\n\\t\\t\\t\\tSigns, but those were the very things which hemmed them\\n\\t\\t\\t\\tin, and showed that they had more power and effectiveness\\n\\t\\t\\t\\tthan anything else."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "27",
    "NoteID": "4807",
    "Body": "In Arabian history and tradition alone, to say nothing of\\n\\t\\t\\t\\tAllah's Signs elsewhere, sin inevitably suffered its\\n\\t\\t\\t\\tPunishment, and in various ways. Would not the later\\n\\t\\t\\t\\tpeople take warning?"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "28",
    "NoteID": "4808",
    "Body": "The false things that they worshipped were figments of\\n\\t\\t\\t\\ttheir imagination. If they had had any existence in fact,\\n\\t\\t\\t\\tit was not of the kind they imagined."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "29",
    "NoteID": "4809",
    "Body": "A company of Jinns. Nafar (company) may mean a group of\\n\\t\\t\\t\\tfrom three to ten persons. For Jinns, see n. 929 to vi.\\n\\t\\t\\t\\t100. They listened to the reading of the Qur-an with\\n\\t\\t\\t\\tgreat respect. The next verse shows that they had heard\\n\\t\\t\\t\\tof the Jewish religion, but they were impressed with the\\n\\t\\t\\t\\tMessage of Islam, and they seem to have gone back to\\n\\t\\t\\t\\ttheir people to share the Good News with them."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "31",
    "NoteID": "4810",
    "Body": "The one who invites all to Allah is the holy Prophet. He\\n\\t\\t\\t\\tinvites us to Allah: if we believe in Allah and His\\n\\t\\t\\t\\tProphet, Allah will forgive us our sins on our repentance\\n\\t\\t\\t\\tand amendment of our lives, and save us the Penalty of\\n\\t\\t\\t\\tthe future life."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "32",
    "NoteID": "4811",
    "Body": "If a person refuses to believe the Truth, or opposes it,\\n\\t\\t\\t\\tit has not the least effect on Allah's holy Plan, which\\n\\t\\t\\t\\twill go on to its completion; but it will deprive him of\\n\\t\\t\\t\\tGrace and of any protection whatever; he will wander\\n\\t\\t\\t\\tabout as an outlaw in manifest helplessness."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "33",
    "NoteID": "4812",
    "Body": "Cf. ii. 255 (Verse of the Throne): \"His Throne doth\\n\\t\\t\\t\\textend over the heavens and the earth, and He feeleth no\\n\\t\\t\\t\\tfatigue in guarding and preserving them.\" He Whose power\\n\\t\\t\\t\\tis constant and unwearied in creating and preserving all\\n\\t\\t\\t\\tthings in heaven and earth can surely give life to the\\n\\t\\t\\t\\tdead at the Resurrection."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "34",
    "NoteID": "4813",
    "Body": "Cf. xlvi. 20, where the argument was closed about the\\n\\t\\t\\t\\tundutiful son of a good father. After that the example of\\n\\t\\t\\t\\tthe 'Ad and of the believing Jinns was cited, and now is\\n\\t\\t\\t\\tclosed that argument in similar terms."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "34",
    "NoteID": "4814",
    "Body": "The Truth which they denied is now all too clear to them.\\n\\t\\t\\t\\tThey are out of the Light of Truth, out of the Light of\\n\\t\\t\\t\\tAllah's Countenance. And that in itself is a terrible\\n\\t\\t\\t\\tPenalty."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "35",
    "NoteID": "4815",
    "Body": "All good work proceeds in its own good time. We should\\n\\t\\t\\t\\tnever be impatient either about its success or about the\\n\\t\\t\\t\\tpunishment which is bound to come for those who oppose it\\n\\t\\t\\t\\tor wish to suppress it. The inevitable punishment is\\n\\t\\t\\t\\tspoken of as the Punishment promised. It will come so\\n\\t\\t\\t\\tsoon and so suddenly that it will appear as if there was\\n\\t\\t\\t\\tnot the delay of a single hour in a single day! Time is a\\n\\t\\t\\t\\tgreat factor in our affairs in this world, but it hardly\\n\\t\\t\\t\\tcounts in the next world."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "35",
    "NoteID": "4816",
    "Body": "The Preacher's duty is to proclaim the Message in\\n\\t\\t\\t\\tunmistakable terms. If any human beings come in the way,\\n\\t\\t\\t\\tit will be to their own destruction; but none but\\n\\t\\t\\t\\trebellious transgressor will be punished. There is always\\n\\t\\t\\t\\thope and forgiveness for repentance and amendment."
  }
]
