[
  {
    "BookCode": "AMH",
    "VolumeNumber": "13",
    "hadithNumber": "1",
    "sectionHeading": "How to Ask for Rain",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Amr ibn Hazm that he had heard Abbad ibn Tamim say\\n\\t\\t\\t\\tthat he had heard Abdullah ibn Zayd al-Mazini say, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came out to the place of prayer and asked for\\n\\t\\t\\t\\train, and when he faced the qibla he turned his cloak\\n\\t\\t\\t\\tinside out.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked how many rakas there were in the prayer\\n\\t\\t\\t\\tof asking for rain and he said, \"Two rakas, and the imam\\n\\t\\t\\t\\tdoes the prayer before he gives the khutba. He prays two\\n\\t\\t\\t\\trakas, and then he gives a khutba and makes dua, facing\\n\\t\\t\\t\\tthe qibla and turning his cloak inside out. He recites\\n\\t\\t\\t\\tout loud in both rakas, and when he turns his cloak\\n\\t\\t\\t\\tinside out he puts what is on his right on his left, and\\n\\t\\t\\t\\twhat is on his left on his right, and all the people turn\\n\\t\\t\\t\\ttheir cloaks inside out when the imam does so, and face\\n\\t\\t\\t\\tthe qibla, sitting.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "13",
    "hadithNumber": "2",
    "sectionHeading": "About Asking for Rain",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAmr ibn Shuayb that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, when he asked for\\n\\t\\t\\t\\train, \"O Allah, give water to Your slaves and Your\\n\\t\\t\\t\\tanimals, and spread Your mercy, and give life to Your\\n\\t\\t\\t\\tdead land.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "13",
    "hadithNumber": "3",
    "sectionHeading": "About Asking for Rain",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sharik ibn Abdullah\\n\\t\\t\\t\\tibn Abi Namir that Anas ibn Malik said, \"A man came to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and said, 'Messenger of Allah, our animals are\\n\\t\\t\\t\\tdying and our camels are too weak to travel, so make dua\\n\\t\\t\\t\\tto Allah.' The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, made dua, and it rained on us from\\n\\t\\t\\t\\tone jumua to the next.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnas continued, \"Then a man came to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, and said,\\n\\t\\t\\t\\t'Messenger of Allah, our houses have fallen down, the\\n\\t\\t\\t\\tpaths are blocked, and our flocks are dying.' The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'O Allah, (only) the mountain and hill-tops,\\n\\t\\t\\t\\tthe valley bottoms, and the places where trees grow.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnas added, \"It cleared away from Madina like a garment\\n\\t\\t\\t\\tbeing removed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about a man who missed the prayer of asking\\n\\t\\t\\t\\tfor rain but caught the khutba, and wished to pray in the\\n\\t\\t\\t\\tmosque, or in his house when he returned, \"He is free to\\n\\t\\t\\t\\tdo so, or not, as he wishes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "13",
    "hadithNumber": "4",
    "sectionHeading": "About Asking the Stars for Rain",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Salih ibn Kaysan from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud that Zayd ibn\\n\\t\\t\\t\\tKhalid al-Juhani said, \"The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, took the subh prayer with\\n\\t\\t\\t\\tus at Hudaybiyya after it had rained in the night. When\\n\\t\\t\\t\\the had finished he went up to the people and said, 'Do\\n\\t\\t\\t\\tyou know what your Lord has said?' They said, 'Allah and\\n\\t\\t\\t\\tHis Messenger know best.' He said, 'Some of my slaves\\n\\t\\t\\t\\thave begun the morning believing in Me, and others have\\n\\t\\t\\t\\tbegun it rejecting Me. As for those who say, 'We were\\n\\t\\t\\t\\trained on by the overflowing favour of Allah and His\\n\\t\\t\\t\\tmercy,' they believe in Me and reject the stars. But as\\n\\t\\t\\t\\tfor those who say, 'We were rained on by such and such a\\n\\t\\t\\t\\tstar, they reject Me and believe in the stars.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "13",
    "hadithNumber": "5",
    "sectionHeading": "About Asking the Stars for Rain",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to say, \"When a cloud appears from the\\n\\t\\t\\t\\tdirection of the sea and then goes towards ash-Sham, it\\n\\t\\t\\t\\twill be an abundant source of rain.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "13",
    "hadithNumber": "6",
    "sectionHeading": "About Asking the Stars for Rain",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abu\\n\\t\\t\\t\\tHurayra used to say, when morning came after it had\\n\\t\\t\\t\\trained on the people, \"We have been rained upon by the\\n\\t\\t\\t\\train of Allah's opening,\" and would then recite the ayat,\\n\\t\\t\\t\\t\"Whatever Allah opens to man of His mercy no-one can\\n\\t\\t\\t\\twithhold, and whatever He withholds no-one can send\\n\\t\\t\\t\\tforward after Him. \" (Sura 35 ayat 2).\\n\\t\\t\\t</p>"
  }
]
