[
  {
    "SurahNumber": "14",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II; also surah {11}, note [1]."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "According to Zamakhshari and Razi, this is the real\\n\\t\\t\\t\\tmeaning of the verbal form yastahibbun in the above\\n\\t\\t\\t\\tcontext - implying that such an all-absorbing, exclusive\\n\\t\\t\\t\\tlove of the life of this world leads inevitably to a\\n\\t\\t\\t\\tdenial of moral truths."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Since every divine writ was meant to be understood by\\n\\t\\t\\t\\tman, it is obvious that each had to be formulated in the\\n\\t\\t\\t\\tlanguage of the people whom the particular prophet was\\n\\t\\t\\t\\taddressing in the first instance; and the\\n\\t\\t\\t\\tQur'an-notwithstanding its universal import (cf. note\\n\\t\\t\\t\\t[126] on  7:158 )-is no exception in this respect."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Or: \"God lets go astray whomever He wills, and guides\\n\\t\\t\\t\\twhomever He wills\". All Qur'anic references to God's\\n\\t\\t\\t\\t\"letting man go astray\" must be understood against the\\n\\t\\t\\t\\tbackground of {2:26-27} - \"none does He cause to go\\n\\t\\t\\t\\tastray save the iniquitous, who break their bond with\\n\\t\\t\\t\\tGod\" (regarding which latter expression, see surah {2},\\n\\t\\t\\t\\tnote [19]): that is to say, man's \"going astray\" is a\\n\\t\\t\\t\\tconsequence of his own attitudes and inclinations and not\\n\\t\\t\\t\\ta result of an arbitrary \"predestination\" in the popular\\n\\t\\t\\t\\tsense of this word (cf. surah {2}, note [7]). In his\\n\\t\\t\\t\\tcommentary on the above verse, Zamakhshari stresses this\\n\\t\\t\\t\\taspect of free choice on the part of man and points out\\n\\t\\t\\t\\tthat \"God does not cause anyone to go astray except one\\n\\t\\t\\t\\twho, as He knows, will never attain to faith; and He does\\n\\t\\t\\t\\tnot guide anyone aright except one who, as He knows, will\\n\\t\\t\\t\\tattain to faith. Hence, the [expression] 'causing to go\\n\\t\\t\\t\\tastray' denotes [God's] leaving [one] alone (takhliyah)\\n\\t\\t\\t\\tand depriving [him] of all favour, whereas [the\\n\\t\\t\\t\\texpression] 'guidance' denotes [His] grant of fulfilment\\n\\t\\t\\t\\t(tawfiq) and favour.... Thus, He does not forsake anyone\\n\\t\\t\\t\\texcept those who deserve to be forsaken, and does not\\n\\t\\t\\t\\tbestow His favour upon anyone except those who deserve to\\n\\t\\t\\t\\tbe favoured.\" Commenting on the identical phrase\\n\\t\\t\\t\\toccurring in  16:93 , Zamakhshari states: \"[God] forsakes\\n\\t\\t\\t\\thim who, as He knows, will [consciously] choose to deny\\n\\t\\t\\t\\tthe truth and will persevere in this [denial]; and...He\\n\\t\\t\\t\\tbestows His favour upon him who, as He knows, will choose\\n\\t\\t\\t\\tfaith: which means that He makes the issue dependent on\\n\\t\\t\\t\\t[man's] free choice (al-ikhtiyar), and thus on his\\n\\t\\t\\t\\tdeserving either [God's] favour or the withdrawal of\\n\\t\\t\\t\\t[His] aid...and does not make it dependent on compulsion\\n\\t\\t\\t\\t[i.e., predestination], which would rule out [man's]\\n\\t\\t\\t\\tdeserving anything of the above.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "In ancient Arabian tradition, the terms \"day\" or \"days\"\\n\\t\\t\\t\\twere often used to describe momentous historical events\\n\\t\\t\\t\\t(e.g., ayyam al-'arab as a metonym for the inter-tribal\\n\\t\\t\\t\\twars of pre-Islamic Arabia). However, in view of the\\n\\t\\t\\t\\tfrequent Qur'anic application of the word \"day\" to\\n\\t\\t\\t\\teschatological concepts - e.g., the \"Last Day\", the \"Day\\n\\t\\t\\t\\tof Resurrection\", the \"Day of Reckoning\", and so forth -\\n\\t\\t\\t\\tand, particularly, in view of  45:14 , where the\\n\\t\\t\\t\\texpression \"the Days of God\" unmistakably points to His\\n\\t\\t\\t\\tjudgment at the end of time - it is only logical to\\n\\t\\t\\t\\tassume that in the present context this expression bears\\n\\t\\t\\t\\tthe same significance: namely, God's final judgment of\\n\\t\\t\\t\\tman on the Day of Resurrection. The use of the plural\\n\\t\\t\\t\\tform (\"the Days of God\") is perhaps meant to bring out\\n\\t\\t\\t\\tthe idea that the \"Day\" of which the Qur'an so often\\n\\t\\t\\t\\tspeaks has nothing to do with human time-definitions but,\\n\\t\\t\\t\\trather, alludes to an ultimate reality in which the\\n\\t\\t\\t\\tconcept of \"time\" has neither place nor meaning."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "For this rendering of the particle idh, see surah {2},\\n\\t\\t\\t\\tnote [21]."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "6",
    "NoteID": "7",
    "Body": "Cf.  2:49 : also Exodus i. 15-16 and 22."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "7",
    "NoteID": "8",
    "Body": "I.e., \"even more than you deserve\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "9",
    "NoteID": "9",
    "Body": "I.e., they have disappeared from the face of the earth,\\n\\t\\t\\t\\tand none save God knows today how many they were and how\\n\\t\\t\\t\\tthey lived. See verse {14} and note [18] below."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "Lit., \"they put their hands into their mouths\" - an\\n\\t\\t\\t\\tidiomatic phrase indicating one's inability to refute a\\n\\t\\t\\t\\treasonable proposition by cogent, logical\\n\\t\\t\\t\\tcounter-arguments: for the out-of-hand rejection of the\\n\\t\\t\\t\\tapostles' message by their recalcitrant compatriots\\n\\t\\t\\t\\tcannot by any means be regarded as an \"argument\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "9",
    "NoteID": "11",
    "Body": "See surah {11}, note [92]. It is to be noted that whereas\\n\\t\\t\\t\\tin  11:62  this reply is placed in the mouth of people of\\n\\t\\t\\t\\tone particular community - the Thamud - and is phrased in\\n\\t\\t\\t\\tthe singular (\"thy call to us\"), it appears here in the\\n\\t\\t\\t\\tplural (\"your call to us\") and represents the gist of the\\n\\t\\t\\t\\tanswers given by various communities to various prophets.\\n\\t\\t\\t\\tThis generalization, underlying the entire subsequent\\n\\t\\t\\t\\taccount and containing echos of several Qur'anic\\n\\t\\t\\t\\tnarratives relating to the experiences of individual\\n\\t\\t\\t\\tapostles of earlier times, is obviously meant to bring\\n\\t\\t\\t\\tout the symptomatic character of the attitude referred\\n\\t\\t\\t\\tto: the stubborn attitude of people who either deny God\\n\\t\\t\\t\\taltogether, or- while not consciously denying His\\n\\t\\t\\t\\texistence - yet feel compelled to interpose all manner of\\n\\t\\t\\t\\timaginary \"mediators\" (thought to be divine or\\n\\t\\t\\t\\tsemi-divine) between themselves and Him, thus denying, by\\n\\t\\t\\t\\timplication, His omniscience and omnipotence."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "10",
    "NoteID": "12",
    "Body": "Lit., \"their apostles\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "10",
    "NoteID": "13",
    "Body": "I.e., \"until the end of your life in this world\". This\\n\\t\\t\\t\\tis, I believe, an indirect allusion to the calamities\\n\\t\\t\\t\\twhich are bound to befall, even in this world, \"those who\\n\\t\\t\\t\\tare bent on denying the truth\" (see the last paragraph of\\n\\t\\t\\t\\t 13:31  and the corresponding note [57]) - implying that\\n\\t\\t\\t\\tthey who consciously respond to the call of God, conveyed\\n\\t\\t\\t\\tthrough His prophets, would be immune to this kind of\\n\\t\\t\\t\\tsuffering and would be graced with abiding spiritual\\n\\t\\t\\t\\thappiness (cf.  13:29 )."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "11",
    "NoteID": "14",
    "Body": "I.e., it is to the contents of the divine message\\n\\t\\t\\t\\tpropounded to them that all seekers after truth must turn\\n\\t\\t\\t\\tfor illumination (see  7:75  and  13:43 , as well as the\\n\\t\\t\\t\\tcorresponding notes). The Qur'an dwells in many places\\n\\t\\t\\t\\t(e.g., in {6:109-111} or  13:31 ) on the futility - moral\\n\\t\\t\\t\\tas well as intellectual-of the demand that the divine\\n\\t\\t\\t\\torigin of a prophetic message should be proved by\\n\\t\\t\\t\\ttangible, extraneous means: for, a morally valid and\\n\\t\\t\\t\\tintellectually justifiable conviction of the intrinsic\\n\\t\\t\\t\\ttruth of such a message can be gained only through\\n\\t\\t\\t\\t\"conscious insight accessible to reason\" ( 12:108 )."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "12",
    "NoteID": "15",
    "Body": "Lit., \"guided us on our paths\" - a plural indicating (as\\n\\t\\t\\t\\tdoes the whole of the passage beginning with {verse 9})\\n\\t\\t\\t\\tthe fundamental identity of the message preached by all\\n\\t\\t\\t\\tthe prophets."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "13",
    "NoteID": "16",
    "Body": "Cf. {7:88-89}, where this alternative is placed before\\n\\t\\t\\t\\tShu'ayb."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "13",
    "NoteID": "17",
    "Body": "Lit., \"to them\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "14",
    "NoteID": "18",
    "Body": "Lit., \"after them\": implying a divine promise that the\\n\\t\\t\\t\\ttruth preached by the apostles would outlive its\\n\\t\\t\\t\\tdetractors (cf. {verse 9} above, \"None knows them [now]\\n\\t\\t\\t\\tsave God\"), and would triumph in the end."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "14",
    "NoteID": "19",
    "Body": "As Zamakhshari points out, the divine promise expressed\\n\\t\\t\\t\\tin the above verse is equivalent to the statement in\\n\\t\\t\\t\\t 7:128  that \"the future (al-'aqibah) belongs to the\\n\\t\\t\\t\\tGod-conscious\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "15",
    "NoteID": "20",
    "Body": "Or: \"they [i.e., the apostles] prayed for victory\" or\\n\\t\\t\\t\\t\"for [God's] aid\" - both these meanings being contained\\n\\t\\t\\t\\tin the noun fath, with which the verbal form istaftabu,\\n\\t\\t\\t\\tused here, is connected. It should be borne in mind that\\n\\t\\t\\t\\tthe primary significance of fataha is \"he opened\", and of\\n\\t\\t\\t\\tistaftaha, \"he sought to open [something]\" or \"he desired\\n\\t\\t\\t\\tthat it be opened\". Thus, the above passage echoes, in a\\n\\t\\t\\t\\tgeneralized form, Shu'ayb's prayer in  7:89 , \"Lay Thou\\n\\t\\t\\t\\topen (iftah) the truth between us and our people\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "16",
    "NoteID": "21",
    "Body": "Lit., \"[with] hell beyond him\", i.e., as his destiny. For\\n\\t\\t\\t\\tmy rendering of jabbar, in this context, as \"enemy of the\\n\\t\\t\\t\\ttruth\", see the first part of note [58] on  26:130 ."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "16",
    "NoteID": "22",
    "Body": "The word sadid is an infinitive noun of sadda, which in\\n\\t\\t\\t\\tits primary meaning denotes \"he turned away\" or \"was\\n\\t\\t\\t\\taverse [from something]\"; also - as noted in the Qamus\\n\\t\\t\\t\\tand the Asas - \"he cried out loudly\" (i.e., by reason of\\n\\t\\t\\t\\this aversion to something). Since sadid signifies\\n\\t\\t\\t\\tanything that is repulsive, it is also used tropically to\\n\\t\\t\\t\\tdescribe the pus that flows from wounds or the viscous\\n\\t\\t\\t\\tliquid that oozes from corpses. In his commentary on this\\n\\t\\t\\t\\tverse, Razi suggests that the expression ma' sadid is\\n\\t\\t\\t\\there purely metaphorical, and should be understood as\\n\\t\\t\\t\\t\"water like [what is described as] ,sadid\". It is in\\n\\t\\t\\t\\tpursuance of this interpretation that I have rendered the\\n\\t\\t\\t\\tabove expression as \"waters of most bitter distress\" - a\\n\\t\\t\\t\\tmetaphor of the boundless suffering and bitter\\n\\t\\t\\t\\tfrustration which, in the life to come, awaits those who\\n\\t\\t\\t\\tduring their life in this world were bent on denying all\\n\\t\\t\\t\\tspiritual truths. (Cf. the expression sharab min ,hamim\\n\\t\\t\\t\\t-rendered by me as \"a draught of burning despair\" -\\n\\t\\t\\t\\toccurring in several places and elucidated in note [62]\\n\\t\\t\\t\\ton  6:70 .)"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "17",
    "NoteID": "23",
    "Body": "I.e., to reconcile himself to this suffering."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "18",
    "NoteID": "24",
    "Body": "I.e., even the good ones (Razi)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "18",
    "NoteID": "25",
    "Body": "Lit., \"this, this is the straying far-away\". The definite\\n\\t\\t\\t\\tarticle in the expression ad-dalal al-ba'id, preceded by\\n\\t\\t\\t\\tthe pronouns dhalika huwa, is meant to stress the extreme\\n\\t\\t\\t\\tdegree of this \"straying far-away\" or \"going astray\": a\\n\\t\\t\\t\\tconstruction that can be rendered in English only by a\\n\\t\\t\\t\\tparaphrase, as above. It is to be noted that this phrase\\n\\t\\t\\t\\toccurs in the Qur'an only twice - namely, in the above\\n\\t\\t\\t\\tpassage and in  22:12  - and refers in both cases to a\\n\\t\\t\\t\\tdenial, conscious or implied, of God's oneness and\\n\\t\\t\\t\\tuniqueness."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "19",
    "NoteID": "26",
    "Body": "See note [11] on  10:5 ."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "19",
    "NoteID": "27",
    "Body": "Lit., \"bring forth a new creation\" or \"new people\", for\\n\\t\\t\\t\\tit should be remembered that the term khalq denotes not\\n\\t\\t\\t\\tmerely \"creation\" or \"act of creation\" but also \"people\"\\n\\t\\t\\t\\tor \"mankind\", which seems to be its meaning here (Ibn\\n\\t\\t\\t\\t'Abbas, as quoted by Razi)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "21",
    "NoteID": "28",
    "Body": "I.e., those who had sinned out of moral weakness and\\n\\t\\t\\t\\tself-indulgence, relying on the supposedly superior\\n\\t\\t\\t\\twisdom of the so-called \"leaders of thought\", who are\\n\\t\\t\\t\\tdescribed in the sequence as having \"gloried in their\\n\\t\\t\\t\\tarrogance\" (astakbaru) inasmuch as they refused to pay\\n\\t\\t\\t\\theed to God's messages (Tabari, on the authority of Ibn\\n\\t\\t\\t\\t'Abbas)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "21",
    "NoteID": "29",
    "Body": "Sc., \"but now it is too late for repentance\". According\\n\\t\\t\\t\\tto Tabari and Razi, this is the meaning of the above\\n\\t\\t\\t\\tpassage. Zamakhshari, however, prefers another\\n\\t\\t\\t\\tinterpretation, implying a reference not to the present\\n\\t\\t\\t\\tbut to the past, thus: \"If God had guided us aright, we\\n\\t\\t\\t\\twould have guided you [too] aright\": in other words, he\\n\\t\\t\\t\\tunderstands the phrase as an attempt on the part of the\\n\\t\\t\\t\\tdoomed to divest themselves of all responsibility, and to\\n\\t\\t\\t\\tattribute their past sinning to God's \"not having willed\"\\n\\t\\t\\t\\tto guide them aright. To my mind, the interpretation\\n\\t\\t\\t\\toffered by Tabari and Razi is preferable because - all\\n\\t\\t\\t\\tother considerations apart - it provides a logical\\n\\t\\t\\t\\tconnection between the request of \"the weak\" (see\\n\\t\\t\\t\\tpreceding note) and the reply of those who in their\\n\\t\\t\\t\\tearthly life had \"gloried in their arrogance\", as well as\\n\\t\\t\\t\\twith the latters' subsequent, despairing utterance, which\\n\\t\\t\\t\\tcan be summed up in the words, \"too late!\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "NoteID": "30",
    "Body": "Lit., \"God promised you a promise of truth\" - i.e., the\\n\\t\\t\\t\\tpromise of resurrection and last judgment."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "NoteID": "31",
    "Body": "In his commentary on this passage, Razi remarks: \"This\\n\\t\\t\\t\\tverse shows that the real Satan (ash-shaytan al-asli) is\\n\\t\\t\\t\\t[man's own] complex of desires (an-pals): for, Satan\\n\\t\\t\\t\\tmakes it clear [in the above] that it was only by means\\n\\t\\t\\t\\tof insinuations (waswasah) that he was able to reach [the\\n\\t\\t\\t\\tsinner's soul]; and had it not been for an\\n\\t\\t\\t\\talready-existing [evil] disposition due to lusts, anger,\\n\\t\\t\\t\\tsuperstition or fanciful ideas, these [satanic]\\n\\t\\t\\t\\tinsinuations would have had no effect whatsoever.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "NoteID": "32",
    "Body": "I.e., \"I cannot respond to your call for help, just as\\n\\t\\t\\t\\tyou should not have, in your lifetime, responded to my\\n\\t\\t\\t\\tcall.\" The above sentence is often interpreted in another\\n\\t\\t\\t\\tsense, namely, \"I cannot succour you, just as you cannot\\n\\t\\t\\t\\tsuccour me\". However, in view of Satan's allegorical\\n\\t\\t\\t\\treference - in the preceding passages as well as in the\\n\\t\\t\\t\\tnext sentence - to the sinners' earthly past, the\\n\\t\\t\\t\\trendering adopted by me seems to be more suitable;\\n\\t\\t\\t\\tmoreover, it is closer to the primary meaning of the verb\\n\\t\\t\\t\\tsarakha (\"he cried out\"), from which the form musrikh\\n\\t\\t\\t\\t(\"one who responds to a cry\") is derived (Jawhari)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "NoteID": "33",
    "Body": "This is, to my mind, the meaning of the highly elliptical\\n\\t\\t\\t\\tphrase kafartu bi-ma ashraktumuni min qabl, which could\\n\\t\\t\\t\\tbe literally - but most inadequately - translated thus:\\n\\t\\t\\t\\t\"I have refused to admit the truth of that whereby you\\n\\t\\t\\t\\tassociated me aforetime [with God].\" The implication is\\n\\t\\t\\t\\tthat Satan, while endeavouring to lead men astray, never\\n\\t\\t\\t\\tclaims to be God's \"equal\" (cf.  7:20 , where he speaks\\n\\t\\t\\t\\tof God, to Adam and Eve, as \"your Sustainer\", or  15:36 \\n\\t\\t\\t\\tand {39}, where he addresses Him as \"my Sustainer\", or\\n\\t\\t\\t\\t 8:48  and  59:16 , where he says, \"behold, I fear God\")\\n\\t\\t\\t\\tbut, rather, tries to make men's sinful doings \"seem\\n\\t\\t\\t\\tgoodly to them\" (cf.  6:43 ,  8:48 ,  16:63 ,  27:24 ,\\n\\t\\t\\t\\t 29:38 ), i.e., persuades them that it is morally\\n\\t\\t\\t\\tjustifiable to follow one's fancies and selfish desires\\n\\t\\t\\t\\twithout any restraint. But while Satan himself does not\\n\\t\\t\\t\\tmake any claim to equality with God, the sinner who\\n\\t\\t\\t\\tsubmits to Satan's blandishments attributes to him\\n\\t\\t\\t\\tthereby, as it were, \"a share in God's divinity\". - It\\n\\t\\t\\t\\tmust be stressed, in this connection, that the Qur'anic\\n\\t\\t\\t\\texpression shaytan is often used as a metaphor for every\\n\\t\\t\\t\\thuman impulse that is intrinsically immoral and,\\n\\t\\t\\t\\ttherefore, contrary to man's best - i.e., spiritual -\\n\\t\\t\\t\\tinterests."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "NoteID": "34",
    "Body": "I.e., all those who had consciously - either from\\n\\t\\t\\t\\tintellectual arrogance or from moral weakness - responded\\n\\t\\t\\t\\tto \"Satan's call\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "23",
    "NoteID": "35",
    "Body": "As in  10:10 , this phrase reads literally, \"their\\n\\t\\t\\t\\tgreeting therein [will be], 'Peace!' (salam)\" - a term\\n\\t\\t\\t\\twhich has been explained in surah {5}, note [29]."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "24",
    "NoteID": "36",
    "Body": "In its wider meaning, the term kalimah (\"word\") denotes\\n\\t\\t\\t\\tany conceptual statement or proposition. Thus, a \"good\\n\\t\\t\\t\\tword\" circumscribes any proposition (or idea) that is\\n\\t\\t\\t\\tintrinsically true and - because it implies a call to\\n\\t\\t\\t\\twhat is good in the moral sense - is ultimately\\n\\t\\t\\t\\tbeneficent and enduring; and since a call to moral\\n\\t\\t\\t\\trighteousness is the innermost purport of every one of\\n\\t\\t\\t\\tGod's messages, the term \"good word\" applies to them as\\n\\t\\t\\t\\twell. Similarly, the \"corrupt word\" mentioned in verse\\n\\t\\t\\t\\t{26} applies to the opposite of what a divine message\\n\\t\\t\\t\\taims at: namely, to every idea that is intrinsically\\n\\t\\t\\t\\tfalse or morally evil and, therefore, spiritually\\n\\t\\t\\t\\tharmful."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "25",
    "NoteID": "37",
    "Body": "See note [33] on the first clause of  39:27 ."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "26",
    "NoteID": "38",
    "Body": "Lit., \"having no permanence (qarar) whatever\": i.e., the\\n\\t\\t\\t\\t\"corrupt word\" (see note [36] above) is ephemeral in its\\n\\t\\t\\t\\teffect, however strong its original impact on the minds\\n\\t\\t\\t\\tof people who fall prey to it."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "27",
    "NoteID": "39",
    "Body": "Lit., \"firm\" (thabit). The term qawl - similar to the\\n\\t\\t\\t\\tterm kalimah (see note [36] above)-denote, beyond its\\n\\t\\t\\t\\tprimary meaning of \"saying\" or \"utterance\", also anything\\n\\t\\t\\t\\tthat can be defined as a statement of belief or opinion,\\n\\t\\t\\t\\tnamely, \"concept\", \"tenet\", \"assertion of faith\", and so\\n\\t\\t\\t\\ton. In this context it expresses the concept that there\\n\\t\\t\\t\\tis no deity save God, and that Muhammad is His Apostle:\\n\\t\\t\\t\\twhich is an interpretation of the above phrase given by\\n\\t\\t\\t\\tthe Prophet himself, as quoted by Bukhari in a Tradition\\n\\t\\t\\t\\ton the authority of Al-Bara' ibn 'Azib (Kitab at-Tafsir),\\n\\t\\t\\t\\tand by other Traditionists, including Muslim, on the\\n\\t\\t\\t\\tauthority of Shu'bah. The adjective thabit connotes the\\n\\t\\t\\t\\t\"firmness\" - that is, the unshakable truth-of the \"word\"\\n\\t\\t\\t\\t(or \"concept\") which it qualifies, thus connecting it\\n\\t\\t\\t\\twith the preceding parable of the \"good word\" and the\\n\\t\\t\\t\\t\"good tree\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "27",
    "NoteID": "40",
    "Body": "See note [4] on verse {4} of this surah."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "28",
    "NoteID": "41",
    "Body": "Lit., \"who have exchanged God's blessings for a denial of\\n\\t\\t\\t\\tthe truth\". The expression \"God's blessings (ni'mah)\"\\n\\t\\t\\t\\tobviously refers here to the messages revealed through\\n\\t\\t\\t\\tHis apostles."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "29",
    "NoteID": "42",
    "Body": "This is evidently an allusion to the relationship between\\n\\t\\t\\t\\tthe arrogant leaders of thought and their weak followers\\n\\t\\t\\t\\tspoken of in verse {21} above."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "30",
    "NoteID": "43",
    "Body": "Lit., \"they gave God compeers (andad)\". For an\\n\\t\\t\\t\\texplanation of my paraphrase of this sentence (fully\\n\\t\\t\\t\\tjustified by Razi), see surah {2}, note [13].-The\\n\\t\\t\\t\\tparticle li prefixed to the subsequent verb li-yudillu\\n\\t\\t\\t\\tdoes not denote intent but is a so-called lam al-'aqibah,\\n\\t\\t\\t\\ti.e., \"the [letter] lam indicating a consequence\" or \"a\\n\\t\\t\\t\\tresult\" (Razi), and is in this case suitably rendered as\\n\\t\\t\\t\\t\"and so\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "31",
    "NoteID": "44",
    "Body": "See surah {2}, note [4]."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "31",
    "NoteID": "45",
    "Body": "Cf.  2:254 . According to the philologist Abu 'Ubaydah,\\n\\t\\t\\t\\tas quoted by Razi, the expression bay' (\"selling and\\n\\t\\t\\t\\tbuying\" or \"bargaining\") denotes here the metaphorical\\n\\t\\t\\t\\t\"[giving and taking] ransom\" which, as the Qur'an\\n\\t\\t\\t\\trepeatedly stresses, will be inadmissible on the Day of\\n\\t\\t\\t\\tJudgment (cf.  3:91  and the corresponding note [71], as\\n\\t\\t\\t\\twell as  5:36 ,  10:54 ,  13:18 ,  39:47  and {70:11-l5})\\n\\t\\t\\t\\tsimilarly, the denial of khilal - which Abu 'Ubaydah\\n\\t\\t\\t\\tregards as synonymous, in this context, with makhalah\\n\\t\\t\\t\\t(\"mutual befriending\") - expresses the impossibility of\\n\\t\\t\\t\\t\"ransom\" through intercession on Judgment Day, for \"now,\\n\\t\\t\\t\\tindeed, you have come unto Us in a lonely state, even as\\n\\t\\t\\t\\tWe created you in the first instance\" ( 6:94 )."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "33",
    "NoteID": "46",
    "Body": "Almost all classical commentators agree that God's having\\n\\t\\t\\t\\tmade the natural phenomena \"subservient\" to man is a\\n\\t\\t\\t\\tmetaphor (majaz) for His having enabled man to derive\\n\\t\\t\\t\\tlasting benefit from them: hence my explanatory\\n\\t\\t\\t\\tinterpolations. In the same sense, the night and the day\\n\\t\\t\\t\\tare spoken of in  10:67 ,  27:86  or  40:61  as having\\n\\t\\t\\t\\tbeen \"made for you\" (resp. \"for them\")."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "34",
    "NoteID": "47",
    "Body": "I.e., God satisfies every one of man's desires, provided\\n\\t\\t\\t\\tthat His unfathomable wisdom regards its satisfaction as\\n\\t\\t\\t\\tultimately beneficial to the human being concerned: this\\n\\t\\t\\t\\tis the meaning of the preposition min (lit., \"out of\",\\n\\t\\t\\t\\tbut in this context, \"something out of\") preceding the\\n\\t\\t\\t\\tphrase \"what you may be asking\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "35",
    "NoteID": "48",
    "Body": "The whole of this passage (verses {35-41}) - from which\\n\\t\\t\\t\\tthe title of this surah is derived - represents a\\n\\t\\t\\t\\tparenthetic reminder, in the form of Abraham's prayer, of\\n\\t\\t\\t\\tthe only way to righteousness, in the deepest sense of\\n\\t\\t\\t\\tthe word, open to man: namely, a recognition of God's\\n\\t\\t\\t\\texistence, oneness and uniqueness and, hence, a rejection\\n\\t\\t\\t\\tof all belief in \"other powers\" supposedly co-existent\\n\\t\\t\\t\\twith Him (cf. verse {30} above). Inasmuch as this prayer\\n\\t\\t\\t\\timplies a realization of, and gratitude for, God's\\n\\t\\t\\t\\tinfinite bounty, it connects directly with the preceding\\n\\t\\t\\t\\tverse {34} and the subsequent verse {42}."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "35",
    "NoteID": "50",
    "Body": "The term \"idols\" (asnam, sing. sanam) does not apply\\n\\t\\t\\t\\texclusively to actual, concrete representations of false\\n\\t\\t\\t\\t\"deities\": for shirk - that is, an attribution of divine\\n\\t\\t\\t\\tpowers or qualities to anyone or anything beside God -\\n\\t\\t\\t\\tmay consist also, as Razi points out, in a worshipful\\n\\t\\t\\t\\tdevotion to all manner of \"causative agencies and outward\\n\\t\\t\\t\\tmeans to an end\" - an obvious allusion to wealth, power,\\n\\t\\t\\t\\tluck, people's favour or disfavour, and so forth -\\n\\t\\t\\t\\twhereas genuine faith in the oneness and uniqueness of\\n\\t\\t\\t\\tGod (at-tawhid al-mahd) consists in divesting oneself of\\n\\t\\t\\t\\tall inner attachment to [such] causative agencies and in\\n\\t\\t\\t\\tbeing convinced that there exists no real directing power\\n\\t\\t\\t\\tapart from God\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "36",
    "NoteID": "51",
    "Body": "Thus, Abraham accepts God's verdict (given in  2:124 )\\n\\t\\t\\t\\tregarding the sinners from among his descendants."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "37",
    "NoteID": "52",
    "Body": "I.e., the narrow desert valley of Mecca, which is\\n\\t\\t\\t\\tenclosed by barren, rocky hills. By \"some of my\\n\\t\\t\\t\\toffspring\" Abraham refers to Ishmael and his descendants\\n\\t\\t\\t\\twho settled at Mecca."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "37",
    "NoteID": "53",
    "Body": "I.e., to be desirous of visiting them - namely, on\\n\\t\\t\\t\\tpilgrimage to Mecca - and thus help them to maintain\\n\\t\\t\\t\\tthemselves in the holy but barren land. The phrase\\n\\t\\t\\t\\taf'idah min an-nas lends itself also to the rendering\\n\\t\\t\\t\\t\"the hearts of some people\", in which case it could be\\n\\t\\t\\t\\ttaken to mean \"the hearts of the believers\" (Baghawi,\\n\\t\\t\\t\\tRazi, Ibn Kathir)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "40",
    "NoteID": "54",
    "Body": "I.e., metonymically, \"to remain utterly devoted to Thee\".\\n\\t\\t\\t\\tThe particle min (\"[some] of\") preceding the word\\n\\t\\t\\t\\tdhurriyati (\"my offspring\") is obviously an allusion to\\n\\t\\t\\t\\t 2:124 , where God says in answer to Abraham's question\\n\\t\\t\\t\\tabout his descendants: \"My covenant does not embrace the\\n\\t\\t\\t\\tevildoers.\" Thus, Abraham has been given to understand\\n\\t\\t\\t\\tthat not all of his posterity would be righteous and that\\n\\t\\t\\t\\tnone can claim to belong to a \"chosen people\" by virtue\\n\\t\\t\\t\\tof his or her descent from an apostle of God: a statement\\n\\t\\t\\t\\twhich relates not only to the Israelites, who descended\\n\\t\\t\\t\\tfrom Abraham through Isaac, but also to the Arabian\\n\\t\\t\\t\\t(Ishmaelite) branch of the Abrahamic peoples, from whom\\n\\t\\t\\t\\tthe Quraysh were to spring: hence, by implication, even\\n\\t\\t\\t\\tto the unrighteous among the descendants of the Last\\n\\t\\t\\t\\tProphet, Muhammad, who belonged to the tribe of Quraysh."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "42",
    "NoteID": "55",
    "Body": "This verse connects with the last sentence of Abraham's\\n\\t\\t\\t\\tprayer, namely, his reference to \"the Day on which the\\n\\t\\t\\t\\t[last] reckoning will come to pass\". The wrongdoers\\n\\t\\t\\t\\tmentioned here are those who indulge in the belief \"that\\n\\t\\t\\t\\tthere are other powers that can rival God\" (cf. verse\\n\\t\\t\\t\\t{30} above), and thus commit the unforgivable sin of\\n\\t\\t\\t\\tshirk. As regards the \"respite\" granted to them, see the\\n\\t\\t\\t\\tfirst clause of  11:20  and the corresponding note [39]."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "43",
    "NoteID": "56",
    "Body": "Lit., \"their gaze will not revert to them\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "44",
    "NoteID": "57",
    "Body": "Cf.  6:27 ."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "44",
    "NoteID": "58",
    "Body": "Lit., \"that there would be no going down [or \"no\\n\\t\\t\\t\\tremoval\"] whatever for you\" - i.e., no passing-over from\\n\\t\\t\\t\\tearthly life to a life in the hereafter, attended by\\n\\t\\t\\t\\tGod's retribution of sins: a reference to many people's\\n\\t\\t\\t\\trefusal, often mentioned in the Qur'an, to believe in\\n\\t\\t\\t\\tlife after death and. hence. in God's ultimate judgment."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "45",
    "NoteID": "59",
    "Body": "I.e., \"you lived on the same earth, and in basically the\\n\\t\\t\\t\\tsame human environment, as those earlier generations who\\n\\t\\t\\t\\toffended against all ethical values and thereby brought\\n\\t\\t\\t\\tdestruction upon themselves: hence, their tragic fate\\n\\t\\t\\t\\tshould have been a warning to you\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "45",
    "NoteID": "60",
    "Body": "Lit., \"the parables\", i.e., the parables in the Qur'an\\n\\t\\t\\t\\twhich illuminate the idea of resurrection and of God's\\n\\t\\t\\t\\tfinal judgment (Razi). See also note [37] above."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "46",
    "NoteID": "61",
    "Body": "Lit., \"they devised their devising\", i.e., their\\n\\t\\t\\t\\tblasphemous belief in the existence of other \"divine\\n\\t\\t\\t\\tpowers\" side by side with God: this is the interpretation\\n\\t\\t\\t\\tgiven by Tabari towards the end of his long commentary on\\n\\t\\t\\t\\tthis verse. For my rendering of the term makr, in this\\n\\t\\t\\t\\tcontext, as \"false imagery\", see surah {13}, note [62]."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "47",
    "NoteID": "62",
    "Body": "I.e., the promise of resurrection and recompense on the\\n\\t\\t\\t\\tDay of Judgment. This relates specifically to the\\n\\t\\t\\t\\t\"respite\" occasionally granted to evildoers for the\\n\\t\\t\\t\\tduration of their lifetime (cf. verse {42} above)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "48",
    "NoteID": "63",
    "Body": "This is an allusion to the total, cataclysmic change, on\\n\\t\\t\\t\\tthe Last Day, of all natural phenomena, and thus of the\\n\\t\\t\\t\\tuniverse as known to man (cf. {20:105-107} and the\\n\\t\\t\\t\\tcorresponding note [90]). Since that change will be\\n\\t\\t\\t\\tbeyond anything that man has ever experienced or what the\\n\\t\\t\\t\\thuman mind can conceive, all the Qur'anic descriptions -\\n\\t\\t\\t\\tin the next two verses as well as in many other places -\\n\\t\\t\\t\\tof what is to happen on that Last Day are, of necessity,\\n\\t\\t\\t\\texpressed in allegorical terms: and this applies also to\\n\\t\\t\\t\\tall descriptions of man's condition, good or bad, in the\\n\\t\\t\\t\\tlife to come. (Cf. note [37] above. relatinz to the term\\n\\t\\t\\t\\t\"parable\" often used in the Qur'an.)"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "49",
    "NoteID": "64",
    "Body": "In his commentary on this passage, Razi expresses the\\n\\t\\t\\t\\tview that the reference to the sinners' being \"linked\\n\\t\\t\\t\\ttogether in fetters\" is a metaphor of their own evil\\n\\t\\t\\t\\tdeeds and inclinations and, consequently, of the utter\\n\\t\\t\\t\\tdespair which will be common to all of them in the\\n\\t\\t\\t\\thereafter. To my mind, it may also be an allusion to the\\n\\t\\t\\t\\tchain-reaction which every evil deed is bound to set in\\n\\t\\t\\t\\tmotion on earth, one evil unavoidably begetting another."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "50",
    "NoteID": "65",
    "Body": "According to Razi, the \"garments of black pitch\\n\\t\\t\\t\\t(qatiran)\" and the \"fire veiling their faces\" are\\n\\t\\t\\t\\tmetaphors of the inexpressible suffering and loathsome\\n\\t\\t\\t\\thorror which will enwrap the sinners' souls on the Day of\\n\\t\\t\\t\\tJudgment. (See also surah {73}, note [7]"
  }
]
