[
  {
    "SurahNumber": "45",
    "AyahNumber": "1",
    "Text": "Ha M'im."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "2",
    "Text": "This Book is revealed from Allah, the All-Mighty, the All-Wise."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "3",
    "Text": "Surely in the heavens and the earth there are signs for the true\\n\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "4",
    "Text": "and in your own creation and that of animals which are scattered\\n\\t\\t\\tthrough the earth, there are signs for those who are firm in\\n\\t\\t\\tfaith,"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "5",
    "Text": "and in the alternation of night and day, in the sustenance that\\n\\t\\t\\tAllah sends down from heaven with which He revives the earth\\n\\t\\t\\tafter its death and in the changing of the winds, there are signs\\n\\t\\t\\tfor those who use their common sense."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "6",
    "Text": "These are the revelations of Allah, which We are reciting to you\\n\\t\\t\\tin all truth. Then, in what report will they believe if not Allah\\n\\t\\t\\tand His revelations?"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "7",
    "Text": "Woe to each lying sinner"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "8",
    "Text": "before whom the revelations of Allah are recited: he hears them,\\n\\t\\t\\tyet he arrogantly persists as though he never heard them;\\n\\t\\t\\tannounce to him a painful punishment."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "9",
    "Text": "And when something of Our revelations come to his knowledge, he\\n\\t\\t\\ttakes them as a joke; for all such people there will be a\\n\\t\\t\\thumiliating punishment."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "10",
    "Text": "Beyond them there lies hell, and nothing of what they have earned\\n\\t\\t\\tin this world will be of any benefit to them, nor those whom they\\n\\t\\t\\thave taken as their protectors besides Allah, and they shall have\\n\\t\\t\\tgrievous punishment."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "11",
    "Text": "This Qur'an is the true Guidance. As for those who deny the\\n\\t\\t\\trevelations of their Rabb, there will be a terribly painful\\n\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "12",
    "Text": "It is Allah Who has subjected the sea to you, so that ships may\\n\\t\\t\\tsail upon it by His command, and that you may seek His bounty and\\n\\t\\t\\tbe grateful to Him."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "13",
    "Text": "He also subjected to you whatever is between the heavens and the\\n\\t\\t\\tearth; all from Himself. Surely there are signs in this for those\\n\\t\\t\\twho think."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "14",
    "Text": "O Prophet, tell the believers to bear with those who do not fear\\n\\t\\t\\tthe coming of the bad days from Allah, so that He may Himself\\n\\t\\t\\trecompense those people according to what they have earned."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "15",
    "Text": "He that does a righteous deed, does it for his own good; and he\\n\\t\\t\\tthat commits evil, does so at his own peril. In the end, you all\\n\\t\\t\\twill be brought back to your Rabb."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "16",
    "Text": "We gave the Book to the Children of Israel and bestowed on them\\n\\t\\t\\trulership and Prophethood. We provided them with good thing of\\n\\t\\t\\tlife, exalted them above the nations,"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "17",
    "Text": "and gave them clear instructions relating to the matters of\\n\\t\\t\\treligion through revealing to them the Torah. Then they differed\\n\\t\\t\\tamong themselves, not because of ignorance but, after the\\n\\t\\t\\tknowledge had come to them, out of envy among themselves. Surely\\n\\t\\t\\tyour Rabb will judge between them on the Day of Resurrection\\n\\t\\t\\tconcerning the matters in which they have set up differences."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "18",
    "Text": "O Prophet, We have put you on the Right Way (Shari'ah) concerning\\n\\t\\t\\tthe religion, so follow it, and do not yield to the desires of\\n\\t\\t\\tignorant people;"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "19",
    "Text": "for they can in no way protect you against Allah. In fact, the\\n\\t\\t\\twrongdoers are protectors of one another, while the protector of\\n\\t\\t\\tthe righteous is Allah Himself."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "20",
    "Text": "These (the Qur'an and Shari'ah) are the eye openers for mankind;\\n\\t\\t\\ta guidance and a blessing to the true believers."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "21",
    "Text": "Do the evil doers think that We shall hold them equal with those\\n\\t\\t\\twho believe and do good deeds, and that their lives and deaths\\n\\t\\t\\tshall be alike? Bad is their judgment!"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "22",
    "Text": "Allah has created the heavens and the earth to manifest the\\n\\t\\t\\ttruth, and to reward each soul according to its deeds, and none\\n\\t\\t\\tof them shall be wronged."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "23",
    "Text": "Have you considered the case of such an individual who has made\\n\\t\\t\\this own desires as his god, and Allah having knowledge let him go\\n\\t\\t\\tastray, and sealed his hearing and heart and drew a veil over his\\n\\t\\t\\tsight? Who is there to guide him after Allah has withdrawn His\\n\\t\\t\\tguidance? Will you not learn a lesson?"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "24",
    "Text": "The disbelievers say: \"There is nothing but the life of this\\n\\t\\t\\tworld? We live and die; nothing but time destroys us.\" In fact,\\n\\t\\t\\tthey have no knowledge concerning this. They are merely guessing."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "25",
    "Text": "When Our clear revelations are recited to them, they have no\\n\\t\\t\\tother argument but to say: \"Bring our forefathers back if what\\n\\t\\t\\tyou say is true!\""
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "26",
    "Text": "O Prophet tell them: \"It is Allah Who gives you life and later\\n\\t\\t\\tcauses you to die; then it is He Who will gather you all on the\\n\\t\\t\\tDay of Resurrection, about which there is no doubt, yet most\\n\\t\\t\\tpeople do not understand.\""
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "27",
    "Text": "To Allah belongs the Kingdom of the heavens and the earth. On\\n\\t\\t\\tthat Day when the Hour of Judgment will be established, those who\\n\\t\\t\\thave denied His revelations shall be doomed to loss."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "28",
    "Text": "You shall see every nation on its knees. Every nation shall be\\n\\t\\t\\tsummoned to its book of record, and Allah will say: \"Today you\\n\\t\\t\\tshall be rewarded for your deeds."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "29",
    "Text": "This book of Ours speaks about you with the truth. Surely We have\\n\\t\\t\\trecorded all your deeds.\""
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "30",
    "Text": "As for those who believed and did righteous deeds, their Rabb\\n\\t\\t\\twill admit them into His mercy. That will be a glorious\\n\\t\\t\\tachievement."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "31",
    "Text": "But as to those who disbelieved, Allah will say: \"Were My\\n\\t\\t\\trevelations not recited to you? But you showed arrogance and\\n\\t\\t\\tbecame a people of criminals\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "32",
    "Text": "When it was said, \"the promise of Allah is true and the Hour of\\n\\t\\t\\tJudgement is sure to come. You used to say, `We don't know what\\n\\t\\t\\tthe Hour of Judgement is: we think it is just a conjecture, we\\n\\t\\t\\tare not convinced.'\""
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "33",
    "Text": "Then the evil of their deeds will become manifest to them, and\\n\\t\\t\\tthey will be completely encircled by that which they used to mock\\n\\t\\t\\tat."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "34",
    "Text": "It will be said: \"Today We will forget you as you forgot the\\n\\t\\t\\tmeeting of this Day of yours! Hellfire will be your home and none\\n\\t\\t\\twill be there to help you."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "35",
    "Text": "This is because you used to take Allah's revelations as a joke\\n\\t\\t\\tand you let the worldly life deceive you.\" Therefore, on this Day\\n\\t\\t\\tneither they shall be taken out of hell, nor shall they be given\\n\\t\\t\\ta chance for amending their ways to please their Rabb."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "36",
    "Text": "So, praise be to Allah, the Rabb of the heavens, the Rabb of the\\n\\t\\t\\tearth and the Rabb of the worlds."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "37",
    "Text": "To Him belongs greatness throughout the heavens and the earth,\\n\\t\\t\\tand He Alone is the All-Mighty, the All-Wise."
  }
]
