[
  {
    "SurahNumber": "73",
    "AyahNumber": "1",
    "NoteID": "5754",
    "Body": "Muzzammil: Some Commentators understand by this,\\n\\t\\t\\t\\t\"properly dressed for prayer\", or \"folded in a sheet, as\\n\\t\\t\\t\\tone renouncing the vanities of this world. Muzzammil is\\n\\t\\t\\t\\tone of the titles of our holy Prophet. But there is a\\n\\t\\t\\t\\tdeeper meaning in this and the address \"Thou wrapped up\"\\n\\t\\t\\t\\tof the next Sura. Human nature requires warm garments and\\n\\t\\t\\t\\twrappings to protect the body from cold or heat or rain.\\n\\t\\t\\t\\tBut in the spiritual world these wrappings are useless:\\n\\t\\t\\t\\tthe soul must stand bare and open before Allah, in the\\n\\t\\t\\t\\tsilence of the night, but not too austerely, as the\\n\\t\\t\\t\\tfollowing verses show."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "2",
    "NoteID": "5755",
    "Body": "The Prophet was prone to austerities in the cave of\\n\\t\\t\\t\\tHiraa, both before and after he received his mission,\\n\\t\\t\\t\\tspending days and nights in prayer and contemplation.\\n\\t\\t\\t\\tMidnight and after-midnight prayers have technically\\n\\t\\t\\t\\treceived the name of Tahajjud. See also verse 20 below;\\n\\t\\t\\t\\talso xvii. 79."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "4",
    "NoteID": "5756",
    "Body": "At this time there was only S. xcvi., S. lxviii, and\\n\\t\\t\\t\\tpossibly S. lxxiv, and the opening Sura (Al-Hamd). For\\n\\t\\t\\t\\tus, now, with the whole of the Qur-an before us, the\\n\\t\\t\\t\\tinjuction is specially necessary. The words of the Qur-an\\n\\t\\t\\t\\tmust not be read hastily, merely to get through so much\\n\\t\\t\\t\\treading. They must be studied, and their deep meaning\\n\\t\\t\\t\\tpondered over. They are themselves so beautiful that they\\n\\t\\t\\t\\tmust be lovingly pronounced in rhythmic tones."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "5",
    "NoteID": "5757",
    "Body": "The Qur-an as completed by degrees, after the Fatra (see\\n\\t\\t\\t\\tIntroduction to this Sura)."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "6",
    "NoteID": "5758",
    "Body": "For contemplation, prayer, and praise, what time can be\\n\\t\\t\\t\\tso suitable as the night, when calm and silence prevail,\\n\\t\\t\\t\\tthe voices of the market-place are still, and the silent\\n\\t\\t\\t\\tstars pour forth their eloquence to the discerning soul."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "7",
    "NoteID": "5759",
    "Body": "A prophet of Allah, as a man, a member of a family, or a\\n\\t\\t\\t\\tcitizen, has many ordinary duties to perform; and his\\n\\t\\t\\t\\twork may be made difficult and irksome in protecting\\n\\t\\t\\t\\tthose who listen to his preaching and are therefore\\n\\t\\t\\t\\tmolested and persecuted by the world. But while\\n\\t\\t\\t\\tdischarging all his ordinary duties, he should work as in\\n\\t\\t\\t\\tthe presence of Allah, and in all matters and at all\\n\\t\\t\\t\\ttimes retain the sense of Allah's nearness. His work may\\n\\t\\t\\t\\tbe on earth, but his heart is in Heaven."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "9",
    "NoteID": "5760",
    "Body": "Allah is Lord of all places. He rules the world.\\n\\t\\t\\t\\tTherefore be not discouraged by the plots or enmity of\\n\\t\\t\\t\\twicked men. Leave all things to Allah; trust Him; He is\\n\\t\\t\\t\\tjust and will do justice. Only turn away from the unjust,\\n\\t\\t\\t\\tbut in a worthy and noble way; i.e., to show them clearly\\n\\t\\t\\t\\tthat you do not fear them, but that you leave all affairs\\n\\t\\t\\t\\tin Allah's hands. If we divide the world into hemispheres\\n\\t\\t\\t\\tfrom north to south, \"East and West\" will cover all\\n\\t\\t\\t\\tdirections."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "11",
    "NoteID": "5761",
    "Body": "Men who enjoy the good things of life have special cause\\n\\t\\t\\t\\tfor gratitude to Allah, Who bestowed them. When they are\\n\\t\\t\\t\\tin the ranks of Allah's enemies, none but Allah can\\n\\t\\t\\t\\tadequately deal with them."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "12",
    "NoteID": "5762",
    "Body": "Cf. xiii. 5; xxxiv. 33; xi. 71 and lxix. 30-32."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "12",
    "NoteID": "5763",
    "Body": "Cf. xliv. 47 and lvi. 94."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "13",
    "NoteID": "5764",
    "Body": "Cf. xliv. 43; lvi. 52; lxix. 36-37, and lxxxviii. 6."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "13",
    "NoteID": "5765",
    "Body": "In general terms, the Penalty of sin may be described as\\n\\t\\t\\t\\ta Penalty Grievous, an Agony. It may come in this very\\n\\t\\t\\t\\tfife, but that in the Hereafter is certain! See next\\n\\t\\t\\t\\tverse. We can also consider punishments from another\\n\\t\\t\\t\\taspect. The first object of punishment is to protect the\\n\\t\\t\\t\\tinnocent from the depredations of the criminal: we have\\n\\t\\t\\t\\tto bind him. The next object is to produce in his heart\\n\\t\\t\\t\\tthe fire of repentance, to consume his evil proclivities\\n\\t\\t\\t\\tand to light his conscience. Where that is not enough, a\\n\\t\\t\\t\\tmore drastic punishment for the callous is something\\n\\t\\t\\t\\twhich causes him pain in things which ordinarily cause\\n\\t\\t\\t\\thim pleasure, such as food, drink, and the satisfaction\\n\\t\\t\\t\\tof physical needs. People in whom the higher spiritual\\n\\t\\t\\t\\tfaculties are dead may perchance be awakened through the\\n\\t\\t\\t\\tlower physical features of their life, which appeal to\\n\\t\\t\\t\\tthem. Where this also fails, there is finally the\\n\\t\\t\\t\\tcomplete agony, a type too terrible to contemplate."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "14",
    "NoteID": "5766",
    "Body": "The Judgment is described as a violent commotion which\\n\\t\\t\\t\\twill change the whole face of nature as we know it. Even\\n\\t\\t\\t\\tthe hard rock of mountains will be like loose sand\\n\\t\\t\\t\\trunning without any cohesion."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "15",
    "NoteID": "5767",
    "Body": "Our holy Prophet has to warn his age, i.e., the present\\n\\t\\t\\t\\tage, reclaim it from sin, and be a witness for the\\n\\t\\t\\t\\trighteous and against evil, as Moses did his office in\\n\\t\\t\\t\\this age. For Pharaoh, his arrogance, and his punishment,\\n\\t\\t\\t\\tsee x. 75-92."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "16",
    "NoteID": "5768",
    "Body": "Pharaoh the earthly king faces Moses the prophet of\\n\\t\\t\\t\\tAllah. In earthly eyes it was Moses who disobeyed\\n\\t\\t\\t\\tPharaoh. In spiritual relations, it was Pharaoh who\\n\\t\\t\\t\\tdisobeyed Moses. Pharaoh represented an ancient and\\n\\t\\t\\t\\tmighty kingdom, with a long history behind it, and a\\n\\t\\t\\t\\tpride in its learning and science, art, organisation, and\\n\\t\\t\\t\\tpower. Moses led a depressed people, hewers of wood and\\n\\t\\t\\t\\tdrawers of water. But the might of Allah was behind him.\\n\\t\\t\\t\\tWhat became of the wisdom, power, and armies of Pharaoh?\\n\\t\\t\\t\\tThey were rent asunder when the day came, and the terror\\n\\t\\t\\t\\tand surprise must have been the same as if the heavens\\n\\t\\t\\t\\thad been rent asunder, and children's hair had turned\\n\\t\\t\\t\\tgrey! But formidable revolutions turn children\\n\\t\\t\\t\\tgrey-haired in another way. Nations that were as children\\n\\t\\t\\t\\tbecame wise before they in their turn decayed, and from\\n\\t\\t\\t\\tsimilar disobedience to the laws of Allah. For Allah's\\n\\t\\t\\t\\tlaw must stand and be fulfilled when all else is swept\\n\\t\\t\\t\\taway."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "17",
    "NoteID": "5769",
    "Body": "If already you deny and disobey Allah in this life of\\n\\t\\t\\t\\tprobation, how can you stand up to the Day of Judgment,\\n\\t\\t\\t\\tthe Day of the terrrible Reality? That Day is described\\n\\t\\t\\t\\tin two metaphors: (1) It will be a time of such stress\\n\\t\\t\\t\\tthat even children will become like hoary-headed men; (2)\\n\\t\\t\\t\\tWhat we look upon as the eternal sky, ever the same, will\\n\\t\\t\\t\\tbe cleft asunder; cf. lxxxii. 1. In other words, the\\n\\t\\t\\t\\tshape of things will be completely altered, both within\\n\\t\\t\\t\\tman and in outer nature, and all true values will be\\n\\t\\t\\t\\trestored. For the Promise of Allah, in this as in all\\n\\t\\t\\t\\tother respects, cannot but be fulfiflled."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "19",
    "NoteID": "5770",
    "Body": "This is no empty threat. It is an admonition for your\\n\\t\\t\\t\\tgood. If you have the will, you can at once come for the\\n\\t\\t\\t\\tGrace and Mercy of Allah, and obtain it. For Repentance\\n\\t\\t\\t\\tand Amendment are the straight Way to the nearness of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "5771",
    "Body": "Cf., above, lxxiii. 24. The Prophet, and a zealous band\\n\\t\\t\\t\\tof his disciples, were often up, two-thirds of the night,\\n\\t\\t\\t\\tor a half, or a third, rejecting sleep and giving\\n\\t\\t\\t\\tthemselves up to Prayer and Praise and the reading of the\\n\\t\\t\\t\\tQur-an. They are told that this was too severe a tax on\\n\\t\\t\\t\\tthem, especially if their health was affected, or they\\n\\t\\t\\t\\twere on a journey, or they were striving, with might and\\n\\t\\t\\t\\tmain, in other ways, for the cause of Allah. See die\\n\\t\\t\\t\\tfines following."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "5772",
    "Body": "The usual meaning taken is that the counting of the exact\\n\\t\\t\\t\\thours of night and day may not be possible for ordinary\\n\\t\\t\\t\\tpeople, in order to determine exactly the half, or the\\n\\t\\t\\t\\tthird, or the two-thirds of a night. The length of the\\n\\t\\t\\t\\tnight and the day varies every day of the solar year, and\\n\\t\\t\\t\\tthe precise hour of midnight can only be determined by\\n\\t\\t\\t\\texact observation in clear skies or by chronometers,\\n\\t\\t\\t\\twhich is not possible for everyone. But I understand it\\n\\t\\t\\t\\tin a wider meaning. Allah fixes night and day in due\\n\\t\\t\\t\\tproportions; for rest and work, and according to seasonal\\n\\t\\t\\t\\tvariations. For prayer and praise no meticulous\\n\\t\\t\\t\\tobservations of that kind are necessary or possible.\\n\\t\\t\\t\\tAllah's service can be done in many ways as detailed\\n\\t\\t\\t\\tbelow. But we must give some time to devotion, as may be\\n\\t\\t\\t\\tmost easy and convenient to us, in various circumstances\\n\\t\\t\\t\\tof health, travel, and the performance of various duties."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "5773",
    "Body": "The reading of the Qur-an here is a part of Prayer and\\n\\t\\t\\t\\treligious devotion. This is not to be made into an\\n\\t\\t\\t\\tobsession or a burden. Cf. xx. 2: \"We have not sent down\\n\\t\\t\\t\\tthe Qur-an to thee to be an occasion for thy distress.\"\\n\\t\\t\\t\\tWe must do it whole-mindedly, but not by formal\\n\\t\\t\\t\\tmechanical computations."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "5774",
    "Body": "This refers to Jihad. The better opinion is that this\\n\\t\\t\\t\\tparticular verse was revealed in Madinah, long after the\\n\\t\\t\\t\\tgreater part of the Sura. The reference, further on, to\\n\\t\\t\\t\\tcanonical Prayers and regular Charity (Zakat), points to\\n\\t\\t\\t\\tthe same conclusion."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "5775",
    "Body": "Cf. ii. 2456, and n. 276, where the meaning of \"a\\n\\t\\t\\t\\tBeautiful Loan\" is explained. See also lvii. 18. The\\n\\t\\t\\t\\t\"Beautiful Loan\" should be that of our own souls. We\\n\\t\\t\\t\\tshould expect no retums in kind, for that is not\\n\\t\\t\\t\\tpossible. But the reward we shall find with Allah will be\\n\\t\\t\\t\\tinfinitely greater and nobler. Cf. the biblical phrase,\\n\\t\\t\\t\\t\"Lay up for yourselves treasures in heaven\" (Matt. vi.\\n\\t\\t\\t\\t20)."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "5776",
    "Body": "Any good that we do raises our own spiritual status and\\n\\t\\t\\t\\tdignity. We must not think that when we speak of Allah's\\n\\t\\t\\t\\tservice or Allah's Cause, we are doing anything for His\\n\\t\\t\\t\\tbenefit: He is independent of all needs whatsoever."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "5777",
    "Body": "This emphasizes the need of Allah's Grace. Whatever good\\n\\t\\t\\t\\twe do, our own merits are comparatively small. Allah's\\n\\t\\t\\t\\tGrace must lift us up and blot out our shortcomings. Even\\n\\t\\t\\t\\tin piety there may be an arrogance which may become a\\n\\t\\t\\t\\tsin. We should always seek Allah's Mercy in all humility."
  }
]
