[
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "For this and the subsequent historical references, see\\n\\t\\t\\t\\tthe introductory note to this surah. The tribe of Banu\\n\\t\\t\\t\\t'n-Nadir - who, as Jews, are naturally termed ahl\\n\\t\\t\\t\\tal-kitab (\"followers of earlier revelation\") - are\\n\\t\\t\\t\\tcharacterized as \"such as were bent on denying the truth\"\\n\\t\\t\\t\\t(alladhina kafaru, see note [6] on  2:6 ) because they\\n\\t\\t\\t\\ttreacherously turned against the Prophet despite their\\n\\t\\t\\t\\tearlier admission that he was truly the bearer of God's\\n\\t\\t\\t\\tmessage announced in their own holy scriptures\\n\\t\\t\\t\\t(Deuteronomy xviii, 15 and 18)."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Lit., \"from whence they had not thought [it possible]\":\\n\\t\\t\\t\\tan allusion to the last-minute, unexpected failure of\\n\\t\\t\\t\\t'Abd Allah ibn Ubayy to come to their aid."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "As mentioned in the introductory note, the Banu 'n-Nadir\\n\\t\\t\\t\\thad originally concluded a treaty of mutual\\n\\t\\t\\t\\tnon-interference with the Muslim community, and were to\\n\\t\\t\\t\\tlive at Medina as its friendly neighbours; and even\\n\\t\\t\\t\\tlater, when their hostility to the Muslims had become\\n\\t\\t\\t\\tapparent and they were ordered to emigrate, they were to\\n\\t\\t\\t\\tbe allowed to retain ownership of their plantations.\\n\\t\\t\\t\\tSubsequently, however, they forfeited by their treachery\\n\\t\\t\\t\\tboth their citizenship and the rights to their landed\\n\\t\\t\\t\\tproperty, and thus \"destroyed their homes by their own\\n\\t\\t\\t\\thands\"."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "For this condemnation of the Banu 'n-Nadir, see note [1]\\n\\t\\t\\t\\tabove. As regards my rendering of the verb shaqqu as\\n\\t\\t\\t\\t\"they cut themselves off\", see note [16] on  8:13 ."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "I.e., to facilitate the military operations against the\\n\\t\\t\\t\\tstrongholds of the Banu 'n-Nadir ('Abd Allah ibn Mas'ud,\\n\\t\\t\\t\\tas quoted by Zamakhshari et al.). It should, however, be\\n\\t\\t\\t\\tnoted that apart from such stringent military exigencies,\\n\\t\\t\\t\\tall destruction of enemy property - and, in particular,\\n\\t\\t\\t\\tof trees and crops - had been and continued to be\\n\\t\\t\\t\\tprohibited by the Prophet (Tabari, Baghawi, Zamakhshari,\\n\\t\\t\\t\\tRazi, Ibn Kathir), and has thus become an integral part\\n\\t\\t\\t\\tof Islamic Law."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "Lit., \"from them\": i.e., from the Banu 'n-Nadir."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "6",
    "NoteID": "7",
    "Body": "I.e., \"you did not have to fight for it, since the enemy\\n\\t\\t\\t\\tsurrendered without giving battle\". The term fay' (a noun\\n\\t\\t\\t\\tderived from the verb fa'a, \"he returned [something]\" or\\n\\t\\t\\t\\t\"turned [it] over\") is applied in the Qur'an and the\\n\\t\\t\\t\\tTraditions exclusively to war-gains - whether consisting\\n\\t\\t\\t\\tof lands, or tribute, or indemnities - which are\\n\\t\\t\\t\\tobtained, as a condition of peace, from an enemy who has\\n\\t\\t\\t\\tlaid down arms before actual fighting has taken place\\n\\t\\t\\t\\t(Taj al-'Arus)."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "7",
    "NoteID": "8",
    "Body": "Sc., and not to individual Muslim warriors. As so often\\n\\t\\t\\t\\tin the Qur'an, the expression \"God and the Apostle\" is\\n\\t\\t\\t\\there a metonym for the Islamic cause, resp. for a\\n\\t\\t\\t\\tgovernment that rules in accordance with the laws of the\\n\\t\\t\\t\\tQur'an and the teachings of the Prophet."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "7",
    "NoteID": "9",
    "Body": "Cf.  8:41 , which relates to booty acquired in actual\\n\\t\\t\\t\\twarfare, out of which only one-fifth is to be reserved\\n\\t\\t\\t\\tfor the above five categories (see note [41] on  8:41 ).\\n\\t\\t\\t\\tIn distinction from all such booty, the gains obtained\\n\\t\\t\\t\\tthrough fay' are to be utilized in their entirety under\\n\\t\\t\\t\\tthese five headings. As regards the term ibn as-sabil\\n\\t\\t\\t\\t(\"wayfarer\"), see surah {2}, note [145]."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "7",
    "NoteID": "10",
    "Body": "Respectively, in later times, the head of an Islamic\\n\\t\\t\\t\\tstate, who has to decide - in the light of the exigencies\\n\\t\\t\\t\\t- how the share of \"God and His Apostle\" is to be\\n\\t\\t\\t\\tutilized for the common weal."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "8",
    "NoteID": "11",
    "Body": "For this rendering of the term muhajirun (\"emigrants\"),\\n\\t\\t\\t\\tsee surah {2}, note [203]."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "9",
    "NoteID": "12",
    "Body": "I.e., before the coming to them of \"those who have\\n\\t\\t\\t\\tforsaken the domain of evil\" (see next note)."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "9",
    "NoteID": "13",
    "Body": "This relates, in the first instance, to the historical\\n\\t\\t\\t\\tansar (\"helpers\") of Medina, who had embraced Islam\\n\\t\\t\\t\\tbefore the Prophet's and his Meccan followers' coming to\\n\\t\\t\\t\\tthem, and who received the refugees with utmost\\n\\t\\t\\t\\tgenerosity, sharing with them like brethren their own\\n\\t\\t\\t\\tdwellings and all their possessions. In a wider sense,\\n\\t\\t\\t\\tthe above refers also to all true believers, at all\\n\\t\\t\\t\\ttimes, who live in freedom and security within the realm\\n\\t\\t\\t\\tof Islam, and are prepared to receive with open arms\\n\\t\\t\\t\\tanyone who is compelled to leave his homeland in order to\\n\\t\\t\\t\\tbe able to live in accordance with the dictates of his\\n\\t\\t\\t\\tfaith."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "9",
    "NoteID": "14",
    "Body": "Thus, greed, niggardliness and covetousness are pointed\\n\\t\\t\\t\\tout here as the main obstacles to man's attaining to a\\n\\t\\t\\t\\thappy state in this world and in the hereafter (cf. surah\\n\\t\\t\\t\\t{102})."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "10",
    "NoteID": "15",
    "Body": "I.e., all who attain to a belief in the Qur'an and its\\n\\t\\t\\t\\tProphet (Razi)."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "11",
    "NoteID": "16",
    "Body": "I.e., the hypocrites of Medina (see introductory note as\\n\\t\\t\\t\\twell as next note)."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "11",
    "NoteID": "17",
    "Body": "The Banu 'n-Nadir. From the construction of the next\\n\\t\\t\\t\\tverse it appears that the whole of this passage (verses\\n\\t\\t\\t\\t{11-14}) was revealed before the actual advance of the\\n\\t\\t\\t\\tMuslims against the Nadir strongholds: verses {12-14}\\n\\t\\t\\t\\tmight be of a prophetic nature, predicting what was yet\\n\\t\\t\\t\\tto happen (Zamakhshari). Alternatively, the passage may\\n\\t\\t\\t\\tbe understood in a wider, timeless sense, applying to the\\n\\t\\t\\t\\tfalsity and futility inherent in all \"alliances\" between,\\n\\t\\t\\t\\ton the one hand, people who openly deny the truth and, on\\n\\t\\t\\t\\tthe other, half-hearted waverers who have neither the\\n\\t\\t\\t\\twill to commit themselves to a spiritual proposition nor\\n\\t\\t\\t\\tthe moral courage to declare openly their lack of belief."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "13",
    "NoteID": "18",
    "Body": "Inasmuch as they do not - or, at best, only\\n\\t\\t\\t\\thalf-heartedly - believe in God, the tangible, material\\n\\t\\t\\t\\tdangers facing them in this world arouse in them a far\\n\\t\\t\\t\\tgreater fear than the thought of His ultimate judgment."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "14",
    "NoteID": "19",
    "Body": "The meaning is: \"Even if they were able - which they are\\n\\t\\t\\t\\tnot - to put forth against you a truly unified front,\\n\\t\\t\\t\\tthey will always fight you only from what they regard as\\n\\t\\t\\t\\twell-established 'positions of strength'.\""
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "14",
    "NoteID": "20",
    "Body": "Sc., \"with a view to achieving what is good for\\n\\t\\t\\t\\tthemselves\": implying that people who have no real faith\\n\\t\\t\\t\\tand no definite moral convictions can never attain to\\n\\t\\t\\t\\ttrue unity among themselves, but are always impelled to\\n\\t\\t\\t\\tcommit acts of aggression against one another."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "15",
    "NoteID": "21",
    "Body": "This interpolation - relating as it does to both the\\n\\t\\t\\t\\toutright deniers of the truth and the hypocrites - is\\n\\t\\t\\t\\tjustified by the occurrence of the dual form in verse\\n\\t\\t\\t\\t{17}."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "15",
    "NoteID": "22",
    "Body": "In the first instance, this is apparently an allusion to\\n\\t\\t\\t\\tthe fate of the pagan Quraysh at the battle of Badr\\n\\t\\t\\t\\t(Zamakhshari) or, according to some authorities (quoted\\n\\t\\t\\t\\tby Tabari), to the treachery and subsequent expulsion\\n\\t\\t\\t\\tfrom Medina, in the month of Shawwal, 2 H., of the Jewish\\n\\t\\t\\t\\ttribe of Banu Qaynuqa'. But in a wider perspective -\\n\\t\\t\\t\\tstrongly suggested by the next two verses - the meaning\\n\\t\\t\\t\\tis general and not restricted to any particular time or\\n\\t\\t\\t\\thistorical occurrence."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "16",
    "NoteID": "23",
    "Body": "Cf.  8:48 ; also  14:22  and the corresponding notes."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "17",
    "NoteID": "24",
    "Body": "Lit., \"the end ('aqibah) of both will be that both...\",\\n\\t\\t\\t\\tetc."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "19",
    "NoteID": "25",
    "Body": "I.e., by having made a deliberately wrong use of the\\n\\t\\t\\t\\tfaculty of reason with which God has endowed man, and -\\n\\t\\t\\t\\tby remaining oblivious of Him - having wasted their own\\n\\t\\t\\t\\tspiritual potential."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "21",
    "NoteID": "26",
    "Body": "I.e., in contrast with those who, by remaining oblivious\\n\\t\\t\\t\\tof God and all moral imperatives, are spiritually more\\n\\t\\t\\t\\tdead than an inert mountain."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "22",
    "NoteID": "27",
    "Body": "See note [65] on the second paragraph of  6:73 ."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "NoteID": "28",
    "Body": "Lit., \"the Salvation\" (as-salam): see surah {5}, note\\n\\t\\t\\t\\t[29]."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "NoteID": "29",
    "Body": "For this rendering of muhaymin, see  5:48  - where this\\n\\t\\t\\t\\tterm is applied to the Qur'an - and the corresponding\\n\\t\\t\\t\\tnote [64]."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "NoteID": "30",
    "Body": "Since the verb jabara - from which the noun jabbar is\\n\\t\\t\\t\\tderived - combines the concepts of \"setting right\" or\\n\\t\\t\\t\\t\"restoring\" (e.g., from a state of brokenness,\\n\\t\\t\\t\\till-health, or misfortune) and of \"compelling\" or\\n\\t\\t\\t\\t\"subduing [someone or something] to one's will\", I\\n\\t\\t\\t\\tbelieve that the term al-jabbar, when applied to God, is\\n\\t\\t\\t\\tbest rendered as above."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "24",
    "NoteID": "31",
    "Body": "Thus Baydawi. The two terms al-bari' (\"the Maker\") and\\n\\t\\t\\t\\tal-musawwir (\"the Shaper\", i.e., of all forms and\\n\\t\\t\\t\\tappearances) evidently constitute here one single unit."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "24",
    "NoteID": "32",
    "Body": "For this rendering of al-asma' al-husna, see surah {7},\\n\\t\\t\\t\\tnote [145]."
  }
]
