[
  {
    "SurahNumber": "24",
    "AyahNumber": "1",
    "NoteID": "2953",
    "Body": "It must not be thought that the checking of sex offences\\n\\t\\t\\t\\tor of minor improprieties, that relate to sex or privacy,\\n\\t\\t\\t\\tare matters that do not affect spiritual life in the\\n\\t\\t\\t\\thighest degree. These matters are intimately connected\\n\\t\\t\\t\\twith spiritual teaching such as Allah has sent down in\\n\\t\\t\\t\\tthis Sura. The emphasis is on \"We\": these things are not\\n\\t\\t\\t\\tmere matters of convenience, but Allah has ordained them\\n\\t\\t\\t\\tfor our observance in life."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "2",
    "NoteID": "2954",
    "Body": "Zina includes sexual intercourse between a man and a\\n\\t\\t\\t\\twoman not married to each other. It therefore applies\\n\\t\\t\\t\\tboth to adultery (which implies that one or both of the\\n\\t\\t\\t\\tparties are married to a person or persons other than the\\n\\t\\t\\t\\tones concerned) and to fornication, which, in its strict\\n\\t\\t\\t\\tsignification, implies that both parties are unmarried.\\n\\t\\t\\t\\tThe law of marriage and divorce is made easy in Islam, so\\n\\t\\t\\t\\tthat there may be the less temptation for intercourse\\n\\t\\t\\t\\toutside the well-defined incidents of marriage. This\\n\\t\\t\\t\\tmakes for greater self-respect for both man and woman.\\n\\t\\t\\t\\tOther sex offences are also punishable, but this Section\\n\\t\\t\\t\\tapplies strictly to Zina as above defined. Although zina\\n\\t\\t\\t\\tcovers both fornication and adultery, in the opinion of\\n\\t\\t\\t\\tMuslim jurists, the punishment laid down here applies\\n\\t\\t\\t\\tonly to unmarried persons. As for married persons, their\\n\\t\\t\\t\\tpunishment, according to the Sunnah of the Prophet (peace\\n\\t\\t\\t\\tbe on him), is stoning to death."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "2",
    "NoteID": "2955",
    "Body": "Cf. iv. 15, and n. 523."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "2",
    "NoteID": "2956",
    "Body": "The punishment should be open, in order to be deterrent."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "3",
    "NoteID": "2957",
    "Body": "Islam commands sex purity, for men and for women, at all\\n\\t\\t\\t\\ttimes,-before marriage, during marriage, and after the\\n\\t\\t\\t\\tdissolution of marriage. Those guilty of illicit\\n\\t\\t\\t\\tpractices are shut out of the marriage circle of chaste\\n\\t\\t\\t\\tmen and women."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "4",
    "NoteID": "2958",
    "Body": "The most serious notice is taken of people who put\\n\\t\\t\\t\\tforward slanders or scandalous suggestions about women\\n\\t\\t\\t\\twithout adequate evidence. If anything is said against a\\n\\t\\t\\t\\twoman's chastity, it should be supported by evidence\\n\\t\\t\\t\\ttwice as strong as would ordinarily be required for\\n\\t\\t\\t\\tbusiness transactions, or even in murder cases. That is,\\n\\t\\t\\t\\tfour witnesses would be required instead of two. Failing\\n\\t\\t\\t\\tsuch preponderating evidence, the slanderer should\\n\\t\\t\\t\\thimself be treated as a wicked transgressor and punished\\n\\t\\t\\t\\twith eighty stripes. Not only would he be subjected to\\n\\t\\t\\t\\tthis disgraceful form of punishment, but he would be\\n\\t\\t\\t\\tdeprived of the citizen's right of giving evidence in all\\n\\t\\t\\t\\tmatters unless he repents and reforms, in which case he\\n\\t\\t\\t\\tcan be readmitted to be a competent witness. The verse\\n\\t\\t\\t\\tlays down the punishment for slandering \"chaste women\",\\n\\t\\t\\t\\twhich by consensus of opinion also covers slandering\\n\\t\\t\\t\\tchaste men. Chaste women have been specifically\\n\\t\\t\\t\\tmentioned, according to Commentators, because slandering\\n\\t\\t\\t\\tthem is more abhorrent."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "5",
    "NoteID": "2959",
    "Body": "The punishment of stripes is inflicted in any case for\\n\\t\\t\\t\\tunsupported slander. But the deprivation of the civic\\n\\t\\t\\t\\tright of giving evidence can be cancelled by the man's\\n\\t\\t\\t\\tsubsequent conduct, if he repents, shows that he is sorry\\n\\t\\t\\t\\tfor what he did, and that he would not in future support\\n\\t\\t\\t\\tby his statement anything for which he has not the\\n\\t\\t\\t\\tfullest evidence. Secular courts do not enforce these\\n\\t\\t\\t\\tprinciples, as their standards are lower than those which\\n\\t\\t\\t\\tgood Muslims set for themselves, but good Muslims must\\n\\t\\t\\t\\tunderstand and act on the underlying principles, which\\n\\t\\t\\t\\tprotect the honour of womanhood."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "6",
    "NoteID": "2960",
    "Body": "The case of married persons is different from that of\\n\\t\\t\\t\\toutsiders. If one of them accuses the other of\\n\\t\\t\\t\\tunchastity, the accusation partly reflects on the accuser\\n\\t\\t\\t\\tas well. Moreover, the link which unites married people,\\n\\t\\t\\t\\teven where differences supervene, is sure to act as a\\n\\t\\t\\t\\tsteadying influence against the concoction of false\\n\\t\\t\\t\\tcharges of unchastity particularly where divorce is\\n\\t\\t\\t\\tallowed (as in Islam) for reasons other than unchastity.\\n\\t\\t\\t\\tSuppose a husband catches a wife in adultery. In the\\n\\t\\t\\t\\tnature of things four witnesses-or even one outside\\n\\t\\t\\t\\twitness-would be impossible. Yet after such an experience\\n\\t\\t\\t\\tit is against human nature that he can live a normal\\n\\t\\t\\t\\tmarried life. The matter is then left to the honour of\\n\\t\\t\\t\\tthe two spouses. If the husband can solemnly swear four\\n\\t\\t\\t\\ttimes to the fact, and in addition invoke a curse on\\n\\t\\t\\t\\thimself if he lies, that is prima facie evidence of the\\n\\t\\t\\t\\twife's guilt. But if the wife swears similarly four times\\n\\t\\t\\t\\tand similarly invokes a curse on herself, she is in law\\n\\t\\t\\t\\tacquitted of the guilt. If she does not take this step,\\n\\t\\t\\t\\tthe charge is held proved and the punishment follows. In\\n\\t\\t\\t\\teither case the marriage is dissolved, as it is against\\n\\t\\t\\t\\thuman nature that the parties can live together happily\\n\\t\\t\\t\\tafter such an incident."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "10",
    "NoteID": "2961",
    "Body": "Cf. xxiv. 11-14, and n. 2962, which illustrates the\\n\\t\\t\\t\\tmatter by a concrete instance."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "11",
    "NoteID": "2962",
    "Body": "The particular incident here referred to occurred on the\\n\\t\\t\\t\\treturn from the expedition to the Banui Mustaliq, A.H.\\n\\t\\t\\t\\t5-6. When the march was ordered, Hadhrat 'Aisha was not\\n\\t\\t\\t\\tin her tent, having gone to search for a valuable\\n\\t\\t\\t\\tnecklace she had dropped. As her litter was veiled, it\\n\\t\\t\\t\\twas not noticed that she was not in it, until the army\\n\\t\\t\\t\\treached the next halt. Meanwhile, finding the camp had\\n\\t\\t\\t\\tgone, she sat down to rest, hoping that some one would\\n\\t\\t\\t\\tcome back to fetch her when her absence was noticed. It\\n\\t\\t\\t\\twas night, and she fell asleep. Next morning she was\\n\\t\\t\\t\\tfound by Safwan, a Muhajir, who had been left behind the\\n\\t\\t\\t\\tcamp expressly to pick up anything inadvertently left\\n\\t\\t\\t\\tbehind. He put her on his camel and brought her, leading\\n\\t\\t\\t\\tthe camel on foot. This gave occasion to enemies to raise\\n\\t\\t\\t\\ta malicious scandal. The ringleader among them was the\\n\\t\\t\\t\\tchief of Madinah Hypocrites, 'Abudllah ibn Ubai, who is\\n\\t\\t\\t\\treferred to in the last clause of this verse. He had\\n\\t\\t\\t\\tother sins and enormities to his debit, and he was left\\n\\t\\t\\t\\tto the punishment of an unrepentant sinner, for he died\\n\\t\\t\\t\\tin that state. The minor tools were given the legal\\n\\t\\t\\t\\tpunishment of the law, and after penitence mended their\\n\\t\\t\\t\\tlives. They made good."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "11",
    "NoteID": "2963",
    "Body": "It is worse for a scandal to be whispered about with\\n\\t\\t\\t\\tbated breath, than that it should be brought into the\\n\\t\\t\\t\\tlight of day and disproved."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "11",
    "NoteID": "2964",
    "Body": "The ringleader: see n. 2962 above."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "12",
    "NoteID": "2965",
    "Body": "Both men and women were involved in spreading the\\n\\t\\t\\t\\tscandal. Their obvious duty was to put the best, not the\\n\\t\\t\\t\\tworst, construction on the acts of one of the \"mothers of\\n\\t\\t\\t\\tthe Believers\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "13",
    "NoteID": "2966",
    "Body": "If any persons took it seriously, it was their duty to\\n\\t\\t\\t\\tsearch for and produce the evidence, in the absence of\\n\\t\\t\\t\\twhich they themselves became guilty of slander."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "14",
    "NoteID": "2967",
    "Body": "Cf. xxiv. 10 above. It was Allah's mercy that saved them\\n\\t\\t\\t\\tfrom many evil consequences, both in this life and in the\\n\\t\\t\\t\\tHereafter, -in this life, because the Prophet's wise\\n\\t\\t\\t\\tmeasures nipped in the bud any incipient estrangement\\n\\t\\t\\t\\tbetween those nearest and dearest to him, and from a\\n\\t\\t\\t\\tspiritual aspect in that the minor agents in spreading\\n\\t\\t\\t\\tthe scandal repented and were forgiven. No doubts and\\n\\t\\t\\t\\tdivisions, no mutual distrust, were allowed to remain in\\n\\t\\t\\t\\ttheir hearts after the whole matter had been cleared up."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "15",
    "NoteID": "2968",
    "Body": "There are three things here reprobated by way of moral\\n\\t\\t\\t\\tteaching: (1) if others speak an evil word, that is no\\n\\t\\t\\t\\treason why you should allow it to defile your tongue; (2)\\n\\t\\t\\t\\tif you get a thought or suspicion which is not based on\\n\\t\\t\\t\\tyour certain knowledge, do not give it currency by giving\\n\\t\\t\\t\\tit expression; and (3) others may think it is a small\\n\\t\\t\\t\\tmatter to speak lightly of something which blasts a\\n\\t\\t\\t\\tperson's character or reputation: in the eyes of Allah it\\n\\t\\t\\t\\tis a most serious matter in any case, but specially when\\n\\t\\t\\t\\tit involves the honour and reputation of pious women."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "16",
    "NoteID": "2969",
    "Body": "The right course would have been to stop any further\\n\\t\\t\\t\\tcurrency of false slanders by ignoring them and at least\\n\\t\\t\\t\\trefusing to help in their circulation. The exclamation\\n\\t\\t\\t\\t\"Subhanaka\", \"Praise to Thee (O Allah)\", or \"Glory to\\n\\t\\t\\t\\tAllah!\" is an exclamation of surprise and disavowal as\\n\\t\\t\\t\\tmuch as to say, \"We do not believe it! And we shall have\\n\\t\\t\\t\\tnothing to do with you, O false slanderers!\""
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "19",
    "NoteID": "2970",
    "Body": "What mischiefs can be planned by Evil to delude simple\\n\\t\\t\\t\\tfolk who mean no harm in their own minds but who by\\n\\t\\t\\t\\tthoughtlessness are deluded step by step to become the\\n\\t\\t\\t\\tinstruments of Evil, may not be known to the most\\n\\t\\t\\t\\tinstructed of men, but it is all known to Allah. Man\\n\\t\\t\\t\\tshould therefore always be on his guard against the traps\\n\\t\\t\\t\\tof Evil, and it is only Allah's grace that can save him."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "20",
    "NoteID": "2971",
    "Body": "Note the refrain that comes four times in this passage,\\n\\t\\t\\t\\t\"Were it not for the grace and, mercy of Allah...\" Each\\n\\t\\t\\t\\ttime it has a different application. (1) In xxiv. 10, it\\n\\t\\t\\t\\twas in connection with the accusation of infidelity by\\n\\t\\t\\t\\tthe man against his wife, they were both reminded of\\n\\t\\t\\t\\tAllah's mercy and warned against suspicion and untruth.\\n\\t\\t\\t\\t(2) In xxiv. 14, the Believers were told to be wary of\\n\\t\\t\\t\\tfalse rumours lest they should cause pain and division\\n\\t\\t\\t\\tamong themselves: it is Allah's grace that keeps them\\n\\t\\t\\t\\tunited. (3) Here is an admonition for the future: there\\n\\t\\t\\t\\tmay be conspiracies and snares laid by evil against\\n\\t\\t\\t\\tsimple people; it is Allah's grace that protects them.\\n\\t\\t\\t\\t(4) In xxiv. 21, the general warning is directed to the\\n\\t\\t\\t\\tobservance of purity in act and in thought, concerning\\n\\t\\t\\t\\tone's self and concerning others: it is only Allah's\\n\\t\\t\\t\\tgrace that can keep that purity spotless, for He hears\\n\\t\\t\\t\\tprayers and knows of all the snares that are spread in\\n\\t\\t\\t\\tthe path of the good."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "21",
    "NoteID": "2972",
    "Body": "See last note."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "21",
    "NoteID": "2973",
    "Body": "Spotless purity in thought, word, and deed, includes the\\n\\t\\t\\t\\tdisposition to put the best construction on the motives\\n\\t\\t\\t\\tof others, so that we ascribe no evil motive to the\\n\\t\\t\\t\\tseeming indiscretions of virtuous people. Such a high\\n\\t\\t\\t\\tstandard can only come by the grace of Allah, Who hears\\n\\t\\t\\t\\tall prayers and knows all the temptations to which human\\n\\t\\t\\t\\tnature is subject. His Will and Plan make both for\\n\\t\\t\\t\\tspiritual protection and spiritual peace, and we must\\n\\t\\t\\t\\tplace ourselves trustingly in His hands."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "22",
    "NoteID": "2974",
    "Body": "The immediate reference was to Hadhrat Abu Bakr, the\\n\\t\\t\\t\\tfather of Hadhrat 'Aisha. He was blessed both with\\n\\t\\t\\t\\tspiritual grace from Allah and with ample means, which he\\n\\t\\t\\t\\talways used in the service of Islam and of Muslims. One\\n\\t\\t\\t\\tof the slanderers of Hadhrat 'Aisha turned out to be\\n\\t\\t\\t\\tMistah, a cousin of Hadhrat Abu Bakr, whom he had been in\\n\\t\\t\\t\\tthe habit of supporting. Naturally Hadhrat Abu Bakr\\n\\t\\t\\t\\twished to stop that aid, but according to the highest\\n\\t\\t\\t\\tstandards of Muslim ethics he was asked to forgive and\\n\\t\\t\\t\\tforget, which he did, with the happiest results to the\\n\\t\\t\\t\\tpeace and unity of the Muslim community. But the general\\n\\t\\t\\t\\tapplication holds good for all time. A generous patron\\n\\t\\t\\t\\tshould not, in personal anger, withdraw his support even\\n\\t\\t\\t\\tfor serious faults if the delinquent repents and mends\\n\\t\\t\\t\\this ways. If Allah forgives us, who are we to refuse\\n\\t\\t\\t\\tforgiveness to our fellows?"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "23",
    "NoteID": "2975",
    "Body": "Good women are sometimes indiscreet because they think of\\n\\t\\t\\t\\tno evil. But even such innocent indiscretion lands them,\\n\\t\\t\\t\\tand those who hold them dear, in difficulties. Such was\\n\\t\\t\\t\\tthe case with Hadhrat 'Aisha, who was in extreme pain and\\n\\t\\t\\t\\tanguish for a whole month because of the slanders spread\\n\\t\\t\\t\\tabout her. Her husband and her father were also placed in\\n\\t\\t\\t\\ta most awkward predicament, considering their position\\n\\t\\t\\t\\tand the great work in which they were engaged. But\\n\\t\\t\\t\\tunprincipled people, who start false slanders, and their\\n\\t\\t\\t\\tunthinking tools who help in spreading such slanders, are\\n\\t\\t\\t\\tguilty of the gravest spiritual offence, and their worst\\n\\t\\t\\t\\tpunishment is the deprivation of Allah's grace, which is\\n\\t\\t\\t\\tthe meaning of a state of Curse."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "24",
    "NoteID": "2976",
    "Body": "Our own limbs and faculties are the strongest witnesses\\n\\t\\t\\t\\tagainst us if we misuse them for evil deeds instead of\\n\\t\\t\\t\\tusing them for the good deeds for which they were given\\n\\t\\t\\t\\tto us."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "25",
    "NoteID": "2977",
    "Body": "All that we thought of hiding will be clear as day before\\n\\t\\t\\t\\tAllah's Judgment Seat, because He is the very essence of\\n\\t\\t\\t\\tTruth and Reality-He is the true Light (xxiv. 35), of\\n\\t\\t\\t\\twhich all physical light is merely a type or reflection."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "26",
    "NoteID": "2978",
    "Body": "The pure consort with the pure, and the impure with the\\n\\t\\t\\t\\timpure. If the impure, out of the impurity of their\\n\\t\\t\\t\\tthoughts, or imaginations, impute any evil to the pure,\\n\\t\\t\\t\\tthe pure are not affected by it, but they should avoid\\n\\t\\t\\t\\tall occasions for random talk."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "26",
    "NoteID": "2979",
    "Body": "Forgiveness for any indiscretion which they may have\\n\\t\\t\\t\\tinnocently committed, and spiritual provision or\\n\\t\\t\\t\\tprotection against the assaults of Evil. It is also meant\\n\\t\\t\\t\\tthat the more the satans attempt to defame or slander\\n\\t\\t\\t\\tthem, the more triumphantly will they be vindicated and\\n\\t\\t\\t\\tprovided with the physical and moral good which will\\n\\t\\t\\t\\tadvance their real life."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "27",
    "NoteID": "2980",
    "Body": "The conventions of propriety and privacy are essential to\\n\\t\\t\\t\\ta refined life of goodness and purity. The English saying\\n\\t\\t\\t\\tthat an Englishman's home is his castle, suggests a\\n\\t\\t\\t\\tcertain amount of exclusiveness and defiance. The Muslim\\n\\t\\t\\t\\tprinciple of asking respectful permission and exchanging\\n\\t\\t\\t\\tsalutations ensures privacy without exclusiveness, and\\n\\t\\t\\t\\tfriendliness without undue familiarity."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "28",
    "NoteID": "2981",
    "Body": "That is, if no one replies; there may be people in the\\n\\t\\t\\t\\thouse not in a presentable state. Or, even if the house\\n\\t\\t\\t\\tis empty, you have no right to enter it until you obtain\\n\\t\\t\\t\\tthe owner's permission, wherever he may be. The fact of\\n\\t\\t\\t\\tyour not receiving a reply does not entitle you to enter\\n\\t\\t\\t\\twithout permission. You should wait, or knock twice or\\n\\t\\t\\t\\tthree times, and withdraw in case no permission is\\n\\t\\t\\t\\treceived. If you are actually asked to withdraw, as the\\n\\t\\t\\t\\tinmates are not in a condition to receive you, you should\\n\\t\\t\\t\\ta fortiori withdraw, either for a time, or altogether, as\\n\\t\\t\\t\\tthe inmates may wish you to do. Even if they are your\\n\\t\\t\\t\\tfriends, you have no right to take them by surprise or\\n\\t\\t\\t\\tenter against their wishes. Your own purity of life and\\n\\t\\t\\t\\tconduct as well as of motives is thus tested."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "29",
    "NoteID": "2982",
    "Body": "The rule about dwelling-houses is strict, because privacy\\n\\t\\t\\t\\tis precious, and essential to a refined, decent, and\\n\\t\\t\\t\\twell-ordered life. Such a rule of course does not apply\\n\\t\\t\\t\\tto houses used for other useful purposes, such as an inn\\n\\t\\t\\t\\tor caravanserai, or a shop, or a warehouse. But even\\n\\t\\t\\t\\there, of course, implied permission from the owner is\\n\\t\\t\\t\\tnecessary as a matter of common-sense. The question in\\n\\t\\t\\t\\tthis passage is that of refined privacy, not that of\\n\\t\\t\\t\\trights of ownership."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "30",
    "NoteID": "2983",
    "Body": "The rule of modesty applies to men as well as women. A\\n\\t\\t\\t\\tbrazen stare by a man at a woman (or even at a man) is a\\n\\t\\t\\t\\tbreach of refined manners. Where sex is concerned,\\n\\t\\t\\t\\tmodesty is not only \"good form\": it is not only to guard\\n\\t\\t\\t\\tthe weaker sex, but also to guard the spiritual good of\\n\\t\\t\\t\\tthe stronger sex."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "2984",
    "Body": "The need for modesty is the same in both men and women.\\n\\t\\t\\t\\tBut on account of the differentiation of the sexes in\\n\\t\\t\\t\\tnature, temperaments, and social life, a greater amount\\n\\t\\t\\t\\tof privacy is required for women than for men, especially\\n\\t\\t\\t\\tin the matter of dress and the uncovering of the bosom."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "2985",
    "Body": "Zinat means both natural beauty and artificial ornaments.\\n\\t\\t\\t\\tI think both are implied here, but chiefly the former.\\n\\t\\t\\t\\tThe woman is asked not to make a display of her figure\\n\\t\\t\\t\\texcept to the following classes of people: (1) her\\n\\t\\t\\t\\thusband, (2) her near relatives whom a certain amount of\\n\\t\\t\\t\\tneglige is permissible; (3) her women, (4) slaves, male\\n\\t\\t\\t\\tand female, as they would be in constant attendance; but\\n\\t\\t\\t\\tthis item would now be blank, with the abolition of\\n\\t\\t\\t\\tslavery; (5) men who are free from sexual desire and who\\n\\t\\t\\t\\tusually frequent the houses; and (6) infants or small\\n\\t\\t\\t\\tchildren before they get a sense of sex. Cf. also xxxiii.\\n\\t\\t\\t\\t59."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "2986",
    "Body": "It is one of the tricks of showy or unchaste women to\\n\\t\\t\\t\\ttinkle their ankle ornaments, to draw attention to\\n\\t\\t\\t\\tthemselves,"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "2987",
    "Body": "While all these details of the purity and good form of\\n\\t\\t\\t\\tdomestic life are being brought to our attention, we are\\n\\t\\t\\t\\tclearly reminded that the chief object we should hold in\\n\\t\\t\\t\\tview is our spiritual welfare. All our brief life on this\\n\\t\\t\\t\\tearth is a probation, and we must make our individual,\\n\\t\\t\\t\\tdomestic, and social life all contribute to our holiness,\\n\\t\\t\\t\\tso that we can get the real success and bliss which is\\n\\t\\t\\t\\tthe aim of our spiritual endeavor."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "32",
    "NoteID": "2988",
    "Body": "The subject of sex ethics and manners brings us to the\\n\\t\\t\\t\\tsubject of marriage. Single (ayama, plural of Aiyim) here\\n\\t\\t\\t\\tmeans any one not in the bond of wedlock, whether\\n\\t\\t\\t\\tunmarried or lawfully divorced, or widowed."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "32",
    "NoteID": "2989",
    "Body": "Cf. v. 57. Allah's mercy is for all: it is not confined\\n\\t\\t\\t\\tto a class or grade of people."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "2990",
    "Body": "A Muslim marriage requires some sort of a dower for the\\n\\t\\t\\t\\twife. If the man cannot afford that, he must wait and\\n\\t\\t\\t\\tkeep himself chaste. It is no excuse for him to say that\\n\\t\\t\\t\\the must satisfy his natural cravings within or outside\\n\\t\\t\\t\\tmarriage. It must be within marriage."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "2991",
    "Body": "The law of slavery in the legal sense of the term is now\\n\\t\\t\\t\\tobsolete. While it had any meaning, Islam made the\\n\\t\\t\\t\\tslave's lot as easy as possible. A slave, male or female,\\n\\t\\t\\t\\tcould ask for conditional manumission by a written deed\\n\\t\\t\\t\\tfixing the amount required for manumission and allowing\\n\\t\\t\\t\\tthe slave meanwhile to earn money by lawful means. Such a\\n\\t\\t\\t\\tdeed was not to be refused if the request was genuine and\\n\\t\\t\\t\\tthe slave had character. Not only that, but the master is\\n\\t\\t\\t\\tdirected to help with money out of his own resources in\\n\\t\\t\\t\\torder to enable the slave to earn his or her own liberty."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "2992",
    "Body": "Where slavery was legal, what is now called the \"white\\n\\t\\t\\t\\tslave traffic\" was carried on by wicked people like\\n\\t\\t\\t\\t'Abdullah ibn Ubai, the Hypocrite leader at Madinah. This\\n\\t\\t\\t\\tis absolutely condemned. While modern nations have\\n\\t\\t\\t\\tabolished ordinary slavery, the \"White Slave Traffic\" is\\n\\t\\t\\t\\tstill a big social problem in individual States. Here it\\n\\t\\t\\t\\tis absolutely condemned. No more despicable trade can be\\n\\t\\t\\t\\timagined."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "2993",
    "Body": "I have translated \"in\" (literally, \"if\") by \"when\"\\n\\t\\t\\t\\tbecause this is not a conditional clause but an\\n\\t\\t\\t\\texplanatory clause, explaining the meaning of \"force\".\\n\\t\\t\\t\\t\"Forcing\" a person necessarily means that it is against\\n\\t\\t\\t\\tthe wish or inclination of the person forced. Even if\\n\\t\\t\\t\\tthey were to give a formal consent, it is not valid."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "2994",
    "Body": "The poor unfortunate girls, who are victims of such a\\n\\t\\t\\t\\tnefarious trade, will yet find mercy from Allah, whose\\n\\t\\t\\t\\tbounties extend to all His creatures."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "34",
    "NoteID": "2995",
    "Body": "This prepares the way for the magnificent Verse of Light\\n\\t\\t\\t\\tthat follows, and its sublime meaning."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "2996",
    "Body": "Embedded within certain directions concerning a refined\\n\\t\\t\\t\\tdomestic and social life, comes this glorious parable of\\n\\t\\t\\t\\tlight, which contains layer upon layer of transcendent\\n\\t\\t\\t\\ttruth about spiritual mysteries. No notes can do adequate\\n\\t\\t\\t\\tjustice to its full meaning. Volumes have been written on\\n\\t\\t\\t\\tthis subject. In these notes I propose to explain the\\n\\t\\t\\t\\tsimplest meaning of this passage."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "2997",
    "Body": "The physical light is but a reflection of the true Light\\n\\t\\t\\t\\tin the world of Reality, and that true Light is Allah. We\\n\\t\\t\\t\\tcan only think of Allah in terms of our phenomenal\\n\\t\\t\\t\\texperience, and in the phenomenal world, light is the\\n\\t\\t\\t\\tpurest thing we know, but physical light has drawbacks\\n\\t\\t\\t\\tincidental to its physical nature: eg. (1) it is\\n\\t\\t\\t\\tdependent upon some source external to itself; (2) it is\\n\\t\\t\\t\\ta passing phenomenon; if we take it to be a form of\\n\\t\\t\\t\\tmotion or energy it is unstable, like all physical\\n\\t\\t\\t\\tphenomena; (3) it is dependent on space and time; its\\n\\t\\t\\t\\tspeed is 186,000 miles per second, and there are stars\\n\\t\\t\\t\\twhose light takes thousands of years before it reaches\\n\\t\\t\\t\\tthe earth. The perfect Light of Allah is free from any\\n\\t\\t\\t\\tsuch defects."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "2998",
    "Body": "The first three points in the Parable center round the\\n\\t\\t\\t\\tsymbols of the Niche, the Lamp, and the Glass. (1) The\\n\\t\\t\\t\\tNiche (Mishkat) is the little shallow recess in the wall\\n\\t\\t\\t\\tof an Eastern house, fairly high from the ground, in\\n\\t\\t\\t\\twhich a light (before the days of electricity) was\\n\\t\\t\\t\\tusually placed. Its height enabled it to diffuse the\\n\\t\\t\\t\\tlight in the room and minimised the shadows. The\\n\\t\\t\\t\\tbackground of the wall and the sides of the niche helped\\n\\t\\t\\t\\tto throw the light well into the room, and if the wall\\n\\t\\t\\t\\twas white-washed, it also acted as a reflector: the\\n\\t\\t\\t\\topening in front made the way for the light. So with the\\n\\t\\t\\t\\tspiritual Light; it is placed high, above worldly things;\\n\\t\\t\\t\\tit has a niche or habitation of its own, in Revelation\\n\\t\\t\\t\\tand other Signs of Allah; its access to men is by a\\n\\t\\t\\t\\tspecial Way, open to all, yet closed to those who refuse\\n\\t\\t\\t\\tits rays. (2) The Lamp is the core of the spiritual\\n\\t\\t\\t\\tTruth, which is the real illumination; the Niche is\\n\\t\\t\\t\\tnothing without it; the Niche is actually made for it.\\n\\t\\t\\t\\t(3) The Glass is the transparent medium through which the\\n\\t\\t\\t\\tLight passes. On the one hand, it protects the light from\\n\\t\\t\\t\\tmoths and other forms of low life and from gusts of wind,\\n\\t\\t\\t\\tand on the other, it transmits the fight through a medium\\n\\t\\t\\t\\twhich is made up of and akin to the grosser substances of\\n\\t\\t\\t\\tthe earth (such as sand, soda, potash, etc.), so arranged\\n\\t\\t\\t\\tas to admit the subtle to the gross by its transparency.\\n\\t\\t\\t\\tSo the spiritual Truth has to be filtered through human\\n\\t\\t\\t\\tlanguage or human intelligence to make it intelligible to\\n\\t\\t\\t\\tmankind."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "2999",
    "Body": "The glass by itself does not shine. But when the light\\n\\t\\t\\t\\tcomes into it, it shines like a brilliant star. So men of\\n\\t\\t\\t\\tGod, who preach Allah's Truth, are themselves illuminated\\n\\t\\t\\t\\tby Allah's light and become the illuminating media\\n\\t\\t\\t\\tthrough which that Light spreads and permeates human\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "3000",
    "Body": "The olive tree is not a very impressive tree in its\\n\\t\\t\\t\\toutward appearance. Its leaves have a dull greenish-brown\\n\\t\\t\\t\\tcolour, and in size it is inconspicuous. But its oil is\\n\\t\\t\\t\\tused in sacred ceremonies and forms a wholesome\\n\\t\\t\\t\\tingredient of food. The fruit has a specially fine\\n\\t\\t\\t\\tflavour. Cf. n. 2880 to xxiii. 20. For the illuminating\\n\\t\\t\\t\\tquality of its oil, see n. 3002 below."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "3001",
    "Body": "This Olive is not localised. It is neither of the East\\n\\t\\t\\t\\tnor of the West. It is universal, for such is Allah's\\n\\t\\t\\t\\tLight. As applied to the olive, there is also a more\\n\\t\\t\\t\\tliteral meaning, which can be allegorised in a different\\n\\t\\t\\t\\tway. An olive tree with an eastern aspect gets only the\\n\\t\\t\\t\\trays of the morning sun; one with a western aspect, only\\n\\t\\t\\t\\tthe rays of the western sun. In the northern hemisphere\\n\\t\\t\\t\\tthe south aspect will give the sun's rays a great part of\\n\\t\\t\\t\\tthe day, while a north aspect will shut them out\\n\\t\\t\\t\\taltogether, and vice versa in the southern hemisphere.\\n\\t\\t\\t\\tBut a tree in the open plain or on a hill will get\\n\\t\\t\\t\\tperpetual sunshine by day; it will be more mature, and\\n\\t\\t\\t\\tthe fruit and oil will be of superior quality. So Allah's\\n\\t\\t\\t\\tlight is not localised or immature: it is perfect and\\n\\t\\t\\t\\tuniversal."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "3002",
    "Body": "Pure olive oil is beautiful in colour, consistency, and\\n\\t\\t\\t\\tilluminating power. The world has tried all kinds of\\n\\t\\t\\t\\tilluminants, and for economic reasons or convenience, one\\n\\t\\t\\t\\treplaces another. But for coolness, comfort to the eyes,\\n\\t\\t\\t\\tand steadiness, vegetable oils are superior to\\n\\t\\t\\t\\telectricity, mineral oils, and animal oils. And among\\n\\t\\t\\t\\tvegetable oils, olive oil takes a high place and deserves\\n\\t\\t\\t\\tits sacred associations. Its purity is almost like light\\n\\t\\t\\t\\titself: you may suppose it to be almost light before it\\n\\t\\t\\t\\tis lit. So with spiritual Truth: it illuminates the mind\\n\\t\\t\\t\\tand understanding imperceptibly, almost before the human\\n\\t\\t\\t\\tmind and heart have been consciously touched by it."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "3003",
    "Body": "Glorious, illimitable Light, which cannot be described or\\n\\t\\t\\t\\tmeasured. And there are grades and grades of it, passing\\n\\t\\t\\t\\ttranscendently into regions of spiritual height, which\\n\\t\\t\\t\\tman's imagination can scarcely conceive of. The topmost\\n\\t\\t\\t\\tpinnacle is the true prototypal Light, the real Light, of\\n\\t\\t\\t\\twhich all others were reflections, the Light of Allah."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "36",
    "NoteID": "3004",
    "Body": "The punctuation of the Arabic text makes it necessary to\\n\\t\\t\\t\\tcarry back the adverbial clause \"in houses\", to something\\n\\t\\t\\t\\tin the last verse, say \"Lit from a blessed Tree\",-the\\n\\t\\t\\t\\tintervening clauses being treated as parenthetical."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "36",
    "NoteID": "3005",
    "Body": "That is, in all places of pure worship; but some\\n\\t\\t\\t\\tCommentators understand special Mosques, such as the\\n\\t\\t\\t\\tKa'ba in Makkah or Mosques in Madinah or Jerusalem; for\\n\\t\\t\\t\\tthese are specially held in honour."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "36",
    "NoteID": "3006",
    "Body": "In the evenings: the Arabic word is Asal, a plural of a\\n\\t\\t\\t\\tplural, to imply emphasis: I have rendered that shade of\\n\\t\\t\\t\\tmeaning by adding the words \"again and again\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "37",
    "NoteID": "3007",
    "Body": "\"Remembrance of Allah\" is wider than Prayer: it includes\\n\\t\\t\\t\\tsilent contemplation, and active service of Allah and His\\n\\t\\t\\t\\tcreatures. The regular Prayers and regular Charity are\\n\\t\\t\\t\\tthe social acts performed through the organised\\n\\t\\t\\t\\tcommunity."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "37",
    "NoteID": "3008",
    "Body": "Some renderings suggest the effects of terror on the Day\\n\\t\\t\\t\\tof Judgment. But here we are considering the case of the\\n\\t\\t\\t\\trighteous, whose \"fear\" of Allah is akin to love and\\n\\t\\t\\t\\treverence and who (as the next verse shows) hope for the\\n\\t\\t\\t\\tbest reward from Allah. But the world they will meet will\\n\\t\\t\\t\\tbe a wholly changed world."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "38",
    "NoteID": "3009",
    "Body": "The best of the righteous do not deserve the reward that\\n\\t\\t\\t\\tthey get: all their faults are forgiven, and only their\\n\\t\\t\\t\\tbest actions are considered in the reward that they get.\\n\\t\\t\\t\\tNay, more! Out of the unbounded Grace of Allah even more\\n\\t\\t\\t\\tis added to them. For in giving rewards, Allah's bounty\\n\\t\\t\\t\\tis boundless."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "39",
    "NoteID": "3010",
    "Body": "We have had various metaphors to give us an idea of the\\n\\t\\t\\t\\tbeneficent Light of Allah. Now we have contrasted\\n\\t\\t\\t\\tmetaphors to enable us to see those who deny or refuse\\n\\t\\t\\t\\tthat Light, and are overwhelmed in utter darkness. The\\n\\t\\t\\t\\tLight (of Allah) is an absolute Reality, and is mentioned\\n\\t\\t\\t\\tfirst, and the souls that follow that Light are a\\n\\t\\t\\t\\treflected reality and are mentioned after the Light. On\\n\\t\\t\\t\\tthe other hand the Darkness is not a reality in itself,\\n\\t\\t\\t\\tbut a negation of reality; the reflected existences that\\n\\t\\t\\t\\trefuse the Light are mentioned, and then their state,\\n\\t\\t\\t\\twhich is Unreality. Two metaphors are given: a mirage, in\\n\\t\\t\\t\\tthis verse, and the depths of darkness in the sea, in the\\n\\t\\t\\t\\tnext,"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "39",
    "NoteID": "3011",
    "Body": "The mirage, of which I have seen several instances in the\\n\\t\\t\\t\\tArabian deserts and in Egypt, is a strange phenomenon of\\n\\t\\t\\t\\tillusion. It is a trick of our vision. In the language of\\n\\t\\t\\t\\tour Parable, it rejects the Light which shows us the\\n\\t\\t\\t\\tTruth, and deceives us with Falsehood. A lonely traveller\\n\\t\\t\\t\\tin a desert, nearly dying of thirst, sees a broad sheet\\n\\t\\t\\t\\tof water. He goes in that direction, lured on and on, but\\n\\t\\t\\t\\tfinds nothing at all. He dies in protracted agony."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "39",
    "NoteID": "3012",
    "Body": "The rebel against Allah finds himself like the man\\n\\t\\t\\t\\tdeluded by a mirage. The Truth which he rejected is\\n\\t\\t\\t\\talways with him. The mirage which he accepted leads to\\n\\t\\t\\t\\this destruction."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "40",
    "NoteID": "3013",
    "Body": "What a graphic picture of darkness in the depths of the\\n\\t\\t\\t\\tOcean, wave upon wave, and on top of all, dense dark\\n\\t\\t\\t\\tclouds! There is so little light even in ordinary depths\\n\\t\\t\\t\\tof the Ocean that fishes which live there lose their eyes\\n\\t\\t\\t\\tas useless organs."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "40",
    "NoteID": "3014",
    "Body": "A contrast to \"Light upon Light\" in xxiv. 35 above."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "40",
    "NoteID": "3015",
    "Body": "The true source of Light in the world of Reatity is\\n\\t\\t\\t\\tAllah, and anyone who cuts himself off from that Light is\\n\\t\\t\\t\\tin utter darkness indeed, for it is the negation of the\\n\\t\\t\\t\\tonly true light, and not merely relative darkness, like\\n\\t\\t\\t\\tthat which we see, say, in the shadows of moonlight."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "41",
    "NoteID": "3016",
    "Body": "Cf. xxi. 19-20."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "41",
    "NoteID": "3017",
    "Body": "All denizens of the heavens, such as angels, all denizens\\n\\t\\t\\t\\tof the earth (including the waters) such as man, animals,\\n\\t\\t\\t\\tinsects, fishes, etc., and all denizens of the air, such\\n\\t\\t\\t\\tas birds, celebrate the praises of Allah. Each has his\\n\\t\\t\\t\\town mode of prayer and praise. It is not necessarily with\\n\\t\\t\\t\\twords, for language (as we know it) is peculiar to man.\\n\\t\\t\\t\\tBut actions and other modes of self-expression recognise\\n\\t\\t\\t\\tand declare the Glory of Allah."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "42",
    "NoteID": "3018",
    "Body": "To Him we belong; and to Him we shall return. Not only\\n\\t\\t\\t\\twe, but all Creation, proclaims this in the whole world."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "43",
    "NoteID": "3019",
    "Body": "Artists, or lovers of nature, or observers of clouds will\\n\\t\\t\\t\\tappreciate this description of cloud effects-thin clouds\\n\\t\\t\\t\\tfloating about in fantastic shapes, joining together and\\n\\t\\t\\t\\ttaking body and substance, then emerging as heavy clouds\\n\\t\\t\\t\\theaped up, which condense and pour forth their rain. Then\\n\\t\\t\\t\\tthe heavy dark clouds in the upper regions, that bring\\n\\t\\t\\t\\thail,-how distinct and yet how similar! They are truly\\n\\t\\t\\t\\tlike mountain masses! And when the hailstones fall, how\\n\\t\\t\\t\\tlocal their area! It hits some localities and leaves free\\n\\t\\t\\t\\tothers almost interlaced! And the lightning-how blinding\\n\\t\\t\\t\\tflashes come from thunderous clouds! In this Book of\\n\\t\\t\\t\\tNature can we not see the hand of the powerful and\\n\\t\\t\\t\\tbeneficent Allah?"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "44",
    "NoteID": "3020",
    "Body": "His power, wisdom, and goodness are shown no less in the\\n\\t\\t\\t\\tregular phenomena of nature like the succession of Day\\n\\t\\t\\t\\tand Night, than in the seasonal or seemingly irregular\\n\\t\\t\\t\\tmovements of clouds and rain and hail and lightning.\\n\\t\\t\\t\\tThose who have the spiritual vision can read this Book of\\n\\t\\t\\t\\tAllah with delight and instruction."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "45",
    "NoteID": "3021",
    "Body": "Cf. xxi. 30, n. 2691. Protoplasm is the basis of all\\n\\t\\t\\t\\tliving matter, and \"the vital power of protoplasm seems\\n\\t\\t\\t\\tto depend on the constant presence of water\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "45",
    "NoteID": "3022",
    "Body": "The creeping things include worms and lowly forms of\\n\\t\\t\\t\\tanimal life as well as reptiles (like snakes),\\n\\t\\t\\t\\tcentipedes, spiders, and insects. Where these have legs\\n\\t\\t\\t\\tthey are small, and the description of creeping or\\n\\t\\t\\t\\tcrawling is more applicable to them than that of walking.\\n\\t\\t\\t\\tFishes and sea-animals generally cannot be said to walk:\\n\\t\\t\\t\\ttheir swimming is like \"creeping on their bellies\".\\n\\t\\t\\t\\tTwo-legged animals include birds and man. Most of the\\n\\t\\t\\t\\tmammals walk on four legs. This includes the whole of the\\n\\t\\t\\t\\tanimal world."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "45",
    "NoteID": "3023",
    "Body": "In Allah's Will and Plan, the variety of forms and habits\\n\\t\\t\\t\\tamong animals is adapted to their various modes of life\\n\\t\\t\\t\\tand stages of biological development."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "47",
    "NoteID": "3024",
    "Body": "The Hypocrites, far from profiting from Allah's Light and\\n\\t\\t\\t\\tRevelation, or declaring their open hostility, play fast\\n\\t\\t\\t\\tand loose according to their selfish worldly aims."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "49",
    "NoteID": "3025",
    "Body": "The Hypocrites only wanted to go to the judge who they\\n\\t\\t\\t\\tthought was likely to give judgment in their favour. If\\n\\t\\t\\t\\ttheir case was incontestable, and justice was on their\\n\\t\\t\\t\\tside, they readily came to the Prophet, knowing that he\\n\\t\\t\\t\\twas just and would judge in their favour, even against\\n\\t\\t\\t\\this own adherents. But if they had done wrong, an\\n\\t\\t\\t\\timpartial judge was not to their taste. They would rather\\n\\t\\t\\t\\tgo to some one who would tip the balance in their favour!\\n\\t\\t\\t\\tThis form of selfishness and iniquity was not confined to\\n\\t\\t\\t\\tthe Hypocrites of Madinah. It is common in all ages, and\\n\\t\\t\\t\\tshould be suppressed."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "50",
    "NoteID": "3026",
    "Body": "The real fact is that their conscience smites them. They\\n\\t\\t\\t\\tknow their own iniquity, and do not wish to go before a\\n\\t\\t\\t\\tjust judge who would be open to no influence and would be\\n\\t\\t\\t\\tsure to give a righteous decree."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "51",
    "NoteID": "3027",
    "Body": "Cf. ii. 285. Contrast with it the attitude of the\\n\\t\\t\\t\\tUnbelievers or Hypocrites, who say aloud, \"we hear\", but\\n\\t\\t\\t\\tintend in their hearts to disobey (ii. 93)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "51",
    "NoteID": "3028",
    "Body": "True happiness, whether here or in the Hereafter, is not\\n\\t\\t\\t\\tto be attained by fraud or duplicity: it is the privilege\\n\\t\\t\\t\\tof those who listen attentively to good counsel and carry\\n\\t\\t\\t\\tit out in their lives."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "53",
    "NoteID": "3029",
    "Body": "Some people, especially hypocrites, give hyperbolic\\n\\t\\t\\t\\tassurances, as did the Madinah Hypocrites to the holy\\n\\t\\t\\t\\tProphet, that they would do any bidding, even to the\\n\\t\\t\\t\\tforsaking of their hearths and homes. To this they are\\n\\t\\t\\t\\tready to swear their strongest oaths, which mean nothing.\\n\\t\\t\\t\\tThey are asked to spare their oaths, and quietly do at\\n\\t\\t\\t\\tleast such unheroic duties as they are asked to do in\\n\\t\\t\\t\\tevery-day life. Idle words are not of the least value.\\n\\t\\t\\t\\tAllah will judge by your actions, and He knows all,\\n\\t\\t\\t\\twhether it is open or secret."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "54",
    "NoteID": "3030",
    "Body": "'If you disobey Allah's commands as explained by His\\n\\t\\t\\t\\tProphet, you are not going to be forced. The Prophet's\\n\\t\\t\\t\\tmission is to train your will and explain clearly all the\\n\\t\\t\\t\\timplications of your conduct. The responsibility for your\\n\\t\\t\\t\\tconduct rests entirely on yourselves.'"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "55",
    "NoteID": "3031",
    "Body": "Three things are promised here, to those who have Faith\\n\\t\\t\\t\\tand obey Allah's Law: (1) that they will inherit power\\n\\t\\t\\t\\tand authority in the land, not for any selfish purposes\\n\\t\\t\\t\\tof theirs nor by way of favouritism, but in order that\\n\\t\\t\\t\\tthey may maintain Allah's Law; (2) that the Religion of\\n\\t\\t\\t\\tRight, which Allah has chosen for them, will be openly\\n\\t\\t\\t\\testablished, and will suppress all wrong and oppression;\\n\\t\\t\\t\\t(3) that the righteous will live in peace and security,\\n\\t\\t\\t\\tinstead of having to suffer persecution, or leave their\\n\\t\\t\\t\\thearths and homes for the cause of Allah, or practise the\\n\\t\\t\\t\\trites of their Faith in secret."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "55",
    "NoteID": "3032",
    "Body": "If this verse was revealed about the time of the Battle\\n\\t\\t\\t\\tof the Ditch (Khandaq), also called the Battle of the\\n\\t\\t\\t\\tConfederates (Ahzab), A.H. 4-5, we can imagine the\\n\\t\\t\\t\\tcomfort it gave to the Muslims who were besieged in\\n\\t\\t\\t\\tMadinah by a force ten times their number. The Muslims\\n\\t\\t\\t\\tthen fived in a state of great suspense and danger, and\\n\\t\\t\\t\\tunder arms for days on end. (See xxxiii. 9-20). The\\n\\t\\t\\t\\tsecurity and authority they were promised came to them\\n\\t\\t\\t\\tsubsequently in abundant measures."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "3033",
    "Body": "We now come to rules of decorum within the family circle\\n\\t\\t\\t\\tin refined society. Servants and children have rather\\n\\t\\t\\t\\tmore freedom of access, as they come and go at all hours,\\n\\t\\t\\t\\tand there is less ceremony with them. But even in their\\n\\t\\t\\t\\tcase there are limitations. During the night, before\\n\\t\\t\\t\\tmorning prayer, i.e., before dawn, they must discreetly\\n\\t\\t\\t\\task for permission before they enter, partly because they\\n\\t\\t\\t\\tmust not unnecessarily disturb people asleep, and partly\\n\\t\\t\\t\\tbecause the people are then undressed. The same applies\\n\\t\\t\\t\\tto the time for the midday siesta, and again to the time\\n\\t\\t\\t\\tafter night prayers, when people usually undress and tum\\n\\t\\t\\t\\tin to sleep. For grown-ups the rule is stricter: they\\n\\t\\t\\t\\tmust ask permission to come in at all times (xxiv. 59)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "3034",
    "Body": "This would mean slaves in a regime of slavery."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "3035",
    "Body": "I have translated \"come of age\" euphemistically for\\n\\t\\t\\t\\t\"attain the age of puberty\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "3036",
    "Body": "It is a mark of refinement for ladies and gentlemen not\\n\\t\\t\\t\\tto be slipshod or vulgarly familiar, in dress, manners,\\n\\t\\t\\t\\tor speech; and Islam aims at making every Muslim man or\\n\\t\\t\\t\\twoman, however humble in station, a refined gentleman or\\n\\t\\t\\t\\tlady, so that he or she can climb the ladder of spiritual\\n\\t\\t\\t\\tdevelopment with humble confidence in Allah, and with the\\n\\t\\t\\t\\tcooperation of his brothers and sisters in Islam. The\\n\\t\\t\\t\\tprinciples here laid down apply, if they are interpreted\\n\\t\\t\\t\\twith due elasticity, even if social and domestic habits\\n\\t\\t\\t\\tchange, with changes in climate or in racial and personal\\n\\t\\t\\t\\thabits. Punctilious self-respect and respect for others,\\n\\t\\t\\t\\tin small things as well as great, are the key-notes in\\n\\t\\t\\t\\tthese simple rules of etiquette."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "59",
    "NoteID": "3037",
    "Body": "Children among you: i.e., in your house, not necessarily\\n\\t\\t\\t\\tyour own children. All in the house, including the\\n\\t\\t\\t\\tstranger within your gate, must conform to these\\n\\t\\t\\t\\twholesome rules."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "59",
    "NoteID": "3038",
    "Body": "Those before them, i.e., those who have already been\\n\\t\\t\\t\\tmentioned in the previous verse. It is suggested that\\n\\t\\t\\t\\teach generation as it grows up should follow the\\n\\t\\t\\t\\twholesome traditions of its predecessors. While they were\\n\\t\\t\\t\\tchildren, they behaved like children: when they grow up,\\n\\t\\t\\t\\tthey must behave like grown-ups."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "59",
    "NoteID": "3039",
    "Body": "The refrain connects up this verse with the last verse,\\n\\t\\t\\t\\twhose meaning is completed here. The slight variation\\n\\t\\t\\t\\t(\"His Signs\" here, against \"the Signs\" there) shows that\\n\\t\\t\\t\\tthis verse is more personal, as referring to children who\\n\\t\\t\\t\\thave now become responsible men and women."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "60",
    "NoteID": "3040",
    "Body": "For elderly women in the home the rules of dress and\\n\\t\\t\\t\\tdecorum are not so exacting as for younger women, but\\n\\t\\t\\t\\tthey are also enjoined to study modesty, both because it\\n\\t\\t\\t\\tis good in itself, and as an example to the younger\\n\\t\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "60",
    "NoteID": "3041",
    "Body": "Another example of a refrain: see n. 3039 above. Verses\\n\\t\\t\\t\\t58 and 59 were closer connected: their refrain was\\n\\t\\t\\t\\tpractically identical. This verse, though ancillary, is\\n\\t\\t\\t\\tless closely connected: its refrain comes in like a\\n\\t\\t\\t\\thalf-note in a melody."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "61",
    "NoteID": "3042",
    "Body": "There were various Arab superstitions and fancies which\\n\\t\\t\\t\\tare combated and rejected here. (1) The blind, or the\\n\\t\\t\\t\\thalt, or those afflicted with serious disease were\\n\\t\\t\\t\\tsupposed to be objects of divine displeasure, and as such\\n\\t\\t\\t\\tnot fit to be associated with us in meals in our houses:\\n\\t\\t\\t\\twe are not to entertain such a thought, as we are not\\n\\t\\t\\t\\tjudges of the causes of people's misfortunes, which\\n\\t\\t\\t\\tdeserve our sympathy and kindness. (2) It was considered\\n\\t\\t\\t\\tunbecoming to take meals in the houses of near relatives:\\n\\t\\t\\t\\tthis taboo is not approved. (3) A similar superstition\\n\\t\\t\\t\\tabout houses in our possession but not in our actual\\n\\t\\t\\t\\toccupation is disapproved. (4) If people think they\\n\\t\\t\\t\\tshould not fall under obligation to casual friends, that\\n\\t\\t\\t\\tdoes not apply to a sincere friend, in whose company a\\n\\t\\t\\t\\tmeal is not to be rejected, but welcomed. (5) If people\\n\\t\\t\\t\\tmake a superstition either that they should always eat\\n\\t\\t\\t\\tseparately, or that they must always eat in company, as\\n\\t\\t\\t\\tsome people weary of their own company think, either of\\n\\t\\t\\t\\tthem is wrong. Man is free and should regulate his life\\n\\t\\t\\t\\taccording to needs and circumstances."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "61",
    "NoteID": "3043",
    "Body": "The shades of meaning in Salam are explained in n. 2512\\n\\t\\t\\t\\tto xix. 62. Here, we were first told that we might accept\\n\\t\\t\\t\\thospitality and good fellowship in each other's houses.\\n\\t\\t\\t\\tNow we are told what spirit should animate us in doing\\n\\t\\t\\t\\tso. It should not be a spirit only of self-satisfaction\\n\\t\\t\\t\\tin a worldly sense. It should rather be a spirit of\\n\\t\\t\\t\\tgood-will in the highest spiritual sense of the\\n\\t\\t\\t\\tterm-purity of motives and purity of life, as in the\\n\\t\\t\\t\\tsight of Allah."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "61",
    "NoteID": "3044",
    "Body": "See notes 3039 and 3041 above. The refrain comes again,\\n\\t\\t\\t\\tin a different form, closing the argument from a\\n\\t\\t\\t\\tdifferent point of view."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "62",
    "NoteID": "3045",
    "Body": "Matter requiring collective action: anything that affects\\n\\t\\t\\t\\tthe Community as a whole: Jumu'a and 'Id prayers are\\n\\t\\t\\t\\tperiodical occasions of this kind, but what is meant here\\n\\t\\t\\t\\tis, I think, joint consultations with a view to joint\\n\\t\\t\\t\\tundertakings, such as a Jihad, or some kind of\\n\\t\\t\\t\\torganisation in peace."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "62",
    "NoteID": "3046",
    "Body": "That is, those to whom, in the exercise of your impartial\\n\\t\\t\\t\\tdiscretion, you think it expedient to give leave. \"Will\",\\n\\t\\t\\t\\tunless the context shows otherwise, means \"right will\",\\n\\t\\t\\t\\tnot a will without any definite principle behind it."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "62",
    "NoteID": "3047",
    "Body": "In important matters of general consultation, even though\\n\\t\\t\\t\\tleave of absence is given on sufficient excuse, it\\n\\t\\t\\t\\timplies some defect in duty on the part of the person to\\n\\t\\t\\t\\twhom the leave is given, and therefore the need of\\n\\t\\t\\t\\tforgiveness from Him to Whom we owe duty in a perfect\\n\\t\\t\\t\\tmeasure."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "63",
    "NoteID": "3048",
    "Body": "Three significations are possible. One is that adopted in\\n\\t\\t\\t\\tthe Translation, which agrees with the view of most\\n\\t\\t\\t\\tCommentators. Another would be: 'Do not think that the\\n\\t\\t\\t\\tprayer of the Prophet of Allah is like your ordinary\\n\\t\\t\\t\\trequests to another: the Prophet's prayer will be about\\n\\t\\t\\t\\tserious matters and will be accepted by Allah'. A third\\n\\t\\t\\t\\tinterpretation would be: 'Do not address the Prophet\\n\\t\\t\\t\\tfamiliarly as you would address one another: use proper\\n\\t\\t\\t\\tterms of respect for him.'"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "63",
    "NoteID": "3049",
    "Body": "The \"trial\" is understood to be some misfortune in this\\n\\t\\t\\t\\tlife, and the \"grievous Penalty\" to be the punishment in\\n\\t\\t\\t\\tthe Hereafter."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "64",
    "NoteID": "3050",
    "Body": "The condition or position you are in, the motives which\\n\\t\\t\\t\\tactuate you, and the ends you have in view."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "64",
    "NoteID": "3051",
    "Body": "Things misunderstood or maligned, falsely praised or held\\n\\t\\t\\t\\tin honour, or fraudulently shown to be good when they are\\n\\t\\t\\t\\tevil-everything will be revealed in its true light on the\\n\\t\\t\\t\\tDay of final Judgment."
  }
]
