[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/059001",
        "Body":  "All that is in the heavens and all that is in the earth\n\t\t\tglorifieth Allah, and He is the Mighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/059010",
        "Body":  "And those who came (into the faith) after them say: Our Lord\n\t\t\tForgive us and our brethren who were before us in the faith, and\n\t\t\tplace not in our hearts any rancor toward those who believe. Our\n\t\t\tLord! Thou art Full of Pity, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/059011",
        "Body":  "Hast thou not observed those who are hypocrites, (how) they tell\n\t\t\ttheir brethren who disbelieve among the People of the Scripture:\n\t\t\tIf ye are driven out, we surely will go out with you, and we will\n\t\t\tnever obey anyone against you, and if ye are attacked we verily\n\t\t\twill help you. And Allah beareth witness that they verily are\n\t\t\tliars."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/059012",
        "Body":  "(For) indeed if they are driven out they go not out with them,\n\t\t\tand indeed if they are attacked they help not, and indeed if they\n\t\t\thad helped them they would have turned and fled, and then they\n\t\t\twould not have been victorious."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/059013",
        "Body":  "Ye are more awful as a fear in their bosoms than Allah. That is\n\t\t\tbecause they are a folk who understand not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/059014",
        "Body":  "They will not fight against you in a body save in fortified\n\t\t\tvillages or from behind walls. Their adversity among themselves\n\t\t\tis very great. Ye think of them as a whole whereas their hearts\n\t\t\tare divers. That is because they are a folk who have no sense."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/059015",
        "Body":  "On the likeness of those (who suffered) a short time before them,\n\t\t\tthey taste the ill effects of their conduct, and theirs is\n\t\t\tpainful punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/059016",
        "Body":  "(And the hypocrites are) on the likeness of the devil when he\n\t\t\ttelleth man to disbelieve, then, when be disbelieveth saith: Lo!\n\t\t\tI am quit of thee. Lo! I fear Allah, the Lord of the Worlds."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/059017",
        "Body":  "And the consequence for both will be that they are in the Fire,\n\t\t\ttherein abiding. Such is the reward of evil-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/059018",
        "Body":  "O ye who believe! Observe your duty to Allah. And let every soul\n\t\t\tlook to that which it sendeth on before for the morrow. And\n\t\t\tobserve your duty to Allah! Lo! Allah is informed of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/059019",
        "Body":  "And be not ye as those who forgot Allah, therefore He caused them\n\t\t\tto forget their souls. Such are the evil-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/059002",
        "Body":  "He it is Who hath caused those of the People of the Scripture who\n\t\t\tdisbelieved to go forth from their homes unto the first exile. Ye\n\t\t\tdeemed not that they would go forth, while they deemed that their\n\t\t\tstrongholds would protect them from Allah. But Allah reached them\n\t\t\tfrom a place whereof they reckoned not, and cast terror in their\n\t\t\thearts so that they ruined their houses with their own hands and\n\t\t\tthe hands of the believers. So learn a lesson, O ye who have\n\t\t\teyes!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/059020",
        "Body":  "Not equal are the owners of the Fire and the owners of the\n\t\t\tGarden. The owners of the Garden, they are the victorious."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/059021",
        "Body":  "If We had caused this Qur\u0027an to descend upon a mountain, thou (O\n\t\t\tMuhammad) verily hadst seen it humbled, rent asunder by the fear\n\t\t\tof Allah. Such similitudes coin We for mankind that haply they\n\t\t\tmay reflect."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/059022",
        "Body":  "He is Allah, than whom there is no other God, the Knower of the\n\t\t\tinvisible and the visible. He is the Beneficent, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/059023",
        "Body":  "He is Allah, than whom there is no other God, the Sovereign Lord\n\t\t\tthe Holy One, Peace, the Keeper of Faith, the Guardian, the\n\t\t\tMajestic, the Compeller, the Superb. Glorified be Allah from all\n\t\t\tthat they ascribe as partner (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/059024",
        "Body":  "He is Allah, the Creator, the Shaper out of naught, the\n\t\t\tFashioner. His are the most beautiful names. All that is in the\n\t\t\theavens and the earth glorifieth Him, and He is the Mighty, the\n\t\t\tWise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/059003",
        "Body":  "And if Allah had not decreed migration for them, He verily would\n\t\t\thave punished them in this world, and theirs in the Hereafter is\n\t\t\tthe punishment of the Fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/059004",
        "Body":  "That is because they were opposed to Allah and His messenger; and\n\t\t\twhoso is opposed to Allah, (for him) verily Allah is stern in\n\t\t\treprisal."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/059005",
        "Body":  "Whatsoever palm trees ye cut down or left standing on their\n\t\t\troots, it was by Allah\u0027s leave, in order that He might confound\n\t\t\tthe evil-livers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/059006",
        "Body":  "And that which Allah gave as spoil unto His messenger from them,\n\t\t\tye urged not any horse or riding camel for the sake thereof, but\n\t\t\tAllah giveth His messenger lordship over whom He will. Allah is\n\t\t\tAble to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/059007",
        "Body":  "That which Allah giveth as spoil unto His messenger from the\n\t\t\tpeople of the townships, it is for Allah and His messenger and\n\t\t\tfor the near of kin and the orphans and the needy and the\n\t\t\twayfarer, that it become not a commodity between the rich among\n\t\t\tyou. And whatsoever the messenger giveth you, take it. And\n\t\t\twhatsoever he forbiddeth, abstain (from it). And keep your duty\n\t\t\tto Allah. Lo! Allah is stern in reprisal."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/059008",
        "Body":  "And (it is) for the poor fugitives who have been driven out from\n\t\t\ttheir homes and their belongings, who seek bounty from Allah and\n\t\t\thelp Allah and His messenger. They are the loyal."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "59",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/059009",
        "Body":  "Those who entered the city and the faith before them love these\n\t\t\twho flee unto them for refuge, and find in their breasts no need\n\t\t\tfor that which hath been given them, but prefer (the fugitives)\n\t\t\tabove themselves though poverty become their lot. And whoso is\n\t\t\tsaved from his own avarice such are they who are successful."
    }
]
