[
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "1",
    "NoteID": "28997",
    "Text": "  &nbsp;i.e., Adam and Eve.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "3",
    "NoteID": "28998",
    "Text": "  &nbsp;The Quran is the only scripture that says marry only one. Unlike any previous faith, Islam puts a limit on the number of wives a man can have. Under certain circumstances, a Muslim man may marry up to four wives as long as he is able to provide for them and maintain justice among them&mdash;otherwise it is unlawful. With the exception of Jesus Christ and John the Baptist (neither of whom were married), almost all religious figures in the Bible had more than one wife. According to the Bible, Solomon (&#65018;) had 700 wives and 300 concubines (1 Kings 11:3) and his father, David (&#65018;), had many wives and concubines (2 Samuel 5:13).   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "3",
    "NoteID": "28999",
    "Text": "  &nbsp;A bondwoman is a female slave that a man owned either through purchase or taking her captive in war&mdash;a common ancient practice in many parts of the world. Islam opened the door for ending slavery by making it an act of charity to free slaves. Many sins (such as breaking one&rsquo;s oath, unintentional killing, and intercourse with one&rsquo;s wife during the day of fasting in Rama&#7693;&acirc;n) can be atoned by freeing a slave. According to Islamic teachings, no free person can be enslaved. Islam also improved the condition of slaves. It was unlawful to separate a mother from her child. Children born to a slave-master were deemed free, and their mother would gain her freedom upon the death of her master. With regards to slaves, Prophet Mu&#7717;ammad (&#65018;) says, &ldquo;Feed them from what you eat, clothe them from what you wear, and do not overwhelm them with work unless you assist them.&rdquo; He (&#65018;) also says, &ldquo;Whoever kills his slave will be killed and whoever injures his slave will be injured.&rdquo; In recent times, slavery has been outlawed in all countries&mdash;including the Muslim world.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "8",
    "NoteID": "29000",
    "Text": "  &nbsp;For example, in the case of orphaned children whose grandfather then dies, leaving behind other children, some scholars rule that an obligatory bequest should be made to them despite not having a share in inheritance.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "29001",
    "Text": "   &nbsp;According to Islamic law of inheritance, a female&mdash;whether she is a mother, a wife, a sister, a daughter, etc.&mdash;gets one of three shares, depending on her closeness to the deceased:      Less than a male&rsquo;s share. If she is a daughter, she will get half of the share of her brother, since he&mdash;unlike his sister&mdash;has to provide for the family and pay a dowry at the time of his marriage.      More than a male&rsquo;s share. For example, if a man leaves $24 000 and six sons, two brothers, a wife, and a mother. The wife will get one-eighth ($3000), the mother one-sixth ($4000), each of the sons will receive about $2 833 and the two brothers will not get anything.      An equal share. This is in the case of siblings from the mother&rsquo;s side (mentioned in verse 12 of this s&ucirc;rah).       "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "29002",
    "Text": "  &nbsp;\"Offspring&rdquo; here means any number of children&mdash;male or female.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "29003",
    "Text": "  &nbsp;And the father will take the rest of the estate.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "29004",
    "Text": "  &nbsp;Although the existence of siblings reduces the mother&rsquo;s share from one-third to one-sixth, siblings themselves do not receive a share of inheritance and the rest of the estate goes to the father.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "29005",
    "Text": "  &nbsp;Debts as well as any other financial obligations (such as funeral expenses, unfulfilled vows, or unpaid dowry) have to be repaid before the fulfilment of bequests, then the estate can be distributed among the heirs. A person can bequest up to one-third of their estate for charities as well as individuals who are not entitled to a share in inheritance.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "29006",
    "Text": "  &nbsp;You do not know who will benefit you by looking after you during your life or doing good deeds on your behalf after your death.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "12",
    "NoteID": "29007",
    "Text": "  &nbsp;If there are two or more brothers and sisters from the mother&rsquo;s side, they share one-third equally&mdash;the female will receive the same share of the male.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "12",
    "NoteID": "29008",
    "Text": "  &nbsp;Harming the heirs includes giving away more than one-third of the estate as a bequest.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "17",
    "NoteID": "29009",
    "Text": "  &nbsp;A person&rsquo;s repentance will be accepted as long as they repent any time before their death. But one should not procrastinate because they do not know when they will die.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "19",
    "NoteID": "29010",
    "Text": "  &nbsp;For example, a man would prevent a female relative (such as his sister or mother) from getting married so he can secure her estate for himself.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "19",
    "NoteID": "29011",
    "Text": "  &nbsp;lit., blatant misconduct. If someone&rsquo;s wife has been found guilty of adultery, he has the right to ask for his dowry back.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "21",
    "NoteID": "29012",
    "Text": "  &nbsp;i.e., the promise to live with her in kindness or divorce her with dignity.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "24",
    "NoteID": "29013",
    "Text": "  &nbsp;A man was not allowed to have a relationship with a bondwoman who he had taken captive in war unless he made sure she was not pregnant. This was verified by her having at least one monthly cycle. See footnote for 4:3.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "25",
    "NoteID": "29014",
    "Text": "  &nbsp;Do not be ashamed to marry a bondwoman since you are all part of the same human family and Allah knows you are doing so to avoid illegal relationships.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "25",
    "NoteID": "29015",
    "Text": "  &nbsp;A married slave-woman is forbidden from having a relationship with her master.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "25",
    "NoteID": "29016",
    "Text": "  &nbsp;i.e., fifty lashes.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "31",
    "NoteID": "29017",
    "Text": "  &nbsp;i.e., Paradise.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "33",
    "NoteID": "29018",
    "Text": "  &nbsp;This pledge was a common practice before Islam between friends and allies&mdash;taking oaths to inherit each other. This practice came to an end with the revelation of verse 8:75 of the Quran. Although friends and allies do not have a share in inheritance anymore, they still can get some of the estate through bequest.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "34",
    "NoteID": "29019",
    "Text": "  &nbsp;i.e., their husbands&rsquo; honour and wealth.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "34",
    "NoteID": "29020",
    "Text": "  &nbsp;Disciplining one&rsquo;s wife gently is the final resort. The earliest commentators understood that this was to be light enough not to leave a mark, should be done with nothing bigger than a tooth stick, and should not be on the face. Prophet Mu&#7717;ammad (&#65018;) said to his companions &ldquo;Do not beat the female servants of Allah.&rdquo; He said that honourable husbands do not beat their wives, and he himself never hit a woman or a servant. If a woman feels her husband is ill-behaved, then she can get help from her guardian or seek divorce.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "40",
    "NoteID": "29021",
    "Text": "  &nbsp;lit., the smallest particle of dust (&#11372;arrah).  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "42",
    "NoteID": "29022",
    "Text": "   &nbsp;Prophet Mu&#7717;ammad (&#65018;) asked one of his companions, &rsquo;Abdullah ibn Mas&rsquo;&ucirc;d, to recite some verses of the Quran for him because he loved to hear it from someone other than himself. &rsquo;Abdullah recited from the beginning of this s&ucirc;rah&nbsp;until he reached verse   &nbsp;42. When he was told he may stop, &rsquo;Abdullah said he looked at the face of Prophet (&#65018;) and saw tears rolling down his cheeks.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "43",
    "NoteID": "29023",
    "Text": "  &nbsp;Intoxicants were prohibited in the Quran in three stages: 2:219, 4:43, and finally 5:90-91.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "43",
    "NoteID": "29024",
    "Text": "  &nbsp;i.e., after sexual intercourse or a wet dream.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "43",
    "NoteID": "29025",
    "Text": "  &nbsp;This ruling is called tayammum&nbsp;or &lsquo;dry ablution.&rsquo; If someone cannot find water or is unable to use it because of illness or cold weather, then they are allowed to touch clean earth, sand, etc. with the palms of their hands once then blow in their hands and wipe over their face and hands.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "47",
    "NoteID": "29026",
    "Text": "  &nbsp;See&nbsp;7:163-165.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "48",
    "NoteID": "29027",
    "Text": "  &nbsp;A person will never be forgiven if they die as a disbeliever. But if they repent before their death and mend their ways, then their repentance will be accepted (see&nbsp;25:68-70).  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "51",
    "NoteID": "29028",
    "Text": "  &nbsp;i.e., the polytheists.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "55",
    "NoteID": "29029",
    "Text": "  &nbsp;i.e., Abraham (&#65018;) or Mu&#7717;ammad (&#65018;).  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "57",
    "NoteID": "29030",
    "Text": "  &nbsp;See&nbsp;footnote for 2:25.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "58",
    "NoteID": "29031",
    "Text": "  &nbsp;This verse was revealed right after Mecca had peacefully surrendered to the Muslims. &rsquo;Ali ibn Abi &#7788;&acirc;lib, the Prophet&rsquo;s cousin and son-in-law, took the Ka&rsquo;bah&rsquo;s key by force from Othm&acirc;n ibn &#7788;al&#7717;a, the non-Muslim keeper of the Ka&rsquo;bah. The verse was revealed to the Prophet (&#65018;) inside the Ka&rsquo;bah with the order to give the key back to its rightful owner. He (&#65018;) ordered Ali to return the key to the keeper immediately along with an apology. Othm&acirc;n was also promised that his family would keep the key forever. The keeper was so touched by the Quranic sense of justice that he decided to accept Islam.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "66",
    "NoteID": "29032",
    "Text": "  &nbsp;i.e., obeying Allah and His Messenger.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "79",
    "NoteID": "29033",
    "Text": "  &nbsp;Both good and evil are destined by Allah. The good comes as Allah&rsquo;s reward for good deeds, whereas the bad comes as Allah&rsquo;s punishment for evil deeds. In some cases, bad things happen to good people to test their faith, or as an atonement for their sins, or as part of a process of replacing something with what is better (e.g., a job or a spouse).  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "83",
    "NoteID": "29034",
    "Text": "  &nbsp;i.e., when they get the news of victory or a threat.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "89",
    "NoteID": "29035",
    "Text": "  &nbsp;The verse discusses a group of people who nominally became Muslims and secretly supported the enemies of Muslims. For those hypocrites to prove their loyalty, they were commanded to emigrate and join the ranks of the believers, or they would be considered enemies.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "93",
    "NoteID": "29036",
    "Text": "  &nbsp;If a Muslim commits a major sin (such as intentional killing or adultery) and dies without repenting, they will be punished in Hell according to the severity or magnitude of the sin, then eventually be taken out of Hell. No Muslim will stay in Hell forever.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "94",
    "NoteID": "29037",
    "Text": "  &nbsp;i.e., spoils of war.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "95",
    "NoteID": "29038",
    "Text": "  &nbsp;This includes women, the elderly, the sick, etc.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "97",
    "NoteID": "29039",
    "Text": "  &nbsp;This verse refers to some of those who had accepted Islam secretly in Mecca but refused to emigrate to Medina along with the rest of the believers. Some of them were killed in the Battle of Badr when they were rallied by the Meccans to fight against the Muslims. The verse also applies to any Muslim who accepts abuse and refuses to move to another place where they can live with dignity and practice their faith freely.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "101",
    "NoteID": "29040",
    "Text": "  &nbsp;Generally, it is permissible for Muslims who are travelling a distance of 85 km or more to shorten their prayers. A four-unit prayer is reduced to two.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "102",
    "NoteID": "29041",
    "Text": "  &nbsp;When the first group prays, the second group stands guard behind them, then the first group withdraws to the back when they finish their prayers and stand guard when the second group moves up to pray.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "107",
    "NoteID": "29042",
    "Text": "  &nbsp;lit., deceive themselves.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "116",
    "NoteID": "29043",
    "Text": "  &nbsp;This applies to those who die in a state of disbelief in Allah. But those who repent before their death and mend their ways, their repentance will be accepted (see&nbsp;25:68-70).  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "117",
    "NoteID": "29044",
    "Text": "  &nbsp;The pagans of Arabia used to shape their idols as females and give them feminine names such as Al-L&acirc;t, Al-&rsquo;Uzza, and Man&acirc;t.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "119",
    "NoteID": "29045",
    "Text": "  &nbsp;Slitting the ears of cattle dedicated to idols was a superstitious practice before Islam.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "127",
    "NoteID": "29046",
    "Text": "  &nbsp;This refers to verses 2-11 of this s&ucirc;rah.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "127",
    "NoteID": "29047",
    "Text": "  &nbsp;i.e., their inheritance and dowries.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "128",
    "NoteID": "29048",
    "Text": "  &nbsp;This implies that many husbands and wives are unwilling to give the other their rights.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "129",
    "NoteID": "29049",
    "Text": "  &nbsp;Do not leave one hanging&mdash;not fully enjoying the rights of a married woman and not fully divorced.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "140",
    "NoteID": "29050",
    "Text": "  &nbsp;This refers to 6:68.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "148",
    "NoteID": "29051",
    "Text": "  &nbsp;i.e., Allah does not like talking about people behind their backs&mdash;except when someone who has been wronged seeks counselling or assistance from authorities.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "150",
    "NoteID": "29052",
    "Text": "  &nbsp;By their claim that they believe in Allah but still reject some of His messengers.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "153",
    "NoteID": "29053",
    "Text": "  &nbsp;i.e., they demanded the Quran to be revealed all at once in writing similar to the Tablets of Moses. This demand is refuted in 25:32.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "155",
    "NoteID": "29054",
    "Text": "  &nbsp;Their hearts are unreceptive because they claim they have enough knowledge already.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "156",
    "NoteID": "29055",
    "Text": "  &nbsp;i.e., they slandered Mary by claiming that she conceived Jesus through an illegal relationship.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "157",
    "NoteID": "29056",
    "Text": "  &nbsp;The popular belief among Muslims is that a conspiracy was made to kill Jesus, Allah made the main culprit who betrayed Jesus look exactly like Jesus, then he was crucified in Jesus&rsquo; place. Jesus was raised safe and sound to the heavens. Muslims also believe in the second coming of Jesus (&#65018;).  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "159",
    "NoteID": "29057",
    "Text": "  &nbsp;Scholars disagree whether Jews and Christians will come to realize that Jesus is a prophet of Allah at the time of their death or before the death of Jesus after his second coming.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "171",
    "NoteID": "29058",
    "Text": "  &nbsp;The Jews are warned against denying Jesus as the Messiah, while Christians are warned against calling Jesus Allah.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "171",
    "NoteID": "29059",
    "Text": "  &nbsp;i.e., Jesus was created by Allah&rsquo;s Word &ldquo;Be!&rdquo; and he was, and life was breathed into Jesus by the holy spirit (the angel Gabriel) at the command of Allah.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "4",
    "AyahNumber": "176",
    "NoteID": "29060",
    "Text": "  &nbsp;This verse is placed at the end of the s&ucirc;rah&nbsp;and not with similar verses at the beginning to connect the end of this s&ucirc;rah&nbsp;with the next one or, according to Al-Fakhr Ar-R&acirc;zi, either to tie the end of the s&ucirc;rah&nbsp;with its beginning for emphasis, as found in 20:2 and 124 as well as 23:1 and 117, or to emphasize Allah&rsquo;s knowledge, just like the first verse emphasizes His power.   "
  }
]
