[
  {
    "SurahNumber": "67",
    "AyahNumber": "1",
    "NoteID": "5554",
    "Body": "What do we mean when we bless the name of Allah, or\\n\\t\\t\\t\\tproclaim (in the optative mood) that the whole Creation\\n\\t\\t\\t\\tshould bless the name of the Lord? We mean that we\\n\\t\\t\\t\\trecognise and proclaim His beneficence to us; for all\\n\\t\\t\\t\\tincrease and happiness is through Him, \"in His hands',-in\\n\\t\\t\\t\\tthe hands of Him Who also holds Dominion or Power. In our\\n\\t\\t\\t\\thuman affairs we sometimes see the separation of Dominion\\n\\t\\t\\t\\tor Power from Goodness or Beneficence: in the divine\\n\\t\\t\\t\\tnature we recognise that there is no separation or\\n\\t\\t\\t\\tantithesis."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "1",
    "NoteID": "5555",
    "Body": "Mulk: Dominion, Lordship, Sovereignty, the Right to carry\\n\\t\\t\\t\\tout His Will, or to do all that He wills. Power (in the\\n\\t\\t\\t\\tclause following) is the Capacity to carry out His Will,\\n\\t\\t\\t\\tso that nothing can resist or neutralise it. Here is\\n\\t\\t\\t\\tbeneficence completely identified with Lordship and\\n\\t\\t\\t\\tPower; and it is exemplified in the verses following.\\n\\t\\t\\t\\tNote that \"Mulk\" here has a different shade of meaning\\n\\t\\t\\t\\tfrom Malakut in xxxvi. 83. Both words are from the same\\n\\t\\t\\t\\troot, and I have translated both by the word \"Dominion\".\\n\\t\\t\\t\\tBut Malakut refers to Lordship in the invisible World,\\n\\t\\t\\t\\twhile Mulk to Lordship in the visible World. Allah is\\n\\t\\t\\t\\tLord of both."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "2",
    "NoteID": "5556",
    "Body": "\"Created Death and Life.\" Death is here put before Life,\\n\\t\\t\\t\\tand it is created. Death is therefore not merely a\\n\\t\\t\\t\\tnegative state. In ii. 28 we read: \"Seeing that ye were\\n\\t\\t\\t\\twithout life (literally, dead), and He gave you life:\\n\\t\\t\\t\\tthen will He cause you to die, and will again bring you\\n\\t\\t\\t\\tto life; and again to Him will ye retum.\" In liii. 44,\\n\\t\\t\\t\\tagain, Death is put before Life. Death, then, is (1) the\\n\\t\\t\\t\\tstate before life began, which may be non-existence or\\n\\t\\t\\t\\texistence in some other form: (2) the state in which Life\\n\\t\\t\\t\\tas we know it ceases, but existence does not cease; a\\n\\t\\t\\t\\tstate of Barzakh (xxiii. 100), or Barrier or Partition,\\n\\t\\t\\t\\tafter our visible Death and before Judgment; after that\\n\\t\\t\\t\\twill be the new Life, which we conceive of under the term\\n\\t\\t\\t\\tEternity."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "2",
    "NoteID": "5557",
    "Body": "Creation, therefore, is not in mere sport, or without a\\n\\t\\t\\t\\tpurpose with reference to man. The state before our\\n\\t\\t\\t\\tpresent life, or the state after, we can scarcely\\n\\t\\t\\t\\tunderstand. But our present Life is clearly given to\\n\\t\\t\\t\\tenable us to strive by good deeds to reach a nobler\\n\\t\\t\\t\\tstate."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "2",
    "NoteID": "5558",
    "Body": "All this is possible, because Allah is so Exalted in\\n\\t\\t\\t\\tMight that He can perfectly carry out His Will and\\n\\t\\t\\t\\tPurpose, and that Purpose is Love, Mercy, and Goodness to\\n\\t\\t\\t\\tHis creatures."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "3",
    "NoteID": "5559",
    "Body": "Cf. lxv. 12, and n. 5526-27. The heavens as they appear\\n\\t\\t\\t\\tto our sight seem to be arranged in layers one above\\n\\t\\t\\t\\tanother, and ancient astronomy accounted for the motions\\n\\t\\t\\t\\tof the heavenly bodies in an elaborate scheme of spheres.\\n\\t\\t\\t\\tWhat we are concerned with here is the order and beauty\\n\\t\\t\\t\\tof the vast spaces and the marvellous bodies that follow\\n\\t\\t\\t\\tregular laws of motion in those enormous spaces in the\\n\\t\\t\\t\\tvisible world. From these we are to form some conception\\n\\t\\t\\t\\tof the vastly greater Invisible World, for which we want\\n\\t\\t\\t\\tspecial spiritual vision."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "4",
    "NoteID": "5560",
    "Body": "Reverting to the indication of the external or visible\\n\\t\\t\\t\\tworld, we are asked to observe and study it again and\\n\\t\\t\\t\\tagain, and as minutely as our powers will allow. However\\n\\t\\t\\t\\tclosely we observe it, we shall find no flaw in it.\\n\\t\\t\\t\\tIndeed the region of enquiry is so vast and stretches so\\n\\t\\t\\t\\tfar beyond our ken, that our eyes, aided with the most\\n\\t\\t\\t\\tpowerful telescopes, will confess themselves defeated in\\n\\t\\t\\t\\ttrying to penetrate to the ultimate mysteries. We shall\\n\\t\\t\\t\\tfind no defect in Allah's handiwork: it is our own powers\\n\\t\\t\\t\\tthat we shall find fail to go beyond a certain compass."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "5",
    "NoteID": "5561",
    "Body": "\"Lowest (or nearest) heaven\": see n. 4035 to xxxvii. 6."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "5",
    "NoteID": "5562",
    "Body": "The phenomenon of the shooting stars has been, explained\\n\\t\\t\\t\\tin xv. 16-18, notes 1951-54; and in xxxvii. 6-10, and\\n\\t\\t\\t\\tnotes thereon."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "6",
    "NoteID": "5563",
    "Body": "We have seen how the fire in the stars can suggest the\\n\\t\\t\\t\\tbeauty and order of the external world; and yet, when it\\n\\t\\t\\t\\tmeets with resistance and disharmony, it can burn and\\n\\t\\t\\t\\tdestroy. So in the moral and spiritual world. What can be\\n\\t\\t\\t\\ta greater sign of evil, disharmony, and rebellion than to\\n\\t\\t\\t\\treject the Cherisher and Sustainer, on Whom our life\\n\\t\\t\\t\\tdepends, and from Whom we receive nothing but goodness?\\n\\t\\t\\t\\tThe Punishment, then, is Fire in its fiercest intensity,\\n\\t\\t\\t\\tas typified in the next two verses."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "7",
    "NoteID": "5564",
    "Body": "For shahiq see n. 1607 to xi. 106. There shahiq (sobs)\\n\\t\\t\\t\\twas contrasted with zafir (sighs): in the one case it is\\n\\t\\t\\t\\tthe drawing in of breath, and in the other the emission\\n\\t\\t\\t\\tof a deep breath. Here the latter process is represented\\n\\t\\t\\t\\tby the verb fara, to swell, to blaze forth, to gush\\n\\t\\t\\t\\tforth. In xi. 40, the verb fara was applied to the\\n\\t\\t\\t\\tgushing forth of the waters of the Flood; here the verb\\n\\t\\t\\t\\tis applied to the blazing forth of the Fire of\\n\\t\\t\\t\\tPunishment. Fire is personified: in its in-take it has a\\n\\t\\t\\t\\tfierce appetite; in the flames which it throws out, it\\n\\t\\t\\t\\thas a fierce aggressiveness. And yet in ultimate result\\n\\t\\t\\t\\tevil meets the same fate, whether typified by water or\\n\\t\\t\\t\\tfire."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "8",
    "NoteID": "5565",
    "Body": "Cf. xxxix. 71, n. 4348. \"Every time\": it may not be the\\n\\t\\t\\t\\tsame angels who are guarding the gates of Hell every time\\n\\t\\t\\t\\tnew inmates come in. The pure, innocent angel nature does\\n\\t\\t\\t\\tnot know the crookedness of human evil, and is surprised\\n\\t\\t\\t\\tat so many human beings coming in for punishment: it\\n\\t\\t\\t\\twonders if no warning was conveyed to men, whereas in\\n\\t\\t\\t\\tfact men have a warning in Clear Signs during all the\\n\\t\\t\\t\\tperiod of their probation. The Clear Signs come from\\n\\t\\t\\t\\tRevelation, from their own conscience, and from all\\n\\t\\t\\t\\tnature around them."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "9",
    "NoteID": "5566",
    "Body": "Allah's Signs were not only rejected or defied, but their\\n\\t\\t\\t\\tvery existence was denied. Nay, more, even their\\n\\t\\t\\t\\tpossibility was denied, and alas! righteous people and\\n\\t\\t\\t\\tProphets were persecuted or mocked (xxxvi. 30). They were\\n\\t\\t\\t\\tcalled fools or madmen, or men under a delusion!"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "10",
    "NoteID": "5567",
    "Body": "Man has himself the power given to him to distinguish\\n\\t\\t\\t\\tgood from evil, and he is further helped by the teachings\\n\\t\\t\\t\\tof the great Messengers or World Teachers. Where such\\n\\t\\t\\t\\tTeachers do not come into personal contact with an\\n\\t\\t\\t\\tindividual or a generation, the true meaning of their\\n\\t\\t\\t\\tteaching can be understood by means of the Reason which\\n\\t\\t\\t\\tAllah has given to every human soul to judge by. It is\\n\\t\\t\\t\\tfailure to follow a man's light sincerely that leads to\\n\\t\\t\\t\\this degradation and destruction."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "11",
    "NoteID": "5568",
    "Body": "The will then have passed through the fire of Judgment\\n\\t\\t\\t\\tand will now be in the fire of Punishment. The Reality\\n\\t\\t\\t\\twill not only now be clear to them, but after the\\n\\t\\t\\t\\tquestionings of the angels they cannot even pretend to\\n\\t\\t\\t\\tmake any excuses. They will freely confess, but that is\\n\\t\\t\\t\\tnot repentance, for repentance implies amendment, and the\\n\\t\\t\\t\\ttime for repentance and amendment will have long been\\n\\t\\t\\t\\tpast."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "12",
    "NoteID": "5569",
    "Body": "See n. 3902 to xxxv. 18. Read \"unseen\" adverbially. To\\n\\t\\t\\t\\tfear the Lord is to love Him so intensely that you fear\\n\\t\\t\\t\\tto do anything which is against His Will, and you do it\\n\\t\\t\\t\\tbecause you realise Him intensely in your hearts, though\\n\\t\\t\\t\\tyou do not see Him with your bodily senses. Nor is it of\\n\\t\\t\\t\\tany consequences whether other people see your love or\\n\\t\\t\\t\\tthe consequences that flow from your love, for your good\\n\\t\\t\\t\\tdeeds are for the love of Allah and not for show in the\\n\\t\\t\\t\\teyes of men. Such intensity of love obtains forgiveness\\n\\t\\t\\t\\tfor any past, and is indeed rewarded with Allah's love,\\n\\t\\t\\t\\twhich is immeasurably precious beyond any merits you may\\n\\t\\t\\t\\tpossess."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "14",
    "NoteID": "5570",
    "Body": "He Who creates must necessarily know His own handiwork.\\n\\t\\t\\t\\tBut lest we should measure His knowledge by such\\n\\t\\t\\t\\timperfect knowledge as we possess. His knowledge is\\n\\t\\t\\t\\tfurther characterised as understanding the finest\\n\\t\\t\\t\\tmysteries and being well acquainted with them (Latif and\\n\\t\\t\\t\\tKhabir): see xxii. 63. n. 2844."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "15",
    "NoteID": "5571",
    "Body": "Zalal is used in ii. 71 for an animal trained and\\n\\t\\t\\t\\ttractable: here it is used to qualify the earth, and I\\n\\t\\t\\t\\thave translated 'manageable'. Man has managed to make\\n\\t\\t\\t\\tpaths through deserts and over mountains: through rivers\\n\\t\\t\\t\\tand seas by means of ships; through the air by means of\\n\\t\\t\\t\\tairways; he has made bridges and tunnels and other means\\n\\t\\t\\t\\tof communication. But this he has only been able to do\\n\\t\\t\\t\\tbecause Allah has given him the necessary intelligence\\n\\t\\t\\t\\tand has made the earth tractable to that intelligence."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "15",
    "NoteID": "5572",
    "Body": "In describing Allah's gifts and mercies and watchful care\\n\\t\\t\\t\\tin this our temporary sojourn on this earth, it is made\\n\\t\\t\\t\\tclear that the ultimate end is the Hereafter. The real\\n\\t\\t\\t\\tBeyond, which is the goal, is the life after the\\n\\t\\t\\t\\tResurrection."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "16",
    "NoteID": "5573",
    "Body": "Cf. xvii. 68. and n. 2263. Also cf. the story of Qarun in\\n\\t\\t\\t\\txxviii. 76-82. If we feel safe on land, it is because\\n\\t\\t\\t\\tAllah has made this earth amenable, manageable and\\n\\t\\t\\t\\tserviceable to us (verse 15 above). But if we defy Allah\\n\\t\\t\\t\\tand break His Law, have we any security, that even this\\n\\t\\t\\t\\tcomparatively unimportant safety in a fleeting world will\\n\\t\\t\\t\\tlast? Looking at it from a purely physical point of view,\\n\\t\\t\\t\\thave there not been dreadful earthquakes, typhoons, and\\n\\t\\t\\t\\ttornadoes?"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "17",
    "NoteID": "5574",
    "Body": "Cf. xvii. 68; and xxix. 40, n. 3462. Such a violent wind\\n\\t\\t\\t\\tdestroyed the wicked Cities which defied Lut's warning."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "18",
    "NoteID": "5575",
    "Body": "Cf. xxii. 42-44, and n. 2822."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "19",
    "NoteID": "5576",
    "Body": "The flight of birds is one of the most beautiful and\\n\\t\\t\\t\\twonderful things in nature. The make and arrangement of\\n\\t\\t\\t\\ttheir feathers and bones, and their stream-line shapes,\\n\\t\\t\\t\\tfrom beak to tail, are instances of purposive adaptation.\\n\\t\\t\\t\\tThey soar with outstretched wings; they dart about with\\n\\t\\t\\t\\tfolded wings; their motions upwards and downwards, as\\n\\t\\t\\t\\twell as their stabilisation in the air, and when they\\n\\t\\t\\t\\trest on their feet, have given many ideas to man in the\\n\\t\\t\\t\\tscience and art of aeronautics. But who taught or gave to\\n\\t\\t\\t\\tbirds this wonderful adaptation? None but Allah, Whose\\n\\t\\t\\t\\tinfinite Mercy provides for every creature just those\\n\\t\\t\\t\\tconditions which are best adapted for its life."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "19",
    "NoteID": "5577",
    "Body": "In the Arabic, there is an artistic touch which it is not\\n\\t\\t\\t\\tpossible to reproduce in the translation. Saffat\\n\\t\\t\\t\\t(spreading their wings) is in the form of the active\\n\\t\\t\\t\\tparticiple, suggesting the continuous soaring on\\n\\t\\t\\t\\toutspread wings; while yaqbidhna (folding them in) is in\\n\\t\\t\\t\\tthe Aorist form, suggesting the spasmodic flapping of\\n\\t\\t\\t\\twings."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "20",
    "NoteID": "5578",
    "Body": "Not the greatest army that man can muster is of any use\\n\\t\\t\\t\\tagainst the Wrath of Allah; while the constant watchful\\n\\t\\t\\t\\tcare of Allah is all-in-all to us, and we can never do\\n\\t\\t\\t\\twithout it. If the godless wander about in search for\\n\\t\\t\\t\\tblessings otherwise than in the Mercy and Grace of Allah,\\n\\t\\t\\t\\tthey are wandering in vain delusions."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "21",
    "NoteID": "5579",
    "Body": "\"Sustenance\" here, as elsewhere, (e.g., in xvi. 73, n.\\n\\t\\t\\t\\t2105), refers to all that is necessary to sustain and\\n\\t\\t\\t\\tdevelop life in all its phases. Allah Most Gracious is\\n\\t\\t\\t\\tthe Source of all our Sustenance, and if we persist in\\n\\t\\t\\t\\tlooking to Vanities for our Sustenance, we are pursuing a\\n\\t\\t\\t\\tmirage, and, if we examine the matter, we are only\\n\\t\\t\\t\\tfollowing obstinate unpulses of rebellion and impiety."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "22",
    "NoteID": "5580",
    "Body": "Cf. xxvii. 90, and n. 3320. The man of probity is the man\\n\\t\\t\\t\\twho walks evenly on a Straight Way, his feet guided by\\n\\t\\t\\t\\tAllah's Light and his heart sustained by Allah's Mercy.\\n\\t\\t\\t\\tThe man who chooses evil grovels, with his face down, in\\n\\t\\t\\t\\tpaths of Darkness, stumbling on the way, and in constant\\n\\t\\t\\t\\tdistrust and fear, the fear of Evil. The two kinds of men\\n\\t\\t\\t\\tare poles apart, although they five on the same earth,\\n\\t\\t\\t\\tsee the same Signs, and are fed with the same Mercies\\n\\t\\t\\t\\tfrom Allah."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "22",
    "NoteID": "5581",
    "Body": "Like Abraham trying to guide his unbelieving father: Cf.\\n\\t\\t\\t\\txix. 43."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "23",
    "NoteID": "5582",
    "Body": "The Prophet is asked to draw constant attention to Allah,\\n\\t\\t\\t\\tthe source of all growth and development, the Giver of\\n\\t\\t\\t\\tthe faculties by which we can judge and attain to higher\\n\\t\\t\\t\\tand higher spiritual dignity. And yet, such is our\\n\\t\\t\\t\\tself-will, we use our faculties for wrong purposes and\\n\\t\\t\\t\\tthus show our ingratitude to Allah."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "23",
    "NoteID": "5583",
    "Body": "For anshaa see n. 923 to vi. 98."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "24",
    "NoteID": "5584",
    "Body": "Mankind, from one set of parents, has been multiplied and\\n\\t\\t\\t\\tscattered through the earth. Men have not only multiplied\\n\\t\\t\\t\\tin numbers but they have developed different languages\\n\\t\\t\\t\\tand characteristics, inner and outer. But they will all\\n\\t\\t\\t\\tbe gathered together at the End of Things, when the\\n\\t\\t\\t\\tmischief created by the wrong exercise of man's will be\\n\\t\\t\\t\\tcancelled, and the Truth of Allah will reign universally."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "25",
    "NoteID": "5585",
    "Body": "The Unbelievers are sceptical, but they are answered in\\n\\t\\t\\t\\tthe next two verses."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "26",
    "NoteID": "5586",
    "Body": "The Judgment is certain to come. But when it will exactly\\n\\t\\t\\t\\tcome, is known to Allah alone. The Prophet's duty is to\\n\\t\\t\\t\\tproclaim that fact openly and clearly. It is not for him\\n\\t\\t\\t\\tto punish or to hasten the punishment of evil. Cf. xxii.\\n\\t\\t\\t\\t47-49."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "27",
    "NoteID": "5587",
    "Body": "\"It\", i.e., the fulfilment of the promise, the Day of\\n\\t\\t\\t\\tJudgment. When it is actually in sight, then the\\n\\t\\t\\t\\tUnbelievers realise that those whom they used to laugh at\\n\\t\\t\\t\\tfor their Faith were in the right, and that they\\n\\t\\t\\t\\tthemselves, the sceptics, were terribly in the wrong."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "27",
    "NoteID": "5588",
    "Body": "They had defiantly asked for it. Now that it has come\\n\\t\\t\\t\\tnear, and it is too late for repentance, there is\\n\\t\\t\\t\\t\"weeping and gnashing of teeth\"."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "28",
    "NoteID": "5589",
    "Body": "The sceptics might say and do say to the righteous: \"Ah\\n\\t\\t\\t\\twell! if calamities come, they involve the good with the\\n\\t\\t\\t\\tbed, just as you say that Allah showers His mercies on\\n\\t\\t\\t\\tboth good and evil!\" The answer is: \"Don't you worry\\n\\t\\t\\t\\tabout us: even supposing we are destroyed, with all who\\n\\t\\t\\t\\tbelieve with us, is that any consolation to you? Your\\n\\t\\t\\t\\tsins must bring on you suffering, and nothing can ward it\\n\\t\\t\\t\\toff. If we get any sorrows or sufferings, we take them as\\n\\t\\t\\t\\ta mere trial to make us better, for we believe in Allah's\\n\\t\\t\\t\\tgoodness and we put our trust in Him.\" See next verse."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "29",
    "NoteID": "5590",
    "Body": "See the end of the last note. \"Our Faith tells us that\\n\\t\\t\\t\\tAllah will deliver us from all harm if we sincerely\\n\\t\\t\\t\\trepent and lead righteous lives. You, Unbelievers, have\\n\\t\\t\\t\\tno such hope. When the real adjustment of values is\\n\\t\\t\\t\\testablished, you will soon see whether we were in the\\n\\t\\t\\t\\twrong or you!\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "30",
    "NoteID": "5591",
    "Body": "The Sura is closed with a parable, taken from a vital\\n\\t\\t\\t\\tfact of our physical life, and leading up to the\\n\\t\\t\\t\\tunderstanding of our spiritual life. In our daily life,\\n\\t\\t\\t\\twhat would happen if we woke up some fine morning to find\\n\\t\\t\\t\\tthat the sources and springs of our water-supply had\\n\\t\\t\\t\\tdisappeared and gone down into the hollows of the earth?\\n\\t\\t\\t\\tNothing could save our life. Without water we cannot\\n\\t\\t\\t\\tlive, and water cannot rise above its level, but always\\n\\t\\t\\t\\tseeks a lower-level. So in spiritual life. Its sources\\n\\t\\t\\t\\tand springs are in the divine wisdom that flows from on\\n\\t\\t\\t\\thigh. Allah is the real source of that life, as He is of\\n\\t\\t\\t\\tall forms of life. We must seek His Grace and Mercy. We\\n\\t\\t\\t\\tcannot find grace or mercy or blessing from anything\\n\\t\\t\\t\\tlower. His Wisdom and Mercy are like, fresh clear-flowing\\n\\t\\t\\t\\tspring-water, not like the muddy murky wisdom and\\n\\t\\t\\t\\tgoodness of this lower world which is only relative, and\\n\\t\\t\\t\\twhich often hampers life rather than advances it."
  }
]
