[
  {
    "SurahNumber": "42",
    "AyahNumber": "1",
    "NoteID": "4526",
    "Body": "See Introduction to S. xi."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "2",
    "NoteID": "4527",
    "Body": "This Sura has a double set of Abbreviated Letters, one in\\n\\t\\t\\t\\tthe first verse, and one in this second verse. No\\n\\t\\t\\t\\tauthoritative explanation of this second set is\\n\\t\\t\\t\\tavailable, and I refrain from speculation. See Appendix\\n\\t\\t\\t\\tI."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "3",
    "NoteID": "4528",
    "Body": "Inspiration is full of Power and Wisdom, and both these\\n\\t\\t\\t\\tqualities are derived from the Power and Wisdom of Allah.\\n\\t\\t\\t\\tUnlike human power, this Power is necessarily good and\\n\\t\\t\\t\\tmerciful; unlike human wisdom, this Wisdom is necessarily\\n\\t\\t\\t\\tcomplete and indisputable."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "4",
    "NoteID": "4529",
    "Body": "We cannot conceive the distance which separates the Most\\n\\t\\t\\t\\tHigh from the highest of His creatures, Allah Most Great\\n\\t\\t\\t\\tfrom the greatest of the beings that we can imagine. The\\n\\t\\t\\t\\thighest heavens are mentioned in the next verse, as well\\n\\t\\t\\t\\tas the noblest creatures that we can imagine, the angels."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "5",
    "NoteID": "4530",
    "Body": "How can we conceive of sublimity and greatness in a\\n\\t\\t\\t\\thigher degree than this, that the highest heavens are\\n\\t\\t\\t\\talmost ready to burst asunder by His Glory, which is\\n\\t\\t\\t\\thigher than all?"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "5",
    "NoteID": "4531",
    "Body": "The angels are the noblest and purest beings of whom we\\n\\t\\t\\t\\tcan conceive. They reflect on the one side Allah's Glory\\n\\t\\t\\t\\tand Praise, and on the other, two other attributes of\\n\\t\\t\\t\\tAllah, that look towards His erring creatures, viz.,\\n\\t\\t\\t\\tForgiveness and Mercy. The two sets of attributes are\\n\\t\\t\\t\\tcomplementary. They thus proclaim in their own being and\\n\\t\\t\\t\\tin their prayers the Greatness and unbounded Goodness of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "6",
    "NoteID": "4532",
    "Body": "We now come to the contrast, the folly and ingratitude of\\n\\t\\t\\t\\tman. But that cannot escape its final doom in the\\n\\t\\t\\t\\tUniversal Plan of Allah. Only Judgment rests with Allah.\\n\\t\\t\\t\\tA Prophet is not responsible for the conduct of men, in a\\n\\t\\t\\t\\tsystem which permits some limited free-will and personal\\n\\t\\t\\t\\tresponsibility."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "7",
    "NoteID": "4533",
    "Body": "The point of the Qur-an being in Arabic is that it is\\n\\t\\t\\t\\tplain and intelligible to the people through whom and\\n\\t\\t\\t\\tamong whom it was promulgated; see next clause."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "7",
    "NoteID": "4534",
    "Body": "The City of Makkah. See n. 913 to vi. 92. This is\\n\\t\\t\\t\\tundoubtedly a Makkan verse. Even apart from the Qibla,\\n\\t\\t\\t\\tMakkah is the centre of Islam, and \"all around her\" is\\n\\t\\t\\t\\tthe whole world."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "7",
    "NoteID": "4535",
    "Body": "The contrast is again emphasised, as explained in the\\n\\t\\t\\t\\tSummary."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "8",
    "NoteID": "4536",
    "Body": "Cf. v. 51, and n. 761. It is one of the Signs of Allah\\n\\t\\t\\t\\tthat He has made us different, that we may be tried in\\n\\t\\t\\t\\tthe exercise of our will, and that we may reach, through\\n\\t\\t\\t\\trighteousness and Faith, our highest development, and\\n\\t\\t\\t\\tenjoy His gifts of Mercy and Grace. But we must not\\n\\t\\t\\t\\tbecome contentious, and fall into evil: we must\\n\\t\\t\\t\\tunderstand our own limitations. Otherwise we shall lose\\n\\t\\t\\t\\tHis grace and protection."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "9",
    "NoteID": "4537",
    "Body": "There can be no greater ingratitude or blasphemy than to\\n\\t\\t\\t\\tworship false gods, or to seek protection from things\\n\\t\\t\\t\\tthat have no power, when Allah-Who has power over all\\n\\t\\t\\t\\tthings-is always seeking to protect and cherish His\\n\\t\\t\\t\\tcreatures, and placing in their way all the means for\\n\\t\\t\\t\\tattaining the best in them."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "10",
    "NoteID": "4538",
    "Body": "In the highest issues of life men may see things\\n\\t\\t\\t\\tdifferently. If their differences arise merely from\\n\\t\\t\\t\\tselfish motives, or narrowness of vision, they are\\n\\t\\t\\t\\tsinning against their own souls. If their differences\\n\\t\\t\\t\\tarise from sincere but mistaken notions, their proper\\n\\t\\t\\t\\tcourse is not to form divisions and sects, or to increase\\n\\t\\t\\t\\tcontention and hatred among men, but to leave all things\\n\\t\\t\\t\\tto Allah, trusting in Him and turning to Him in all\\n\\t\\t\\t\\tdifficulties. The final decision in all things is with\\n\\t\\t\\t\\tHim."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "11",
    "NoteID": "4539",
    "Body": "The mystery of sex has not only its physical aspects, but\\n\\t\\t\\t\\tits moral and spiritual aspects, and therefore mankind is\\n\\t\\t\\t\\tin this respect differentiated from the lower animals,\\n\\t\\t\\t\\tand among mankind the grades and qualities are suggested\\n\\t\\t\\t\\tby the phrase \"from among yourselves\". As regards cattle,\\n\\t\\t\\t\\tthey are specially mentioned among the animals, as having\\n\\t\\t\\t\\tspecial relations with man and specially subserving his\\n\\t\\t\\t\\tneeds, not only in the physical sphere, but also in the\\n\\t\\t\\t\\tmatter of transport, which is the key to all civilization\\n\\t\\t\\t\\tand culture: Cf. xxxvi. 71-73; also xxiii. 21-22, where\\n\\t\\t\\t\\tthey are compared to ships, the symbol of international\\n\\t\\t\\t\\tintercourse."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "12",
    "NoteID": "4540",
    "Body": "\"Sustenance\", here as elsewhere, stands for all things\\n\\t\\t\\t\\tthat support every phase of life, physical, social,\\n\\t\\t\\t\\tintellectual, or spiritual. Cf. x. 59, n. 1447. The\\n\\t\\t\\t\\tsource of all gifts is Allah; His bounty is\\n\\t\\t\\t\\tinexhaustible, and He gives to all; but He does not give\\n\\t\\t\\t\\tto all in the same measure, because, out of the fullness\\n\\t\\t\\t\\tof His knowledge and wisdom, He can judge best what is\\n\\t\\t\\t\\tbest for any of His creatures."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "13",
    "NoteID": "4541",
    "Body": "Allah's Religion is the same in essence, whether given,\\n\\t\\t\\t\\tfor example, to Noah, Abraham, Moses, or Jesus, or to our\\n\\t\\t\\t\\tholy Prophet. The source of unity is the revelation from\\n\\t\\t\\t\\tAllah. In Islam it is \"established\" as an institution,\\n\\t\\t\\t\\tand does not remain merely a vague suggestion."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "13",
    "NoteID": "4542",
    "Body": "Faith, Duty or Religion, is not a matter to dispute\\n\\t\\t\\t\\tabout. The formation of sects is against the very\\n\\t\\t\\t\\tprinciple of Religion and Unity. What we should strive\\n\\t\\t\\t\\tfor is steadfastness in duty and faith, and unity among\\n\\t\\t\\t\\tmankind."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "13",
    "NoteID": "4543",
    "Body": "Unity, unselfishness, love for Allah and man,-these\r\\n\\t\\t\\t\\tthings are inconsistent with selfish aggrandizement,\r\\n\\t\\t\\t\\tunjust suppression of our fellow-creatures, false\r\\n\\t\\t\\t\\tworship, and false conduct to our brethren. Hence the\r\\n\\t\\t\\t\\tGospel of Unity, though it is in complete accord with the\r\\n\\t\\t\\t\\tpure pattern after which Allah made us, is yet hard to\r\\n\\t\\t\\t\\tthose who love self and falsehood. But Grace is free to\r\\n\\t\\t\\t\\tall, and in His wise Plan, He will specially select\r\\n\\t\\t\\t\\tTeachers to show the Way to humanity, and no one who tums\r\\n\\t\\t\\t\\tto Him will lack guidance."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "14",
    "NoteID": "4544",
    "Body": "Cf. ii. 213. If you reject Truth after it has reached\\n\\t\\t\\t\\tyou, it can only be through selfish contumacy or envy."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "14",
    "NoteID": "4545",
    "Body": "Cf. x. 19, and n. 1407. Allah's decree has allowed a\\n\\t\\t\\t\\tcertain Term during which a sinner has the chance of\\n\\t\\t\\t\\trepentance and forgiveness. Were it not so, sin would be\\n\\t\\t\\t\\tpunished at once, and the matter would be decided\\n\\t\\t\\t\\tstraightway. So also, when people reject Truth from\\n\\t\\t\\t\\tselfish or contumacious motives, they get rope: perchance\\n\\t\\t\\t\\tthey may repent."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "14",
    "NoteID": "4546",
    "Body": "Cf. xiv. 9 and n. 1884. \"Those who have inherited the\\n\\t\\t\\t\\tBook\" are the People of the Book, of the ages since the\\n\\t\\t\\t\\tBook or Revelation came to them. Referring to the Jews\\n\\t\\t\\t\\tand Christians, contemporary with our Prophet, how true\\n\\t\\t\\t\\tit is that they were broken up into hostile sects which\\n\\t\\t\\t\\thated and persecuted each other! Islam came to unite\\n\\t\\t\\t\\tthem, and it did. For the present phases of Christianity\\n\\t\\t\\t\\tand Judaism are of later growth."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "15",
    "NoteID": "4547",
    "Body": "How beautifully the mission of Islam is commended in this\\n\\t\\t\\t\\tverse! (1) The more sectarianism and division there is in\\n\\t\\t\\t\\tthe world, the more need is there for the Gospel of\\n\\t\\t\\t\\tUnity. (2) It must steadfastly pursue its way. (3) It\\n\\t\\t\\t\\tmust not be deflected by worldly or political motives.\\n\\t\\t\\t\\t(4) Its faith must be directly in Allah and in Allah's\\n\\t\\t\\t\\tRevelation. \"The Book\" mentioned here covers all the\\n\\t\\t\\t\\trevelations sent by Allah to His prophets. (5) it must\\n\\t\\t\\t\\tjudge justly between warring factions, as the Religion of\\n\\t\\t\\t\\tPeace and Unity."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "15",
    "NoteID": "4548",
    "Body": "The Mission of Islam is further described. (6) The God\\n\\t\\t\\t\\twhom it preaches is not an exclusive God: He is the Lord\\n\\t\\t\\t\\tof the Worlds: to any given person, of whatever faith,\\n\\t\\t\\t\\t'He is your Allah, as well as mine.' (7) Our Faith is not\\n\\t\\t\\t\\ta question of words; it is deeds which decide; each one\\n\\t\\t\\t\\tof us has personal responsibility for his own conduct.\\n\\t\\t\\t\\t(8) There is no cause of contention whatever, when we\\n\\t\\t\\t\\tpreach Unity, Truth, and the Hereafter. (9) If you have\\n\\t\\t\\t\\tdoubts, the final arbiter is Allah, and His pleasure is\\n\\t\\t\\t\\tour Goal."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "16",
    "NoteID": "4549",
    "Body": "After He has been accepted. The disputants are the\\n\\t\\t\\t\\tUnbelievers who pugnaciously assault the minds of\\n\\t\\t\\t\\tBelievers after the Believers have by conviction accepted\\n\\t\\t\\t\\tFaith in Allah as leading to spiritual Light. Such\\n\\t\\t\\t\\tdisputation is futile. An inner spiritual experience can\\n\\t\\t\\t\\tnever be shaken by dialectical assaults. On the contrary\\n\\t\\t\\t\\tsuch disputations recoil on the heads of those who\\n\\t\\t\\t\\tindulge in them. Allah's Wrath is on them in this life,\\n\\t\\t\\t\\tand the terrible Penalty of the Hereafter must inevitably\\n\\t\\t\\t\\tfollow their evil plots against Truth."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "17",
    "NoteID": "4550",
    "Body": "Revelation is like a balance, an instrument placed by\\n\\t\\t\\t\\tAllah in our hands, by which we can weigh all moral\\n\\t\\t\\t\\tissues, all questions of right and wrong in conduct. We\\n\\t\\t\\t\\tmust do so constantly. For the Judgment in any given case\\n\\t\\t\\t\\tmay come at any time: it may be quite near, and we must\\n\\t\\t\\t\\talways be prepared. The Balance may also refer to the God\\n\\t\\t\\t\\tgiven faculty by which man can judge between right and\\n\\t\\t\\t\\twrong."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "18",
    "NoteID": "4551",
    "Body": "The Unbelievers do not believe in Judgment and laugh at\\n\\t\\t\\t\\tit. They say defiantly, \"If there is to be a punishment,\\n\\t\\t\\t\\tlet it come at once!\" The threefold answer to this will\\n\\t\\t\\t\\tbe found in n. 1810 to xiii. 6. With those who believe,\\n\\t\\t\\t\\tthe case is different. They know that the Hereafter is an\\n\\t\\t\\t\\tawful Reality, and prepare for it. They see clearly on\\n\\t\\t\\t\\twhat a wrong track the scoffers are!"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "19",
    "NoteID": "4552",
    "Body": "Latif: so kind, gracious, and understanding, as to bestow\\n\\t\\t\\t\\tgifts finely suited to the needs of the recipients. For\\n\\t\\t\\t\\tthe various meanings of Latif, see n. 2844 to xxii. 63.\\n\\t\\t\\t\\tCf. also xii. 100."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "19",
    "NoteID": "4553",
    "Body": "\"Servants\" here seems to include all men, just and\\n\\t\\t\\t\\tunjust, for Allah provides for them all."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "19",
    "NoteID": "4554",
    "Body": "Sustenance, i.e., provision for all needs. \"To whom He\\n\\t\\t\\t\\tpleases\" is not restrictive, but modal. 'Allah provides\\n\\t\\t\\t\\tfor all, but His provision is according to His wise Will\\n\\t\\t\\t\\tand Plan, and not according to people's extravagant\\n\\t\\t\\t\\tdemands.' He can provide for all, because He has complete\\n\\t\\t\\t\\tpower and can carry out His Will. A further comment will\\n\\t\\t\\t\\tbe found in the next verse."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "20",
    "NoteID": "4555",
    "Body": "The parable is from the efforts of the husbandman, who\\n\\t\\t\\t\\tploughs and prepares the soil, sows the seed, weeds in\\n\\t\\t\\t\\tdue season, and reaps the harvest, You reap as you sow.\\n\\t\\t\\t\\tBut Allah will add manifold advantages for spiritual\\n\\t\\t\\t\\ttilth. To those who are only engrossed in the vanities of\\n\\t\\t\\t\\tthis world, something may accrue in this world, but the\\n\\t\\t\\t\\tnext world is closed to them."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "21",
    "NoteID": "4556",
    "Body": "Nothing can exist without the permission of Allah. Can\\n\\t\\t\\t\\tpeople, who indulge in false worship say: \"Why does Allah\\n\\t\\t\\t\\tpermit it?\" The answer is: \"a certain latitude is allowed\\n\\t\\t\\t\\twith the grant of a limited form of free will. When the\\n\\t\\t\\t\\ttime for Judgment comes, the Punishment is sure.\" See n.\\n\\t\\t\\t\\t1810 to xiii. 6. Decree (or Word) of Judgment: See n.\\n\\t\\t\\t\\t1407 to x. 19."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "22",
    "NoteID": "4557",
    "Body": "The chief feature of the punishment of wrong-doing is\\n\\t\\t\\t\\tthat the minds of the wrong-doers are haunted with terror\\n\\t\\t\\t\\ton account of their own guilty conscience. They cannot\\n\\t\\t\\t\\tpossibly escape the weight of that terror."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "22",
    "NoteID": "4558",
    "Body": "In contrast with the withering terror of the wrong-doers\\n\\t\\t\\t\\tis the ease and rational happiness of those who do good.\\n\\t\\t\\t\\t\"On them shall be no fear, nor shall they grieve\" (ii.\\n\\t\\t\\t\\t38). Their wills will have been purified, and they shall\\n\\t\\t\\t\\thave all that they shall desire, \"before their Lord\".\\n\\t\\t\\t\\tThat is, their highest Bliss will be the sight of their\\n\\t\\t\\t\\tLord. No higher Bounty can they wish for."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "23",
    "NoteID": "4559",
    "Body": "Heaven may be pictured to our minds in various forms.\\n\\t\\t\\t\\tThis is one of the highest, and Allah announces it freely\\n\\t\\t\\t\\tto the righteous."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "23",
    "NoteID": "4560",
    "Body": "No sort of tangible reward does the prophet of Allah ask\\n\\t\\t\\t\\tfor proclaiming the Glad Tidings of Allah. But at least\\n\\t\\t\\t\\the has the right to ask that his kith and kin should not\\n\\t\\t\\t\\tpersecute him and put all sorts of obstacles in his way,\\n\\t\\t\\t\\tas did the Quraish against the holy Prophet."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "23",
    "NoteID": "4561",
    "Body": "Cf. xxxv. 29-30, and notes 3915 (for increase) and 3917\\n\\t\\t\\t\\t(for Allah's appreciation of service)."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "24",
    "NoteID": "4562",
    "Body": "If any one has a doubt about a prophet's mission, let him\\n\\t\\t\\t\\tlook at the prophet's lfe, at his work, at his character.\\n\\t\\t\\t\\tAllah loves Truth, not Falsehood. Allah's aid goes with\\n\\t\\t\\t\\tTruth, not with Falsehood. The beauty and power of\\n\\t\\t\\t\\tAllah's Word cannot be found in Falsehood. The false\\n\\t\\t\\t\\tman's heart would be sealed, not expanded to new heights,\\n\\t\\t\\t\\tas is that of the Message-bearer of Allah."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "25",
    "NoteID": "4563",
    "Body": "Whatever the sin, Allah's Mercy is open to sincere\\n\\t\\t\\t\\tRepentance, at all times, until the decree of\\n\\t\\t\\t\\tcondemnation issues."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "26",
    "NoteID": "4564",
    "Body": "To the prayers of the righteous He listens, and He gives\\n\\t\\t\\t\\tthem of His Bounty beyond their deserts. Every time they\\n\\t\\t\\t\\tdo a little good, they are increased in their goodness.\\n\\t\\t\\t\\tEvery right impulse or aspiration is strengthened and\\n\\t\\t\\t\\tleads to progressive spiritual advancement."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "27",
    "NoteID": "4565",
    "Body": "It may be objected that all prayers, even of good people,\\n\\t\\t\\t\\tare not answered. The reply is: (1) that even everyone\\n\\t\\t\\t\\twho is good does not necessarily know what is best for\\n\\t\\t\\t\\thim, for the values in this life are curiously distorted;\\n\\t\\t\\t\\tand (2) on account of their want of knowledge, if\\n\\t\\t\\t\\teveryone got all he asked for, there would be chaos and\\n\\t\\t\\t\\tconfusion, and \"transgression beyond bounds through the\\n\\t\\t\\t\\tearth\", for the different interests are so intermingled\\n\\t\\t\\t\\tand balanced that some measure must be observed in\\n\\t\\t\\t\\tgranting people's wishes. This measure is best supplied\\n\\t\\t\\t\\tby the watchful care of Allah and His perfect knowledge\\n\\t\\t\\t\\tof all our real needs."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "27",
    "NoteID": "4566",
    "Body": "\"As He pleases\" is here almost equivalent to \"as He\\n\\t\\t\\t\\tthinks best\"."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "28",
    "NoteID": "4567",
    "Body": "That men should get such a blessing as rain when they\\n\\t\\t\\t\\texpect it according to ordinary calculations or\\n\\t\\t\\t\\tprobabilities does not impress them, as it is a daily\\n\\t\\t\\t\\toccurrence. But Allah's mercy is more than this. It comes\\n\\t\\t\\t\\tto our aid even when all hope is lost, and gives us new\\n\\t\\t\\t\\tchances and new openings where we least expect them. His\\n\\t\\t\\t\\tquality of cherishing and protecting His creatures is\\n\\t\\t\\t\\talways active, and what higher praise can we give?"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "29",
    "NoteID": "4568",
    "Body": "Dabbatun: beasts, living, crawling creatures of all\\n\\t\\t\\t\\tkinds: see n. 166 to ii. 164. Similarly in xxiv. 45, and\\n\\t\\t\\t\\tother passages, the word is used for living creatures of\\n\\t\\t\\t\\tall kinds, life generally, whose material basis is the\\n\\t\\t\\t\\tmysterious thing which science calls protoplasm. The more\\n\\t\\t\\t\\tour biological knowledge increases, the more do we marvel\\n\\t\\t\\t\\tat the unity of Life on the one hand, and its diversity\\n\\t\\t\\t\\ton the other."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "29",
    "NoteID": "4569",
    "Body": "Life is not confined to our one little Planet. It is a\\n\\t\\t\\t\\tvery old speculation to imagine some life like human life\\n\\t\\t\\t\\ton the planet Mars. Though no scientific demonstration is\\n\\t\\t\\t\\tpossible, it is reasonable to suppose that Life in some\\n\\t\\t\\t\\tform or other is scattered through some of the millions\\n\\t\\t\\t\\tof heavenly bodies scattered through space. What a\\n\\t\\t\\t\\twonderful Sign of Allah! The Almighty Who created such\\n\\t\\t\\t\\tcountless beings has surely the power to bring them\\n\\t\\t\\t\\ttogether."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "30",
    "NoteID": "4570",
    "Body": "All evil, all sorrow, all pain and affliction, are things\\n\\t\\t\\t\\tnot normal, things twisted from the pure and holy nature\\n\\t\\t\\t\\tas created by Allah's hands. As far as man is concerned,\\n\\t\\t\\t\\this misfortunes are but the consequences of the things he\\n\\t\\t\\t\\thas done. He must bear personal responsibility for them\\n\\t\\t\\t\\tand not throw the blame on others."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "31",
    "NoteID": "4571",
    "Body": "Every evil deed or word or thought must have its evil\\n\\t\\t\\t\\tconsequences: but if Allah forgives anything,-and He\\n\\t\\t\\t\\tforgives much, yet no one imagine that he has defeated-or\\n\\t\\t\\t\\tcan defeat-Allah's. Will or Plan. The only help or\\n\\t\\t\\t\\tprotection that is possible is from Allah. Cf. xxix. 22."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "32",
    "NoteID": "4572",
    "Body": "The great and stately ships are appealed to again and\\n\\t\\t\\t\\tagain as being among the Signs of Allah, from many\\n\\t\\t\\t\\taspects. The aspect referred to here is how the great\\n\\t\\t\\t\\tsailing ship runs prosperously as long as \"the breath of\\n\\t\\t\\t\\theaven fills the sail\", and what a miserable helpless\\n\\t\\t\\t\\tcreature she becomes when she once becomes becalmed.\\n\\t\\t\\t\\tStudents of English literature will remember the striking\\n\\t\\t\\t\\tpicture which Coleridge draws in his \"Rime of the Ancient\\n\\t\\t\\t\\tMariner.\" The becalmed ship is as it were in the grip of\\n\\t\\t\\t\\tDeath because of the crime which the sailor had\\n\\t\\t\\t\\tcommitted, and his mind feels psychologically the full\\n\\t\\t\\t\\tforce of the Sign. By analogy we can apply this to other\\n\\t\\t\\t\\tcraft: the steamer is not free from other dangers of the\\n\\t\\t\\t\\tsea, nor air-craft from numerous dangers of the air."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "33",
    "NoteID": "4573",
    "Body": "If we study such Signs in the right spirit, we learn the\\n\\t\\t\\t\\thighest lessons for our spiritual life: on the one hand,\\n\\t\\t\\t\\tpatient perseverance with reliance on Allah, and on the\\n\\t\\t\\t\\tother a feeling or attitude of grateful thanks to Allah,\\n\\t\\t\\t\\tthat He enables us to achieve so much in spite of our\\n\\t\\t\\t\\tshortcomings, and forgives in us so much that deserves\\n\\t\\t\\t\\tpunishment and disaster."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "35",
    "NoteID": "4574",
    "Body": "If we treat Allah's Signs in the wrong spirit, i.e.,\\n\\t\\t\\t\\tcontumaciously reject them or constantly dispute about\\n\\t\\t\\t\\tthem instead of trying to understand them, we are told\\n\\t\\t\\t\\tthat such tactics will avail us nothing. we cannot escape\\n\\t\\t\\t\\tthe consequences of our sins. The only way to escape is\\n\\t\\t\\t\\tby repentance on our part and the grant of mercy by\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "36",
    "NoteID": "4575",
    "Body": "Any good (or ill) which is our lot is only a temporary\\n\\t\\t\\t\\tphase to serve the convenience of this life. But there is\\n\\t\\t\\t\\ta higher good, which comes from Allah's own Presence.\\n\\t\\t\\t\\tSuch good is both superior in quality, and more\\n\\t\\t\\t\\tpermanent. In the same way, any ills that we may suffer\\n\\t\\t\\t\\tin this life, have reference only to the conditions of\\n\\t\\t\\t\\tthis our life of probation. The ills that we \"earn\" in\\n\\t\\t\\t\\tour spiritual Life-such as deprivation of Allah's\\n\\t\\t\\t\\tGrace-are far more momentous and permanent."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "36",
    "NoteID": "4576",
    "Body": "The higher and more permanent gifts which come from\\n\\t\\t\\t\\tAllah's Presence are for those who truly worship and\\n\\t\\t\\t\\tserve Allah. These are described by nine of their\\n\\t\\t\\t\\tcharacteristics: viz. (1) they have Faith: and it follows\\n\\t\\t\\t\\tthat (2) they trust in Allah, instead of running after\\n\\t\\t\\t\\tfalse standards or values: (3) they eschew the more\\n\\t\\t\\t\\tserious offences against Allah's Law, and of course keep\\n\\t\\t\\t\\tclear of any offences against sex (indecencies); (4)\\n\\t\\t\\t\\twhile knowing that they are not themselves perfect, they\\n\\t\\t\\t\\tare ready to forgive others, even though they are sorely\\n\\t\\t\\t\\ttried with anger and provocation; for the rest see n.\\n\\t\\t\\t\\t4578."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "37",
    "NoteID": "4577",
    "Body": "Here we are speaking of the ordinary man or woman who\\n\\t\\t\\t\\ttries to follow Allah's Law: he or she is not perfect,\\n\\t\\t\\t\\tbut at least eschews the major breaches of conduct. For\\n\\t\\t\\t\\tthose higher in spiritual degree there is of course a\\n\\t\\t\\t\\tstricter standard. But all are entitled to the blessing\\n\\t\\t\\t\\tof Islam, whatever their degree."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "38",
    "NoteID": "4578",
    "Body": "Continuing the enumeration of the characteristics\\n\\t\\t\\t\\tdescribed in n. 4576 above, we have the following further\\n\\t\\t\\t\\tqualities in those who wish to serve Allah. (5) They are\\n\\t\\t\\t\\tready at all times to hearken to Allah's Signs, or to\\n\\t\\t\\t\\tlisten to the admonitions of prophets of Allah, and to\\n\\t\\t\\t\\tfollow the true Path, as they understand it; (6) they\\n\\t\\t\\t\\tkeep personal contact with Allah, by habits of Prayer and\\n\\t\\t\\t\\tPraise; (7) their conduct in life is open and determined\\n\\t\\t\\t\\tby mutual Consultation between those who are entitled to\\n\\t\\t\\t\\tvoice, e.g., in private domestic affairs, as between\\n\\t\\t\\t\\thusband and wife, or other responsible members of the\\n\\t\\t\\t\\thousehold; in affairs of business, as between partners or\\n\\t\\t\\t\\tparties interested; and in State affairs, as between\\n\\t\\t\\t\\trulers and ruled, or as between different departments of\\n\\t\\t\\t\\tadministration, to preserve the unity of administration;\\n\\t\\t\\t\\t(8) they do not forget Charity, or the help due to their\\n\\t\\t\\t\\tweaker brethren, out of the wealth or gifts or talents or\\n\\t\\t\\t\\topportunities, which Allah has provided for themselves;\\n\\t\\t\\t\\tand (9) when other people use them despitefully, they are\\n\\t\\t\\t\\tnot cowed down or terrorised into submission and\\n\\t\\t\\t\\tacceptance of evil, but stand up for their rights within\\n\\t\\t\\t\\tthe limits mentioned in verse 40."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "38",
    "NoteID": "4579",
    "Body": "\"Consultation.\" This is the key-word of the Sura, and\\n\\t\\t\\t\\tsuggests the ideal way in which a good man should conduct\\n\\t\\t\\t\\this affairs, so that, on the one hand, he may not become\\n\\t\\t\\t\\ttoo egotistical, and, on the other, he may not lightly\\n\\t\\t\\t\\tabandon the responsibilities which devolve on him as a\\n\\t\\t\\t\\tPersonality whose development counts in the sight of\\n\\t\\t\\t\\tAllah. See the points in head (7) under n. 4578 above.\\n\\t\\t\\t\\tThis principle was applied to its fullest extent by the\\n\\t\\t\\t\\tholy Prophet in his private and public life, and was\\n\\t\\t\\t\\tfully acted upon by the early rulers of Islam. Modern\\n\\t\\t\\t\\trepresentative government is an attempt-by no means\\n\\t\\t\\t\\tperfect-to apply this principle in State affairs. See my\\n\\t\\t\\t\\tReligious Polity of Islam."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "39",
    "NoteID": "4580",
    "Body": "This follows from the high value attached to an\\n\\t\\t\\t\\tindividual soul's Personality in Islam. Cf. last note.\\n\\t\\t\\t\\tThere are four possible situations that may arise: an\\n\\t\\t\\t\\tindividual may have to stand up against an oppressor (1)\\n\\t\\t\\t\\tfor his own trampled rights, or (2) for the rights of\\n\\t\\t\\t\\tothers within his ken; or (3) a community may have\\n\\t\\t\\t\\tsimilarly to stand up for its own rights collectively: or\\n\\t\\t\\t\\t(4) for the rights of others. Nos. 2, 3, and 4 are\\n\\t\\t\\t\\tconsidered highly meritorious for all, though few have\\n\\t\\t\\t\\tthe courage or the spirit to rise to so high a standard.\\n\\t\\t\\t\\tNo. I is specially liable to abuse on account of man's\\n\\t\\t\\t\\tselfishness; Nos. 2, 3 and 4 are also abused by men\\n\\t\\t\\t\\tpretending to motives of public good when they are\\n\\t\\t\\t\\tserving their own personal interests or idiosyncracies;\\n\\t\\t\\t\\thence the qualifications mentioned in the next four\\n\\t\\t\\t\\tverses and the notes thereto."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "40",
    "NoteID": "4581",
    "Body": "See last note. When you stand up for rights, either on\\n\\t\\t\\t\\tprivate or public grounds, it may be through processes of\\n\\t\\t\\t\\tlaw, or by way of private defence in so far as the law\\n\\t\\t\\t\\tpermits private action. But in all cases you must not\\n\\t\\t\\t\\tseek a compensation greater than the injury suffered. The\\n\\t\\t\\t\\tmost you can do is to demand equal redress, i.e., a harm\\n\\t\\t\\t\\tequivalent to the harm done to you. Even this may serve\\n\\t\\t\\t\\tto curb your unregenerate soul, or a community bent on\\n\\t\\t\\t\\trevenge. But the ideal mode is not to slake your thirst\\n\\t\\t\\t\\tfor vengeance, but to follow better ways leading to the\\n\\t\\t\\t\\treform of the offender or his reconciliation. See xli.\\n\\t\\t\\t\\t34, and xxiii. 96. You can take steps to prevent\\n\\t\\t\\t\\trepetition, by physical or moral means; the best moral\\n\\t\\t\\t\\tmeans would be to turn hatred into friendship by\\n\\t\\t\\t\\tforgiveness and love. In that case the compensation or\\n\\t\\t\\t\\treward (if we must use such terms) is infinitely greater,\\n\\t\\t\\t\\tfor it wins the good pleasure of Allah. But this active\\n\\t\\t\\t\\trighting of wrongs, whether by physical or by moral or\\n\\t\\t\\t\\tspiritual means, which are commended as better, is an\\n\\t\\t\\t\\tantithesis to the monkish doctrine, when you are smitten\\n\\t\\t\\t\\ton one cheek, to turn the other also. This would not\\n\\t\\t\\t\\tsuppress, but encourage wrong-doing. It is practised by\\n\\t\\t\\t\\tnone but poltroons, and is preached only by hypocrites,\\n\\t\\t\\t\\tor men who want to make slaves of others by depriving\\n\\t\\t\\t\\tthem of the power of self-defence. It occurs in two of\\n\\t\\t\\t\\tthe four canonical Gospels (Matt. v. 39, and Luke vi.\\n\\t\\t\\t\\t29), but we need not therefore assume that it was\\n\\t\\t\\t\\tpreached by Jesus."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "40",
    "NoteID": "4582",
    "Body": "To love Allah is the highest motive of our conduct, for\\n\\t\\t\\t\\tit leads to the love of Allah's creatures; to win the\\n\\t\\t\\t\\tapprobation and love of Allah, is the highest reward, far\\n\\t\\t\\t\\ttranscending any compensation or satisfaction we can\\n\\t\\t\\t\\tobtain in this life."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "40",
    "NoteID": "4583",
    "Body": "Allah does not love those who do wrong. If, therefore we\\n\\t\\t\\t\\ttolerate wrong, or encourage wrong by allowing it to run\\n\\t\\t\\t\\trampant when we can prevent it, we fail in our duty to\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "41",
    "NoteID": "4584",
    "Body": "Such people are not to be blamed, though they are\\n\\t\\t\\t\\tfollowing the lower law. The blame is on those who\\n\\t\\t\\t\\tarrogantly ride rough-shod over the land, oppressing\\n\\t\\t\\t\\tpeople with grievous wrong. See next verse."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "42",
    "NoteID": "4585",
    "Body": "The fact that men seek the lower rather than the higher\\n\\t\\t\\t\\tLaw is itself a result of arrogant wrong-doing of which\\n\\t\\t\\t\\tthe type was the Pharaoh who claimed to be \"your Lord\\n\\t\\t\\t\\tMost High\" and oppressed the Israelites, and kept his own\\n\\t\\t\\t\\tpeople under slavery and subjection, and the false\\n\\t\\t\\t\\tglamour of magic and deception."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "43",
    "NoteID": "4586",
    "Body": "It is harder to be patient and forgive, and yet to get\\n\\t\\t\\t\\twrongs righted, as was done by the holy Prophet, than to\\n\\t\\t\\t\\tbluster about and \"punish the guilty\" or \"teach them\\n\\t\\t\\t\\tlessons\". It may look like futility or lack of purpose,\\n\\t\\t\\t\\tbut in reality it is the highest and noblest form of\\n\\t\\t\\t\\tcourage and resolution. And it may carry out the purpose\\n\\t\\t\\t\\tof reform and the suppression of evil even better than\\n\\t\\t\\t\\tstem punishment. The gentleness of innocence often\\n\\t\\t\\t\\t\"persuades where stronger measures fail.\" But of course\\n\\t\\t\\t\\tcircumstances alter cases, and there is some allowance\\n\\t\\t\\t\\talso to be made for the personal equation of the men you\\n\\t\\t\\t\\thave to deal with: in some cases severity may be called\\n\\t\\t\\t\\tfor, but it should be from a strict judicial motive, and\\n\\t\\t\\t\\tnot merely from personal anger or spite or any lower\\n\\t\\t\\t\\tmotive in disguise."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "44",
    "NoteID": "4587",
    "Body": "When the actual consequences of evil are in sight, the\\n\\t\\t\\t\\tfoolish sinner wishes that it were possible to get back\\n\\t\\t\\t\\tto the life of probation. But he neglected or abused it\\n\\t\\t\\t\\tand rejected Allah's Grace all the time. How can he then\\n\\t\\t\\t\\tbe restored to a closed chapter of his life?"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "45",
    "NoteID": "4588",
    "Body": "They were very arrogant in their probationary life. Now\\n\\t\\t\\t\\tthey will be humbled to the dust. And they will be in\\n\\t\\t\\t\\tutter despair and misery. They will not be able to see\\n\\t\\t\\t\\tthe favours and good things of the other life (Cf. xx.\\n\\t\\t\\t\\t124-126). Even their misery, which will face them as a\\n\\t\\t\\t\\tterrible Reality, they will only be able to look at\\n\\t\\t\\t\\taskance, so thoroughly cowed will be their spirit."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "45",
    "NoteID": "4589",
    "Body": "This will be their thought, and their realised\\n\\t\\t\\t\\texperience: 'after all, any troubles and sorrows, any\\n\\t\\t\\t\\tpersecutions and taunts which they suffered in the life\\n\\t\\t\\t\\tof probation from the enemies of truth, were of no\\n\\t\\t\\t\\tconsequence; the real loss was that revealed at the\\n\\t\\t\\t\\tJudgment at the restoration of true values; the wicked\\n\\t\\t\\t\\tand the arrogant have lost their own souls, and have\\n\\t\\t\\t\\tbrought to perdition all who attached themselves to them\\n\\t\\t\\t\\tand followed their evil ways; and this Penalty is one\\n\\t\\t\\t\\tthat will endure! How much more real it is!'"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "46",
    "NoteID": "4590",
    "Body": "The argument begun in verse 44 above is here rounded off.\\n\\t\\t\\t\\t'If once men finally cut themselves off from Allah's\\n\\t\\t\\t\\tguidance and care, they will have no protection whatever.\\n\\t\\t\\t\\tAll their false objects of worship will only mislead them\\n\\t\\t\\t\\tfurther and further. How they will wish the fact blotted\\n\\t\\t\\t\\tout when they are in sight of Judgment, and vainly wish\\n\\t\\t\\t\\tfor time to be reversed! They will be in the Fire, while\\n\\t\\t\\t\\tthe men whom they despised and rejected will have reached\\n\\t\\t\\t\\tthe final Goal! For them there will be no such way!'"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "47",
    "NoteID": "4591",
    "Body": "The Day of Judgment is inevitable. Allah has ordained it,\\n\\t\\t\\t\\tand it cannot in any way be put back."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "47",
    "NoteID": "4592",
    "Body": "At Judgment no one can escape the consequences of his\\n\\t\\t\\t\\tcrimes or deeds. And no one can disavow them or deny\\n\\t\\t\\t\\tthem, or by any chance pretend that they do not apply to\\n\\t\\t\\t\\thim."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "48",
    "NoteID": "4593",
    "Body": "The warning is now given, that men may repent and do\\n\\t\\t\\t\\tgood, and pray for Allah's Mercy and Grace. If the\\n\\t\\t\\t\\twarning is not heeded or is rejected, the prophet of\\n\\t\\t\\t\\tAllah is not responsible for bringing about the Penalty\\n\\t\\t\\t\\tor for forcing people to come to the right Path. He is\\n\\t\\t\\t\\tnot a guard set over them to free them from the need of\\n\\t\\t\\t\\texercising their limited free-will."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "48",
    "NoteID": "4594",
    "Body": "Cf. xxx. 36. It is a sad reflection that men, when they\\n\\t\\t\\t\\treceive some gift out of Allah's Mercy, exult in their\\n\\t\\t\\t\\tgood fortune and attribute it to some merit in\\n\\t\\t\\t\\tthemselves, instead of to the Grace and Mercy of Allah,\\n\\t\\t\\t\\tthus missing the real lesson of Life. On the other hand,\\n\\t\\t\\t\\twhen they are in trouble, due to their own errors and\\n\\t\\t\\t\\tshortcomings, they fall into despair and blame Allah,\\n\\t\\t\\t\\tinstead of blaming themselves. This is rank ingratitude.\\n\\t\\t\\t\\tSo they miss the true lesson of Life in that case also."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "49",
    "NoteID": "4595",
    "Body": "Verses 49-50 deal, in their ordinary meaning, with\\n\\t\\t\\t\\tAllah's creative power replete with knowledge and\\n\\t\\t\\t\\tcontinued purpose, contrasted with man's instincts and\\n\\t\\t\\t\\tgropings after knowledge. The mystery of sex and\\n\\t\\t\\t\\tparenthood is referred to in a new light. With reference\\n\\t\\t\\t\\tto children, a parent is often spoken of as the \"author\"\\n\\t\\t\\t\\tof their being. The growth of population and the\\n\\t\\t\\t\\tproportion of males and females in it have various\\n\\t\\t\\t\\tsociological and psychological implications; yet how\\n\\t\\t\\t\\tlittle do parents really know about them? If advancing\\n\\t\\t\\t\\tknowledge threw light on what may be called the\\n\\t\\t\\t\\tmechanical aspects of the question, the profounder\\n\\t\\t\\t\\tproblems touched by it are beyond the reach of man. Yet\\n\\t\\t\\t\\tthey are not governed by chance. Allah has a meaning and\\n\\t\\t\\t\\tpurpose in all things, and His power is complete to carry\\n\\t\\t\\t\\tout His purpose."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "50",
    "NoteID": "4596",
    "Body": "To parents themselves it is a mystery why a male or\\n\\t\\t\\t\\tfemale child is given at any birth, or how the balance of\\n\\t\\t\\t\\tthe two sexes is made up in a family or in large groups\\n\\t\\t\\t\\tof mankind, or why in some cases the womb is barren and\\n\\t\\t\\t\\tthe would be parents are denied the joys and\\n\\t\\t\\t\\tresponsibilities of parenthood. But each individual human\\n\\t\\t\\t\\tsoul is precious in the Plan of Allah, and all these\\n\\t\\t\\t\\tvariations, besides their reactions on parents and on\\n\\t\\t\\t\\tsociety, have a purpose to fulfil in the large Plan of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "51",
    "NoteID": "4597",
    "Body": "This leads us on to the higher spiritual meaning of\\n\\t\\t\\t\\tverses 49-50, as leading up to verses 51-53. Man is but a\\n\\t\\t\\t\\tspeck in Allah's creation. His growth and family\\n\\t\\t\\t\\trelationships are not by any means comparable to Allah's\\n\\t\\t\\t\\tcreative acts, whose various stages are referred to in n.\\n\\t\\t\\t\\t120 to ii. 117, n. 916 to vi. 94, and n. 923 to vi. 98.\\n\\t\\t\\t\\tThat being so in the mysteries of man's daily life, how\\n\\t\\t\\t\\tmuch more profound is the contrast between man and Allah\\n\\t\\t\\t\\tin the apprehension of the higher spiritual problems\\n\\t\\t\\t\\tconcerned with Revelation? How can man be fit to speak to\\n\\t\\t\\t\\tAllah? He is not fit. But there are three ways in which\\n\\t\\t\\t\\tAllah, in His infinite Mercy, communicates with man, as\\n\\t\\t\\t\\tdescribed in verses 51-53."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "51",
    "NoteID": "4598",
    "Body": "Allah is Most High, Most Wise: man is, in spite of his\\n\\t\\t\\t\\thigh destiny, often the lowest of the low (xcv. 5). Yet\\n\\t\\t\\t\\tAllah, out of His infinite Mercy and Grace, has bestowed\\n\\t\\t\\t\\tHis revelation on man. How does it come about? Three ways\\n\\t\\t\\t\\tare mentioned: (1) Wahyun, Inspiration; (2) from behind a\\n\\t\\t\\t\\tveil; and (3) by the sending of a Messenger: see the\\n\\t\\t\\t\\tnotes following. Wahyun, Inspiration, is interpreted to\\n\\t\\t\\t\\tbe of two kinds: (1) a suggestion thrown by Allah into\\n\\t\\t\\t\\tthe heart or mind of man, by which man understands the\\n\\t\\t\\t\\tsubstance of the Message, whether it is a command or\\n\\t\\t\\t\\tprohibition, or an explanation of a great truth; and (2)\\n\\t\\t\\t\\tverbal or literal inspiration, by which the actual words\\n\\t\\t\\t\\tof Allah are conveyed in human language."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "51",
    "NoteID": "4599",
    "Body": "Behind a veil: not of course a material veil, but the\\n\\t\\t\\t\\tveil of Light. Muslim relates a tradition that the\\n\\t\\t\\t\\tProphet said: \"His veil is Light: were He to withdraw it,\\n\\t\\t\\t\\tthen would the august splendours of His countenance\\n\\t\\t\\t\\tsurely consume everything that comes within His Sight.\""
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "51",
    "NoteID": "4600",
    "Body": "Messenger: Rasul: the angel Gabriel, through whom the\\n\\t\\t\\t\\trevelations were given to the holy Prophet."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "52",
    "NoteID": "4601",
    "Body": "Before the receipt of his mission in his fortieth year,\\n\\t\\t\\t\\tthe holy Prophet, though a man of steadfast virtue and\\n\\t\\t\\t\\tpurity and unflinching in his search for Truth, was yet\\n\\t\\t\\t\\tunacquainted with Revelation in the highest sense of the\\n\\t\\t\\t\\tterm and with the certainty that comes from perfected\\n\\t\\t\\t\\tFaith, or realised nearness to Allah. Ruh, which I have\\n\\t\\t\\t\\there translated Inspiration has also been understood by\\n\\t\\t\\t\\tsome Commentators to refer to the angel Gabriel, the\\n\\t\\t\\t\\tvehicle of Revelation. The Light of the Qur-an made all\\n\\t\\t\\t\\tthings clear to man, and to the world."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "52",
    "NoteID": "4602",
    "Body": "The Qur-an and the inspired Prophet who proclaimed it,\\n\\t\\t\\t\\tare here identified. They were a Guide to men, showing\\n\\t\\t\\t\\tthe Straight Way. This Way is described in various ways:\\n\\t\\t\\t\\tfor example, see i. 6, and n. 22; xviii. 1-2, and notes\\n\\t\\t\\t\\t2326-27; and xc. 11-18."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "53",
    "NoteID": "4603",
    "Body": "The most comprehensive description of the Straight Way is\\n\\t\\t\\t\\tthat it is the Way of Allah, the Way of the Universal\\n\\t\\t\\t\\tLaw."
  }
]
