[
  {
    "SurahNumber": "62",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "The term \"unlettered people\" (ummiyun) denotes a nation\\n\\t\\t\\t\\tor community who had not previously had a revealed\\n\\t\\t\\t\\tscripture of their own (Razi). The designation of the\\n\\t\\t\\t\\tProphet as a man \"from among themselves\" is meant, in\\n\\t\\t\\t\\tthis context, to stress the fact that he, too, was\\n\\t\\t\\t\\tunlettered (ummi) in the primary sense of this word (cf.\\n\\t\\t\\t\\t 7:157  and {158}), and could not, therefore, have\\n\\t\\t\\t\\t\"invented\" the message of the Qur'an or \"derived\" its\\n\\t\\t\\t\\tideas from earlier scriptures."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "I.e., to cause the message of the Qur'an to reach people\\n\\t\\t\\t\\tof other environments and of future times through the\\n\\t\\t\\t\\tmedium of the Arabs and their language: thus stressing\\n\\t\\t\\t\\tthe universality and timeless validity of all that has\\n\\t\\t\\t\\tbeen revealed to Muhammad."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Or: \"He grants it unto whomever He wills\". Both these\\n\\t\\t\\t\\tformulations are syntactically correct; but since the\\n\\t\\t\\t\\tbounty of God referred to in this passage relates to the\\n\\t\\t\\t\\tdivine guidance granted to man through the medium of the\\n\\t\\t\\t\\trevelation bestowed upon God's Apostle, the construction\\n\\t\\t\\t\\tchosen by me seems to be more appropriate, expressing as\\n\\t\\t\\t\\tit does the idea that the bounty of God's guidance is\\n\\t\\t\\t\\talways available to one who sincerely desires it."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Connecting with the idea - implied in the preceding\\n\\t\\t\\t\\tpassage - that God's revelation is a sacred trust as well\\n\\t\\t\\t\\tas a bounty, the discourse turns now to the problem of\\n\\t\\t\\t\\tman's betrayal of this trust, exemplified by the Jews of\\n\\t\\t\\t\\tpost-Biblical times. They had been entrusted by God with\\n\\t\\t\\t\\tthe task of carrying the message of His oneness and\\n\\t\\t\\t\\tuniqueness to all the world: but they failed in this task\\n\\t\\t\\t\\tinasmuch as they came to believe that they were \"God's\\n\\t\\t\\t\\tchosen people\" because of their descent from Abraham,\\n\\t\\t\\t\\tIsaac and Jacob, and that, therefore, the divine message\\n\\t\\t\\t\\twas meant for them alone and not for people of other\\n\\t\\t\\t\\tnations. Hence, too, they came to deny the possibility of\\n\\t\\t\\t\\tprophethood being bestowed on anyone who did not belong\\n\\t\\t\\t\\tto the children of Israel (cf.  2:90  and {94}, and the\\n\\t\\t\\t\\tcorresponding notes [75] and [79]), and so they summarily\\n\\t\\t\\t\\trejected the idea of Muhammad's prophethood despite the\\n\\t\\t\\t\\tclear predictions of his advent in the Torah itself (see\\n\\t\\t\\t\\tnote [33] on  2:42 ). By thus corrupting the innermost\\n\\t\\t\\t\\tpurport of the divine writ bestowed on Moses, they\\n\\t\\t\\t\\tthemselves became unable to derive any real spiritual\\n\\t\\t\\t\\tbenefit from it, and to live up to its teachings."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "I.e., in its present form, estranged from the original\\n\\t\\t\\t\\tpurport of the Torah."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "For this and the next verse, cf. {2:94-95}."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Lit., \"of what their hands have sent ahead\"."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "8",
    "NoteID": "8",
    "Body": "An allusion to what is said in  2:96 ."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "8",
    "NoteID": "9",
    "Body": "See surah {6}, note [65]."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "I.e., on Friday, when the congregational prayer at noon\\n\\t\\t\\t\\tis obligatory. Nevertheless, as the sequence shows,\\n\\t\\t\\t\\tFriday is not a day of compulsory rest in Islamic Law."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "I.e., \"you may devote yourselves to worldly pursuits\"."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "11",
    "NoteID": "12",
    "Body": "Llt., \"they\"."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "11",
    "NoteID": "13",
    "Body": "Lit., \"trade\" or \"a bargain\"."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "11",
    "NoteID": "14",
    "Body": "Sc., \"O Prophet\" - thus alluding to an historical\\n\\t\\t\\t\\tincident, when most of the congregation, on hearing that\\n\\t\\t\\t\\ta long-expected trade caravan had come from Syria, rushed\\n\\t\\t\\t\\tout of the mosque in the midst of the Prophet's\\n\\t\\t\\t\\tFriday-sermon. In a wider, timeless sense, the above\\n\\t\\t\\t\\tverse contains an allusion to an all-too-human weakness\\n\\t\\t\\t\\tagainst which even true believers are not always immune:\\n\\t\\t\\t\\tnamely, the tendency to overlook religious obligations\\n\\t\\t\\t\\tfor the sake of a transitory, worldly advantage.63_1  See\\n\\t\\t\\t\\tnote [26] on the identical sentence in  58:16 ."
  }
]
