[
  {
    "SurahNumber": "45",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Cf.  2:164 , where the term ayat has been rendered by me\\n\\t\\t\\t\\tin the same way, inasmuch as those visible signs of a\\n\\t\\t\\t\\tconsciously creative Power convey a spiritual message to\\n\\t\\t\\t\\tman."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Cf.  7:185  and the corresponding note [151]. - The\\n\\t\\t\\t\\tintricate structure of human and animal bodies, and the\\n\\t\\t\\t\\tlife-preserving instincts with which all living creatures\\n\\t\\t\\t\\thave been endowed, make it virtually impossible to assume\\n\\t\\t\\t\\tthat all this has developed \"by accident\"; and if we\\n\\t\\t\\t\\tassume, as we must, that a creative purpose underlies\\n\\t\\t\\t\\tthis development, we must conclude, too, that it has been\\n\\t\\t\\t\\twilled by a conscious Power which creates all natural\\n\\t\\t\\t\\tphenomena \"in accordance with an inner truth\" (see note\\n\\t\\t\\t\\t[11] on  10:5 )."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "I.e., rain, with the symbolic connotation of physical and\\n\\t\\t\\t\\tspiritual grace often attached to it in the Qur'an."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "Lit., \"in what tiding after God and His messages\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "10",
    "NoteID": "7",
    "Body": "I.e., anything to which they may attribute a quasi-divine\\n\\t\\t\\t\\tinfluence on their lives, whether it be false deities or\\n\\t\\t\\t\\tfalse values, e.g., wealth, power, social status, etc."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "11",
    "NoteID": "8",
    "Body": "Lit., \"and or \"but\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "For an explanation of this rendering of the phrase min\\n\\t\\t\\t\\trijzin, see note [4] on  34:5 ."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "For the reason of the above interpolation, see surah\\n\\t\\t\\t\\t{14}, note [46]."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "13",
    "NoteID": "11",
    "Body": "I.e., by endowing man, alone among all living beings,\\n\\t\\t\\t\\twith a creative mind and, thus, with the ability to make\\n\\t\\t\\t\\tconscious use of the nature that surrounds him and is\\n\\t\\t\\t\\twithin him."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "14",
    "NoteID": "12",
    "Body": "Lit., \"who do not hope for [i.e., expect] the Days of\\n\\t\\t\\t\\tGod\", implying that they do not believe in them. As\\n\\t\\t\\t\\tregards the meaning of \"the Days of God\", see surah {14}."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "16",
    "NoteID": "13",
    "Body": "Sc., \"in the same way and for the same purpose as We now\\n\\t\\t\\t\\tbestow this revelation of the Qur'an\" - thus stressing\\n\\t\\t\\t\\tthe fact of continuity in all divine revelation."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "16",
    "NoteID": "14",
    "Body": "I.e., inasmuch as at that time they were the only truly\\n\\t\\t\\t\\tmonotheistic community (cf.  2:47 )."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "17",
    "NoteID": "15",
    "Body": "This, I believe, is the meaning of the phrase min al-amr\\n\\t\\t\\t\\tin the above  context, although most of the classical\\n\\t\\t\\t\\tcommentators are of the opinion that amr signifies here\\n\\t\\t\\t\\t\"religion\" (din), and interpret the whole phrase,\\n\\t\\t\\t\\taccordingly, as \"of what pertains to religion\". Since,\\n\\t\\t\\t\\thowever, the common denominator in all the possible\\n\\t\\t\\t\\tmeanings of the term amr - e.g., \"command\", \"injunction\",\\n\\t\\t\\t\\t\"ordinance\", \"matter [of concern]\", \"event\", \"action\",\\n\\t\\t\\t\\tetc. - is the element of purpose, whether implied or\\n\\t\\t\\t\\texplicit, we may safely assume that this is the meaning\\n\\t\\t\\t\\tof the term in the above elliptic phrase, which obviously\\n\\t\\t\\t\\talludes to the purpose underlying all divine revelation\\n\\t\\t\\t\\tand, consequently, man's faith in it. Now from the\\n\\t\\t\\t\\ttotality of the Qur'anic teachings it becomes apparent\\n\\t\\t\\t\\tthat the innermost purpose of all true faith is, firstly,\\n\\t\\t\\t\\ta realization of the existence of God and of every human\\n\\t\\t\\t\\tbeing's responsibility to Him; secondly, man's attaining\\n\\t\\t\\t\\tto a consciousness of his own dignity as a positive\\n\\t\\t\\t\\telement - a logically necessary element - in God's plan\\n\\t\\t\\t\\tof creation and, thus, achieving freedom from all manner\\n\\t\\t\\t\\tof superstitions and irrational fears; and, lastly,\\n\\t\\t\\t\\tmaking man aware that whatever good or evil he does is\\n\\t\\t\\t\\tbut done for the benefit, or to the detriment, of his own\\n\\t\\t\\t\\tself (as expressed in verse {15} above)."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "17",
    "NoteID": "16",
    "Body": "See  23:53  and the corresponding note [30]."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "Lit., \"thereafter\" or \"in the end\" (thumma) - i.e., after\\n\\t\\t\\t\\tthe failure of the earlier communities to realize the\\n\\t\\t\\t\\tideal purpose of faith in their actual mode of life."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "18",
    "NoteID": "18",
    "Body": "Lit., \"on a way of the purpose [of faith]\": see note [15]\\n\\t\\t\\t\\tabove. It is to be borne in mind that the literal meaning\\n\\t\\t\\t\\tof the term shariah is \"the way to a watering-place\", and\\n\\t\\t\\t\\tsince water is indispensable for all organic life, this\\n\\t\\t\\t\\tterm has in time come to denote a \"system of laws\", both\\n\\t\\t\\t\\tmoral and practical, which shows man the way towards\\n\\t\\t\\t\\tspiritual fulfilment and social welfare: hence,\\n\\t\\t\\t\\t\"religious law\" in the widest sense of the term. (See in\\n\\t\\t\\t\\tthis connection note [66] on the second part of  5:48 ."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "18",
    "NoteID": "19",
    "Body": "I.e., who are not - or not primarily - motivated by\\n\\t\\t\\t\\tGod-consciousness and, hence, are swayed only by what\\n\\t\\t\\t\\tthey themselves regard as \"right\" in accordance with\\n\\t\\t\\t\\tworldly, changing circumstances."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "19",
    "NoteID": "20",
    "Body": "Lit., \"against [i.e., \"in defiance of\"] God\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "20",
    "NoteID": "21",
    "Body": "l.e.. the Our'an, which unfolds to man the purpose of all\\n\\t\\t\\t\\tfaith."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "21",
    "NoteID": "22",
    "Body": "The meaning is twofold: \"that We consider them to be\\n\\t\\t\\t\\tequal with those who.. .\", etc., and \"that We shall deal\\n\\t\\t\\t\\twith them in the same manner as We deal with those\\n\\t\\t\\t\\twho...\", etc. The reference to the intrinsic difference\\n\\t\\t\\t\\tbetween these two categories with regard to \"their life\\n\\t\\t\\t\\tand their death\" points not merely to the moral quality\\n\\t\\t\\t\\tof their worldly existence, but also, on the one hand, to\\n\\t\\t\\t\\tthe inner peace and tranquility with which a true\\n\\t\\t\\t\\tbeliever faces life's tribulations and the moment of\\n\\t\\t\\t\\tdeath, and on the other, to the nagging anxiety which so\\n\\t\\t\\t\\toften accompanies spiritual nihilism, and the \"fear of\\n\\t\\t\\t\\tthe unknown\" at the time of dying."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "22",
    "NoteID": "23",
    "Body": "See note [11] on  10:5 . The implication is that without\\n\\t\\t\\t\\ta differentiation between right and wrong - or true and\\n\\t\\t\\t\\tfalse - there would be no \"inner truth\" in the concept of\\n\\t\\t\\t\\ta divinely-planned creation."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "23",
    "NoteID": "24",
    "Body": "Thus Razi, evidently reflecting the views of Zamakhshari,\\n\\t\\t\\t\\twhich have been quoted at length in my note [4] on\\n\\t\\t\\t\\t 14:4 ."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "23",
    "NoteID": "25",
    "Body": "See note [7] on  2:7 ."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "24",
    "NoteID": "26",
    "Body": "I.e., by accident, or as an outcome of blind forces of\\n\\t\\t\\t\\tnature."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "25",
    "NoteID": "27",
    "Body": "Lit., \"their argument is nothing but that they say\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "25",
    "NoteID": "28",
    "Body": "Cf.  44:36  and the corresponding note [19]."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "27",
    "NoteID": "29",
    "Body": "I.e., whatever they could not \"prove\" by direct\\n\\t\\t\\t\\tobservation or calculation. For the above rendering of\\n\\t\\t\\t\\tal-mubtilun, see surah {29}, note [47]."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "33",
    "NoteID": "30",
    "Body": "Lit., \"and that which they were wont to deride will have\\n\\t\\t\\t\\tenfolded them\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "35",
    "NoteID": "31",
    "Body": "Lit., \"since the life of this world has beguiled you\":\\n\\t\\t\\t\\timplying that this self-abandonment to worldly pursuits\\n\\t\\t\\t\\twas the cause of their scornful disregard of God's\\n\\t\\t\\t\\tmessages."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "35",
    "NoteID": "32",
    "Body": "Lit., \"out of it\". Regarding the stress on the phrase,\\n\\t\\t\\t\\t\"On that Day\", see note [114] on the last paragraph of\\n\\t\\t\\t\\t 6:128 , note [10] on  40:12  and note [59] on  43:74 ."
  }
]
