[
  {
    "SurahNumber": "25",
    "AyahNumber": "1",
    "Text": "Blessed is the One Who has revealed Al-Furqan (the criterion to\\n\\t\\t\\tdistinguish right from wrong: The Qur'an) to His servant, that he\\n\\t\\t\\tmay be a Warner to the worlds;"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "2",
    "Text": "He is the One to Whom belongs the kingdom of the heavens and the\\n\\t\\t\\tearth, has begotten no son and has no partner in His kingdom; He\\n\\t\\t\\thas created everything and ordained them in due proportions."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "3",
    "Text": "Yet the unbelievers have taken besides Him other gods which can\\n\\t\\t\\tcreate nothing but are themselves created, which can neither harm\\n\\t\\t\\tnor help even themselves, and which have no power over life or\\n\\t\\t\\tdeath, or raising the dead to life."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "4",
    "Text": "Those who deny the Truth say: \"This Al-Furqan (The Qur'an) is but\\n\\t\\t\\ta forgery which he (Muhammad) himself has devised and some other\\n\\t\\t\\tpeople have helped him.\" Unjust is what they do and falsehood is\\n\\t\\t\\twhat they utter!"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "5",
    "Text": "And they say: \"These are the stories of the ancients which he has\\n\\t\\t\\tcopied down from what is read to him day and night.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "6",
    "Text": "Tell them: \"This (The Qur'an) is revealed by Him Who knows the\\n\\t\\t\\tsecrets of the heavens and the earth; surely He is\\n\\t\\t\\tEver-Forgiving, Merciful.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "7",
    "Text": "And they say: \"What sort of Rasool is he who eats food and walks\\n\\t\\t\\tthrough the streets? Why has no angel been sent down with him to\\n\\t\\t\\tthreaten the disbelievers?"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "8",
    "Text": "Why he has not been given a treasure or at least a garden from\\n\\t\\t\\twhich he could eat?\" And these wicked people further say: \"You\\n\\t\\t\\tare only following a man who is bewitched.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "9",
    "Text": "See what sort of examples they apply to you! Because they are\\n\\t\\t\\tlost and cannot find the way to refute the truth of Tawhid and\\n\\t\\t\\tlife after death."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "10",
    "Text": "Blessed is He, Who, if He wills, could give you much better\\n\\t\\t\\tthings than what they propose for you: not one but many gardens\\n\\t\\t\\tbeneath which rivers flow; and make for you palaces too."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "11",
    "Text": "But in fact they deny the Hour - and for the one who denies the\\n\\t\\t\\tcoming of the Hour, We have prepared a blazing fire."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "12",
    "Text": "When it shall come into their sight, from a long distance, they\\n\\t\\t\\twill hear its raging and roaring."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "13",
    "Text": "And when, chained together, they are flung into some narrow\\n\\t\\t\\tspace, they will fervently plead for death."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "14",
    "Text": "But they will be told: \"Do not plead for one death today, but\\n\\t\\t\\tplead for many deaths.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "15",
    "Text": "Ask them: \"Which is better, this hell or the eternal paradise\\n\\t\\t\\twhich the righteous are being promised, which will be the reward\\n\\t\\t\\tof their good deeds and also their final destination;"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "16",
    "Text": "wherein they will live forever and get everything that they wish\\n\\t\\t\\tfor: and this is the promise worth praying for, which your Rabb\\n\\t\\t\\tis going to fulfill.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "17",
    "Text": "On that Day, He will gather all these people together along with\\n\\t\\t\\tthe deities whom they worshiped besides Allah, and ask: \"Was it\\n\\t\\t\\tyou who misled these servants of Mine, or did they choose to go\\n\\t\\t\\tastray themselves?\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "18",
    "Text": "Those deities will answer: \"Glory be to You! It was not befitting\\n\\t\\t\\tfor us that we could take any guardian besides You, but You let\\n\\t\\t\\tthem and their forefathers enjoy the comforts of worldly life\\n\\t\\t\\tuntil they forgot the Reminder, and thereby became worthless\\n\\t\\t\\tpeople.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "19",
    "Text": "Thus your gods will deny all that you profess today. Then you\\n\\t\\t\\tshall neither be able to avert your punishment nor shall you get\\n\\t\\t\\tany help from anywhere; and every one among you who is guilty of\\n\\t\\t\\twrongdoing, We shall make him taste the mighty punishment."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "20",
    "Text": "We have sent no Rasool before you, who did not eat or walk\\n\\t\\t\\tthrough the streets. In fact, We test you by means of one\\n\\t\\t\\tanother. Now, will you show patience, for your Rabb is Ever\\n\\t\\t\\tObservant."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "21",
    "Text": "Those who do not expect to meet Us on the Day of Judgement say:\\n\\t\\t\\t\"Why are not the angels sent down to us or why do we not see our\\n\\t\\t\\tRabb?\" Certainly they are too proud of themselves, and have\\n\\t\\t\\trevolted in a great revolt."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "22",
    "Text": "On the Day when they see the angels, it will not be a Day of\\n\\t\\t\\trejoicing for the criminal; rather they will cry: \"May there be a\\n\\t\\t\\tstone barrier between us and the angels of punishment.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "23",
    "Text": "Then We shall turn to the deeds which they did, based on their\\n\\t\\t\\twrong opinions, and render them vain like blown dust."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "24",
    "Text": "In contrast, the heirs of paradise shall have the best residence\\n\\t\\t\\tand finest lodging on that Day."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "25",
    "Text": "On that Day when the heavens shall burst asunder with clouds and\\n\\t\\t\\tthe angels will be sent down ranks after ranks,"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "26",
    "Text": "the real Kingdom on that Day will belong only to the\\n\\t\\t\\tCompassionate (Allah), a hard Day shall it be for the\\n\\t\\t\\tunbelievers."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "27",
    "Text": "On that Day the wrongdoer will bite his hands saying: \"Oh! Would\\n\\t\\t\\tthat I had only taken the pathway alongside the Rasool!"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "28",
    "Text": "Oh! Would that I had never chosen so-and-so for my companion."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "29",
    "Text": "He was the one who led me astray from the admonition even after\\n\\t\\t\\tit had reached me.\" Shaitan is ever treacherous to man."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "30",
    "Text": "The Rasool will say: \"O my Rabb! Surely my people took this\\n\\t\\t\\tQur'an for foolish nonsense.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "31",
    "Text": "That is how We made for every Rasool an enemy among the\\n\\t\\t\\tcriminals, but your Rabb is sufficient for you (O Muhammad) as a\\n\\t\\t\\tGuide and Helper."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "32",
    "Text": "The unbelievers ask: \"Why is not the Qur'an revealed to him all\\n\\t\\t\\tin a single revelation?\" This method of slow, well arranged,\\n\\t\\t\\tpiecemeal revelations is adopted to strengthen your heart."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "33",
    "Text": "The other reason for this method is that any time they come to\\n\\t\\t\\tyou with an argument, We reveal to you the Truth and properly\\n\\t\\t\\texplain it."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "34",
    "Text": "Those who will be dragged headlong into hell shall have an evil\\n\\t\\t\\tplace to dwell in, for they had lost the Way by taking an utterly\\n\\t\\t\\twrong stand."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "35",
    "Text": "We gave Musa (Moses) the Book and appointed his brother Haroon\\n\\t\\t\\t(Aaron) as a deputy with him,"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "36",
    "Text": "and said to them: \"Both of you should go to the people who have\\n\\t\\t\\tdenied Our Revelations.\" But those people rejected Our Rasools,\\n\\t\\t\\tas a result We destroyed them with utter destruction."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "37",
    "Text": "Likewise, the people of Nuh (Noah) We drowned when they rejected\\n\\t\\t\\tthe Rasools and made them an example for mankind; and We have\\n\\t\\t\\tprepared a painful punishment for such wrongdoers."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "38",
    "Text": "The nations of `Ad and Thamud were also destroyed, and so were\\n\\t\\t\\tthe dwellers of Ar-Rass, and many generations between them."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "39",
    "Text": "We admonished each of them by citing examples of those who were\\n\\t\\t\\tdestroyed before them, even then they rejected Our revelations,\\n\\t\\t\\tso We exterminated each one of them."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "40",
    "Text": "These unbelievers must have passed by that town which was\\n\\t\\t\\tdestroyed by a fatal rain; had they not seen its ruins? But the\\n\\t\\t\\tfact of the matter is they do not believe in the life hereafter."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "41",
    "Text": "Whenever they see you, they scoff at you, saying: \"Is this the\\n\\t\\t\\tman whom Allah has sent as a Rasool?"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "42",
    "Text": "Had we not stood firm, he (Muhammad) would have turned us away\\n\\t\\t\\tfrom our gods.\" Very soon, when they face the punishment, they\\n\\t\\t\\twill realize who actually went off the Right Path."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "43",
    "Text": "Have you ever seen the one who has taken his own desires as his\\n\\t\\t\\tgod? Would you take the responsibility of guiding him?"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "44",
    "Text": "Or do you think that most of them listen or try to understand?\\n\\t\\t\\tThey are nothing but animals - nay, they are even further off\\n\\t\\t\\ttrack!"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "45",
    "Text": "Have you not seen how your Rabb extends a shadow? If He wanted,\\n\\t\\t\\tHe could make it constant. Then We made the sun an indication of\\n\\t\\t\\tit;"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "46",
    "Text": "as the sun climbs up, We draw it in little by little towards\\n\\t\\t\\tOurselves."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "47",
    "Text": "He is the One Who has made the night a mantle for you, and sleep\\n\\t\\t\\ta rest, and made the day to rise up again."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "48",
    "Text": "He is the One Who sends the winds as heralds announcing His Mercy\\n\\t\\t\\tand sends down pure water from the sky,"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "49",
    "Text": "so that with it We may give life to a dead land, and quench the\\n\\t\\t\\tthirst of countless animals and men that We have created."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "50",
    "Text": "We distribute this water among them so that they may glorify Us,\\n\\t\\t\\tyet most people refuse to do anything except show ingratitude."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "51",
    "Text": "Had it been Our Will, We could have sent a Warner to every town,"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "52",
    "Text": "therefore, do not yield to the unbelievers, and make Jihad\\n\\t\\t\\t(strive) against them with this Qur'an, a mighty Jihad (strenuous\\n\\t\\t\\tstriving)."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "53",
    "Text": "He is the One Who has made the two seas rolling, the one sweet\\n\\t\\t\\tand fresh, the other salt and bitter, and set a rampart between\\n\\t\\t\\tthem, an insurmountable barrier."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "54",
    "Text": "He is the One Who has created man from water, then made for him\\n\\t\\t\\tblood relationships and that of marriage relationships, your Rabb\\n\\t\\t\\tis indeed All-Powerful."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "55",
    "Text": "Yet they worship those deities besides Allah which can neither\\n\\t\\t\\thelp nor harm them, over and above this, the unbeliever has\\n\\t\\t\\tbecome a helper of every rebel against his own Rabb."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "56",
    "Text": "But O Muhammad! We have sent you only to proclaim good news and\\n\\t\\t\\tto give warning."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "57",
    "Text": "Say: \"I ask of you no recompense for this work except that he who\\n\\t\\t\\twants, may take a the Right Way to his Rabb.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "58",
    "Text": "Put your trust in the Ever-Living (Allah) Who never dies:\\n\\t\\t\\tcelebrate His praise, for He Alone is sufficient to be aware of\\n\\t\\t\\tthe sins of His servants."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "59",
    "Text": "The One Who created the heavens and the earth and all that is\\n\\t\\t\\tbetween them in six days, and is firmly established on the Throne\\n\\t\\t\\tof authority; the Compassionate (Allah): as to His Glory, ask the\\n\\t\\t\\tone who knows."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "60",
    "Text": "When it is said to them, \"Prostrate yourselves before the Most\\n\\t\\t\\tCompassionate,\" they ask: \"Who is that Most Compassionate? Are we\\n\\t\\t\\tto prostrate just because you order us to?\" It merely increase\\n\\t\\t\\ttheir disdain."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "61",
    "Text": "Blessed is the One Who has decked the sky with constellations and\\n\\t\\t\\tplaced in it a lamp and a shining moon."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "62",
    "Text": "He is the One Who has caused the night and the day to succeed\\n\\t\\t\\teach other, for him who desires to learn a lesson or desires to\\n\\t\\t\\trender thanks."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "63",
    "Text": "True servants of the Compassionate (Allah) are those who walk on\\n\\t\\t\\tthe earth in humility and when the ignorant people address them,\\n\\t\\t\\tthey say: \"Peace;\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "64",
    "Text": "who pass the night prostrating before their Rabb and standing in\\n\\t\\t\\tprayers;"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "65",
    "Text": "who say: \"Our Rabb! Ward off the punishment of hell from us, for\\n\\t\\t\\tits punishment is atrocious"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "66",
    "Text": "- certainly it is an evil abode and an evil resting place;\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "67",
    "Text": "who, when they spend, are neither extravagant nor stingy, but\\n\\t\\t\\tkeep the balance between those two extremes;"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "68",
    "Text": "who do not invoke any other god besides Allah, nor kill any soul\\n\\t\\t\\twhich Allah has made sacred, except for a just cause, nor commit\\n\\t\\t\\tfornication - he that does this shall be punished for his sin,"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "69",
    "Text": "and his punishment shall be doubled on the Day of Resurrection\\n\\t\\t\\tand in disgrace he shall abide forever,"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "70",
    "Text": "except the one who repents, becomes a true believer, and starts\\n\\t\\t\\tdoing good deeds, for then Allah will change his evil deeds into\\n\\t\\t\\tgood, and Allah is Most Forgiving, Most Merciful."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "71",
    "Text": "He that repents and does good deeds, has truly turned to Allah\\n\\t\\t\\twith good turning."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "72",
    "Text": "Those are the ones who do not bear witness to falsehood and, if\\n\\t\\t\\tthey ever pass by futility, pass with dignity."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "73",
    "Text": "Who, when reminded about the revelations of their Rabb, do not\\n\\t\\t\\tturn a blind eye and a deaf ear to them."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "74",
    "Text": "Who pray: \"Our Rabb! Make our wives and our children to be the\\n\\t\\t\\tcomfort of our eyes, and make us leaders of the righteous.\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "75",
    "Text": "Such are the ones who will be rewarded with the lofty places in\\n\\t\\t\\tparadise for their patience, wherein they shall be welcomed with\\n\\t\\t\\tgreetings and salutations."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "76",
    "Text": "They shall live forever in that excellent dwelling and excellent\\n\\t\\t\\tresting place!"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "77",
    "Text": "O Muhammad! Say: \"My Rabb does not care at all if you invoke Him\\n\\t\\t\\tor not. Now that you have rejected His revelations, soon you will\\n\\t\\t\\tface the inevitable punishment.\""
  }
]
