[
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "1",
    "sectionHeading": "Washing the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tfrom his father that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, was washed in a long\\n\\t\\t\\t\\tshirt.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "2",
    "sectionHeading": "Washing the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Abi Tamima\\n\\t\\t\\t\\tas-Sakhtayani from Muhammad ibn Sirin that Umm Atiyya\\n\\t\\t\\t\\tal-Ansariyya said, \"The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, came to us when his\\n\\t\\t\\t\\tdaughter died and said, 'Wash her three times, or five,\\n\\t\\t\\t\\tor more than that if you think it necessary, with water\\n\\t\\t\\t\\tand lotus leaves, and at the end put on some camphor, or\\n\\t\\t\\t\\ta little camphor, and when you have finished let me\\n\\t\\t\\t\\tknow.' When we finished we told him, and he gave us his\\n\\t\\t\\t\\twaist-wrapper and said, 'Shroud her with this.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "3",
    "sectionHeading": "Washing the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tthat Asma bint Umays washed Abu Bakr as-Siddiq when he\\n\\t\\t\\t\\tdied. Then she went out and asked some of the muhajirun\\n\\t\\t\\t\\twho were there, \"I am fasting and this is an extremely\\n\\t\\t\\t\\tcold day. Do I have to do ghusl?\" They said, \"No.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "4",
    "sectionHeading": "Washing the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard people\\n\\t\\t\\t\\tof knowledge say, \"When a woman dies and there are no\\n\\t\\t\\t\\twomen with her to wash her and no man who has the right\\n\\t\\t\\t\\tby blood ties to take charge of that for her and no\\n\\t\\t\\t\\thusband to take charge of it for her, she should be\\n\\t\\t\\t\\tpurified by tayammum ,that is, by wiping her face and\\n\\t\\t\\t\\thands with earth.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a man dies and there are only women\\n\\t\\t\\t\\twith him, they also should purify him with earth .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no particular way with us for\\n\\t\\t\\t\\twashing the dead nor any recognised way to do it. They\\n\\t\\t\\t\\tare just washed and purified.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "5",
    "sectionHeading": "Shrouding the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\tshrouded in three pure white cotton garments, none of\\n\\t\\t\\t\\twhich was a long shirt or a turban.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "6",
    "sectionHeading": "Shrouding the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat he had heard that when Abu Bakr as-Siddiq was ill he\\n\\t\\t\\t\\tasked A'isha, \"How many shrouds did the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, have?\"\\n\\t\\t\\t\\tand she replied, \"Three pure white cotton garments.\" Abu\\n\\t\\t\\t\\tBakr said, \"Take this garment (a garment he was wearing\\n\\t\\t\\t\\ton which red clay or saffron had fallen) and wash it.\\n\\t\\t\\t\\tThen shroud me in it with two other garments.\" A'isha\\n\\t\\t\\t\\tsaid, \"Why's that?\", and Abu Bakr replied, \"The living\\n\\t\\t\\t\\thave greater need of the new than the dead. This is only\\n\\t\\t\\t\\tfor the body fluids that come out as the body decays.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "7",
    "sectionHeading": "Shrouding the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tHumayd ibn Abdar-Rahman ibn Awf that Abdullah ibn Amr ibn\\n\\t\\t\\t\\tal-As said, \"A dead man is clothed in a shirt and a\\n\\t\\t\\t\\twaist-wrapper and then wrapped in a third, and if he only\\n\\t\\t\\t\\thas one garment he is shrouded in that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "8",
    "sectionHeading": "Walking in Front of the Bier",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and Abu Bakr and Umar as well as the khalifas up\\n\\t\\t\\t\\tuntil this time and Abdullah ibn Umar, would walk in\\n\\t\\t\\t\\tfront of the bier.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "9",
    "sectionHeading": "Walking in Front of the Bier",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Muhammad ibn alMunkadir that\\n\\t\\t\\t\\tRabia ibn Abdullah ibn alHadir told him that he had seen\\n\\t\\t\\t\\tUmar ibn al-Khattab leading people in front of the bier\\n\\t\\t\\t\\tat the funeral of Zaynab bint Jahsh.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "10",
    "sectionHeading": "Walking in Front of the Bier",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Hisham ibn Urwa said,\\n\\t\\t\\t\\t\"I only ever saw my father in front of a funeral\\n\\t\\t\\t\\tprocession.\" He added, \"Then he would come to al-Baqi and\\n\\t\\t\\t\\tsit down until the procession passed him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "11",
    "sectionHeading": "Walking in Front of the Bier",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said,\\n\\t\\t\\t\\t\"Walking behind the bier is in contradiction to the\\n\\t\\t\\t\\tsunna.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t16.4 The Prohibition Against Following the Bier with a\\n\\t\\t\\t\\tBurning Torch\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "12",
    "sectionHeading": "The Prohibition Against Following the Bier with a Burning Torch",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\tAsma bint Abi Bakr said to her family, \"Perfume my\\n\\t\\t\\t\\tclothes with incense when I die and then embalm me. Do\\n\\t\\t\\t\\tnot put any of the embalming substance on my shroud, and\\n\\t\\t\\t\\tdo not follow me with a burning torch.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "13",
    "sectionHeading": "The Prohibition Against Following the Bier with a Burning Torch",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Abi Said\\n\\t\\t\\t\\tal-Maqburi that Abu Hurayra forbade anyone to follow him\\n\\t\\t\\t\\twith a burning torch after his death.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"I heard Malik disapprove of that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "14",
    "sectionHeading": "The Takbir Over a Dead Man",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, announced\\n\\t\\t\\t\\tthe death of an Najashi to everyone on the day that he\\n\\t\\t\\t\\tdied, and went out with them to the place of prayer, and\\n\\t\\t\\t\\tthen formed them into rows and said \"Allah is greater\"\\n\\t\\t\\t\\tfour times.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "15",
    "sectionHeading": "The Takbir Over a Dead Man",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Abu\\n\\t\\t\\t\\tUmama ibn Sahl ibn Hunayf told him that once a poor woman\\n\\t\\t\\t\\tfell ill and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, was told of her illness, and the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to visit poor people frequently and ask after\\n\\t\\t\\t\\tthem. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Let me know if she dies.\" Her\\n\\t\\t\\t\\tbier was brought out at night-time and they did not want\\n\\t\\t\\t\\tto wake up the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace. In the morning the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was told\\n\\t\\t\\t\\twhat had happened to her and he said, \"Didn't I tell you\\n\\t\\t\\t\\tto let me know if she died?\" They replied, \"Messenger of\\n\\t\\t\\t\\tAllah, we did not want to wake you up and make you come\\n\\t\\t\\t\\tout in the night.\" Then the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, went out and formed\\n\\t\\t\\t\\teveryone into rows by her grave and said \"Allah is\\n\\t\\t\\t\\tgreater\" four times.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "16",
    "sectionHeading": "The Takbir Over a Dead Man",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik asked Ibn Shihab about a\\n\\t\\t\\t\\tman who caught some of the takbirs said over the corpse\\n\\t\\t\\t\\tand missed the rest, and Ibn Shihab said, \"He completes\\n\\t\\t\\t\\twhat he has missed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "17",
    "sectionHeading": "What to Say in the Prayer for the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Abi Said\\n\\t\\t\\t\\tal-Maqburi from his father that he had asked Abu Hurayra,\\n\\t\\t\\t\\t\"How do you pray over the dead?\" and Abu Hurayra replied,\\n\\t\\t\\t\\t\"By the Life of Allah, I will tell you! I follow with the\\n\\t\\t\\t\\tfamily and when the corpse is put down I say 'Allah is\\n\\t\\t\\t\\tgreater' and praise Allah and ask for blessings on His\\n\\t\\t\\t\\tProphet. Then I say, 'O Allah, he is Your slave and the\\n\\t\\t\\t\\tson of Your male slave and Your female slave. He used to\\n\\t\\t\\t\\ttestify that there is no god but You and that Muhammad is\\n\\t\\t\\t\\tYour slave and Your Messenger, and You know that best. O\\n\\t\\t\\t\\tAllah, if he acted well, then increase for him his good\\n\\t\\t\\t\\taction, and if he acted wrongly, then overlook his wrong\\n\\t\\t\\t\\tactions. O Allah, do not deprive us of his reward, and do\\n\\t\\t\\t\\tnot try us after him.'\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma inna huwa abduka wa'bnu abdika wa'bnu amatika.\\n\\t\\t\\t\\tKana yash-hadu an la ilaha illa ant wa anna Muhammadan\\n\\t\\t\\t\\tabduka wa rasooluka, wa anta alamu bihi. Allahumma in\\n\\t\\t\\t\\tkana muhsinan zid fi ihsanihi, wa in kana musiyan fa\\n\\t\\t\\t\\ttajawaz an sayatihi. Allahumma la tahrimna ajrahu wa\\n\\t\\t\\t\\tlataftina badahu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "18",
    "sectionHeading": "What to Say in the Prayer for the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat he heard Said ibn al-Musayyab say, \"I once prayed\\n\\t\\t\\t\\tbehind Abu Hurayra over a child who had never done a\\n\\t\\t\\t\\twrong action and I heard him say, 'O Allah, give him\\n\\t\\t\\t\\tprotection from the torment of the grave.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "19",
    "sectionHeading": "What to Say in the Prayer for the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used not to recite when praying over a dead\\n\\t\\t\\t\\tperson.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "20",
    "sectionHeading": "Permission to Pray Over the Dead After Subh until the Dawn is very Clear and After Asr until the Sun Turns Yellow",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Abi\\n\\t\\t\\t\\tHarmala, the mawla of Abd ar-Rahman ibn Abi Sufyan ibn\\n\\t\\t\\t\\tHuwaytib, that Zaynab bint Abi Salama died during the\\n\\t\\t\\t\\ttime that Tariq was amir of Madina and her bier was\\n\\t\\t\\t\\tbrought out after subh and put in al-Baqi. He said that\\n\\t\\t\\t\\tTariq used to pray subh right at the beginning of its\\n\\t\\t\\t\\ttime. He added, \"I heard Abdullah ibn Umar say to the\\n\\t\\t\\t\\tfamily, 'You can either pray over your dead now or you\\n\\t\\t\\t\\tcan wait until the sun comes up.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "21",
    "sectionHeading": "Permission to Pray Over the Dead After Subh until the Dawn is very Clear and After Asr until the Sun Turns Yellow",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"The prayer for a dead person can be done\\n\\t\\t\\t\\tafter asr and subh if these have been prayed at their\\n\\t\\t\\t\\ttimes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "22",
    "sectionHeading": "Doing the Prayer for the Dead in Mosques",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, ordered\\n\\t\\t\\t\\tthat the body of Sad ibn Abi Waqqas be brought past her\\n\\t\\t\\t\\tin the mosque so that she could make dua for him. Some\\n\\t\\t\\t\\tpeople disapproved of her doing that, and she said, \"How\\n\\t\\t\\t\\thasty people are! The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, only prayed over Suhayl ibn\\n\\t\\t\\t\\tBayda in the mosque.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "23",
    "sectionHeading": "Doing the Prayer for the Dead in Mosques",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"The prayer over Umar ibn al-Khattab was\\n\\t\\t\\t\\tdone in the mosque.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "24",
    "sectionHeading": "The Prayer over the Dead in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUthman ibn Affan and Abdullah ibn Umar and Abu Hurayra\\n\\t\\t\\t\\tused to pray over the dead, both men and women, in\\n\\t\\t\\t\\tMadina. They would put the men nearer to the imam and the\\n\\t\\t\\t\\twomen nearer to the qibla.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "25",
    "sectionHeading": "The Prayer over the Dead in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar, when he prayed over the dead, would say, \"Peace\\n\\t\\t\\t\\tbe upon you\" loud enough for whoever was near to him to\\n\\t\\t\\t\\thear.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "26",
    "sectionHeading": "The Prayer over the Dead in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"No-one should pray over a dead\\n\\t\\t\\t\\tperson unless he is in wudu.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"I have not seen any\\n\\t\\t\\t\\tperson of knowledge disapproving of praying over either a\\n\\t\\t\\t\\tchild born of adultery or its mother.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "27",
    "sectionHeading": "Burying theDead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, died on Monday and was buried on Tuesday and\\n\\t\\t\\t\\tpeople prayed over him individually with no one leading\\n\\t\\t\\t\\tthem. Some people said that he would be buried near the\\n\\t\\t\\t\\tmimbar, and others said that he would be buried in\\n\\t\\t\\t\\tal-Baqi. Abu Bakr as-Siddiq came and said, \"I heard the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, 'No prophet was ever buried except in the\\n\\t\\t\\t\\tplace where he died.'  \"So a grave was dug for him there.\\n\\t\\t\\t\\tWhen he was about to be washed they wished to take off\\n\\t\\t\\t\\this shirt but they heard a voice saying \"Don't take off\\n\\t\\t\\t\\this shirt,\" so they did not take off his shirt and he was\\n\\t\\t\\t\\twashed with it on, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "28",
    "sectionHeading": "Burying theDead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"There were two men in Madina, one of\\n\\t\\t\\t\\twhom dug graves with a niche in the side wall for the\\n\\t\\t\\t\\tbody, and the other who did not, and they said,\\n\\t\\t\\t\\t'Whichever one comes first can do the job,' and the one\\n\\t\\t\\t\\twho dug graves with a niche came first and dug the\\n\\t\\t\\t\\tMessenger of Allah's grave, may Allah bless him and grant\\n\\t\\t\\t\\thim peace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "29",
    "sectionHeading": "Burying theDead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Umm\\n\\t\\t\\t\\tSalama, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to say, \"I did not believe that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, had died until I heard the pickaxes fall.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "30",
    "sectionHeading": "Burying theDead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"I saw three moons fall into my\\n\\t\\t\\t\\troom, and I related my vision to Abu Bakr as-Siddiq.\\n\\t\\t\\t\\tThen, when the Messenger of Allah died, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and was buried in my house, Abu\\n\\t\\t\\t\\tBakr said to me, 'This is one of your moons, and he is\\n\\t\\t\\t\\tthe best of them.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "31",
    "sectionHeading": "Burying theDead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from more than one\\n\\t\\t\\t\\treliable source that Sad ibn Abi Waqqas and Said ibn Zayd\\n\\t\\t\\t\\tibn Amr ibn Nufayl died at al-Aqiq and were carried to\\n\\t\\t\\t\\tMadina and buried there.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "32",
    "sectionHeading": "Burying theDead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"I would not want to be buried in\\n\\t\\t\\t\\tal-Baqi. I would prefer to be buried elsewhere. The one\\n\\t\\t\\t\\twho is buried in al-Baqi is one of two people. Either he\\n\\t\\t\\t\\tis unjust (dhalim), and I would not like to be buried\\n\\t\\t\\t\\twith him, or he is salih, and I would not like his bones\\n\\t\\t\\t\\tto be disturbed for me.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "33",
    "sectionHeading": "Stopping for Funerals and Sitting in Graveyards",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tWafid ibn Amr ibn Said ibn Muadh from Nafi ibn Jubayr ibn\\n\\t\\t\\t\\tMutim from Masud ibn al-Hakam from AIi ibn Abi Talib that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to stand up when a funeral procession passed\\n\\t\\t\\t\\tby, and then sit down again afterwards.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "34",
    "sectionHeading": "Stopping for Funerals and Sitting in Graveyards",
    "text": "<p>\\n\\t\\t\\t\\tahya related to me from Malik that he had heard that AIi\\n\\t\\t\\t\\tibn Abi Talib used to rest his head on graves and lie on\\n\\t\\t\\t\\tthem.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As far as we can see ,it is only forbidden\\n\\t\\t\\t\\tto sit on graves to relieve oneself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "35",
    "sectionHeading": "Stopping for Funerals and Sitting in Graveyards",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Bakr ibn Uthman\\n\\t\\t\\t\\tibn Sahl ibn Hunayf that he had heard Abu Umama ibn Sahl\\n\\t\\t\\t\\tibn Hunayf say, \"We used to attend funeral processions,\\n\\t\\t\\t\\tand the last of the people would not sit until they had\\n\\t\\t\\t\\tbeen given permission .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "36",
    "sectionHeading": "The Prohibition Against Weeping Over the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abdullah\\n\\t\\t\\t\\tibn Jabir ibn Atik that Atik ibn al-Harith, the\\n\\t\\t\\t\\tgrandfather of Abdullah ibn Abdullah ibn Jabir on his\\n\\t\\t\\t\\tmother's side, told him that Jabir ibn Atik had told him\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, came to visit Abdullah ibn Thabit and\\n\\t\\t\\t\\tfound him in his death-throes. He called to him but he\\n\\t\\t\\t\\tdid not reply. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"We belong to Allah, and\\n\\t\\t\\t\\tto Him we are returning,\" and added, \"You are being taken\\n\\t\\t\\t\\tfrom us, Abu'r-Rabi.''\\tThe women cried out and wept, and\\n\\t\\t\\t\\tJabir began to silence them. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Leave them,\\n\\t\\t\\t\\tand when the necessary time comes, none of the women\\n\\t\\t\\t\\tshould cry.\"  They said, \"Messenger of Allah, what is the\\n\\t\\t\\t\\tnecessary time?\", and he replied, \"When he dies.\"  The\\n\\t\\t\\t\\tdying  man's daughter said, \"By Allah, I hope that you\\n\\t\\t\\t\\twill be a martyr, for you have completed your\\n\\t\\t\\t\\tpreparations for battle,\" and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Allah has\\n\\t\\t\\t\\tmade his reward fall according to his intention. What do\\n\\t\\t\\t\\tyou consider dying a martyr to be?\" They said, \"Death in\\n\\t\\t\\t\\tthe way of Allah.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"There are seven\\n\\t\\t\\t\\tkinds of rnartyr other than those killed in the way of\\n\\t\\t\\t\\tAllah. Someone who is killed by the plague is a martyr,\\n\\t\\t\\t\\tsomeone who drowns is a martyr, someone who dies of\\n\\t\\t\\t\\tpleurisy is a martyr, someone who dies of a disease of\\n\\t\\t\\t\\tthe belly is a martyr, someone who dies by fire is a\\n\\t\\t\\t\\tmartyr, someone who dies under a falling building is a\\n\\t\\t\\t\\tmartyr and a woman who dies in childbirth is a martyr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "37",
    "sectionHeading": "The Prohibition Against Weeping Over the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom his father that Amra bint Abd ar-Rahman told him\\n\\t\\t\\t\\tthat she had heard A'isha, the umm al-muminin, say (when\\n\\t\\t\\t\\tit was mentioned to her that Abdullah ibn Umar used to\\n\\t\\t\\t\\tsay, \"The dead are tormented by the weeping of the\\n\\t\\t\\t\\tliving\"), \"May Allah forgive Abu Abd ar-Rahman. Of course\\n\\t\\t\\t\\the has not lied, but he has forgotten, or made a mistake.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, passed by a  jewish woman whose family were crying\\n\\t\\t\\t\\tover her and he said, 'You are crying over her, and she\\n\\t\\t\\t\\tis being tormented in her grave. ' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "38",
    "sectionHeading": "Contentment in the Face of Misfortune",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"No\\n\\t\\t\\t\\tmuslim who has three children die will be touched by the\\n\\t\\t\\t\\tFire except to fulfil Allah's oath.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "39",
    "sectionHeading": "Contentment in the Face of Misfortune",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Abi Bakr\\n\\t\\t\\t\\tibn Amr ibn Hazm from his father from Abu'n-Nadr\\n\\t\\t\\t\\tas-Salami that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"If three of a muslim's\\n\\t\\t\\t\\tchildren die, and he remains content with that, they will\\n\\t\\t\\t\\tbe a protection for him from the Fire.\" A woman who was\\n\\t\\t\\t\\twith the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Or two, Messengerof Allah?\", and\\n\\t\\t\\t\\the said, \"Or two.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "40",
    "sectionHeading": "Contentment in the Face of Misfortune",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard from\\n\\t\\t\\t\\tAbu'l-Hubab Said ibn Yasar from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The mumin continues to be struck by\\n\\t\\t\\t\\tmisfortune in his children and close friends until he\\n\\t\\t\\t\\tmeets Allah with no wrong actions.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "41",
    "sectionHeading": "Contentment in the Face of Misfortune Generally",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim ibn Muhammad ibn Abi Bakr that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Let the misfortune that befalls me be a comfort to the\\n\\t\\t\\t\\tmuslims in their misfortunes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "42",
    "sectionHeading": "Contentment in the Face of Misfortune Generally",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman from Umm Salama, the wife of the Prophet may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"If a misfortune befalls some one and he says, as Allah\\n\\t\\t\\t\\thas ordered, 'We belong to Allah and to Him we are\\n\\t\\t\\t\\treturning. O Allah, reward me in my misfortune and give\\n\\t\\t\\t\\tme better than it afterwards,' Allah will do that for\\n\\t\\t\\t\\thim\" (Inna lillahi wa inna ilayhi rajiun. Allahumma'\\n\\t\\t\\t\\tjurniy fi musiybatiy, wa a qibhiy khayran minha, illa\\n\\t\\t\\t\\tfaala 'llahu dhalika bihi.).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tUmm Salama said, \"When Abu Salama died I said that, and\\n\\t\\t\\t\\tthen I said, 'Who is better than Abu Salama?' \" And then\\n\\t\\t\\t\\tAllah left her the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and he married her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "43",
    "sectionHeading": "Contentment in the Face of Misfortune Generally",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad said, \"One of my wives died and\\n\\t\\t\\t\\tMuhammad ibn Kab al Quradhi came to console me about her.\\n\\t\\t\\t\\tHe told me of one among the Bani Israil who was a\\n\\t\\t\\t\\tdiligent, worshipping, knowing and understanding man who\\n\\t\\t\\t\\thad a wife that he admired and loved, and she died. He\\n\\t\\t\\t\\tgrieved over her intensely and lamented her until he\\n\\t\\t\\t\\twithdrew into a house and locked himself in, hidden from\\n\\t\\t\\t\\teveryone, and no-one visited him. A woman heard about him\\n\\t\\t\\t\\tand went to him, saying, 'I need him to give me an\\n\\t\\t\\t\\topinion. Nothing will satisfy me except what he says\\n\\t\\t\\t\\tabout it.' Everyone went away, but she stuck to his door\\n\\t\\t\\t\\tand said, 'I must see him.' Someone said to him, 'There\\n\\t\\t\\t\\tis a woman who wishes to ask your opinion about\\n\\t\\t\\t\\tsomething,' and she insisted, 'I will only talk to him\\n\\t\\t\\t\\tabout it.'  When everyone had gone away, and she still\\n\\t\\t\\t\\thad not left his door, he said, 'Let her in.' So she went\\n\\t\\t\\t\\tin and saw him and said, 'I have come to ask your opinion\\n\\t\\t\\t\\tabout something.'  He said, 'What is it?' She said, 'I\\n\\t\\t\\t\\tborrowed a piece of jewellery from a neighbour of mine,\\n\\t\\t\\t\\tand I have worn it and used it for a long time. Then they\\n\\t\\t\\t\\tsent to me for it. Should I let them have it back?'  He\\n\\t\\t\\t\\tsaid, 'Yes, by Allah.' She said, 'I have had it for a\\n\\t\\t\\t\\tlong time.'  He said, 'It is more correct for you to\\n\\t\\t\\t\\treturn it to them, since they have lent it to you for\\n\\t\\t\\t\\tsuch a long time.'  She said, 'Yes. May Allah have mercy\\n\\t\\t\\t\\ton you. Do you then grieve over what Allah has lent you\\n\\t\\t\\t\\tand then taken from you, when He has a greater right to\\n\\t\\t\\t\\tit than you?'  Then he saw the situation he was in, and\\n\\t\\t\\t\\tAllah helped him by her words.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "44",
    "sectionHeading": "Digging Up Graves",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'r-Rijal Muhammad\\n\\t\\t\\t\\tibn Abd ar-Rahman heard his mother Amra bint Abd\\n\\t\\t\\t\\tar-Rahman say, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, cursed both men and women who\\n\\t\\t\\t\\tdug up,\" meaning those who dug up graves.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "45",
    "sectionHeading": "Digging Up Graves",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to say, \"Breaking the bone of a\\n\\t\\t\\t\\tmuslim when he is dead is like breaking it when he is\\n\\t\\t\\t\\talive.\"  She meant if done in wrong action.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "46",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\tAbbad ibn Abdullah ibn az-Zubayr that A'isha, the wife of\\n\\t\\t\\t\\tthe Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\ttold him that she had heard the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, say before he died,\\n\\t\\t\\t\\twhile he was leaning on her breast and she was listening\\n\\t\\t\\t\\tto him, \"O Allah, forgive me and have mercy on me and\\n\\t\\t\\t\\tjoin me with the highest company.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "47",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that A'isha\\n\\t\\t\\t\\tsaid, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'No prophet dies until he is given\\n\\t\\t\\t\\tthe choice.' \" She continued, \"I heard him say ,'O Allah,\\n\\t\\t\\t\\tthe highest company,' and I knew that he was going.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "48",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"When you die, your\\n\\t\\t\\t\\tplace will be shown to you in the morning and the\\n\\t\\t\\t\\tevening. If you are one of the people of the Garden, then\\n\\t\\t\\t\\tyou will be with the people of the Garden, and if you are\\n\\t\\t\\t\\tone of the people of the Fire, then you will be with the\\n\\t\\t\\t\\tpeople of the Fire. You will be told, 'This is your place\\n\\t\\t\\t\\tof waiting until Allah raises you on the day of rising.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "49",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The earth\\n\\t\\t\\t\\teats all of the son of Adam except the coccyx. He was\\n\\t\\t\\t\\tcreated from it, and on it he is built.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "50",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Abd\\n\\t\\t\\t\\tar-Rahman ibn Kab ibn Malik al-Ansari told him that his\\n\\t\\t\\t\\tfather, Kab ibn Malik, used to relate that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"The ruh of the mumin is a bird that sits in the trees of\\n\\t\\t\\t\\tthe Garden until Allah returns it to his body on the day\\n\\t\\t\\t\\tHe raises him .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "51",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Allah, the\\n\\t\\t\\t\\tBlessed and Exalted, said, 'If My slave longs to meet Me,\\n\\t\\t\\t\\tI long to meet him, and if he is averse to meeting Me, I\\n\\t\\t\\t\\tam averse to meeting him.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "52",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"A man said to\\n\\t\\t\\t\\this family that he had never done a good action, and that\\n\\t\\t\\t\\twhen he died they were to burn him and then scatter half\\n\\t\\t\\t\\tof him on the land and half of him on the sea, and by\\n\\t\\t\\t\\tAllah, if Allah destined it for him He would punish him\\n\\t\\t\\t\\twith a punishment which He had not punished anyone else\\n\\t\\t\\t\\twith in all the worlds. When the man died, they did as he\\n\\t\\t\\t\\thad told them. Then Allah told the land to collect\\n\\t\\t\\t\\teverything that was in it, and told the sea to collect\\n\\t\\t\\t\\teverything that was in it, and then He said to the man,\\n\\t\\t\\t\\t'Why did you do this?' and he said, 'From fear of  You,\\n\\t\\t\\t\\tLord, and You know best.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Hurayra added, \"And He forgave him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "53",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Every child\\n\\t\\t\\t\\tis born on the fitra and it is his parents who make him a\\n\\t\\t\\t\\tjew or a christian.  Just as a camel is born whole - do\\n\\t\\t\\t\\tyou perceive any defect?\" They said, \"Messenger of Allah,\\n\\t\\t\\t\\twhat happens to people who die when they are (very)\\n\\t\\t\\t\\tyoung?\"  He said, \"Allah knows best what they used to\\n\\t\\t\\t\\tdo.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "54",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The Hour will\\n\\t\\t\\t\\tnot come until a man passes by the grave of another and\\n\\t\\t\\t\\tsays, 'If only I were in his place.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "55",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Amr ibn\\n\\t\\t\\t\\tHalhalaad-Dili from Mabad ibn Kab ibn Malik that Abu\\n\\t\\t\\t\\tQatada ibn Ribi used to relate that a funeral procession\\n\\t\\t\\t\\tpassed by the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and he said, \"One is relieved and\\n\\t\\t\\t\\tanother others are relieved from.\" They said, \"Who is the\\n\\t\\t\\t\\tone relieved and the one from whom others are relieved?\"\\n\\t\\t\\t\\tHe said, \"A slave who is mumin is the one who is relieved\\n\\t\\t\\t\\tfrom the exhaustion and suffering of this world to the\\n\\t\\t\\t\\tmercy of Allah, and a wrong-acting slave is the one from\\n\\t\\t\\t\\twhom people, towns, trees and animals are relieved.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "56",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, said that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, when\\n\\t\\t\\t\\tUthman ibn Madhun's funeral procession passed by him,\\n\\t\\t\\t\\t\"You have gone and you were not involved in any of it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "57",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from AIqama ibn Abi Alqama that his\\n\\t\\t\\t\\tmother said that she had heard A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, say,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, rose one night and put on his clothes and then\\n\\t\\t\\t\\twent out. I ordered my slave-girl, Barira, to follow him,\\n\\t\\t\\t\\tand she followed him until he got to al-Baqi. He stood\\n\\t\\t\\t\\tnear it as long as Allah willed and then he left. Barira\\n\\t\\t\\t\\tarrived back before him and told me and I did not say\\n\\t\\t\\t\\tanything to him until morning, and then I mentioned it to\\n\\t\\t\\t\\thim and he explained, 'I was sent out to the people of\\n\\t\\t\\t\\tal-Baqi to pray for them.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "16",
    "hadithNumber": "58",
    "sectionHeading": "Burial in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abu Hurayra\\n\\t\\t\\t\\tsaid, \"Make your funerals speedy, for it is only good\\n\\t\\t\\t\\tthat you are advancing him towards, or evil that you are\\n\\t\\t\\t\\ttaking off your necks.\"\\n\\t\\t\\t</p>"
  }
]
