[
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "1",
    "sectionHeading": "The Ghusl to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father from Asma bint Umays that she\\n\\t\\t\\t\\tgave birth to Muhammad ibn Abi Bakr at al-Bayda. Abu Bakr\\n\\t\\t\\t\\tmentioned this to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and he said, \"Tell her to do\\n\\t\\t\\t\\tghusl and then enter ihram.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "2",
    "sectionHeading": "The Ghusl to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that Asma bint Umays gave birth to\\n\\t\\t\\t\\tMuhammad ibn Abi Bakr at Dhu'l-Hulayfa and Abu Bakr told\\n\\t\\t\\t\\ther to do ghusl and then enter ihram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "3",
    "sectionHeading": "The Ghusl to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi' that 'Abdullah\\n\\t\\t\\t\\tibn Umar used to do ghusl for ihram before he entered\\n\\t\\t\\t\\tihram, and for entering Makka, and for standing on the\\n\\t\\t\\t\\tafternoon of 'Arafa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "4",
    "sectionHeading": "The Ghusl of Someone in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tIbrahim ibn Abdullah ibn Hunayn from his father Abdullah\\n\\t\\t\\t\\tibn Hunayn that Abdullah ibn Abbas and al-Miswar ibn\\n\\t\\t\\t\\tMakhrama once had a disagreement at al-Abwa. Abdullah\\n\\t\\t\\t\\tsaid that some one in ihram could wash his head, and al\\n\\t\\t\\t\\tMiswar ibn Makhrama maintained that some one in ihram\\n\\t\\t\\t\\tcould not wash his head.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah ibn Hunayn continued, \"Abdullah ibn Abbas sent\\n\\t\\t\\t\\tme to Abu Ayyub al-Ansari, and I found him doing ghusl\\n\\t\\t\\t\\tbetween the posts of a well, screened by a garment. I\\n\\t\\t\\t\\tgreeted him and hesaid, 'Who is that?' I replied, 'I am\\n\\t\\t\\t\\t'Abdullah ibn Hunayn. 'Abdullah ibn Abbas sent me to you\\n\\t\\t\\t\\tto ask how the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, used to wash his head when he was in\\n\\t\\t\\t\\tihram.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe continued, \"Abu Ayyub put his hand on the garment and\\n\\t\\t\\t\\tpulled it down until I could see his head. He said to the\\n\\t\\t\\t\\tman who was pouring out the water for him, 'Pour,' and he\\n\\t\\t\\t\\tpoured some over his head. Then he passed his hands over\\n\\t\\t\\t\\this head from the front to the back and then to the front\\n\\t\\t\\t\\tagain, and then said, 'I saw the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, doing it like this.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "5",
    "sectionHeading": "The Ghusl of Someone in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Humayd ibn Qays from Ata ibn Abi\\n\\t\\t\\t\\tRabah that 'Umar ibn alKhattab once asked Yala ibn Munya,\\n\\t\\t\\t\\twho was pouring out water for him while he was having a\\n\\t\\t\\t\\tghusl, to pour some on his head. Ya'la said, \"Are you\\n\\t\\t\\t\\ttrying to make me responsible? I will only pour it out if\\n\\t\\t\\t\\tyou tell me to do so.\" Umar ibn al-Khattab said, \"Pour.\\n\\t\\t\\t\\tIt will only make (my head) more unkempt.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "6",
    "sectionHeading": "The Ghusl of Someone in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that Abdullah ibn Umar\\n\\t\\t\\t\\twould spend the night between the two trails in the\\n\\t\\t\\t\\tvalley of Dhu Tuwa when he was approaching Makka. Then he\\n\\t\\t\\t\\twould pray subh, and after that he would enter Makka by\\n\\t\\t\\t\\tthe trail which is at the highest part of Makka. He would\\n\\t\\t\\t\\tnever enter Makka, if he was coming for hajj or umra,\\n\\t\\t\\t\\twithout doing ghusl beforehand when he was near Makka at\\n\\t\\t\\t\\tDhu Tuwa, and he would tell whoever was with him to do\\n\\t\\t\\t\\tlikewise.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "7",
    "sectionHeading": "The Ghusl of Someone in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar would never wash his head while he was in ihram\\n\\t\\t\\t\\texcept if he had to do ghusl because of a wet dream.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard the people of knowledge say\\n\\t\\t\\t\\tthat there is no harm in someone who is in ihram rubbing\\n\\t\\t\\t\\this head with certain kinds of plants after he has stoned\\n\\t\\t\\t\\tthe Jamrat al-Aqaba but before he has shaved his head,\\n\\t\\t\\t\\tbecause once he has finished stoning the Jamrat al-Aqaba\\n\\t\\t\\t\\tit is halal for him to kill lice, to shave his head, to\\n\\t\\t\\t\\tclean himself of body hair, and to wear normal clothes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "8",
    "sectionHeading": "Clothes Forbidden to be Worn in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that a man once asked the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, what clothes\\n\\t\\t\\t\\tsomeone in ihram could wear, and the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"Do not\\n\\t\\t\\t\\twear shirts, turbans, trousers, burnouses, or leather\\n\\t\\t\\t\\tsocks, except if you cannot find sandals. In that case\\n\\t\\t\\t\\tyou can wear leather socks, but cut them off below the\\n\\t\\t\\t\\tankles. Do not wear any clothes that have been touched by\\n\\t\\t\\t\\tsaffron or yellow dye.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about the hadith\\n\\t\\t\\t\\tattributed to the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, \"Whoever cannot find a waist wrapper should\\n\\t\\t\\t\\twear trousers,\" and he said, \"I have never heard this,\\n\\t\\t\\t\\tand I do not think that some one who is in ihram can wear\\n\\t\\t\\t\\ttrousers, because among the things which the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade some one in\\n\\t\\t\\t\\tihram to wear were trousers, and he did not make any\\n\\t\\t\\t\\texception for them although he did make an exception for\\n\\t\\t\\t\\tleather socks.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t20.4 Wearing Clothes when in Ihram\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "9",
    "sectionHeading": "Wearing Clothes when in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from 'Abdullah ibn Dinar\\n\\t\\t\\t\\tthat Abdullah ibn Umar said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade anyone in\\n\\t\\t\\t\\tihram to wear a garment which had been dyed with saffron\\n\\t\\t\\t\\tor yellow dye, and said, 'Anyone that cannot find sandals\\n\\t\\t\\t\\tcan wear leather socks, but he should cut them off below\\n\\t\\t\\t\\tthe ankles.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "10",
    "sectionHeading": "Wearing Clothes when in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that he had\\n\\t\\t\\t\\theard Aslam, the mawla of Umar ibn al-Khattab, telling\\n\\t\\t\\t\\t'Abdullah ibn Umar that Umar ibn al-Khattab once saw a\\n\\t\\t\\t\\tdyed garment on Talha ibn Ubaydullah while he was in\\n\\t\\t\\t\\tihram and Umar said, \"What is this dyed garment, Talha?\",\\n\\t\\t\\t\\tand Talha said, \"Amir al-muminin, it is only mud.''  Umar\\n\\t\\t\\t\\tsaid, \"You and your like are taken by people as imams,\\n\\t\\t\\t\\tand if an ignorant man were to see this garment he would\\n\\t\\t\\t\\tsay that Talha ibn Ubaydullah used to wear a dyed  robe\\n\\t\\t\\t\\twhile he was in ihram. So do not wear any form of dyed\\n\\t\\t\\t\\tclothes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "11",
    "sectionHeading": "Wearing Clothes when in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Asma bint Abi Bakr had worn clothes that\\n\\t\\t\\t\\twere completely dyed with safflower while she was in\\n\\t\\t\\t\\tihram, though there was not any saffron in them.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked if a garment which had\\n\\t\\t\\t\\tbeen perfumed could be used for ihram if the smell of the\\n\\t\\t\\t\\tperfume had gone, and he said, \"Yes, as long as there is\\n\\t\\t\\t\\tno saffron or yellow dye in it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "12",
    "sectionHeading": "Wearing Clothes when in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that 'Abdullah\\n\\t\\t\\t\\tibn 'Umar used to disapprove of anybody wearing a belt or\\n\\t\\t\\t\\tgirdle while in ihram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "13",
    "sectionHeading": "Wearing Clothes when in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Sa'id that\\n\\t\\t\\t\\the heard Said ibn al Musayyab say, about the girdle worn\\n\\t\\t\\t\\tby some one in ihram under his clothes, \"There is no harm\\n\\t\\t\\t\\tin it if he ties the ends together as a belt.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I like most out of what I have\\n\\t\\t\\t\\theard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "13",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad said that al-Furafisa ibn Umayr\\n\\t\\t\\t\\tal-Hanafi saw Uthman ibn Affan at al-Arj, and he was\\n\\t\\t\\t\\tcovering his face while in ihram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "13",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say that a man in ihram should not veil\\n\\t\\t\\t\\tanything above his chin .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "14",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar shrouded his son Waqid ibn Abdullah, who had\\n\\t\\t\\t\\tdied at al-Juhfa while in ihram, and he veiled his head\\n\\t\\t\\t\\tand face and said, \"If we had not been in ihram we would\\n\\t\\t\\t\\thave perfumed him. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A man can only do things while he is alive.\\n\\t\\t\\t\\tWhen he is dead, his actions stop.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "15",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say that a woman in ihram should wear\\n\\t\\t\\t\\tneither a veil nor gloves.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "16",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\tFatima bint al-Mundhir said, \"We used to veil our faces\\n\\t\\t\\t\\twhen we were in ihram in the company of Asma bint Abi\\n\\t\\t\\t\\tBakr as-Siddiq.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t20.7 Wearing Perfume during Hajj.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "17",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"I perfumed the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, for his ihram before he entered\\n\\t\\t\\t\\tihram, and when he came out of ihram before he did tawaf\\n\\t\\t\\t\\tof the House.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "18",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd ibn Qays from\\n\\t\\t\\t\\tAta ibn Rabah that a bedouin came to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, when he\\n\\t\\t\\t\\twas at Hunayn, and he was wearing a shirt with traces of\\n\\t\\t\\t\\tyellow on it. He said, \"Messenger of Allah, I have\\n\\t\\t\\t\\tentered ihram for umra. What should I do?\"  The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said\\n\\t\\t\\t\\tto him, \"Take off your shirt and wash off this yellowness\\n\\t\\t\\t\\tand do in umra as you would do on hajj.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "19",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Aslam, the\\n\\t\\t\\t\\tmawla of Umar ibn al Khattab, that Umar ibn al-Khattab\\n\\t\\t\\t\\tdiscovered the smell of perfume while he was at\\n\\t\\t\\t\\tash-Shajara, and he asked, \"Who is this smell of perfume\\n\\t\\t\\t\\tcoming from?\" Muawiya ibn Abi Sufyan answered, \"From me,\\n\\t\\t\\t\\tamir al-muminin.\" Umar said, \"From you? By the life of\\n\\t\\t\\t\\tAllah!\" Muawiya explained, \"Umm Habiba perfumed me, amir\\n\\t\\t\\t\\tal-muminin. \"'Umar then said, \"You must go back and wash\\n\\t\\t\\t\\tit off.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "20",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from as-Salt ibn Zubayd\\n\\t\\t\\t\\tfrom more than one of his family that Umar ibn al-Khattab\\n\\t\\t\\t\\tdiscovered the smell of perfume while he was at\\n\\t\\t\\t\\tash-Shajara. Kathir ibn as-Salt was at his side, and Umar\\n\\t\\t\\t\\tasked, \"Who is this smell of perfume coming from?\", and\\n\\t\\t\\t\\tKathir said, \"From me, amir al-muminin. I matted my hair\\n\\t\\t\\t\\twith perfume and I intended not to shave it.'' Umar said,\\n\\t\\t\\t\\t\"Go to a sharaba and rub your head until it is clean,\"\\n\\t\\t\\t\\tand Kathir did so.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik explained, \"A sharaba is the ditch at the base of a\\n\\t\\t\\t\\tdate-palm.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "21",
    "sectionHeading": "Veiling the Face while in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said and\\n\\t\\t\\t\\t'Abdullah ibn Abi Bakr and Rabia ibn Abi Abd ar-Rahman\\n\\t\\t\\t\\tthat al-Walid ibn Abd al-Malik asked Salim ibn Abdullah\\n\\t\\t\\t\\tand Kharija ibn Zayd ibn Thabit if he could use perfume\\n\\t\\t\\t\\tafter he had stoned the jamra and shaved his head, but\\n\\t\\t\\t\\tbefore he had left for the tawafal-ifada. Salim forbade\\n\\t\\t\\t\\thim to do so, but Kharija ibn Zayd ibn Thabit said that\\n\\t\\t\\t\\the could.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in a man oiling himself\\n\\t\\t\\t\\twith an oil which does not have any perfume in it, either\\n\\t\\t\\t\\tbefore he enters ihram, or before he leaves Mina for the\\n\\t\\t\\t\\ttawaf al-ifada, if he has stoned the jamra.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether someone in ihram\\n\\t\\t\\t\\tcould eat food with saffron in it, and he said, \"There is\\n\\t\\t\\t\\tno harm in some one in ihram eating it if it has been\\n\\t\\t\\t\\tcooked. If, however, it has not been cooked he should not\\n\\t\\t\\t\\teat it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "22",
    "sectionHeading": "Where People Should Enter Ihram.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"The people of Madina should\\n\\t\\t\\t\\tenter ihram at Dhu'l-Hulayfa, the people of Syria should\\n\\t\\t\\t\\tdo so at al-Juhfa, and the people of Najd should do so at\\n\\t\\t\\t\\tQarn.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah ibn Umar added, \"I have heard that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'The people of Yemen should enter ihram at Yalamlam.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "23",
    "sectionHeading": "Where People Should Enter Ihram.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat Abdullah ibn Umar said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, told the people of\\n\\t\\t\\t\\tMadina to enter ihram at Dhu'l-Hulayfa, the people of\\n\\t\\t\\t\\tSyria to do so at al-Juhfa, and the people of Najd to do\\n\\t\\t\\t\\tso at Qarn.'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "24",
    "sectionHeading": "Where People Should Enter Ihram.",
    "text": "<p>\\n\\t\\t\\t\\tAbdullah ibn Umar said, \"I heard these three from the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace. I was also told that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'The people of\\n\\t\\t\\t\\tYemen should enter ihram at Yalamlam.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "25",
    "sectionHeading": "Where People Should Enter Ihram.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar once entered ihram at al-Fur.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "26",
    "sectionHeading": "Where People Should Enter Ihram.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a reliable source\\n\\t\\t\\t\\tthat Abdullah ibn Umar once entered ihram at Ilya\\n\\t\\t\\t\\t(Jerusalem).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "27",
    "sectionHeading": "Where People Should Enter Ihram.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, once entered ihram at al-Jiirrana (near Makka) for\\n\\t\\t\\t\\tan umra.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "28",
    "sectionHeading": "How to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Umar\\n\\t\\t\\t\\tthat the talbiya of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, was, \"I am at Your\\n\\t\\t\\t\\tservice, O Allah, I am at Your service. You have no\\n\\t\\t\\t\\tpartner. I am at Your service. Praise and blessing belong\\n\\t\\t\\t\\tto You, and the Kingdom. You have no partner.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tLabayk, Allahumma labayk, la sharika laka labayk.\\n\\t\\t\\t\\tInna'l-hamda wa'n-nimata laka wa'l-mulk, la sharika lak.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Abdullah ibn Umar used to add, \"I am at\\n\\t\\t\\t\\tYour service, I am at Your service. I am at Your service\\n\\t\\t\\t\\tand at Your call. Good is in Your hands, and I am at Your\\n\\t\\t\\t\\tservice. Our desire is for You, and our action .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tLabayk, labayk, labayk wa sadayka wa'l-khayr biyadayka\\n\\t\\t\\t\\tlabayk wa'r-raghba'u ilayka wa'l-amalu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "29",
    "sectionHeading": "How to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to pray two rakas in the\\n\\t\\t\\t\\tmosque at Dhu'l-Hulayfa, and then, when he had got on to\\n\\t\\t\\t\\this camel and it had stood up, he would begin doing\\n\\t\\t\\t\\ttalbiya.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "30",
    "sectionHeading": "How to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Musa ibn Uqba that\\n\\t\\t\\t\\tSalim ibn Abdullah heard his father say, \"Your claim that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, entered ihram from this desert of yours is not\\n\\t\\t\\t\\ttrue, because he only entered ihram from the mosque, i.e.\\n\\t\\t\\t\\tthe mosque of Dhu'l-Hulayfa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "31",
    "sectionHeading": "How to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Abi Said\\n\\t\\t\\t\\tal-Maqburi that Ubayd ibn Jurayj once said to Abdullah\\n\\t\\t\\t\\tibn Umar, \"Abu Abd ar-Rahman, I have seen you doing four\\n\\t\\t\\t\\tthings which I have never seen any of your companions\\n\\t\\t\\t\\tdoing.\" He said, \"What are they, Ibn Jurayj?\" and he\\n\\t\\t\\t\\treplied, \"I have seen you touching only the twoYamani\\n\\t\\t\\t\\tcorners, I have seen you wearing hairless sandals, I have\\n\\t\\t\\t\\tseen you using yellow dye, and, when you were at Makka\\n\\t\\t\\t\\tand everybody had started doing talbiya after seeing the\\n\\t\\t\\t\\tnew moon, I saw that you did not do so until the eighth\\n\\t\\t\\t\\tof Dhu'l-Hijja.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah ibn Umar replied, \"As for the corners, I only\\n\\t\\t\\t\\tever saw the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, touching the two Yamani corners. As for\\n\\t\\t\\t\\tthe sandals, I saw the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, wearing hairless sandals\\n\\t\\t\\t\\tand doing wudu in them, and I like wearing them. As for\\n\\t\\t\\t\\tusing yellow dye, I saw the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, using it, and I also like\\n\\t\\t\\t\\tto use it for dyeing things with. As for doing talbiya, I\\n\\t\\t\\t\\tnever saw the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, begin doing so until he had set out on\\n\\t\\t\\t\\tthe animal he was riding on (i.e. for Mina and Arafa).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "32",
    "sectionHeading": "How to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to pray in the mosque of Dhu'l-Hulayfa, and\\n\\t\\t\\t\\tthen go outside and get on his camel and when his camel\\n\\t\\t\\t\\thad stood up he would begin to do talbiya.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "33",
    "sectionHeading": "How to Enter Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abd\\n\\t\\t\\t\\tal-Malik ibn Marwan had started to do talbiya at the\\n\\t\\t\\t\\tmosque of Dhu'l-Hulayfa, after the animal he was riding\\n\\t\\t\\t\\ton had stood up, and that Aban ibn Uthman had told him to\\n\\t\\t\\t\\tdo this.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "34",
    "sectionHeading": "Raising the Voice in Talbiyya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from 'Abdullah ibn Abi\\n\\t\\t\\t\\tBakr ibn Muhammad ibn Amr ibn Hazm from Abd al-Malik ibn\\n\\t\\t\\t\\tAbi Bakr ibn al-Harith ibn Hisham from Khallad ibn\\n\\t\\t\\t\\tas-Sa'ib al-Ansari from his father that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Jibril came to me and told me to tell my companions, or\\n\\t\\t\\t\\twhoever was with me, to raise their voices when doing\\n\\t\\t\\t\\ttalbiya.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "35",
    "sectionHeading": "Raising the Voice in Talbiyya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the\\n\\t\\t\\t\\tpeople of knowledge say, \"Women do not have to raise\\n\\t\\t\\t\\ttheir voices when they are doing talbiya, and a woman\\n\\t\\t\\t\\tshould only speak loudly enough to hear herself.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Some one who is in ihram should not raise\\n\\t\\t\\t\\this voice when doing talbiya if he is in a mosque where\\n\\t\\t\\t\\tthere are groups of people. He should only speak loudly\\n\\t\\t\\t\\tenough for himself and those who are near him to be able\\n\\t\\t\\t\\tto hear, except in the Masjid alHaram and the mosque at\\n\\t\\t\\t\\tMina, where he should raise his voice.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard some of the people of knowledge\\n\\t\\t\\t\\trecommending (people to do) talbiya at the end of every\\n\\t\\t\\t\\tprayer and at every rise on the route.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "36",
    "sectionHeading": "Doing Hajj on its Own",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abu'l-Aswad Muhammad\\n\\t\\t\\t\\tibn Abd ar-Rahman, fromUrwa ibn az-Zubayr, that A'isha,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, said, \"We set out with the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, in the year of\\n\\t\\t\\t\\tthe farewell hajj, and some of us went into ihram to do\\n\\t\\t\\t\\tumra, some of us went into ihram to do hajj and umra, and\\n\\t\\t\\t\\tsome of us went into ihram to do hajj on its own. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, went into ihram to do hajj on its own. Those who\\n\\t\\t\\t\\thad gone into ihram to do umra came out of ihram (after\\n\\t\\t\\t\\tdoing umra). Those who had gone into ihram to do hajj (on\\n\\t\\t\\t\\tits own), or to do both hajj and umra, did not come out\\n\\t\\t\\t\\tof ihram until the day of the sacrifice.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "37",
    "sectionHeading": "Doing Hajj on its Own",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim, from his father, from A'isha, umm al-muminin,\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, did hajj on its own.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "38",
    "sectionHeading": "Doing Hajj on its Own",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abu'l-Aswad Muhammad\\n\\t\\t\\t\\tibn 'Abd ar-Rahman, from Urwa ibn az-Zubayr, from A'isha,\\n\\t\\t\\t\\tumm al-muminin, that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, did hajj on its own.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "39",
    "sectionHeading": "Doing Hajj on its Own",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the\\n\\t\\t\\t\\tpeople of knowledge say, \"If someone goes into ihram to\\n\\t\\t\\t\\tdo hajj on its own, he cannot then go into ihram to do\\n\\t\\t\\t\\tumra.''\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I have found the people of\\n\\t\\t\\t\\tknowledge in our city doing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "40",
    "sectionHeading": "Doing Hajj and Umra Together (Hajj al-Qiran)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Jafar ibn Muhammad,\\n\\t\\t\\t\\tfrom his father, that al-Miqdad ibn al-Aswad once went to\\n\\t\\t\\t\\tsee AIi ibn Abi Talibat as-Suqya, where he was feeding\\n\\t\\t\\t\\tsome young camels of his with a mash of meal and leaves,\\n\\t\\t\\t\\tand he said to him, \"This man Uthman ibn Affan is telling\\n\\t\\t\\t\\tpeople that they cannot do hajj and umra together.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAl-Miqdad said, \"Ali ibn Abi Talib went off with bits of\\n\\t\\t\\t\\tmeal and leaves on his forearms - and I shall never\\n\\t\\t\\t\\tforget the sight of the meal and the leaves on his arms -\\n\\t\\t\\t\\tand went to see Uthman ibn Affan and asked him, 'Are you\\n\\t\\t\\t\\tsaying then that people cannot do hajj and umra\\n\\t\\t\\t\\ttogether?' Uthman replied, 'That is my opinion.'\\n\\t\\t\\t\\tWhereupon AIi got angry and went out saying, 'I am at\\n\\t\\t\\t\\tyour service, O Allah, I am at your service for a hajj\\n\\t\\t\\t\\tand an umra together.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Our position (here in Madina) is that\\n\\t\\t\\t\\tsomeone who does hajj and umra together should not remove\\n\\t\\t\\t\\tany of his hair, nor should he come out of ihram in any\\n\\t\\t\\t\\tway until he has sacrificed an animal, if he has one. He\\n\\t\\t\\t\\tshould come out of ihram at Mina, on the day of the\\n\\t\\t\\t\\tsacrifice.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "41",
    "sectionHeading": "Doing Hajj and Umra Together (Hajj al-Qiran)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Muhammad ibn Abd\\n\\t\\t\\t\\tar-Rahman, from Sulayman ibn Yasar, that when the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, set out for hajj in the year of the farewell hajj,\\n\\t\\t\\t\\tsome of his companions went into ihram to do hajj on its\\n\\t\\t\\t\\town, some of them combined hajj and umra, and some went\\n\\t\\t\\t\\tinto ihram to do umra on its own. Those who had gone into\\n\\t\\t\\t\\tihram to do hajj, or hajj and umra together, did not come\\n\\t\\t\\t\\tout of ihram, whils tthose who had gone into ihram to\\n\\t\\t\\t\\tdoumra (on its own) came out of ihram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "42",
    "sectionHeading": "Doing Hajj and Umra Together (Hajj al-Qiran)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard some of\\n\\t\\t\\t\\tthe people of knowledge say, \"If someone goes into ihram\\n\\t\\t\\t\\tto do umra and then wants to go into ihram to do hajj as\\n\\t\\t\\t\\twell, he can do so, as long as he has not done tawaf of\\n\\t\\t\\t\\tthe House and s'ay between Safa and Marwa. This is what\\n\\t\\t\\t\\tAbdullah ibn 'Umar did when he said, 'If I am blocked\\n\\t\\t\\t\\tfrom the House we shall do what we did when we were with\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.' He then turned to his companions and said, 'It is\\n\\t\\t\\t\\tthe same either way. I call you to witness that I have\\n\\t\\t\\t\\tdecided in favour of hajj and umra together. ' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The companions of the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, went into ihram\\n\\t\\t\\t\\tto do umra in the year of the farewell hajj, and the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to them, 'Anyone that has a sacrificial\\n\\t\\t\\t\\tanimal with him should go into ihram to do hajj and umra\\n\\t\\t\\t\\ttogether, and he should not come out of ihram until he\\n\\t\\t\\t\\thas finished both.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "43",
    "sectionHeading": "When to Stop the Talbiya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Abi Bakr\\n\\t\\t\\t\\tath-Thaqafi once asked Anas ibn Malik, while the two of\\n\\t\\t\\t\\tthem were going from Mina to Arafa, \"What did you use to\\n\\t\\t\\t\\tdo on this day when you were with the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace?\" He said, \"Those\\n\\t\\t\\t\\tof us who were saying the talbiya would continue doing\\n\\t\\t\\t\\tso, and no-one disapproved of it, and those of us who\\n\\t\\t\\t\\twere saying 'Allahu akbar' would continue doing so, and\\n\\t\\t\\t\\tno-one disapproved of that either.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "44",
    "sectionHeading": "When to Stop the Talbiya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Jafar ibn Muhammad,\\n\\t\\t\\t\\tfrom his father, that AIi ibn Abi Talib used to say the\\n\\t\\t\\t\\ttalbiya while on hajj until after noon on the day of\\n\\t\\t\\t\\tArafa, when he would stop doing so.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"This is what the people of\\n\\t\\t\\t\\tknowledge in our city are still doing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "45",
    "sectionHeading": "When to Stop the Talbiya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim, from his father, that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, would\\n\\t\\t\\t\\tstop saying the talbiya when she arrived at the place of\\n\\t\\t\\t\\tstanding (i.e. Arafa) .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "46",
    "sectionHeading": "When to Stop the Talbiya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Nafi, that when\\n\\t\\t\\t\\t'Abdullah ibn Umar was doing hajj he would keep saying\\n\\t\\t\\t\\tthe talbiya until he reached the Haram and did tawaf of\\n\\t\\t\\t\\tthe House and say between Safa and Marwa. He would then\\n\\t\\t\\t\\tsay the talbiya until he left Mina to go to Arafa, at\\n\\t\\t\\t\\twhich point he would stop doing so. If he was doing umra\\n\\t\\t\\t\\the would stop saying the talbiya on entering the Haram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "47",
    "sectionHeading": "When to Stop the Talbiya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab used to\\n\\t\\t\\t\\tsay, \"Abdullah ibn Umar would never say the talbiya while\\n\\t\\t\\t\\the was doing tawaf of the House.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "48",
    "sectionHeading": "When to Stop the Talbiya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from AIqama ibn Abi\\n\\t\\t\\t\\tAIqama, from his mother, that A'isha, umm al-muminin,\\n\\t\\t\\t\\tused to camp on the plain of Arafa at a place called\\n\\t\\t\\t\\tNamira, and then later she changed to another place\\n\\t\\t\\t\\tcalled al-Arak.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe said, ''A'isha, and those who were with her, would\\n\\t\\t\\t\\tsay the talbiya while she was at the place where they\\n\\t\\t\\t\\twere camping, and then, when she had mounted and set out\\n\\t\\t\\t\\ttowards the place of standing, she would stop doing so.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe continued, ''A'isha used to do umra when she was in\\n\\t\\t\\t\\tMakka after the hajj was over, in the month of\\n\\t\\t\\t\\tDhu'l-Hijja.Then she stopped doing that, and instead\\n\\t\\t\\t\\twould set out before the new moon of Muharram for al-J\\n\\t\\t\\t\\tuhfa, where she would stay until she saw the new moon,\\n\\t\\t\\t\\tand then, when she had seen the new moon, she would go\\n\\t\\t\\t\\tinto ihram to do umra.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "49",
    "sectionHeading": "When to Stop the Talbiya",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Yahya ibn Said, that\\n\\t\\t\\t\\tUmar ibn Abd alAziz was once going from Mina (to Arafa)\\n\\t\\t\\t\\ton the day of Arafa and heard the takbir being said\\n\\t\\t\\t\\tloudly, so he sent the guard to shout out to the people,\\n\\t\\t\\t\\t\"O people, you should be saying the talbiya.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "50",
    "sectionHeading": "How the People of Makka, and Those Besides Them Living There, Go into Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim, from his father, that Umar ibn al-Khattab said,\\n\\t\\t\\t\\t\"People of Makka, why is it that people arrive\\n\\t\\t\\t\\tdishevelled while you still have oil on your hair? Go\\n\\t\\t\\t\\tinto ihram when you see the new moon.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "51",
    "sectionHeading": "How the People of Makka, and Those Besides Them Living There, Go into Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Hisham ibn Urwa,\\n\\t\\t\\t\\tthat Abdullah ibn az-Zubayr stayed in Makka for nine\\n\\t\\t\\t\\tyears. He would go into ihram for hajj at the beginning\\n\\t\\t\\t\\tof Dhu'l-Hijja, and Urwa ibn az-Zubayr, who was with him,\\n\\t\\t\\t\\twould do likewise.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The people of Makka and\\n\\t\\t\\t\\twhoever else is living there besides them should go into\\n\\t\\t\\t\\tihram for hajj if they are in Makka, and anyone that is\\n\\t\\t\\t\\tliving in the centre of Makka and is not one of the\\n\\t\\t\\t\\tpeople of Makka should not leave the Haram.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"Someone who goes into ihram\\n\\t\\t\\t\\tfor hajj in Makka should delay tawaf of the House and the\\n\\t\\t\\t\\tsa'y between Safa and Marwa until he has come back from\\n\\t\\t\\t\\tMina, which is what Abdullah ibn Umar used to do.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked what the people of Madina, or anybody\\n\\t\\t\\t\\telse, should do about tawaf if they went into ihram in\\n\\t\\t\\t\\tMakka at the beginning of Dhu'l-Hijja, and he said, \"They\\n\\t\\t\\t\\tshould delay the obligatory tawaf, which is the one they\\n\\t\\t\\t\\tcombine with the say between Safa and Marwa, but they can\\n\\t\\t\\t\\tdo whatever other tawaf they want to, and they should\\n\\t\\t\\t\\tpray two rakas every time they complete seven tawafs,\\n\\t\\t\\t\\twhich is what the companions of the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, did when they\\n\\t\\t\\t\\thad gone into ihram to do hajj. They delayed the tawaf of\\n\\t\\t\\t\\tthe House and the sa'y between Safa and Marwa until they\\n\\t\\t\\t\\thad come back from Mina. Abdullah ibn Umar also did this,\\n\\t\\t\\t\\tgoing into ihram for hajj in Makka at the beginning of\\n\\t\\t\\t\\tDhu'l-Hijja, and then delaying tawaf of theHouse and the\\n\\t\\t\\t\\tsay between Safa and Marwa until he had come back from\\n\\t\\t\\t\\tMina.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether one of the people of Makka could\\n\\t\\t\\t\\tgo into ihram to do umra in the centre of Makka, and he\\n\\t\\t\\t\\tsaid, \"No. He should go outside the Haram and go into\\n\\t\\t\\t\\tihram there.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "52",
    "sectionHeading": "Situations when Ihram Not Obligatory for Garlanding Sacrificial Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from 'Abdullah ibn Abi\\n\\t\\t\\t\\tBakr ibn Muhammad, that Amra bint 'Abd ar-Rahman told him\\n\\t\\t\\t\\tthat Ziyad ibn Abi Sufyan once wrote to A'isha, the wife\\n\\t\\t\\t\\tof the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tsaying, \"'Abdullah ibn Abbas said that whatever was haram\\n\\t\\t\\t\\tfor some one doing hajj was also haram for some one who\\n\\t\\t\\t\\tsent a sacrificial animal until the animal was\\n\\t\\t\\t\\tsacrificed. I have sent one, so write and tell me what\\n\\t\\t\\t\\tyou say about this, or tell the man in charge of the\\n\\t\\t\\t\\tanimal what to do.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAmra said that A'isha said, \"It is notas Ibn Abbas has\\n\\t\\t\\t\\tsaid. I once plaited the garlands for the sacrificial\\n\\t\\t\\t\\tanimal of the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, with my own two hands. Then after that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, himself put the garlands on the animal and then\\n\\t\\t\\t\\tsent it with my father. And there was nothing that Allah\\n\\t\\t\\t\\thad made halal forthe Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, that was haram for him until\\n\\t\\t\\t\\tsuch time as the animal had been sacrificed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "53",
    "sectionHeading": "Situations when Ihram Not Obligatory for Garlanding Sacrificial Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"I asked Amra bint Abd ar-Rahman if there was anything\\n\\t\\t\\t\\tthat was haram for someone who sent a sacrificial animal\\n\\t\\t\\t\\t(to Makka) but did not go there himself, and she told me\\n\\t\\t\\t\\tthat she had heard A'isha say, 'It is only some one who\\n\\t\\t\\t\\tgoes into ihram for hajj and begins saying the talbiya\\n\\t\\t\\t\\tfor whom things are haram.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "54",
    "sectionHeading": "Situations when Ihram Not Obligatory for Garlanding Sacrificial Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Yahya ibn Said, from\\n\\t\\t\\t\\tMuhammad ibn Ibrahim ibn al-Harith at-Taymi, that Rabia\\n\\t\\t\\t\\tibn Abdullah ibn al-Hudayr once saw a man in a state of\\n\\t\\t\\t\\tihram in Iraq. So he asked people about him and they\\n\\t\\t\\t\\tsaid, \"He has given directions for his sacrificial animal\\n\\t\\t\\t\\tto be garlanded, and it is for that reason that he has\\n\\t\\t\\t\\tput on ihram .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tRabia said, \"I then met Abdullah ibn az-Zubayr and so I\\n\\t\\t\\t\\tmentioned this to him and he said, 'By the Lord of the\\n\\t\\t\\t\\tKaba, an innovation.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about some one who set out with his own\\n\\t\\t\\t\\tsacrificial animal and marked it and garlanded it at\\n\\t\\t\\t\\tDhu'l-Hulayfa, but did not go into ihram until he had\\n\\t\\t\\t\\treached al-Juhfa,and hesaid, \"I do not like that, and\\n\\t\\t\\t\\twhoever does so has not acted properly. He should only\\n\\t\\t\\t\\tgarland his sacrificial animal, or mark it, when he goes\\n\\t\\t\\t\\tinto ihram, unless it is someone who does not intend to\\n\\t\\t\\t\\tdo hajj, in which case he sends it off and stays with his\\n\\t\\t\\t\\tfamily.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked if somone who was not in ihram could set\\n\\t\\t\\t\\tout with a sacrificial animal, and he said, \"Yes. There\\n\\t\\t\\t\\tis no harm in that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe was also asked to comment on the different views\\n\\t\\t\\t\\tpeople had about what became haram for some one who\\n\\t\\t\\t\\tgarlanded a sacrificial animal but did not intend to do\\n\\t\\t\\t\\teither hajj or umra, and he said, \"What we go by as far\\n\\t\\t\\t\\tas this is concerned is what A'isha, umm al-muminin said,\\n\\t\\t\\t\\t'The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, sent his sacrificial animal off and did not go\\n\\t\\t\\t\\tthere himself, and there was nothing that Allah had made\\n\\t\\t\\t\\thalal for him that was haram for him until the animal had\\n\\t\\t\\t\\tbeen sacrificed.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "55",
    "sectionHeading": "What a Menstruating Woman Does on Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Nafi, that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"A menstruating woman who wants to\\n\\t\\t\\t\\tgo into ihram to do either hajj or umra can do so if she\\n\\t\\t\\t\\tso wishes, but she cannot do tawaf of the House, nor the\\n\\t\\t\\t\\tsay between Safa and Marwa. She can participate in all\\n\\t\\t\\t\\tthe rituals along with everybody else, except that she\\n\\t\\t\\t\\tcannot do tawaf of the House, nor the say between Safa\\n\\t\\t\\t\\tand Marwa, nor can she come near the mosque until she is\\n\\t\\t\\t\\tpure.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "56",
    "sectionHeading": "Umra in the Months of Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, did umra three times: in the year of Hudaybiya, in\\n\\t\\t\\t\\tthe year of al-Qadiyya, and in the year of al-Jiirrana.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "57",
    "sectionHeading": "Umra in the Months of Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa, from\\n\\t\\t\\t\\this father, that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, only did three umras, one of\\n\\t\\t\\t\\tthem in Shawwal, and two in Dhu'l-Qada.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "58",
    "sectionHeading": "Umra in the Months of Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abd ar-Rahman ibn\\n\\t\\t\\t\\tHarmala al-Aslami, that somebody asked Said ibn\\n\\t\\t\\t\\tal-Musayyab, \"Can I do umra before I do hajj?\", and Said\\n\\t\\t\\t\\tsaid, \"Yes, the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, did umra before doing hajj.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "59",
    "sectionHeading": "Umra in the Months of Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Ibn Shihab, from\\n\\t\\t\\t\\tSaid ibn al-Musayyab, that Umar ibn Abi Salama once asked\\n\\t\\t\\t\\tUmar ibn alKhattab for permission to do umra in Shawwal.\\n\\t\\t\\t\\tHe gave him permission, so he did umra and then went back\\n\\t\\t\\t\\tto his family, and he did not do hajj.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "60",
    "sectionHeading": "When to Stop Saying the Talbiya for Umra.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Hisham ibn 'Urwa,\\n\\t\\t\\t\\tthat his father would stop saying the talbiya when he\\n\\t\\t\\t\\tentered the Haram, if he was doing 'umra.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that someone who went into ihram at at-Tanim\\n\\t\\t\\t\\tshould stop saying the talbiya when he saw the House.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked where a man from the\\n\\t\\t\\t\\tpeople of Madina, or elsewhere, who had begun doing umra\\n\\t\\t\\t\\tat one of the mawaqit, should stop saying the talbiya,\\n\\t\\t\\t\\tand he said, \"Someone who goes into ihram at one of the\\n\\t\\t\\t\\tmawaqit should stop saying the talbiya when he arrives at\\n\\t\\t\\t\\tthe Haram.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"I have heard that Abdullah ibn Umar used to\\n\\t\\t\\t\\tdo that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "61",
    "sectionHeading": "Hajj At-Tamattu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Ibn Shihab, that\\n\\t\\t\\t\\tMuhammad ibn Abdullah ibn al-Harith ibn Nawfal ibn Abd\\n\\t\\t\\t\\tal-Muttalib told him that he had heard Sad ibn Abi Waqqas\\n\\t\\t\\t\\tand ad-Dahhak ibn Qays discussing tamattu in between umra\\n\\t\\t\\t\\tand hajj. Ad-Dahhak ibn Qays said, \"Only someone who is\\n\\t\\t\\t\\tignorant of what Allah, the Exalted and Glorified, says\\n\\t\\t\\t\\twould do that.\"  Whereupon Sad said, \"How wrong is what\\n\\t\\t\\t\\tyou have just said, son of my brother!\"  Ad-Dahhak said,\\n\\t\\t\\t\\t''Umar ibn al-Khattab forbade that,\" and Sad said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, did it, and we did it with him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "62",
    "sectionHeading": "Hajj At-Tamattu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Sadaqa ibn Yasar,\\n\\t\\t\\t\\tthat Abdullah ibn Umar said, \"By Allah, I would rather do\\n\\t\\t\\t\\tumra before hajj and sacrifice an animal than do umra\\n\\t\\t\\t\\tafter hajj in the month of Dhu'l-Hijja.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "63",
    "sectionHeading": "Hajj At-Tamattu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abdullah ibn Dinar,\\n\\t\\t\\t\\tthat Abdullah ibn Umar used to say, \"Anyone that does\\n\\t\\t\\t\\tumra in the months of hajj, that is, in Shawwal,\\n\\t\\t\\t\\tDhu'l-Qada, or in Dhu'l-Hijja before the hajj, and then\\n\\t\\t\\t\\tstays in Makka until the time for hajj, is doing tamattu\\n\\t\\t\\t\\tif he then does hajj. He must sacrifice whatever animal\\n\\t\\t\\t\\tit is easy for him to obtain, and if he cannot find one\\n\\t\\t\\t\\tthen he must fast three days during hajj and seven days\\n\\t\\t\\t\\twhen he returns.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is only the case if he stays until the\\n\\t\\t\\t\\thajj and does hajj in that same year.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if someone who was from Makka but had\\n\\t\\t\\t\\tstopped living there and gone to live elsewhere, came\\n\\t\\t\\t\\tback to do umra in the months of the hajj and then stayed\\n\\t\\t\\t\\tin Makka to begin hajj there, he was doing tamattu, and\\n\\t\\t\\t\\thad to offer up a sacrificial animal, or fast if he could\\n\\t\\t\\t\\tnot find one. He was not the same as the people of Makka.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether someone who was not from Makka\\n\\t\\t\\t\\tand entered Makka to do umra in the months of hajj with\\n\\t\\t\\t\\tthe intention of staying on to begin his hajj there was\\n\\t\\t\\t\\tdoing tamattu or not, and he said,  \"Yes, he is doing\\n\\t\\t\\t\\ttamattu, and he is not the same as the people of Makka,\\n\\t\\t\\t\\teven if he has the intention of staying there. This is\\n\\t\\t\\t\\tbecause he has entered Makka, and is not one of its\\n\\t\\t\\t\\tpeople, and making a sacrifice or fasting is incumbent on\\n\\t\\t\\t\\tanyone who is not from Makka, and, although he intends to\\n\\t\\t\\t\\tstay, he does not know what possibilities might arise\\n\\t\\t\\t\\tlater. He is not one of the people of Makka.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "64",
    "sectionHeading": "Hajj At-Tamattu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said used\\n\\t\\t\\t\\tto hear Said ibn al-Musayyab say, \"Anyone that does umra\\n\\t\\t\\t\\tin Shawwal, Dhu'l-Qada or Dhu l-Hijja, and then stays in\\n\\t\\t\\t\\tMakka until it is time for the hajj, is doing tamattu if\\n\\t\\t\\t\\the then does hajj. He must sacrifice whatever animal it\\n\\t\\t\\t\\tis easy for him to obtain, and if he cannot find one then\\n\\t\\t\\t\\the must fast three days during hajj and seven days when\\n\\t\\t\\t\\the returns.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "65",
    "sectionHeading": "Circumstances in which Tamattu is Not Obligatory",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"Someone who does umra in Shawwal, Dhu'l-Qada\\n\\t\\t\\t\\tor Dhu'l-Hijja and then goes back to his people, and then\\n\\t\\t\\t\\treturns and does hajj in that same year does not have to\\n\\t\\t\\t\\tsacrifice an animal. Sacrificing an animal is only\\n\\t\\t\\t\\tincumbent on some one who does umra in the months of\\n\\t\\t\\t\\thajj, and then stays in Makka and then does hajj. A\\n\\t\\t\\t\\tperson not from Makka who moves to Makka and establishes\\n\\t\\t\\t\\this home there and does umra in the months of the hajj\\n\\t\\t\\t\\tand then begins his hajj there is not doing tamattu. He\\n\\t\\t\\t\\tdoes not have to sacrifice an animal nor does he have to\\n\\t\\t\\t\\tfast. He is in the same position as the people of Makka\\n\\t\\t\\t\\tif he is one of those who are living there.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man from Makka who had gone to\\n\\t\\t\\t\\tlive in another town or had been on a journey and then\\n\\t\\t\\t\\treturned to Makka with the intention of staying there,\\n\\t\\t\\t\\tregardless of whether he had a family there or not, and\\n\\t\\t\\t\\tentered it to do umra in the months of the hajj, and then\\n\\t\\t\\t\\tbegan his hajj there, beginning his umra at the miqat of\\n\\t\\t\\t\\tthe Prophet, may Allah bless him and grant him peace, or\\n\\t\\t\\t\\tat a place nearer than that, was doing tamattu or not?\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik answered, \"He does not have to sacrifice an animal\\n\\t\\t\\t\\tor fast as someone who is doing tamattu has to do. This\\n\\t\\t\\t\\tis because Allah, the Blessed and Exalted, says in His\\n\\t\\t\\t\\tBook, 'That is for someone whose family are not present\\n\\t\\t\\t\\tat Masjid al-Haram. '\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "66",
    "sectionHeading": "About Umra in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman, from Abu Salih as-Samman,\\n\\t\\t\\t\\tfrom Abu Hurayra, that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace ,said, \"Umra is an\\n\\t\\t\\t\\texpiation for what is between it and the next umra, and\\n\\t\\t\\t\\tthe only reward for an accepted hajj is the Garden.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "67",
    "sectionHeading": "About Umra in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman, heard Abu Bakribn Abd\\n\\t\\t\\t\\tar-Rahman say, \"A woman came to the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, and said, 'I had\\n\\t\\t\\t\\tarranged to do hajj, but I was prevented,' and the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'Do umra in Ramadan, for doing umra in it is\\n\\t\\t\\t\\tlike doing hajj.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "68",
    "sectionHeading": "About Umra in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Nafi, from Abdullah\\n\\t\\t\\t\\tibn Umar, that Umar ibn al-Khattab said, \"Keep your hajj\\n\\t\\t\\t\\tseparate from your umra. That way your hajj will be more\\n\\t\\t\\t\\tcomplete. And your umra will be more complete if you do\\n\\t\\t\\t\\tit outside of the months of the hajj.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "69",
    "sectionHeading": "About Umra in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUthman ibn Affan would sometimes never get down from the\\n\\t\\t\\t\\tanimal he was riding on when he was doing umra, until he\\n\\t\\t\\t\\thad returned .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, ''Umra is a sunna, and we do not know of any\\n\\t\\t\\t\\tmuslim who has ever said that it is permissible not to do\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not think that anyone can do more than\\n\\t\\t\\t\\tone umra in any one year.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that someone doing umra who had sexual\\n\\t\\t\\t\\tintercourse with his wife had to sacrifice an animal and\\n\\t\\t\\t\\tdo a second umra, which he had to begin when he had\\n\\t\\t\\t\\tfinished the one that he had spoiled. He should go into\\n\\t\\t\\t\\tihram at the same place where he went into ihram for the\\n\\t\\t\\t\\tumra which he had spoiled, except if he had entered into\\n\\t\\t\\t\\tihram at a place further away than his miqat. This was\\n\\t\\t\\t\\tbecause he only had to go into ihram from his miqat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who entered Makka to do umra, and\\n\\t\\t\\t\\tdoes tawaf of the House and say between Safa and Marwa\\n\\t\\t\\t\\twhile he is junub, or not in wudu, and afterwards has\\n\\t\\t\\t\\tintercourse with his wife,  and then remembers, should do\\n\\t\\t\\t\\tghusl, or wudu, and then go back and do tawaf around the\\n\\t\\t\\t\\tHouse and say between Safa and Marwa and do another umra\\n\\t\\t\\t\\tand sacrifice an animal. A woman should do the same if\\n\\t\\t\\t\\ther husband has intercourse with her while she is in\\n\\t\\t\\t\\tihram. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for beginning umra at at-Tanim, (it is\\n\\t\\t\\t\\tnot the only alternative). It is permissible if Allah\\n\\t\\t\\t\\twills for some one to leave the Haram and go into ihram\\n\\t\\t\\t\\tif he wishes, but the best way is for him to go into\\n\\t\\t\\t\\tihram at the miqat which the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used (i.e.\\n\\t\\t\\t\\tat-Tanim), or one which is further away.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "70",
    "sectionHeading": "Marriage in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman, from Sulayman ibn Yasar, that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, sent Abu\\n\\t\\t\\t\\tRafi and a man of the Ansar to arrange his marriage to\\n\\t\\t\\t\\tMaymuna bint al-Harith, and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, was in Madina before\\n\\t\\t\\t\\the had left for umra.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "71",
    "sectionHeading": "Marriage in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Nafi, from Nubayh\\n\\t\\t\\t\\tibn Wahb, who was from the tribe of Bani Abd ad-Dar, that\\n\\t\\t\\t\\tUmar ibn Ubaydullah sent a message to Aban ibn Uthman\\n\\t\\t\\t\\t(who was amir of the hajj at the time), while both of\\n\\t\\t\\t\\tthem were in ihram, saying, \"I want to marry Bint Shayba\\n\\t\\t\\t\\tibn Jubayr to Talha ibn Umar and I want you to be\\n\\t\\t\\t\\tpresent.\" Aban told him that he should not do that and\\n\\t\\t\\t\\tsaid, \"I heard Uthman ibn Affan say that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'A\\n\\t\\t\\t\\tman in ihram should not marry, or give in marriage, or\\n\\t\\t\\t\\tget betrothed.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "72",
    "sectionHeading": "Marriage in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Da'ud ibn al-Husayn,\\n\\t\\t\\t\\tthat Abu Ghatafan ibn Tarif al-Murri told him that his\\n\\t\\t\\t\\tfather Tarif had married a woman while he was in ihram,\\n\\t\\t\\t\\tand Umar ibn al-Khattab had rescinded the marriage.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "73",
    "sectionHeading": "Marriage in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Nafi, that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Someone in ihram may neither get\\n\\t\\t\\t\\tmarried, nor arrange a marriage for himself or others.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "74",
    "sectionHeading": "Marriage in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab, Salim ibn Abdullah and Sulayman ibn\\n\\t\\t\\t\\tYasar were asked about whether someone in ihram could get\\n\\t\\t\\t\\tmarried, and they said, \"Some one in ihram may neither\\n\\t\\t\\t\\tget married nor give some one in marriage.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who was in ihram could return to\\n\\t\\t\\t\\this wife if he wanted to, if she was still in her idda\\n\\t\\t\\t\\tafter she had been divorced from him.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "75",
    "sectionHeading": "Cupping in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Yahya ibn Sa'id,\\n\\t\\t\\t\\tfrom Sulayman ibn Yasar, that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, was once cupped on\\n\\t\\t\\t\\tthe top of his head while he was in ihram, at Lahyay\\n\\t\\t\\t\\tJamal, which is a place on the road to Makka.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "76",
    "sectionHeading": "Cupping in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Nafi, that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Someone in ihram should not be\\n\\t\\t\\t\\tcupped, except when there is no other alternative.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who is in ihram should not be cupped\\n\\t\\t\\t\\texcept when it is necessary.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "77",
    "sectionHeading": "Game that can be Eaten by Someone who is in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abu'n-Nadr, the\\n\\t\\t\\t\\tmawla of 'Umar ibn 'Ubaydullah at-Taymi, from Nafi, the\\n\\t\\t\\t\\tmawla of Abu Qatada al-Ansari, that Abu Qatada was once\\n\\t\\t\\t\\twith the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace. When they got to one of the roads to\\n\\t\\t\\t\\tMakka he fell behind with some companions of his who were\\n\\t\\t\\t\\tmuhrim, while he was not. Then he saw a wild ass, so he\\n\\t\\t\\t\\tgot on his mount and asked his companions to give him his\\n\\t\\t\\t\\twhip but they refused. Then he asked them for his spear\\n\\t\\t\\t\\tand they refused to give it to him. So he took hold of it\\n\\t\\t\\t\\tand attacked the ass and killed it. Some of the\\n\\t\\t\\t\\tcompanions of the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, ate from it, and others refused.\\n\\t\\t\\t\\tWhen they had caught up with the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, they asked him about\\n\\t\\t\\t\\tit and he said, \"It is food that Allah has fed you with.\"\\n\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "78",
    "sectionHeading": "Game that can be Eaten by Someone who is in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Hisham ibn Urwa,\\n\\t\\t\\t\\tfrom his father, that az-Zubayr ibn al-Awwam used to take\\n\\t\\t\\t\\tdried gazelle meat (safif adh-dhiba) as provisions while\\n\\t\\t\\t\\the was in ihram.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Safif are dried strips of meat.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "79",
    "sectionHeading": "Game that can be Eaten by Someone who is in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Zayd ibn Aslam, that\\n\\t\\t\\t\\tAta ibn Yasar had told him, from Abu Qatada, the same\\n\\t\\t\\t\\thadith about the wild ass as that of Abu'n-Nadr, except\\n\\t\\t\\t\\tthat in the hadith of Zayd ibn Aslam the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"Do\\n\\t\\t\\t\\tyou still have any of its meat?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "80",
    "sectionHeading": "Game that can be Eaten by Someone who is in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said\\n\\t\\t\\t\\tal-Ansari said that Muhammad ibn Ibrahim ibn al-Harith\\n\\t\\t\\t\\tat-Taymi told him from Isa ibn Talha ibn Ubaydullah,\\n\\t\\t\\t\\tfromUmayr ibn Salama ad-Damri, from al-Bahzi, that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, set out once for Makka while in ihram. When they\\n\\t\\t\\t\\thad reached ar-Rawha, they unexpectedly came upon a\\n\\t\\t\\t\\twounded wild ass. Someone mentioned it to the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, and\\n\\t\\t\\t\\thesaid, \"Leave it. The man to whom it belongs is about to\\n\\t\\t\\t\\tcome.\" Then al-Bahzi, who was the man, came to the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, and\\n\\t\\t\\t\\tsaid, \"Messenger of Allah, do whatever you want with this\\n\\t\\t\\t\\tass,' and the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, told Abu Bakr to divide it up among the\\n\\t\\t\\t\\tcompany. Then they went on until they came to the well of\\n\\t\\t\\t\\tal-Uthaba, which was between ar-Ruwaytha and al-Arj\\n\\t\\t\\t\\t(between Makka and Madina), where they unexpectedly came\\n\\t\\t\\t\\tupon a gazelle with an arrow in it, Iying on its side in\\n\\t\\t\\t\\tsome shade. He claimed that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, told someone to\\n\\t\\t\\t\\tstand by it to make sure no one disturbed it until\\n\\t\\t\\t\\teveryone had passed by.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "81",
    "sectionHeading": "Game that can be Eaten by Someone who is in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Yahya ibn Said, that\\n\\t\\t\\t\\the heard Said ibn al-Musayyab relating from Abu Hurayra\\n\\t\\t\\t\\tthat he was once coming back from Bahrayn, and, when he\\n\\t\\t\\t\\treached ar-Rabadha, he found a caravan of people from\\n\\t\\t\\t\\tIraq in ihram, who asked him whether they could eat the\\n\\t\\t\\t\\tmeat of some game which they had found with the people of\\n\\t\\t\\t\\tar-Rabadha, and he told them they could eat it. He said,\\n\\t\\t\\t\\t\"Afterwards I had doubts about what I had told them to\\n\\t\\t\\t\\tdo, so when I got back to Madina I mentioned the matter\\n\\t\\t\\t\\tto Umar ibn al-Khattab and he said, 'What did you tell\\n\\t\\t\\t\\tthem to do?' I said, ' I told them to eat it.' Umar ibn\\n\\t\\t\\t\\tal-Khattab said, threatening me, 'If you had told them to\\n\\t\\t\\t\\tdo anything else I would have done something to you.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "82",
    "sectionHeading": "Game that can be Eaten by Someone who is in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Ibn Shihab, that\\n\\t\\t\\t\\tSalim ibn Abdullah heard Abu Hurayra relating to Abdullah\\n\\t\\t\\t\\tibn Umar how a group of three people in ihram had passed\\n\\t\\t\\t\\thim at ar-Rabadha and had asked him for a fatwa about\\n\\t\\t\\t\\teating game which people who were not in ihram were\\n\\t\\t\\t\\teating, and he told them that they could eat it. He said,\\n\\t\\t\\t\\t\"Then I went to Umar ibn al-Khattab in Madina and asked\\n\\t\\t\\t\\thim about it, and he said, 'What did you say to them?'\\n\\t\\t\\t\\tand I said, 'I told them that they could eat it.' Umar\\n\\t\\t\\t\\tsaid, 'If you had told them anything else I would have\\n\\t\\t\\t\\tdone you an injury.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "83",
    "sectionHeading": "Game that can be Eaten by Someone who is in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Zayd ibn Aslam, from\\n\\t\\t\\t\\tAta ibn Yasar, that Kab al-Ahbar was once coming back\\n\\t\\t\\t\\tfrom Syria with a group of riders, and at a certain point\\n\\t\\t\\t\\talong the road they found some game-meat and Kab said\\n\\t\\t\\t\\tthey could eat it. When they got back to Madina they went\\n\\t\\t\\t\\tto Umar ibn al-Khattab and told him about that, and he\\n\\t\\t\\t\\tsaid, \"Who told you you could do that?\", and they said,\\n\\t\\t\\t\\t''Kab.'' He said, \"He was indeed the one I made amir over\\n\\t\\t\\t\\tyou until you should return.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tLater, when they were on the road to Makka, a swarm of\\n\\t\\t\\t\\tlocusts passed them by and Kab told them to catch them\\n\\t\\t\\t\\tand eat them. When they got back to Umar ibn al-Khattab\\n\\t\\t\\t\\tthey told him about this, and he said (to Kab), \"What\\n\\t\\t\\t\\tmade you tell them they could do that?\" Kab said, \"It is\\n\\t\\t\\t\\tgame of the sea.\" He said, \"How do you know?\", and Kab\\n\\t\\t\\t\\tsaid, \"Amir al-muminin, by the One in whose hand my self\\n\\t\\t\\t\\tis, it is only the sneeze of a fish which it sneezes\\n\\t\\t\\t\\ttwice every year.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a muhrim could buy game that he\\n\\t\\t\\t\\thad found on the way. He replied, \"Game that is only\\n\\t\\t\\t\\thunted to be offered to people performing Hajj I\\n\\t\\t\\t\\tdisapprove of and forbid, but there is no harm in game\\n\\t\\t\\t\\tthat a man has which he does not intend for those in\\n\\t\\t\\t\\tihram, but which a muhrim finds and buys.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about someone who had some game with him that\\n\\t\\t\\t\\the had hunted or bought at the time when he had entered\\n\\t\\t\\t\\tinto ihram, that he did not have to get rid of it, and\\n\\t\\t\\t\\tthat there was no harm in him giving it to his family.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that it was halal for some one in ihram to\\n\\t\\t\\t\\tfish in the sea or in rivers and lakes, etc.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "84",
    "sectionHeading": "Game that is Not Halal to Eat in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Ibn Shihab, from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud, from Abdullah\\n\\t\\t\\t\\tibn Abbas, that as-Sab ibn Jaththama al-Laythi once gave\\n\\t\\t\\t\\ta wild ass to the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, while he was at al-Abwa, or Waddan,\\n\\t\\t\\t\\tand the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, gave it back to him. However, when the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, saw the expression on the man's face he said, \"We\\n\\t\\t\\t\\tonly gave it back to you because we are in ihram.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "85",
    "sectionHeading": "Game that is Not Halal to Eat in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Abdullah ibn Abi\\n\\t\\t\\t\\tBakr, that Abd ar-Rahman ibn Amir ibn Rabia said, \"I once\\n\\t\\t\\t\\tsaw Uthman ibn Affan in ihram on a hot summer's day at\\n\\t\\t\\t\\tal-Arj,and he had covered his face with a red woollen\\n\\t\\t\\t\\tcloth. Some game-meat was brought to him and he told his\\n\\t\\t\\t\\tcompanions to eat. They said, 'Will you not eat then?',\\n\\t\\t\\t\\tand he said, 'I am not in the same position as you. It\\n\\t\\t\\t\\twas hunted for my sake.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "86",
    "sectionHeading": "Game that is Not Halal to Eat in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, from Hisham ibn Urwa,\\n\\t\\t\\t\\tfrom his father, that A'isha, umm al-muminin, said to\\n\\t\\t\\t\\thim, \"Son of my sister, it is only for ten nights, so if\\n\\t\\t\\t\\tyou get an urge to do something, leave it,\" by which she\\n\\t\\t\\t\\tmeant eating game-meat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if game was hunted forthe sake of a man\\n\\t\\t\\t\\twho is in ihram and it was prepared for him and he ate\\n\\t\\t\\t\\tsome of it knowing that it had been hunted for his sake,\\n\\t\\t\\t\\tthen he had to pay a forfeit for all of the game that had\\n\\t\\t\\t\\tbeen hunted on his behalf.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about whether someone who was forced to\\n\\t\\t\\t\\teat carrion while he was in ihram should hunt game and\\n\\t\\t\\t\\tthen eat that rather than the carrion, and he said, \"It\\n\\t\\t\\t\\tis better for him to eat the carrion, because Allah, the\\n\\t\\t\\t\\tBlessed and Exalted, has not given permission for someone\\n\\t\\t\\t\\tin ihram to either eat game or take it in any situation,\\n\\t\\t\\t\\tbut He has made allowances for eating carrion when\\n\\t\\t\\t\\tabsolutely necessary.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not halal for anyone, whether in ihram\\n\\t\\t\\t\\tor not, to eat game which has been killed or sacrificed\\n\\t\\t\\t\\tby some one in ihram, because, whether it was killed\\n\\t\\t\\t\\tdeliberately or by mistake, it was not done in a halal\\n\\t\\t\\t\\tmanner, and so eating it is not halal. I have heard this\\n\\t\\t\\t\\tfrom more than one person. Somebody who kills game and\\n\\t\\t\\t\\tthen eats it only has to make a single kaffara, which is\\n\\t\\t\\t\\tthe same as for somebody who kills game but does not eat\\n\\t\\t\\t\\tany of it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "87",
    "sectionHeading": "Hunting in the Haram",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"It is not halal to eat any game that has\\n\\t\\t\\t\\tbeen hunted in the Haram, or has had a dog set after it\\n\\t\\t\\t\\tin the Haram and then been killed outside the Haram.\\n\\t\\t\\t\\tAnyone that does that has to pay a forfeit for what has\\n\\t\\t\\t\\tbeen hunted. However, some one that sets his dog after\\n\\t\\t\\t\\tgame outside the Haram and then follows it until it is\\n\\t\\t\\t\\thunted down in the Haram does not have to pay any\\n\\t\\t\\t\\tforfeit, unless he set the dog after the game near to the\\n\\t\\t\\t\\tHaram. The game should not be eaten, however. If he set\\n\\t\\t\\t\\tthe dog loose near the Haram then he has to pay a forfeit\\n\\t\\t\\t\\tfor the game.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "88",
    "sectionHeading": "Assessing the Forfeit for Hunting Game Animals that Someone in Ihram can Kill",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"Allah, the Blessed and Exalted, says, 'O you\\n\\t\\t\\t\\twho trust, do not kill game while you are in ihram.\\n\\t\\t\\t\\tWhoever of you kills game intentionally has to pay a\\n\\t\\t\\t\\tforfeit commensurate with what he has killed in cattle\\n\\t\\t\\t\\twhich two men from among you shall judge, a sacrificial\\n\\t\\t\\t\\tanimal which reaches the Kaba, or else he makes a kaffara\\n\\t\\t\\t\\tof either feeding poor people or the equivalent of that\\n\\t\\t\\t\\tin fasting, so that he may taste the consequences of what\\n\\t\\t\\t\\the has done.' \" (Sura 5 ayat 95).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who hunts game when he is not in\\n\\t\\t\\t\\tihram and then kills it while he is in ihram is in the\\n\\t\\t\\t\\tsame position as someone who buys game while he is in\\n\\t\\t\\t\\tihram and then kills it. Allah has forbidden killing it,\\n\\t\\t\\t\\tand so a man who does so has to pay a forfeit for it. The\\n\\t\\t\\t\\tposition that we go by in this matter is that a forfeit\\n\\t\\t\\t\\tis assessed for anyone who kills game while he is in\\n\\t\\t\\t\\tihram.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The best that I have heard\\n\\t\\t\\t\\tabout someone who kills game and is assessed for it is\\n\\t\\t\\t\\tthat the game which he has killed is assessed and its\\n\\t\\t\\t\\tvalue in food is estimated and with that food he feeds\\n\\t\\t\\t\\teach poor man a mudd, or fasts a day in place of each\\n\\t\\t\\t\\tmudd. The number of poor men is considered, and if it is\\n\\t\\t\\t\\tten then he fasts ten days, and if it is twenty he fasts\\n\\t\\t\\t\\ttwenty days, according to how many people there are to be\\n\\t\\t\\t\\tfed, even if there are more than sixty.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard that a forfeit is assessed for\\n\\t\\t\\t\\tsomeone who kills game in the Haram while he is not in\\n\\t\\t\\t\\tihram in the same way that it is assessed for some one\\n\\t\\t\\t\\twho kills game in the Haram while he is in ihram .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "89",
    "sectionHeading": "Animals that Someone in Ihram can Kill",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"There are five kinds of\\n\\t\\t\\t\\tanimal which it is not wrong for some one in ihram to\\n\\t\\t\\t\\tkill: crows, kites, scorpions, rats and mice, and wild\\n\\t\\t\\t\\tdogs.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "90",
    "sectionHeading": "Animals that Someone in Ihram can Kill",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace,said,\"There are five\\n\\t\\t\\t\\t(kinds of) animal which it is not wrong for some one in\\n\\t\\t\\t\\tihram to kill: scorpions, rats and mice, crows, kites and\\n\\t\\t\\t\\twild dogs. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "91",
    "sectionHeading": "Animals that Someone in Ihram can Kill",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"There are five\\n\\t\\t\\t\\ttrespassers that can be killed in the Haram: rats and\\n\\t\\t\\t\\tmice, scorpions, crows, kites and wild dogs.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "92",
    "sectionHeading": "Animals that Someone in Ihram can Kill",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Umar\\n\\t\\t\\t\\tibn al-Khattab told people to kill snakes in the Haram.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about the \"wild dogs\" which people were told\\n\\t\\t\\t\\tto kill in the Haram, that any animals that wounded,\\n\\t\\t\\t\\tattacked, or terrorised men, such as lions, leopards,\\n\\t\\t\\t\\tIynxes and wolves, were counted as\"wild dogs.\" However,\\n\\t\\t\\t\\tsomeone who was in ihram should not kill beasts of prey\\n\\t\\t\\t\\tthat did not attack (people), such as hyenas, foxes, cats\\n\\t\\t\\t\\tand anything else like them, and if he did then he had to\\n\\t\\t\\t\\tpay a forfeit for it. Similarly, someone in ihram should\\n\\t\\t\\t\\tnot kill any predatory birds except the kinds that the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tspecified, namely crows and kites. If someone in ihram\\n\\t\\t\\t\\tkilled any other kind of bird he had to pay a forfeit for\\n\\t\\t\\t\\tit.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "93",
    "sectionHeading": "Things that Someone in Ihram is Allowed to do",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Yahya ibn Said from Muhammad ibn\\n\\t\\t\\t\\tIbrahim ibn alHarith at-Taymi from Rabia ibn Abi Abdullah\\n\\t\\t\\t\\tibn alHudayr that he saw Umar ibn al-Khattab taking the\\n\\t\\t\\t\\tticks off a camel of his at as-Suqya while he was in\\n\\t\\t\\t\\tihram .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that he disapproved of that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "94",
    "sectionHeading": "Things that Someone in Ihram is Allowed to do",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Alqama ibn Abi Alqama\\n\\t\\t\\t\\tthat his mother said, \"I heard A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, being\\n\\t\\t\\t\\tasked whether some one in ihram could scratch their body\\n\\t\\t\\t\\tor not, and she said, 'Yes, he can scratch it and do so\\n\\t\\t\\t\\tas hard as he pleases. I would scratch even if my hands\\n\\t\\t\\t\\twere tied and I could only use my feet.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "95",
    "sectionHeading": "Things that Someone in Ihram is Allowed to do",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Musa that\\n\\t\\t\\t\\tAbdullah ibn Umar once looked in the mirror for something\\n\\t\\t\\t\\tthat was irritating him while he was in ihram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "96",
    "sectionHeading": "Things that Someone in Ihram is Allowed to do",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar did not like people who were in ihram removing\\n\\t\\t\\t\\tmites or ticks from their camels.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I like most out of what I have\\n\\t\\t\\t\\theard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "97",
    "sectionHeading": "Things that Someone in Ihram is Allowed to do",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Abdullah\\n\\t\\t\\t\\tibn Abi Maryam once asked Said ibn al-Musayyab about\\n\\t\\t\\t\\t(what to do with) a nail of his that had broken while he\\n\\t\\t\\t\\twas in ihram and Said said, \"cut it off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether some one in ihram who had an\\n\\t\\t\\t\\tear-complaint could use medicinal oil which was not\\n\\t\\t\\t\\tperfumed for dropping into his ears, and he said, \"I do\\n\\t\\t\\t\\tnot see any harm in that, and even if he were to put it\\n\\t\\t\\t\\tinto his mouth I still would not see any harm in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that there was no harm in some one in ihram\\n\\t\\t\\t\\tlancing an abscess that he had, or a boil, or cutting a\\n\\t\\t\\t\\tvein, if he needed to do so.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "98",
    "sectionHeading": "Doing the Hajj for Somebody Else",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tSulayman ibn Yasar that Abdullah ibn Abbas said, \"Al-Fadl\\n\\t\\t\\t\\tibn Abbas was riding behind the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, when a woman from\\n\\t\\t\\t\\tthe Khathama tribe came to him to ask him for a fatwa.\\n\\t\\t\\t\\tAl-Fadl began to look at her, and she at him, and the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, turned Fadl's face away to the other side. The\\n\\t\\t\\t\\twoman said, 'Messenger of Allah, Allah's making the hajj\\n\\t\\t\\t\\tobligatory finds my father a very old man, unable to stay\\n\\t\\t\\t\\tfirm on his riding-beast. Can I do hajj for him?', and he\\n\\t\\t\\t\\tsaid, 'Yes.' This was during the farewell hajj.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "99",
    "sectionHeading": "Concerning Someone whose Path (to the House) is Blocked by an Enemy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"Someone whose\\n\\t\\t\\t\\tpassage to the House is blocked by an enemy is freed from\\n\\t\\t\\t\\tevery restriction of ihram, and should sacrifice his\\n\\t\\t\\t\\tanimal and shave his head wherever he has been detained,\\n\\t\\t\\t\\tand there is nothing for him to make up afterwards.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\twhen the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and his companions came out of ihram at\\n\\t\\t\\t\\tal-Hudaybiya they sacrificed their sacrificial animals\\n\\t\\t\\t\\tand shaved their heads, and were freed from all the\\n\\t\\t\\t\\trestrictions of ihram without having done tawaf of the\\n\\t\\t\\t\\tHouse and without their sacrificial animals reaching the\\n\\t\\t\\t\\tKaba.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThere is nothing known about the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, ever telling any of\\n\\t\\t\\t\\this companions, or anybody else that was with him, to\\n\\t\\t\\t\\tmake up for anything they had missed or to go back to\\n\\t\\t\\t\\tdoing anything they had not finished doing.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "100",
    "sectionHeading": "Concerning Someone whose Path (to the House) is Blocked by an Enemy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that when\\n\\t\\t\\t\\tAbdullah ibn Umar set out for Makka during the troubles\\n\\t\\t\\t\\t(between al-Hajjaj ibn Yusuf and Zubair ibn al-Awwam) he\\n\\t\\t\\t\\tsaid, \"If I am blocked from going to the House we shall\\n\\t\\t\\t\\tdo what we did when we were with the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace,\" and he went\\n\\t\\t\\t\\tinto ihram for umra, because that was what the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, did in\\n\\t\\t\\t\\tthe year of al-Hudaybiya.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tBut afterwards, he reconsidered his position and said,\\n\\t\\t\\t\\t\"It is the same either way.\" After that he turned to his\\n\\t\\t\\t\\tcompanions and said, \"It is the same either way. I call\\n\\t\\t\\t\\tyou to witness that I have decided in favour of hajj and\\n\\t\\t\\t\\tumra together.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe then got through to the House (without being stopped)\\n\\t\\t\\t\\tand did one set of tawaf, which he considered to be\\n\\t\\t\\t\\tenough for himself, and sacrificed an animal.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what we go by if someone is hindered\\n\\t\\t\\t\\tby an enemy, as the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and his companions were. If some one is\\n\\t\\t\\t\\thindered by anything other than an enemy, he is only\\n\\t\\t\\t\\tfreed from ihram by tawaf of the House. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "101",
    "sectionHeading": "Concerning Someone who is Hindered (From Going To The House) by Something Other than an Enemy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Umar said, \"Someone who is\\n\\t\\t\\t\\theld back from going to the House by illness can only\\n\\t\\t\\t\\tcome out of ihram after he has done tawaf of the House\\n\\t\\t\\t\\tand say between Safa and Marwa. If it is absolutely\\n\\t\\t\\t\\tnecessary for him to wear any ordinary clothes, or\\n\\t\\t\\t\\tundergo medical treatment, he should do that and pay\\n\\t\\t\\t\\tcompensation for it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "102",
    "sectionHeading": "Concerning Someone who is Hindered (From Going To The House) by Something Other than an Enemy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the had heard that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used to say, \"Only\\n\\t\\t\\t\\tthe House frees a person in ihram from ihram.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "103",
    "sectionHeading": "Concerning Someone who is Hindered (From Going To The House) by Something Other than an Enemy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Abi Tamima\\n\\t\\t\\t\\tas-Sakhtayani that a very old man from Basra once said to\\n\\t\\t\\t\\thim, \"I set out for Makka but on the way there I broke my\\n\\t\\t\\t\\tthigh, so I sent a message on to Makka Abdullah ibn Abbas\\n\\t\\t\\t\\tand Abdullah ibn Umar and the people were there, but\\n\\t\\t\\t\\tno-one allowed me to leave ihram, and I stayed there for\\n\\t\\t\\t\\tseven months until I left ihram by doing an umra.''\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "104",
    "sectionHeading": "Concerning Someone who is Hindered (From Going To The House) by Something Other than an Enemy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Umar said, \"Some one who\\n\\t\\t\\t\\tis detained by sickness before he has got to the House\\n\\t\\t\\t\\tcannot leave ihram until he has done tawaf of the House\\n\\t\\t\\t\\tand say between Safa and Marwa.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSulayman ibn Yasar that Said ibn Huzaba al-Makhzumi was\\n\\t\\t\\t\\tthrown off his mount while he was in ihram on the road to\\n\\t\\t\\t\\tMakka. He asked after the person in charge of the relay\\n\\t\\t\\t\\tstation where he was injured and he found Abdullah ibn\\n\\t\\t\\t\\tUmar, Abdullah ibn az-Zubayr and Marwan ibn al-Hakam\\n\\t\\t\\t\\tthere. He told them what had happened to him and all of\\n\\t\\t\\t\\tthem said that he should take whatever medicine he had to\\n\\t\\t\\t\\ttake and pay compensation for it. Then, when he got\\n\\t\\t\\t\\tbetter again, he should do umra and come out of his\\n\\t\\t\\t\\tihram, after which he had to do hajj another year and to\\n\\t\\t\\t\\toffer whatever sacrificial animal he was able to in the\\n\\t\\t\\t\\tfuture.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what we do here (in Madina) if\\n\\t\\t\\t\\tsomeone is detained by something other than an enemy. And\\n\\t\\t\\t\\twhen Abu Ayyub al-Ansari and Habbar ibn al-Aswad came to\\n\\t\\t\\t\\tthe day of the sacrifice and had missed the hajj, Umar\\n\\t\\t\\t\\tibn al-Khattab told them to come out of ihram by doing\\n\\t\\t\\t\\tumra and then to go home free of ihram and do hajj some\\n\\t\\t\\t\\ttime in the future and to sacrifice an animal, or, if\\n\\t\\t\\t\\tthey could not find one, to fast three days during the\\n\\t\\t\\t\\thajj and seven days after they had returned to their\\n\\t\\t\\t\\tfamilies.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Anyone who is detained from doing hajj after\\n\\t\\t\\t\\the has gone into ihram, whether by illness or otherwise,\\n\\t\\t\\t\\tor by an error in calculating the month or because the\\n\\t\\t\\t\\tnew moon is concealed from him is in the same position as\\n\\t\\t\\t\\tsome one who is hindered from doing the hajj and must do\\n\\t\\t\\t\\tthe same as he does.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about the situation of\\n\\t\\t\\t\\tsomeone from Makka who went into ihram for hajj and then\\n\\t\\t\\t\\tbroke a bone or had severe stomach pain, or of a woman\\n\\t\\t\\t\\twho was in labour, and he said, \"Someone to whom this\\n\\t\\t\\t\\thappens is in the same situation as one who is hindered\\n\\t\\t\\t\\tfrom doing the hajj, and he must do the same as people\\n\\t\\t\\t\\tfrom outlying regions do when they are hindered from\\n\\t\\t\\t\\tdoing the hajj.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about someone who arrived in the months of\\n\\t\\t\\t\\tthe hajj with the intention of doing umra, and completed\\n\\t\\t\\t\\this umra and went into ihram in Makka to do hajj, and\\n\\t\\t\\t\\tthen broke a bone or something else happened to him which\\n\\t\\t\\t\\tstopped him from being present at Arafa with everybody\\n\\t\\t\\t\\telse, \"I think that he should stay where he is until he\\n\\t\\t\\t\\tis better and then go outside the area of the Haram, and\\n\\t\\t\\t\\tthen return to Makka and do tawaf of the House and say\\n\\t\\t\\t\\tbetween Safa and Marwa, and then leave ihram. He must\\n\\t\\t\\t\\tthen do hajj again another year and offer a sacrificial\\n\\t\\t\\t\\tanimal .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about someone who left ihram in Makka, and\\n\\t\\t\\t\\tthen did tawaf of the House and say between Safa and\\n\\t\\t\\t\\tMarwa, and then fell ill and was unable to be present\\n\\t\\t\\t\\twith everybody at Arafa, \"If the hajj passes someone by\\n\\t\\t\\t\\the should, if he can, go out of the area of the Haram and\\n\\t\\t\\t\\tthen come back in again to do umra and do tawaf of the\\n\\t\\t\\t\\tHouse and say between Safa and Marwa, because he had not\\n\\t\\t\\t\\tintended his initial tawaf to be for an umra, and so for\\n\\t\\t\\t\\tthis reason he does it again. He must do the next hajj\\n\\t\\t\\t\\tand offer a sacrificial animal.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf he is not one of the people of Makka, and something\\n\\t\\t\\t\\thappens to him which stops him from doing the hajj, but\\n\\t\\t\\t\\the does tawaf of the House and say between Safa and\\n\\t\\t\\t\\tMarwa, he should come out of ihram by doing an umra and\\n\\t\\t\\t\\tthen do tawaf of the House a second time, and say between\\n\\t\\t\\t\\tSafa and Marwa, because his initial tawaf and say were\\n\\t\\t\\t\\tintended for the hajj. He must do the next hajj and offer\\n\\t\\t\\t\\ta sacrificial animal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "105",
    "sectionHeading": "Concerning Building the Kaba",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Muhammad ibn Abi\\n\\t\\t\\t\\tBakras-Siddiq told Abdullah ibn Umar from A'isha, that\\n\\t\\t\\t\\tthe Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tsaid, \"Don't you see that when your people built the Kaba\\n\\t\\t\\t\\tthey fell short of the foundations of Ibrahim?\" A'isha\\n\\t\\t\\t\\tsaid, \"Messenger of Allah, won't you return it to the\\n\\t\\t\\t\\tfoundations of Ibrahim?\" and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"If it were\\n\\t\\t\\t\\tnot that your people have only recently left kufr, I\\n\\t\\t\\t\\twould have done so.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSalim ibn Abdullah said that Abdullah ibn Umar said, \"If\\n\\t\\t\\t\\tA'isha heard this from the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, then I consider that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, only refrained from greeting the two corners which\\n\\t\\t\\t\\tare adjacent to the Hijr because the House had not been\\n\\t\\t\\t\\tcompleted on the foundations of Ibrahim.\" (i.e. the\\n\\t\\t\\t\\tcorners he did not touch were not the original corners of\\n\\t\\t\\t\\tthe Kaba) .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "106",
    "sectionHeading": "Concerning Building the Kaba",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, umm al-muminin, said, \"I do not\\n\\t\\t\\t\\tmind whether I pray in the Hijr or in the House.\" (i.e.\\n\\t\\t\\t\\tpraying in the Hijr is the same as praying in the House).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "107",
    "sectionHeading": "Concerning Building the Kaba",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Ibn Shihab\\n\\t\\t\\t\\tsay that he had heard one of the people of knowledge say\\n\\t\\t\\t\\tthat the Hijr was only enclosed so that people would go\\n\\t\\t\\t\\tbeyond it as they were making tawaf, and their tawaf\\n\\t\\t\\t\\twould therefore encompass the original House.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "108",
    "sectionHeading": "Hastening (Raml) in the Tawaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tfrom his father that Jabir ibn Abdullah said, \"I saw the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, hastening from the Black Stone until he reached it\\n\\t\\t\\t\\tagain, three times.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what is still done by the people of\\n\\t\\t\\t\\tknowledge in our city.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "109",
    "sectionHeading": "Hastening (Raml) in the Tawaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to hasten from the Black Stone round to the\\n\\t\\t\\t\\tBlack Stone three times and then would walk four circuits\\n\\t\\t\\t\\tnormally.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "110",
    "sectionHeading": "Hastening (Raml) in the Tawaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\twhen his father did tawaf of the House he would hasten in\\n\\t\\t\\t\\tthe first three circuits and say in a low voice, \"O\\n\\t\\t\\t\\tAllah, there is no god but You, and You bring to life\\n\\t\\t\\t\\tafter You have made to die.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma la ilaha illa anta, wa anta tuhyi badama\\n\\t\\t\\t\\tamatta.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "111",
    "sectionHeading": "Hastening (Raml) in the Tawaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that he saw Abdullah ibn az-Zubayr go into\\n\\t\\t\\t\\tihram for umra at at-Tanim.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"Then I saw him hasten around the House for\\n\\t\\t\\t\\tthree circuits.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "112",
    "sectionHeading": "Hastening (Raml) in the Tawaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar never used to do tawaf of the House or say\\n\\t\\t\\t\\tbetween Safa and Marwa if he went into ihram in Makka\\n\\t\\t\\t\\tuntil he had returned from Mina, nor would he hasten when\\n\\t\\t\\t\\tdoing tawaf of the House if he went into ihram in Makka.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "113",
    "sectionHeading": "Saluting the Corners during Tawaf.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\twhen the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, had finished his tawaf of the House,\\n\\t\\t\\t\\tprayed two rakas, and wanted to go to Safa and Marwa, he\\n\\t\\t\\t\\twould salute the corner of the Black Stone before he\\n\\t\\t\\t\\tleft.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "114",
    "sectionHeading": "Saluting the Corners during Tawaf.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, once said to Abd ar-Rahman\\n\\t\\t\\t\\tibn Awf, \"What do you do, Abu Muhammad, when saluting the\\n\\t\\t\\t\\tcorner?\" and Abd ar-Rahman said, \"Sometimes I salute it,\\n\\t\\t\\t\\tand sometimes I don't.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"You are right.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "115",
    "sectionHeading": "Saluting the Corners during Tawaf.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to salute all the corners when he did\\n\\t\\t\\t\\ttawaf of the House and did not omit the Yamani corner\\n\\t\\t\\t\\tunless he was prevented from it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "116",
    "sectionHeading": "Kissing the Corner of the Black Stone when Saluting the Corners",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Umar ibn al-Khattab said to the corner of\\n\\t\\t\\t\\tthe Black Stone while he was doing tawaf of the House,\\n\\t\\t\\t\\t\"You are only a stone, and if I had not seen the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, kiss you, I would not do so.\"  Then he kissed it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard some of the people of knowledge\\n\\t\\t\\t\\trecommending someone doing tawaf of the House to put his\\n\\t\\t\\t\\thand to his mouth when he takes it from the Yamani\\n\\t\\t\\t\\tcorner.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "117",
    "sectionHeading": "The Two Rakas of Tawaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father would never do two sets of seven tawafs\\n\\t\\t\\t\\ttogether without praying between them. After every seven\\n\\t\\t\\t\\ttawafs he would pray two rakas, sometimes at the maqam of\\n\\t\\t\\t\\tIbrahim, and sometimes elsewhere.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man doing voluntary tawaf\\n\\t\\t\\t\\tcould, to make it easier on himself, join two or more\\n\\t\\t\\t\\tsets of seven circuits and then pray whatever he owed for\\n\\t\\t\\t\\tthose sets of seven, and he said, \"He should not do that.\\n\\t\\t\\t\\tThe sunna is that he does two rakasafter every seven\\n\\t\\t\\t\\tcircuits.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about someone who began doing tawaf and then\\n\\t\\t\\t\\tforgot how many he had done and did eightor nine\\n\\t\\t\\t\\tcircuits, \"He should stop when he knows that he has done\\n\\t\\t\\t\\tmore than the right number and then pray two rakas,and he\\n\\t\\t\\t\\tshould not count the ones that he has done in excess.\\n\\t\\t\\t\\tNeither should he build on the nine that he has done and\\n\\t\\t\\t\\tthen pray the rakas for the two sets of seven circuits\\n\\t\\t\\t\\ttogether, because the sunna is that you pray two rakas\\n\\t\\t\\t\\tafter every seven circuits.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that someone who was in doubt about his tawaf\\n\\t\\t\\t\\tafter he had prayed the two rakas of tawaf should go back\\n\\t\\t\\t\\tand complete his tawaf until he was certain of how much\\n\\t\\t\\t\\the had done. He should then repeat the two rakas, because\\n\\t\\t\\t\\tprayer when doing tawaf was only valid after completing\\n\\t\\t\\t\\tseven circuits.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If some one breaks his wudu either while he is doing\\n\\t\\t\\t\\ttawaf, or when he has finished tawaf but before he has\\n\\t\\t\\t\\tprayed the two rakas of tawaf, he should do wudu and\\n\\t\\t\\t\\tbegin the tawaf and the two rakas afresh. Breaking wudu\\n\\t\\t\\t\\tdoes not interrupt say between Safa and Marwa, but a\\n\\t\\t\\t\\tperson should not begin say unless he is pure by being in\\n\\t\\t\\t\\twudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "118",
    "sectionHeading": "Praying after Subh and Asr when doing Tawaf ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tHumayd ibn Abd ar-Rahman ibn Awf that Abd ar-Rahman ibn\\n\\t\\t\\t\\tAbd al-Qari mentioned to him that he once did tawaf of\\n\\t\\t\\t\\tthe House with Umar ibn al-Khattab after subh and when\\n\\t\\t\\t\\tUmar had finished his tawaf he looked and saw that the\\n\\t\\t\\t\\tsun had not yet risen, so he rode on until he made his\\n\\t\\t\\t\\tcamel kneel at Dhu Tuwa, and he prayed two rakas.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "119",
    "sectionHeading": "Praying after Subh and Asr when doing Tawaf ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'z Zubayr al-Makki\\n\\t\\t\\t\\tsaid, \"I saw Abdullah ibn Abbas doing tawaf after asr.\\n\\t\\t\\t\\tThen he went into his room and I do not know what he\\n\\t\\t\\t\\tdid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "120",
    "sectionHeading": "Praying after Subh and Asr when doing Tawaf ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tsaid, \"I saw the House deserted both after subh and asr,\\n\\t\\t\\t\\twith no-one doing tawaf.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone does some of his circuits and\\n\\t\\t\\t\\tthen the subh or asr prayer is begun, he should pray with\\n\\t\\t\\t\\tthe imam and then complete the rest of his circuits but\\n\\t\\t\\t\\tshould not pray at all until the sun has either risen or\\n\\t\\t\\t\\tset \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe added, \"There is no harm in delaying the two rakas\\n\\t\\t\\t\\tuntil after he has prayed maghrib.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in someone doing a single\\n\\t\\t\\t\\ttawaf after subh or after asr, not to do more than one\\n\\t\\t\\t\\tgroup of seven circuits, and then as long as he delays\\n\\t\\t\\t\\tthe two rakas until after the sun has risen, as Umar ibn\\n\\t\\t\\t\\tal-Khattab did, or he delays them until after the sun has\\n\\t\\t\\t\\tset if it is after asr. Then when the sun has set he can\\n\\t\\t\\t\\tpray them if he wants, or, if he wants, he can delay them\\n\\t\\t\\t\\tuntil after he has prayed maghrib. There is no harm in\\n\\t\\t\\t\\tthat.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "121",
    "sectionHeading": "Taking Leave of the House",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Umar ibn al-Khattab said, \"No-one should\\n\\t\\t\\t\\tleave the hajj until he has done tawaf of the House, and\\n\\t\\t\\t\\ttawaf of the House is the final rite.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, commenting about Umar ibn al-Khattab's saying\\n\\t\\t\\t\\t'tawaf of the House is the final rite,' \"In our opinion,\\n\\t\\t\\t\\tand Allah knows best, that is because Allah, the Blessed\\n\\t\\t\\t\\tand Exalted, says, 'Whoever exalts the rituals of Allah -\\n\\t\\t\\t\\tthat is from the taqwa of the hearts' (Sura 22 ayat 32),\\n\\t\\t\\t\\tand He says, 'Then their halal place (of sacrifice) is at\\n\\t\\t\\t\\tthe Ancient House,' and the place of all the rituals and\\n\\t\\t\\t\\twhere they end is therefore at the Ancient House.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "122",
    "sectionHeading": "Taking Leave of the House",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tUmar ibn al-Khattab refused to let one man who had not\\n\\t\\t\\t\\ttaken leave of the House pass adh-Dhahran, (a valley\\n\\t\\t\\t\\teighteen miles from Makka) until he had taken leave of\\n\\t\\t\\t\\tit.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "123",
    "sectionHeading": "Taking Leave of the House",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"Allah has completed the hajj of anyone\\n\\t\\t\\t\\twho does the tawaf al-ifada. It is fitting that tawaf of\\n\\t\\t\\t\\tthe House be the last of his contract, as long as nothing\\n\\t\\t\\t\\tprevents him, and if something prevents him, or an\\n\\t\\t\\t\\tobstacle arises, then Allah has completed his hajj.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not think that a man who does not know\\n\\t\\t\\t\\tthat the last of his contract is tawaf of the House until\\n\\t\\t\\t\\the has left owes anything, unless he is nearby and can\\n\\t\\t\\t\\treturn, do tawaf, and then leave having done the tawaf\\n\\t\\t\\t\\tal-ifada.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "124",
    "sectionHeading": "Tawaf in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'l-Aswad Muhammad\\n\\t\\t\\t\\tibn Abd ar-Rahman ibn Nawfal from Urwa ibn az-Zubayr from\\n\\t\\t\\t\\tZaynab bint Abi Salama that Umm Salama, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"I once complained to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, that I was ill and he\\n\\t\\t\\t\\tsaid, 'Do tawaf riding behind the people.' So I did tawaf\\n\\t\\t\\t\\triding my camel, while the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, was praying by the side of\\n\\t\\t\\t\\tthe House, reciting Surat at-Tur.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "125",
    "sectionHeading": "Tawaf in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zubayr al-Makki\\n\\t\\t\\t\\tthat Abu Maiz al-Aslami Abdullah ibn Sufyan told him that\\n\\t\\t\\t\\tonce, when he was sitting with Abdullah ibn Umar, a woman\\n\\t\\t\\t\\tcame to ask him for an opinion. She said, \"I set out\\n\\t\\t\\t\\tintending to do tawaf of the House, but then, when I got\\n\\t\\t\\t\\tto the gate of the Mosque, I started bleeding, so I went\\n\\t\\t\\t\\tback until it had left me. Then I set out again, and\\n\\t\\t\\t\\tthen, when I got to the gate of the mosque, I started\\n\\t\\t\\t\\tbleeding, so I went back until it had left me. Then I set\\n\\t\\t\\t\\toff again, and then, when I got to the gate of the\\n\\t\\t\\t\\tmosque, I started bleeding.\" Abdullah ibn Umar said,\\n\\t\\t\\t\\t\"That is only an impulse from Shaytan. Do ghusl, then\\n\\t\\t\\t\\tbind your private parts with a cloth and do tawaf.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "126",
    "sectionHeading": "Tawaf in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that if\\n\\t\\t\\t\\tSad ibn Abi Waqqas entered Makka late, he would go to\\n\\t\\t\\t\\tArafa before doing tawaf of the House and say between\\n\\t\\t\\t\\tSafa and Marwa, and then do tawaf when he got back.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The leeway is broad, if Allah wills.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether somebody that was doing\\n\\t\\t\\t\\tobligatory tawaf could stop and talk with another man,\\n\\t\\t\\t\\tand he said, \"I do not like him to do that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Only someone who is pure (by being in wudu)\\n\\t\\t\\t\\tshould do tawaf of the House or say between Safa and\\n\\t\\t\\t\\tMarwa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "127",
    "sectionHeading": "Starting with Safa in the Say",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tibn AIi from his father that Jabir ibn Abdullah said, \"I\\n\\t\\t\\t\\theard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, say as he left the mosque, intending to\\n\\t\\t\\t\\tgo to Safa, 'We begin with that with which Allah began,'\\n\\t\\t\\t\\tand he began with Safa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "128",
    "sectionHeading": "Starting with Safa in the Say",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammed\\n\\t\\t\\t\\tibn AIi from his father from Jabir ibn Abdullah that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to say, \"Allah is greater\" three times when\\n\\t\\t\\t\\the stopped on Safa, and \"There is no god but Allah,\\n\\t\\t\\t\\talone, without any partner. To Him belong the Kingdom and\\n\\t\\t\\t\\tpraise, and He has power over everything\" three times,\\n\\t\\t\\t\\tand make dua. He would then do the same on Marwa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "129",
    "sectionHeading": "Starting with Safa in the Say",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that he heard\\n\\t\\t\\t\\tAbdullah ibn Umar making dua on Safa saying, \"O Allah,\\n\\t\\t\\t\\tYou have said, 'call on Me - I will answer you' and You\\n\\t\\t\\t\\tdo not break Your promise. So I am askingYou, in the same\\n\\t\\t\\t\\tway that You have guided me to Islam, not to take it away\\n\\t\\t\\t\\tfrom me, and that You make me die while I am muslim.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "130",
    "sectionHeading": "Say in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"Once when I was young I said to A'isha,\\n\\t\\t\\t\\tumm al-muminin, 'Have you seen the saying of Allah, the\\n\\t\\t\\t\\tBlessed and Exalted, \"Safa and Marwa are among the\\n\\t\\t\\t\\twaymarks of Allah, so whoever does hajj or umra to the\\n\\t\\t\\t\\tHouse, there is no harm in his going between them,\" so it\\n\\t\\t\\t\\tfollows that there should be no harm for some one who\\n\\t\\t\\t\\tdoes not go between them.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha said, 'No. If it were as you say, there would be\\n\\t\\t\\t\\tno harm in his not going between them. This ayat was only\\n\\t\\t\\t\\trevealed about the Ansar. They used to make pilgrimage to\\n\\t\\t\\t\\tManat, and Manat was an idol near Qudayd, and they used\\n\\t\\t\\t\\tto avoid going between Safa and Marwa, and when Islam\\n\\t\\t\\t\\tcame they asked the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, about this and Allah, the\\n\\t\\t\\t\\tBlessed and Exalted, revealed, \"Safa and Marwa are among\\n\\t\\t\\t\\tthe waymarks of Allah, so whoever does hajj or umra to\\n\\t\\t\\t\\tthe House, there is no harm in his going between them. \"\\n\\t\\t\\t\\t' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "131",
    "sectionHeading": "Say in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\tSawda bint Abdullah ibn Umar, who was in the household of\\n\\t\\t\\t\\tUrwa ibn az-Zubayr, set off walking between Safa and\\n\\t\\t\\t\\tMarwa when doing either hajj or an umra. She was a heavy\\n\\t\\t\\t\\twoman and she began when everybody was leaving after the\\n\\t\\t\\t\\tisha prayer, and she still had not completed her circuits\\n\\t\\t\\t\\twhen the first call was given for subh, but finished them\\n\\t\\t\\t\\tbetween the two calls to prayer.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf Urwa saw people doing circuits on riding beasts he\\n\\t\\t\\t\\twould tell them in very strong terms not to do so, and\\n\\t\\t\\t\\tthey would pretend to be ill, out of awe of him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHisham added, \"He used to say to us about them 'These are\\n\\t\\t\\t\\tunsuccessful and have lost.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who forgets say between Safa and\\n\\t\\t\\t\\tMarwa in an umra, and does not remember until he is far\\n\\t\\t\\t\\tfrom Makka, should return and do say. If, in the\\n\\t\\t\\t\\tmeantime, he has had intercourse with a woman, he should\\n\\t\\t\\t\\treturn and do say between Safa and Marwa so as to\\n\\t\\t\\t\\tcomplete what remains of that umra, and then after that\\n\\t\\t\\t\\the has to do another umra and offer a sacrificial\\n\\t\\t\\t\\tanimal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about someone who met another man when\\n\\t\\t\\t\\tdoing say between Safa and Marwa and stopped to talk with\\n\\t\\t\\t\\thim, and he said, \"I do not like anyone to do that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If anyone forgets some of his tawaf or is\\n\\t\\t\\t\\tuncertain about it and remembers only when he is doing\\n\\t\\t\\t\\tsay between Safa and Marwa, he should stop the say and\\n\\t\\t\\t\\tcomplete his tawaf of the House apart from that about\\n\\t\\t\\t\\twhich he is certain. After that he prays the two rakas of\\n\\t\\t\\t\\tthe tawaf, and then begins his say between Safa and\\n\\t\\t\\t\\tMarwa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "132",
    "sectionHeading": "Say in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tfrom his father from Jabir ibn Abdullah that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, walked when he came down from Safa and Marwa and\\n\\t\\t\\t\\tthen, when he reached the middle of the valley, he broke\\n\\t\\t\\t\\tinto a light run until he had left it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about a man who, out of ignorance, did the\\n\\t\\t\\t\\tsay between Safa and Marwa before he had done tawaf of\\n\\t\\t\\t\\tthe House, \"He should go back and do tawaf of the House\\n\\t\\t\\t\\tand then do say between Safa and Marwa. If he does not\\n\\t\\t\\t\\tlearn about this until he has left Makka and is far away,\\n\\t\\t\\t\\the should return to Makka and do tawaf of the House and\\n\\t\\t\\t\\tsay between Safa and Marwa. If in the meantime he has had\\n\\t\\t\\t\\tintercourse with a woman he should return, and do tawaf\\n\\t\\t\\t\\tof the House and say between Safa and Marwa so that he\\n\\t\\t\\t\\tcompletes what he owes of that umra. Then, after that, he\\n\\t\\t\\t\\thas to do another umra and offer a sacrificial animal .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "133",
    "sectionHeading": "Fasting the Day of Arafa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, from Umayr, the mawla of Abdullah\\n\\t\\t\\t\\tibn Abbas, from Umm al-Fadl bint al-Harith, that she was\\n\\t\\t\\t\\tpresent when some people were arguing on the day of Arafa\\n\\t\\t\\t\\tabout whether the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, was fasting or not. Some of them\\n\\t\\t\\t\\tsaid he was fasting, and some of them said he was not. So\\n\\t\\t\\t\\tshe sent a bowl of milk to him while his camel was\\n\\t\\t\\t\\tstanding still and he drank.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "134",
    "sectionHeading": "Fasting the Day of Arafa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tal-Qasim ibn Muhammad that A'isha, umm al-muminin, used\\n\\t\\t\\t\\tto fast on the day of Arafa .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAl-Qasim said, \"I saw her, when the imam began moving\\n\\t\\t\\t\\taway (after sunset) on the afternoon of Arafa, stay where\\n\\t\\t\\t\\tshe was until the ground between her and the people\\n\\t\\t\\t\\tbecame clear. Then she asked for something to drink and\\n\\t\\t\\t\\tbroke her fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "135",
    "sectionHeading": "Fasting on the Days of Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n-Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, from Sulayman ibn Yasar that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade fasting on the days of Mina.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "136",
    "sectionHeading": "Fasting on the Days of Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, sent Abdullah ibn Hudhayfa out on the days of Mina\\n\\t\\t\\t\\tto circulate among the people to tell them those days\\n\\t\\t\\t\\twere for eating and drinking and remembrance of Allah.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "137",
    "sectionHeading": "Fasting on the Days of Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Yahya\\n\\t\\t\\t\\tibn Habban from al-Araj from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade fasting on two days - the day of the Id\\n\\t\\t\\t\\tal-Fitr and the day of the Id al-Adha.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "138",
    "sectionHeading": "Fasting on the Days of Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Abdullah\\n\\t\\t\\t\\tibn al-Hadi from Abu Murra, the mawla of Umm Hani, the\\n\\t\\t\\t\\tsister of Aqil ibn Abi Talib, that Abdullah ibn Amr ibn\\n\\t\\t\\t\\tal-As told him that he had visited his father Amr ibn\\n\\t\\t\\t\\tal-As and found him eating. His father had invited him to\\n\\t\\t\\t\\teat, and when he replied that he was fasting, his father\\n\\t\\t\\t\\tsaid, \"These are the days on which the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, forbade\\n\\t\\t\\t\\tus to fast, and told us to break the fast on them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"These days are the days of tashriq.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "139",
    "sectionHeading": "What are Acceptable as Sacrificial Animals (Hadys)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Abi Bakr ibn Muhammad ibn Amr ibn Hazm that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, sacrificed a camel, which had belonged to Abu Jahl\\n\\t\\t\\t\\tibn Hisham, in either a hajj or an umra.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "140",
    "sectionHeading": "What are Acceptable as Sacrificial Animals (Hadys)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, saw a man driving\\n\\t\\t\\t\\tforward a camel which he was going to sacrifice, and he\\n\\t\\t\\t\\ttold him to ride it. The man said, \"Messenger of Allah,\\n\\t\\t\\t\\tit is an animal that I am going to sacrifice,\" and he\\n\\t\\t\\t\\treplied, \"Ride it, woe on you,\" either the second or the\\n\\t\\t\\t\\tthird time.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "141",
    "sectionHeading": "What are Acceptable as Sacrificial Animals (Hadys)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat he used to see Abdullah ibn Umar sacrificing animals\\n\\t\\t\\t\\ttwo at a time during hajj and one at a time during umra.\\n\\t\\t\\t\\tHe said, \"I saw him sacrifice an animal during an umra\\n\\t\\t\\t\\toutside the house of Khalid ibn Usayd, where he was\\n\\t\\t\\t\\tstaying. I saw him stick his spear in the throat of the\\n\\t\\t\\t\\tanimal he was going to sacrifice until the spear came out\\n\\t\\t\\t\\tunder its shoulder.\"'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "142",
    "sectionHeading": "What are Acceptable as Sacrificial Animals (Hadys)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tUmar ibn Abd al-Aziz once sacrificed a camel during a\\n\\t\\t\\t\\thajj or an umra.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "143",
    "sectionHeading": "What are Acceptable as Sacrificial Animals (Hadys)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Jafar al-Qari\\n\\t\\t\\t\\tthat Abdullah ibn Ayyash ibn Abi Rabia al-Makhzumi\\n\\t\\t\\t\\tsacrificed two camels, one of them a Bactrian.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "144",
    "sectionHeading": "What are Acceptable as Sacrificial Animals (Hadys)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"If a she-camel that is being\\n\\t\\t\\t\\tdriven as a sacrificial animal gives birth, the offspring\\n\\t\\t\\t\\tshould be carried along as well and they are sacrificed\\n\\t\\t\\t\\ttogether with her, and if there is no place where they\\n\\t\\t\\t\\tcan be carried, they should be carried on the mother\\n\\t\\t\\t\\tuntil they are all sacrificed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "145",
    "sectionHeading": "What are Acceptable as Sacrificial Animals (Hadys)",
    "text": "<p>\\n\\t\\t\\t\\tahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"If necessary, ride on your sacrificial\\n\\t\\t\\t\\tanimal, without burdening it, and if necessary, drink its\\n\\t\\t\\t\\tmilk after its young one has drunk its fill, and when you\\n\\t\\t\\t\\tsacrifice it, sacrifice the young one with it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "146",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that when he brought an animal to be sacrificed\\n\\t\\t\\t\\tfrom Madina he would garland it and brand it at\\n\\t\\t\\t\\tDhu'l-Hulayfa, doing the garlanding before the branding,\\n\\t\\t\\t\\tbut doing both in the same place, while facing the qibla.\\n\\t\\t\\t\\tHe would garland the animal with two sandals and brand it\\n\\t\\t\\t\\ton its left side. It would then be driven with him until\\n\\t\\t\\t\\the observed the standing together with everybody at\\n\\t\\t\\t\\tArafa. Then he would drive it on with him when everybody\\n\\t\\t\\t\\telse moved on, and then when he arrived at Mina on the\\n\\t\\t\\t\\tmorning of the sacrifice, he would sacrifice the animal,\\n\\t\\t\\t\\tbefore he shaved his head. He would sacrifice the animals\\n\\t\\t\\t\\twith his own hands ,lining them up standing and facing\\n\\t\\t\\t\\tthe qibla. He would then eat some of the meat, and give\\n\\t\\t\\t\\tsome of it away.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "147",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, when nicking the hump of his sacrificial\\n\\t\\t\\t\\tanimal to brand it, \"In the name of Allah, and Allah is\\n\\t\\t\\t\\tgreater.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "148",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"A sacrificial animal is what has\\n\\t\\t\\t\\tbeen garlanded, branded, and stood with on Arafa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "149",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to drape his sacrificial animals in fine\\n\\t\\t\\t\\tEgyptian linen, saddlecloths and sets of clothing, which\\n\\t\\t\\t\\the would afterwards send to the Kaba and have the Kaba\\n\\t\\t\\t\\tdraped with them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "150",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Abdullah ibn\\n\\t\\t\\t\\tDinar what Abdullah ibn Umar used to do with the drapings\\n\\t\\t\\t\\tof his animals when the Kaba began to be draped with the\\n\\t\\t\\t\\tkiswa, and he said, \"He gave them away as sadaqa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "151",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, about sacrificial animals,\\n\\t\\t\\t\\t\"Six-year-old camels, three-year-old cows and sheep, or\\n\\t\\t\\t\\tolder than these.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "152",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar never used to tear the drapes of his sacrificial\\n\\t\\t\\t\\tanimals, and he would not drape them until he went from\\n\\t\\t\\t\\tMina to Arafa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "153",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) while They are being Driven",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to say to his sons, \"My sons, let none of\\n\\t\\t\\t\\tyou sacrifice any animal which he would be ashamed to\\n\\t\\t\\t\\tsacrifice for a noble woman, for surely Allah is the\\n\\t\\t\\t\\tnoblest of noble ones, and the most deserving of those\\n\\t\\t\\t\\tfor whom things are chosen.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "154",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) if They get Injured or Stray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the man who was in charge of the\\n\\t\\t\\t\\tsacrificial animal of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Messenger of Allah,\\n\\t\\t\\t\\twhat should I do with a sacrificial animal that gets\\n\\t\\t\\t\\tinjured?\" The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said to him, \"Slaughter any sacrificial\\n\\t\\t\\t\\tanimal that is injured. Then throw the garlands in its\\n\\t\\t\\t\\tblood, and then give the people a free hand in eating it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "155",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) if They get Injured or Stray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"If someone dedicates an animal\\n\\t\\t\\t\\tvoluntarily and then it is injured and he kills it and\\n\\t\\t\\t\\tgives everyone a free hand in eating it, he owes nothing.\\n\\t\\t\\t\\tIf, however, he eats some of it himself, or tells certain\\n\\t\\t\\t\\tother people to eat it, then he owes compensation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "156",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) if They get Injured or Stray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili from Abdullah ibn Abbas the same as that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "157",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) if They get Injured or Stray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said, \"If\\n\\t\\t\\t\\tsomeone dedicates an animal as compensation, or for a\\n\\t\\t\\t\\tvow, or as the sacrifice for tamattu, and misfortune\\n\\t\\t\\t\\tbefalls it on the road, he must provide a substitute.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "158",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) if They get Injured or Stray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"If someone dedicates an animal and then\\n\\t\\t\\t\\tit goes astray or dies, he should provide a substitute,\\n\\t\\t\\t\\tif it was for a vow. If, however, it was voluntary, then\\n\\t\\t\\t\\the can either provide a substitute for it or not, as he\\n\\t\\t\\t\\twishes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "159",
    "sectionHeading": "What to Do with Sacrificial Animals (Hadys) if They get Injured or Stray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the\\n\\t\\t\\t\\tpeople of knowledge say, \"Someone who dedicates a\\n\\t\\t\\t\\tsacrificial animal for compensation or as part of the\\n\\t\\t\\t\\thajj should not eat from it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "160",
    "sectionHeading": "The Animal (Hady) to be Sacriticed for Intercourse in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab and AIi ibn Abi Talib and Abu Hurayra\\n\\t\\t\\t\\twere asked about a man who had intercourse with his wife\\n\\t\\t\\t\\twhile he was in ihram on hajj. They said, \"The two of\\n\\t\\t\\t\\tthem should carry on and complete their hajj. Then they\\n\\t\\t\\t\\tmust do hajj again in another year, and sacrifice an\\n\\t\\t\\t\\tanimal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added that AIi ibn Abi Talib said, \"When they then\\n\\t\\t\\t\\tgo into ihram for hajj in a future year they should keep\\n\\t\\t\\t\\tapart until they have completed their hajj.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "161",
    "sectionHeading": "The Animal (Hady) to be Sacriticed for Intercourse in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the heard Said ibn al-Musayyab asking a group of people,\\n\\t\\t\\t\\t\"What do you think about someone who has intercourse with\\n\\t\\t\\t\\this wife while he is in ihram?\" and none of them answered\\n\\t\\t\\t\\thim. Said said, \"There is a man who has had intercourse\\n\\t\\t\\t\\twith his wife while in ihram who has sent a message to\\n\\t\\t\\t\\tMadina asking about it.\" Some of them said, \"They should\\n\\t\\t\\t\\tbe kept apart until a future year,\" and Said ibn\\n\\t\\t\\t\\tal-Musayyab said, \"They should carry on and complete the\\n\\t\\t\\t\\thajj which they have spoiled, and then return home when\\n\\t\\t\\t\\tthey have finished. If another hajj comes upon them, they\\n\\t\\t\\t\\tmust do hajj and sacrifice an animal. They should go into\\n\\t\\t\\t\\tihram at the same place where they went into ihram for\\n\\t\\t\\t\\tthe hajj that they spoiled, and they should keep apart\\n\\t\\t\\t\\tuntil they have finished their hajj.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"They should both sacrifice an animal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about a man who had intercourse with his wife\\n\\t\\t\\t\\tduring hajj after he had come down from Arafa but before\\n\\t\\t\\t\\the had stoned the Jamra, \"He must sacrifice an animal and\\n\\t\\t\\t\\tdo hajj again in another year. If, however, he had\\n\\t\\t\\t\\tintercourse with his wife after he stoned the Jamra, he\\n\\t\\t\\t\\tonly has to do an umra and sacrifice an animal and he\\n\\t\\t\\t\\tdoes not have to do another hajj.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What spoils a hajj or an umra and makes\\n\\t\\t\\t\\tsacrificing an animal and repeating the hajj necessary is\\n\\t\\t\\t\\tthe meeting of the two circumcised parts, even if there\\n\\t\\t\\t\\tis no emission. It is also made necessary by an emission\\n\\t\\t\\t\\tif it is the result of bodily contact. I do not think\\n\\t\\t\\t\\tthat a man who remembers something and has an emission\\n\\t\\t\\t\\towes anything, and if a man were to kiss his wife and no\\n\\t\\t\\t\\temission were to occur from that, he would only have to\\n\\t\\t\\t\\tsacrifice an animal. A woman in ihram who has intercourse\\n\\t\\t\\t\\twith her husband several times during hajj or umra out of\\n\\t\\t\\t\\tobedience to him only has to do another hajj and\\n\\t\\t\\t\\tsacrifice an animal. That is if her husband has\\n\\t\\t\\t\\tintercourse with her while she is doing hajj. If he has\\n\\t\\t\\t\\tintercourse with her while she is doing umra, she must\\n\\t\\t\\t\\trepeat the umra she has spoiled and sacrifice an animal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "162",
    "sectionHeading": "The Animal (Hady) to be Sacrificed for Missing the Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat Sulayman ibn Yasar told him that Abu Ayyub al-Ansari\\n\\t\\t\\t\\tonce set off to do hajj and then, when he reached\\n\\t\\t\\t\\tan-Naziya, on the road to Makka, his riding beasts\\n\\t\\t\\t\\tstrayed. He reached Umar ibn al-Khattab on the day of\\n\\t\\t\\t\\tsacrifice and told him what had happened and Umar said,\\n\\t\\t\\t\\t\"Do what someone doing umra would do, and then you can\\n\\t\\t\\t\\tleave ihram, and then when the hajj next comes upon you,\\n\\t\\t\\t\\tdo it and sacrifice whatever animal is easy for you .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "163",
    "sectionHeading": "The Animal (Hady) to be Sacrificed for Missing the Hajj",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Sulayman ibn Yasar\\n\\t\\t\\t\\tthat Habbar ibn al-Aswad arrived on the day of sacrifice\\n\\t\\t\\t\\twhile Umar ibn al-Khattab was sacrificing his animal and\\n\\t\\t\\t\\tsaid, \"Amir al-muminin, we made a mistake in our\\n\\t\\t\\t\\treckoning and we thought that today was the day of\\n\\t\\t\\t\\tArafa.\" Umar said, \"Go to Makka, you and whoever else is\\n\\t\\t\\t\\twith you, and do tawaf and sacrifice your animal if you\\n\\t\\t\\t\\thave one with you. Then shave or cut your hair and return\\n\\t\\t\\t\\thome. Then, in another year, do hajj and sacrifice an\\n\\t\\t\\t\\tanimal, and if you cannot find one, fast three days on\\n\\t\\t\\t\\thajj and seven when you return home.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who intends to do hajj and umra\\n\\t\\t\\t\\ttogether and then misses the hajj must do hajj again in\\n\\t\\t\\t\\tanother year, doing hajj with umra, and offer two\\n\\t\\t\\t\\tsacrificial animals, one for doing the hajj with umra,\\n\\t\\t\\t\\tand one for the hajj that he has missed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "164",
    "sectionHeading": "Intercourse with One's Wife Before Doing the Tawaf al-Ifada",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tfrom Ata ibn Abi Rabah that Abdullah ibn Abbas was asked\\n\\t\\t\\t\\tabout a man who had had intercourse with his wife while\\n\\t\\t\\t\\tat Mina before he had done the tawaf al-ifada, and he\\n\\t\\t\\t\\ttold him to sacrifice an animal.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "165",
    "sectionHeading": "Intercourse with One's Wife Before Doing the Tawaf al-Ifada",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili that lkrama, the mawla of Ibn Abbas, said, (and\\n\\t\\t\\t\\tThawr believed it to be from Abdullah ibn Abbas),\\n\\t\\t\\t\\t\"Someone who has intercourse with his wife before he has\\n\\t\\t\\t\\tdone the tawaf al-ifada should do an umra and sacrifice\\n\\t\\t\\t\\tan animal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "166",
    "sectionHeading": "Intercourse with One's Wife Before Doing the Tawaf al-Ifada",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard Rabia\\n\\t\\t\\t\\tibn Abi Abd ar-Rahman saying the same about that as what\\n\\t\\t\\t\\tIkrama related from Ibn Abbas.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I like most out of what I have\\n\\t\\t\\t\\theard about the matter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who forgot the tawaf al-ifada\\n\\t\\t\\t\\tuntil he had left Makka and returned to his community and\\n\\t\\t\\t\\the said, \"I think that he should go back and do the tawaf\\n\\t\\t\\t\\tal-ifada, as long as he has not had sexual relations with\\n\\t\\t\\t\\twomen. If, however, he has had sexual relations with\\n\\t\\t\\t\\twomen, then he should not only return and do the tawaf\\n\\t\\t\\t\\tal-ifada, but he should also do an umra and sacrifice an\\n\\t\\t\\t\\tanimal. He should not buy theanimal in Makka and\\n\\t\\t\\t\\tsacrifice it there, but if he has not brought one with\\n\\t\\t\\t\\thim from wherever it was he set out to do umra, he should\\n\\t\\t\\t\\tbuy one in Makka and then take it outside the limits of\\n\\t\\t\\t\\tthe Haram and drive it from there to Makka and sacrifice\\n\\t\\t\\t\\tit there.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "167",
    "sectionHeading": "The Sacrificial Animals that are Considered Least Difficult",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tfrom his father that Ali ibn Abi Talib used to say, \"The\\n\\t\\t\\t\\tleast difficult thing acceptable as a sacrificial animal\\n\\t\\t\\t\\tis a sheep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "168",
    "sectionHeading": "The Sacrificial Animals that are Considered Least Difficult",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Abbas used to say, \"The least difficult\\n\\t\\t\\t\\tthing acceptable as a sacrificial animal is a sheep.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I like most out of what I have\\n\\t\\t\\t\\theard about the matter, because Allah, the Blessed and\\n\\t\\t\\t\\tExalted, says in His Book, 'O you who trust, do not kill\\n\\t\\t\\t\\tgame while you are in ihram. Whoever of you kills it\\n\\t\\t\\t\\tintentionally, there shall be repayment the like of what\\n\\t\\t\\t\\the has slain, from livestock, as shall be judged by two\\n\\t\\t\\t\\tmen of justice among you, a sacrificial animal which will\\n\\t\\t\\t\\treach the Kaba, or food for poor people, or the\\n\\t\\t\\t\\tequivalent of that in fasting,' (Sura 5 ayat 95) and a\\n\\t\\t\\t\\tsheep is one of the animals which is judged to be\\n\\t\\t\\t\\tacceptable as a sacrifice. Allah has called it a\\n\\t\\t\\t\\tsacrificial animal, and there is no dispute among us\\n\\t\\t\\t\\tabout the matter. How, indeed, could anyone be in doubt\\n\\t\\t\\t\\tabout the matter? A sheep is the kaffara for anything\\n\\t\\t\\t\\twhich does not reach the extent of something for which a\\n\\t\\t\\t\\tcamel or a cow would be the kaffara, and the kaffara for\\n\\t\\t\\t\\tsomething which does not reach the extent of something\\n\\t\\t\\t\\tfor which a sheep would be the kaffara is fasting, or\\n\\t\\t\\t\\tfeeding poor people.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "169",
    "sectionHeading": "The Sacrificial Animals that are Considered Least Difficult",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Urnar used to say, \"The least thing that is\\n\\t\\t\\t\\tacceptable as a sacrificial animal is a camel or a cow.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "170",
    "sectionHeading": "The Sacrificial Animals that are Considered Least Difficult",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik fromAbdullah ibn Abi Bakr\\n\\t\\t\\t\\tthat a mawla of Amir bint Abd ar-Rahman called Ruqayya\\n\\t\\t\\t\\ttold him that she once set out with Amra bint Abd\\n\\t\\t\\t\\tar-Rahman to go to Makka. She said, ''Amra entered Makka\\n\\t\\t\\t\\ton the eighth of Dhu'l-Hijja, and I was with her. She did\\n\\t\\t\\t\\ttawaf of the House, and say between Safa and Marwa, and\\n\\t\\t\\t\\tthen entered the back of the mosque. She asked me, 'Do\\n\\t\\t\\t\\tyou have a pair of scissors with you?' and I said, 'No.'\\n\\t\\t\\t\\tShe said, 'Then try and find some for me.' I went and\\n\\t\\t\\t\\tlooked for some and brought them back and she cut some\\n\\t\\t\\t\\thair from the tresses of her head.Then, on the day of\\n\\t\\t\\t\\tsacrifice, she slaughtered a sheep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "171",
    "sectionHeading": "Sacrificial Animals in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sadaqa ibn Yasar\\n\\t\\t\\t\\tal-Makki that a man from the people of Yemen, who had his\\n\\t\\t\\t\\thair braided, came to Abdullah ibn Umar and said, \"Abu\\n\\t\\t\\t\\tAbd arRahman, I have come to do just umra. ''Abdullah ibn\\n\\t\\t\\t\\tUmar said to him, \"If I had been with you or you had\\n\\t\\t\\t\\tasked me I would have told you to do hajj and umra\\n\\t\\t\\t\\ttogether.\"  The Yemeni answered, \"I am doing what I am\\n\\t\\t\\t\\tdoing,\" and Abdullah ibn Umar said to him, \"Cut off the\\n\\t\\t\\t\\tlocks that are hanging from your head and offer a\\n\\t\\t\\t\\tsacrificial animal.\" A woman from Iraq said, \"What should\\n\\t\\t\\t\\this sacrificial animal be, Abu Abd ar-Rahman?\" and he\\n\\t\\t\\t\\tsaid, \"His sacrificial animal?\" and she said to him,\\n\\t\\t\\t\\t\"What should his sacrificial animal be?\" Abdullah ibn\\n\\t\\t\\t\\tUmar said, \"If I could only find a sheep to sacrifice, I\\n\\t\\t\\t\\twould prefer to do that than to fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "172",
    "sectionHeading": "Sacrificial Animals in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"A woman in ihram should not comb\\n\\t\\t\\t\\ther hair when she leaves ihram until she has cut some of\\n\\t\\t\\t\\tthe tresses of her hair, and if she has an animal for\\n\\t\\t\\t\\tsacrifice with her she should not cut off any of her hair\\n\\t\\t\\t\\tuntil the animal has been killed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "173",
    "sectionHeading": "Sacrificial Animals in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard one of\\n\\t\\t\\t\\tthe people of knowledge say, \"A man and wife should not\\n\\t\\t\\t\\tshare in one sacrificial animal. Each should sacrifice an\\n\\t\\t\\t\\tanimal separately.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about whether someone who had been\\n\\t\\t\\t\\tentrusted with an animal for him to sacrifice on hajj,\\n\\t\\t\\t\\twho went into ihram for umra, should sacrifice it when he\\n\\t\\t\\t\\tcame out of ihram or postpone it so that he sacrificed it\\n\\t\\t\\t\\tat the time of the hajj while in the meantime he came out\\n\\t\\t\\t\\tof ihram from his umra. He said, \"He should postpone it\\n\\t\\t\\t\\tso that he may sacrifice it at the time of the hajj, and\\n\\t\\t\\t\\tmeanwhile come out of ihram from his umra.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If it is judged that some-one must offer an\\n\\t\\t\\t\\tanimal for having killed game, or for any other reason,\\n\\t\\t\\t\\tthis animal can only be sacrificed at Makka, since Allah,\\n\\t\\t\\t\\tthe Blessed and Exalted, says, 'a sacrificial animal\\n\\t\\t\\t\\twhich will reach the Kaba.'  The fasting or sadaqa that\\n\\t\\t\\t\\tis considered equivalent to offering a sacrifice can be\\n\\t\\t\\t\\tdone outside Makka, and the person who is doing it can do\\n\\t\\t\\t\\tit wherever he likes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "174",
    "sectionHeading": "Sacrificial Animals in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tYaqub ibn Khalid al-Makhzumi that Abu Asma, the mawla of\\n\\t\\t\\t\\tAbdullah ibn Jafar, told him that he was with Abdullah\\n\\t\\t\\t\\tibn Jafar when they set out once from Madina. At as-Suqya\\n\\t\\t\\t\\tthey passed by Husayn ibn Ali, who was ill at the time.\\n\\t\\t\\t\\tAbdullah ibn Jafar stayed with him and then, when he\\n\\t\\t\\t\\tfeared that he was late (for the hajj) he left, and sent\\n\\t\\t\\t\\tfor Ali ibn Abi Talib and Asma bint Umays in Madina, and\\n\\t\\t\\t\\tthey came to Husayn. Then Husayn pointed to his head, and\\n\\t\\t\\t\\tAIi told someone to shave his head. Then he sacrificed an\\n\\t\\t\\t\\tanimal for him at as-Suqya, killing a camel for him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya ibn Said added, \"Husayn had set out with Uthman ibn\\n\\t\\t\\t\\tAffan on that particular journey to Makka. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "175",
    "sectionHeading": "The Wuquf at Arata and Muzdalifa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The whole of Arafa is a mawqif, except the\\n\\t\\t\\t\\tmiddle of Urana, and the whole of Muzdalifa is a\\n\\t\\t\\t\\tstanding-place, except for the middle of Muhassir.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "176",
    "sectionHeading": "The Wuquf at Arata and Muzdalifa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\tAbdullah ibn az-Zubayr used to say, \"Know that the whole\\n\\t\\t\\t\\tof Arafa is a standing-place except for the middle of\\n\\t\\t\\t\\tUrana, and that the wholeof Muzdalifa is a standing-place\\n\\t\\t\\t\\texcept for the middle of Muhassir.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Allah, the Blessed and Exalted says, 'There\\n\\t\\t\\t\\tis to be no rafath, no fusuq and no jidal during the\\n\\t\\t\\t\\thajj.' \" (Sura 2 ayat 197).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe added, \"Rafath is sexual relations with women, and\\n\\t\\t\\t\\tAllah knows best. Allah, the Blessed and Exalted says,\\n\\t\\t\\t\\t'Rafath with your women is permitted to you on the night\\n\\t\\t\\t\\tof the fast.' (Sura 2 ayat 197). Fusuq are sacrifices\\n\\t\\t\\t\\tmade to idols, and Allah knows best. Allah, the Blessed\\n\\t\\t\\t\\tand Exalted, says, 'Or a fisq offered up to other than\\n\\t\\t\\t\\tAllah.' (Sura 2 ayat 197) Jidal (arguing) during the hajj\\n\\t\\t\\t\\trefers to when the Quraysh used to stand near the mashar\\n\\t\\t\\t\\tal-haram at Quzah in Muzdalifa, while the Arabs and\\n\\t\\t\\t\\tothers would stand at Arafa, and they would argue about\\n\\t\\t\\t\\twho was the more correct. Allah, the Blessed and Exalted,\\n\\t\\t\\t\\tsays, 'And we appointed a method of sacrifice for every\\n\\t\\t\\t\\tnation, which they followed, so let them not dispute with\\n\\t\\t\\t\\tyou about the matter, and call to your Lord. Surely you\\n\\t\\t\\t\\tare on a straight guidance.' (Sura 22 ayat 67) This is\\n\\t\\t\\t\\twhat jidal refers to in our opinion, and Allah knows\\n\\t\\t\\t\\tbest. This I have heard from the people of knowledge.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "177",
    "sectionHeading": "Wuquf while Not in Wudu, and Wuquf on a Riding Beast",
    "text": "<p>\\n\\t\\t\\t\\tMalik was asked about whether a man could stand at Arafa,\\n\\t\\t\\t\\tor at Muzdalifa, or stone the Jamras, or do say between\\n\\t\\t\\t\\tSafa and Marwa if he was not in wudu, and he said, \"Every\\n\\t\\t\\t\\tpractice in the hajj that a menstruating woman can take\\n\\t\\t\\t\\tpart in can be taken part in by a man who is not in wudu\\n\\t\\t\\t\\tand there is nothing due from him for that. However, it\\n\\t\\t\\t\\tis better for him to be in wudu for all those things, and\\n\\t\\t\\t\\the should not make a general practice of it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man who was riding should get\\n\\t\\t\\t\\tdown to do the standing at Arafa or if he could stand\\n\\t\\t\\t\\twhile mounted, and he said, \"He can stand while mounted,\\n\\t\\t\\t\\tunless he or his riding beast have an illness, in which\\n\\t\\t\\t\\tcase Allah is the one who most often accepts an excuse.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "178",
    "sectionHeading": "The Wuquf at Arafa of Someone who Misses the Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Someone who does not stand at\\n\\t\\t\\t\\tArafa on the night of Muzdalifa before the dawn breaks\\n\\t\\t\\t\\thas missed the hajj, and someone who stands at Arafa on\\n\\t\\t\\t\\tthe night of Muzdalifa before the dawn breaks has caught\\n\\t\\t\\t\\tthe hajj.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "179",
    "sectionHeading": "The Wuquf at Arafa of Someone who Misses the Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"Someone who does not stand at Arafa on\\n\\t\\t\\t\\tthe night of Muzdalifa\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tbefore the dawn breaks has missed the hajj, and some one\\n\\t\\t\\t\\twho stands at Arafa on the night of Muzdalifa before the\\n\\t\\t\\t\\tdawn breaks has caught the hajj.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about a slave freed during the wuquf at\\n\\t\\t\\t\\tArafa, \"His standing does not fulfil for him the hajj of\\n\\t\\t\\t\\tIslam, except if he was not in ihram and then he went\\n\\t\\t\\t\\tinto ihram after he was freed and he stood at Arafa that\\n\\t\\t\\t\\tsame night before the dawn broke in which case that is\\n\\t\\t\\t\\tenough for him. If, however, he did not go into ihram\\n\\t\\t\\t\\tuntil after the dawn had broken, he is in the same\\n\\t\\t\\t\\tposition as someone who misses the hajj by not catching\\n\\t\\t\\t\\tthe standing at Arafa before the breaking of the dawn on\\n\\t\\t\\t\\tthe night of Muzdalifa, and he will have to do the hajj\\n\\t\\t\\t\\tof Islam later.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "180",
    "sectionHeading": "Sending Women and Children Ahead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafj from Salim and\\n\\t\\t\\t\\tUbaydullah, two sons of Abdullah ibn Umar, that their\\n\\t\\t\\t\\tfather Abdullah ibn Umar used to send his family and\\n\\t\\t\\t\\tchildren from Muzdalifa to Mina ahead of him so that they\\n\\t\\t\\t\\tcould pray subh at Mina and throw the stones before\\n\\t\\t\\t\\teveryone (else) arrived.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "181",
    "sectionHeading": "Sending Women and Children Ahead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAta ibn Abi Rabah that a mawla of Asma bint Abi Bakr told\\n\\t\\t\\t\\thim, \"We arrived at Mina with Asma bint Abi Bakr at the\\n\\t\\t\\t\\tend of the night, and I said to her, 'We have arrived at\\n\\t\\t\\t\\tMina at the end of the night,' and she said, 'We used to\\n\\t\\t\\t\\tdo that with one who was better than you.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "182",
    "sectionHeading": "Sending Women and Children Ahead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tTalha ibn Ubaydullah used to send his family and children\\n\\t\\t\\t\\tfrom Muzdalifa to Mina ahead of him.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "183",
    "sectionHeading": "Sending Women and Children Ahead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to.me from Malik that he had heard one of\\n\\t\\t\\t\\tthe people of knowledge disapproving of stoning the jamra\\n\\t\\t\\t\\tuntil after dawn on the day of sacrifice, as it was halal\\n\\t\\t\\t\\tfor whoever had thrown the stones to sacrifice.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "184",
    "sectionHeading": "Sending Women and Children Ahead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\tFatima bint al-Mundhir told him that she used to see Asma\\n\\t\\t\\t\\tbint Abi Bakrat Muzdalifa telling whoever led the subh\\n\\t\\t\\t\\tprayer for her and her companions to pray it as soon as\\n\\t\\t\\t\\tthe dawn broke, after which she would mount and go to\\n\\t\\t\\t\\tMina without stopping at all.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "185",
    "sectionHeading": "Going from Arafa to Muzdalifa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"I was sitting with Usama ibn Zayd when\\n\\t\\t\\t\\tsome one asked him, 'How did the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, travel when he went\\n\\t\\t\\t\\tfrom Arafa to Muzdalifa during the farewell hajj?' and he\\n\\t\\t\\t\\treplied, 'He went at a medium pace, but when he found a\\n\\t\\t\\t\\tgap (in the crowds) he speeded up.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "186",
    "sectionHeading": "Going from Arafa to Muzdalifa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to spur on his mount in the middle of\\n\\t\\t\\t\\tMuhassir over the distance of a stone's throw.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "187",
    "sectionHeading": "Sacrificing during the Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said once at Mina, \"This place (where I have just\\n\\t\\t\\t\\tsacrificed), and the whole of Mina, is a place of\\n\\t\\t\\t\\tsacrifice,\" and he said once during umra, \"This place of\\n\\t\\t\\t\\tsacrifice\" meaning Marwa, \"and all the pathways of Makka\\n\\t\\t\\t\\tand its roads are a place of sacrifice.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "188",
    "sectionHeading": "Sacrificing during the Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat Amra bint Abd ar-Rahman told him that she had heard\\n\\t\\t\\t\\tA'isha, umm al-muminin, saying, \"We set out with the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, when there were five nights left in Dhu'l-Qada and\\n\\t\\t\\t\\twe assumed that we must be setting out for hajj. When we\\n\\t\\t\\t\\tgot near to Makka, the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, told everyone that did not\\n\\t\\t\\t\\thave a sacrificial animal with them to leave ihram after\\n\\t\\t\\t\\tthey had done tawaf of the House and say between Safa and\\n\\t\\t\\t\\tMarwa.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha added, \"We were sent some beef on the day of\\n\\t\\t\\t\\tsacrifice. I asked what it was and they said that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, had sacrificed for his wives.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya ibn Said said, \"I mentioned this hadith to Qasim\\n\\t\\t\\t\\tibn Muhammad and he said, 'She has given you the complete\\n\\t\\t\\t\\thadith, by Allah.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "189",
    "sectionHeading": "Sacrificing during the Hajj",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Hafsa, umm al-muminin, once said to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, \"Why is it that everyone has left ihram and you\\n\\t\\t\\t\\tstill have not left ihram from your umra?\" and he\\n\\t\\t\\t\\treplied, \"I have matted my hair and garlanded my\\n\\t\\t\\t\\tsacrificial animal and will not leave ihram until I have\\n\\t\\t\\t\\tsacrificed the animal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "190",
    "sectionHeading": "How to Make the Sacrifice.",
    "text": "<p>\\n\\t\\t\\t\\t190 Yahya related to me from Malik from Jafar ibn\\n\\t\\t\\t\\tMuhammad from his father from Ali ibn Abi Talib that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, killed some of his sacrificial animals himself,\\n\\t\\t\\t\\tand someone else killed the rest.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "191",
    "sectionHeading": "How to Make the Sacrifice.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"Someone who vows to sacrifice a camel or\\n\\t\\t\\t\\ta cow to Allah should garland it with two sandals about\\n\\t\\t\\t\\tits neck, and brand it by causing blood to flow from its\\n\\t\\t\\t\\tside. He should then sacrifice it either at the House or\\n\\t\\t\\t\\tat Mina on the day of sacrifice. There are no other\\n\\t\\t\\t\\tcorrect places apart from those. However, someone who\\n\\t\\t\\t\\tvows to slaughter a camel or a cow simply as a sacrifice\\n\\t\\t\\t\\tcan sacrifice it wherever he wishes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "192",
    "sectionHeading": "How to Make the Sacrifice.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to kill his sacrificial animals while\\n\\t\\t\\t\\tthey were standing.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No-one is permitted to shave his head until\\n\\t\\t\\t\\the has killed his sacrificial animal, and no-one must\\n\\t\\t\\t\\tsacrifice before dawn on the day of sacrifice. The things\\n\\t\\t\\t\\tthat should be done on the day of sacrifice are\\n\\t\\t\\t\\tslaughtering, donning clothes, grooming the body\\n\\t\\t\\t\\tgenerally (at-tafath) and shaving the head, and none of\\n\\t\\t\\t\\tthis may be done before the day of sacrifice.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "193",
    "sectionHeading": "Shaving the Head",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"O Allah, have mercy on those\\n\\t\\t\\t\\twho shave their hair.\"\\tThey said, \"And those who shorten\\n\\t\\t\\t\\t(their hair), Messenger of Allah.\"   He said, \"O Allah,\\n\\t\\t\\t\\thave mercy on those who shave.\" They said, \"And those who\\n\\t\\t\\t\\tshorten, Messenger of Allah.\" He said, \"And those who\\n\\t\\t\\t\\tshorten.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "194",
    "sectionHeading": "Shaving the Head",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that his father used to go into Makka by night\\n\\t\\t\\t\\twhen he was doing umra and do tawaf of the House and say\\n\\t\\t\\t\\tbetween Safa and Marwa and delay the shaving until the\\n\\t\\t\\t\\tmorning, but he would not go back to the House and do\\n\\t\\t\\t\\ttawaf again until he had shaved his head.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbd ar-Rahman added, \"Sometimes he would enter the mosque\\n\\t\\t\\t\\tand do the witr prayer there without actually going near\\n\\t\\t\\t\\tthe House.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"At-tafath is shaving the head, putting on\\n\\t\\t\\t\\tnormal clothes and things of that nature.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether a man who forgot\\n\\t\\t\\t\\tto shave (his head) at Mina during the hajj could shave\\n\\t\\t\\t\\tin Makka, and he said, \"That is permissible, but I prefer\\n\\t\\t\\t\\tthe shaving to be done at Mina.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What we are all agreed upon here (in Madina)\\n\\t\\t\\t\\tis that no-one should shave his head or cut his hair\\n\\t\\t\\t\\tuntil he has killed his sacrificial animal, if he has\\n\\t\\t\\t\\tone, and things that are haram for him do not become\\n\\t\\t\\t\\thalal for him until he leaves ihram at Mina on the day of\\n\\t\\t\\t\\tsacrifice. This is because Allah, the Blessed and\\n\\t\\t\\t\\tExalted, says, 'Do not shave yourheads until the\\n\\t\\t\\t\\tsacrificial animal has reached its destination. ' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "195",
    "sectionHeading": "Cutting the Hair.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that if Abdullah\\n\\t\\t\\t\\tibn Umar had finished the fast of Ramadan and intended to\\n\\t\\t\\t\\tdo hajj, he would not cut his hair or beard at all until\\n\\t\\t\\t\\the had done hajj.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not necessary for people to do the\\n\\t\\t\\t\\tsame.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "196",
    "sectionHeading": "Cutting the Hair.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to trim his beard and moustache when he\\n\\t\\t\\t\\tshaved at the end of a hajj or umra.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "197",
    "sectionHeading": "Cutting the Hair.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that a man came to Qasim ibn Muhammad and said,\\n\\t\\t\\t\\t\"I did the tawaf al-ifada along with my wife, and then I\\n\\t\\t\\t\\twent off onto a mountain path and approached my wife to\\n\\t\\t\\t\\tmake love to her, and she said, 'I have not cut my hair\\n\\t\\t\\t\\tyet.' So I bit some of her hair off with my teeth and\\n\\t\\t\\t\\tthen had intercourse with her.\"  Qasim laughed and said,\\n\\t\\t\\t\\t\"Tell her to cut her hair with some scissors.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"To my liking an animal should be sacrificed\\n\\t\\t\\t\\tin an instance such as this, because Abdullah ibn Abbas\\n\\t\\t\\t\\tsaid, 'Whoever forgets any of his rites on hajj should\\n\\t\\t\\t\\tsacrifice an animal.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "198",
    "sectionHeading": "Cutting the Hair.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar once met a relative of his called al-Mujabbar\\n\\t\\t\\t\\twho had done the tawaf al-ifada but, out of ignorance,\\n\\t\\t\\t\\thad not shaved his head or cut his hair. Abdullah told\\n\\t\\t\\t\\thim to go back and shave his head or cut his hair, and\\n\\t\\t\\t\\tthen go back and do the tawaf al-ifada.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "199",
    "sectionHeading": "Cutting the Hair.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\twhen Salim ibn Abdullah intended to go into ihram he\\n\\t\\t\\t\\twould call for some scissors and trim his moustache and\\n\\t\\t\\t\\tbeard before setting off and before going into ihram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "200",
    "sectionHeading": "Matting the Hair.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from 'Abdullah\\n\\t\\t\\t\\tibn 'Umar that Umar ibn al-Khattab said, \"Someone who\\n\\t\\t\\t\\tputs plaits in his hair should shave his head, and do not\\n\\t\\t\\t\\tplait your hair in such a way that it seems you have\\n\\t\\t\\t\\tmatted it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "201",
    "sectionHeading": "Matting the Hair.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that Umar ibn al-Khattab said,\\n\\t\\t\\t\\t\"Anyone who has braided his hair, or plaited it or matted\\n\\t\\t\\t\\tit must shave his head.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "202",
    "sectionHeading": "Doing the Prayer in the House, Shortening the Prayer, and Hastening the Khutba at Arafa.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, entered the Kaba with Usama ibn\\n\\t\\t\\t\\tZayd, Bilal ibn Rabah and Uthman ibn Talha al-Hajabi and\\n\\t\\t\\t\\tlocked it behind him and stayed there for some time.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah said that he asked Bilal when he came out what\\n\\t\\t\\t\\tthe Messenger of Allah had done there and he said, \"He\\n\\t\\t\\t\\tpositioned himself with one support to his left, two\\n\\t\\t\\t\\tsupports to his right, and three behind him (the house\\n\\t\\t\\t\\thad six supports at that time) and then he prayed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "203",
    "sectionHeading": "Doing the Prayer in the House, Shortening the Prayer, and Hastening the Khutba at Arafa.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Salim\\n\\t\\t\\t\\tibn Abdullah said, ''Abd al-Malik ibn Marwan wrote to\\n\\t\\t\\t\\tal-Hajjaj ibn Yusuf telling him not to disagree with\\n\\t\\t\\t\\tAbdullah ibn Umar about anything to do with the hajj.\\n\\t\\t\\t\\tThen, when the day of Arafa came Abdullah ibn Umar went\\n\\t\\t\\t\\tto him just after noon, and I went with him. He called\\n\\t\\t\\t\\tout to him outside his tent, 'Where is this man?' and\\n\\t\\t\\t\\ta-lHajjaj came out to him, wearing a blanket dyed with\\n\\t\\t\\t\\tsafflower, and said to him, 'What's up with you, Abu Abd\\n\\t\\t\\t\\tar-Rahman?' He said, 'Hurry up, if you want to follow the\\n\\t\\t\\t\\tsunna.' Al-Hajjaj said, 'At this hour?' and he said,\\n\\t\\t\\t\\t'Yes.' Al-Hajjaj said, 'Wait until I have poured some\\n\\t\\t\\t\\twater over myself, and then I will come out.' So Abdullah\\n\\t\\t\\t\\tdismounted and waited until al-Hajjaj came out. He passed\\n\\t\\t\\t\\tbetween me and my father and I said to him, 'If you want\\n\\t\\t\\t\\tto accord with the sunna today, then make the khutba\\n\\t\\t\\t\\tshort, do not delay the prayer and do the prayer\\n\\t\\t\\t\\tquickly.' Then he began looking at Abdullah ibn Umar to\\n\\t\\t\\t\\tsee if he would say the same thing, and when Abdullah saw\\n\\t\\t\\t\\tthat, he said, 'What Salim is saying is true.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t20.64 Doing the Prayer at Mina on the Eighth Day of\\n\\t\\t\\t\\tDhu-l-Hijja, and the Jumua at Mina and Arafa\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "204",
    "sectionHeading": "Doing the Prayer in the House, Shortening the Prayer, and Hastening the Khutba at Arafa.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to pray dhuhr, asr, maghrib, isha and subh\\n\\t\\t\\t\\tat Mina. Then in the morning, after the sun had risen, he\\n\\t\\t\\t\\twould go to Arafa .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What we are all agreed upon here (in Madina)\\n\\t\\t\\t\\tis that the imam does not recite the Qur'an out loud in\\n\\t\\t\\t\\tdhuhr on the day of Arafa, and that he gives a khutba to\\n\\t\\t\\t\\tthe people on that day, and that the prayer on the day of\\n\\t\\t\\t\\tArafa is really a dhuhr prayer, and even if it coincides\\n\\t\\t\\t\\twith a jumua it is still a dhuhr prayer, but one which\\n\\t\\t\\t\\thas been shortened because of travelling.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that the imam of the pilgrims should not pray\\n\\t\\t\\t\\tthe jumua prayer if the day of Arafa, the day of\\n\\t\\t\\t\\tsacrifice or one of the three days after the day of\\n\\t\\t\\t\\tsacrifice, was a Friday.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "205",
    "sectionHeading": "Doing the Prayer at Muzdalifa.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah from Abdullah ibn Umar that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, prayed\\n\\t\\t\\t\\tmaghrib and isha together at Muzdalifa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "206",
    "sectionHeading": "Doing the Prayer at Muzdalifa.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Musa ibn Uqba that\\n\\t\\t\\t\\tKurayb, the mawla of Ibn 'Abbas, heard Usama ibn Zayd\\n\\t\\t\\t\\tsay, \"The Messenger ofAllah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, left Arafa and then, when he reached\\n\\t\\t\\t\\tash-Shib, he dismounted and urinated and then did wudu,\\n\\t\\t\\t\\tthough not thoroughly. I said to him, 'It is time for the\\n\\t\\t\\t\\tprayer, Messenger of Allah,' and he said 'The prayer is\\n\\t\\t\\t\\tahead of you,' and then mounted. When we arrived at\\n\\t\\t\\t\\tMuzdalifa he dismounted and did wudu thoroughly. Then the\\n\\t\\t\\t\\tiqama was said for the prayer and he prayed maghrib.\\n\\t\\t\\t\\tAfter that everyone settled his camel in its\\n\\t\\t\\t\\tresting-place, and then the iqama for isha was said and\\n\\t\\t\\t\\the prayed it, without having prayed anything between the\\n\\t\\t\\t\\ttwo.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "207",
    "sectionHeading": "Doing the Prayer at Muzdalifa.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAdi ibn Thabit al-Ansari that Abdullah ibn Yazid\\n\\t\\t\\t\\tal-Khatmi told him that Abu Ayyub al-Ansari told him that\\n\\t\\t\\t\\the prayed maghrib and isha together at Muzdalifa during\\n\\t\\t\\t\\tthe farewell hajj, with the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "208",
    "sectionHeading": "Doing the Prayer at Muzdalifa.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to pray maghrib and isha together at\\n\\t\\t\\t\\tMuzdalifa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "209",
    "sectionHeading": "Doing the Prayer at Mina",
    "text": "<p>\\n\\t\\t\\t\\tMalik said that the people of Makka who are doing hajj\\n\\t\\t\\t\\tshould shorten the prayer to two rakas when at Mina until\\n\\t\\t\\t\\tthey go back to Ma ka.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "210",
    "sectionHeading": "Doing the Prayer at Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, prayed four raka prayers with\\n\\t\\t\\t\\tonly two rakas when at Mina, and that Abu Bakr prayed\\n\\t\\t\\t\\tthem at Mina with only two rakas, and that Umar ibn\\n\\t\\t\\t\\tal-Khattab prayed them at Mina with only two rakas, and\\n\\t\\t\\t\\tthat Uthman prayed them at Mina with only two rakas for\\n\\t\\t\\t\\thalf of his khalifate, and then later completed them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "211",
    "sectionHeading": "Doing the Prayer at Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that Umar ibn al-Khattab prayed two rakas\\n\\t\\t\\t\\twith everybody when he arrived in Makka. Then, when he\\n\\t\\t\\t\\thad finished, he said, \"People of Makka, complete your\\n\\t\\t\\t\\tprayer, because we are a group of travellers.\" Later,\\n\\t\\t\\t\\tUmar ibn al-Khattab prayed two rakas with them at Mina,\\n\\t\\t\\t\\tbut we have not heard that he said anything to them on\\n\\t\\t\\t\\tthat occasion.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "212",
    "sectionHeading": "Doing the Prayer at Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\this father that Umar ibn al-Khattab prayed two rakas with\\n\\t\\t\\t\\tthe people of Makka, and then, when he had finished, he\\n\\t\\t\\t\\tsaid, \"People of Makka, complete your prayer, becausewe\\n\\t\\t\\t\\tare a group of travellers.\" Later, Umar prayed two rakas\\n\\t\\t\\t\\twith them at Mina, but we have not heard that he said\\n\\t\\t\\t\\tanything to them on that occasion.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether the people of Makka should pray\\n\\t\\t\\t\\ttwo rakas at Arafa or four, and whether the amir of the\\n\\t\\t\\t\\thajj, if he was a Makkan, should pray dhuhr and asr with\\n\\t\\t\\t\\tfour rakas or two, and also how the people of Makka who\\n\\t\\t\\t\\twere living (at Mina) should pray, and he said, \"The\\n\\t\\t\\t\\tpeople of Makka should pray only two rakas at Arafa and\\n\\t\\t\\t\\tMina for as long as they stay there, and should shorten\\n\\t\\t\\t\\tthe prayer until they return to Makka. The amir of the\\n\\t\\t\\t\\thajj, if he is a Makkan, should also shorten the prayer\\n\\t\\t\\t\\tat Arafa and during the days of Mina. Anyone who is\\n\\t\\t\\t\\tliving at Mina as a resident should do the full prayer at\\n\\t\\t\\t\\tMina, and similarly anyone who lives at Arafa and is a\\n\\t\\t\\t\\tresident there should do the full prayer at Arafa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "213",
    "sectionHeading": "The Prayer of the Visitor of Makka or Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"Someone who comes\\n\\t\\t\\t\\tto Makka at or before the new moon of Dhu'l-Hij ja and\\n\\t\\t\\t\\tgoes into ihram for the hajj should do the full prayer\\n\\t\\t\\t\\tuntil he leaves Makka for Mina, and then he should\\n\\t\\t\\t\\tshorten the prayer. This is because he has decided to\\n\\t\\t\\t\\tstay there for more than four nights.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "214",
    "sectionHeading": "Saying the Takbir During the Days of Tashriq",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the had heard that on the day after the day of sacrifice\\n\\t\\t\\t\\tUmar ibn al-Khattab went out a little after the sun had\\n\\t\\t\\t\\trisen and said the takbir, and everyone repeated it after\\n\\t\\t\\t\\thim. Then he went out a second time the same day when the\\n\\t\\t\\t\\tsun was well up and said the takbir, and everyone\\n\\t\\t\\t\\trepeated it after him. Then he went out a third time\\n\\t\\t\\t\\tafter mid-day and said the takbir, and everyone repeated\\n\\t\\t\\t\\tit after him until it resounded from group to group until\\n\\t\\t\\t\\tit reached the House and people knew that Umar had left\\n\\t\\t\\t\\tto throw the stones.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What we do here (in Madina) is to say the\\n\\t\\t\\t\\ttakbir during the days of tashriq after each prayer. The\\n\\t\\t\\t\\tfirst time is when the imam and everyone with him says\\n\\t\\t\\t\\tthe takbir after the dhuhr prayer on the day of\\n\\t\\t\\t\\tsacrifice, and the last is when the imam and everyone\\n\\t\\t\\t\\twith him says the takbir after subh on the last of the\\n\\t\\t\\t\\tdays of tashriq, after which he stops saying the takbir.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The takbirs during the days of tashriq\\n\\t\\t\\t\\tshould be done by both men and women, whether they are in\\n\\t\\t\\t\\ta group or by themselves, at Mina or elsewhere, and all\\n\\t\\t\\t\\tof the takbirs should be done. In this everyone follows\\n\\t\\t\\t\\tthe imam of the hajj and the people at Mina, because when\\n\\t\\t\\t\\teveryone returns (to Makka) and comes out of ihram they\\n\\t\\t\\t\\tkeep the same people as imams while out of ihram (as they\\n\\t\\t\\t\\tdid when they were in ihram). Some one who is not doing\\n\\t\\t\\t\\thajj does not follow them except for the takbirs during\\n\\t\\t\\t\\tthe days of tashriq.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The 'limited number of days' are the days of\\n\\t\\t\\t\\ttashriq.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "215",
    "sectionHeading": "Doing the Prayer at al-Muarras and al-Muhassab",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, made his camel kneel down at\\n\\t\\t\\t\\tal-Batha, which is at Dhu'l-Hulayfa, and prayed there.\\n\\t\\t\\t\\tNafi said, \"Abdullah ibn Umar used to do that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No-one should go past al-Muarras when he is\\n\\t\\t\\t\\treturning from hajj without praying there. If he passes\\n\\t\\t\\t\\tit at a time when prayer is not permissible he should\\n\\t\\t\\t\\tstay there until prayer is permissible and then pray\\n\\t\\t\\t\\twhatever he feels is appropriate. (This is) because I\\n\\t\\t\\t\\thave heard that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, stopped there to rest, and that\\n\\t\\t\\t\\tAbdullah ibn Umar stopped his camel there also.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "216",
    "sectionHeading": "Doing the Prayer at al-Muarras and al-Muhassab",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to pray dhuhr, asr, maghrib and isha at\\n\\t\\t\\t\\tal-Muhassab, and then enter Makka at night and do tawaf\\n\\t\\t\\t\\tof the House.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "217",
    "sectionHeading": "Staying Overnight at Makka on the Nights of Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Nafi said, \"They say\\n\\t\\t\\t\\tthat Umar ibn al-Khattab used to send men out to bring\\n\\t\\t\\t\\tpeople in from beyond al-Aqaba.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "218",
    "sectionHeading": "Staying Overnight at Makka on the Nights of Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Umar ibn al-Khattab said, \"No-one doing\\n\\t\\t\\t\\thajj should spend the nights of Mina beyond al-Aqaba.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "219",
    "sectionHeading": "Staying Overnight at Makka on the Nights of Mina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, talking about spending the nights of\\n\\t\\t\\t\\tMina at Makka, \"No-one must spend the night anywhere\\n\\t\\t\\t\\texcept Mina.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "220",
    "sectionHeading": "Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab used to stop at the first two jamras\\n\\t\\t\\t\\tfor such a long time that someone standing up would get\\n\\t\\t\\t\\ttired.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "221",
    "sectionHeading": "Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to stop for a long time at the first two\\n\\t\\t\\t\\tjamras saying, \"Allah is greater\", \"Glory be to Allah\",\\n\\t\\t\\t\\t\"Praise be to Allah\", and making duas to Allah, but he\\n\\t\\t\\t\\tdid not stop at the jamrat al-Aqaba.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "222",
    "sectionHeading": "Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say \"Allah is greater\" whenever he threw\\n\\t\\t\\t\\ta pebble while stoning the jamra.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "223",
    "sectionHeading": "Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard some of\\n\\t\\t\\t\\tthe people of knowledge saying, \"The pebbles used for\\n\\t\\t\\t\\tstoning the jamras should be like the stones used as\\n\\t\\t\\t\\tslingshot.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I like it better if they are a little larger\\n\\t\\t\\t\\tthan that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Someone who is at Mina when the\\n\\t\\t\\t\\tsun sets in the middle of the days of tashriq must not\\n\\t\\t\\t\\tleave until he has stoned the jamras on the following\\n\\t\\t\\t\\tday.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "224",
    "sectionHeading": "Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tQasim from his father that when people went to stone the\\n\\t\\t\\t\\tjamras they would walk both going there and coming back.\\n\\t\\t\\t\\tThe first one to ride was Muawiya ibn Abi Sufyan.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "225",
    "sectionHeading": "Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Abd\\n\\t\\t\\t\\tar-Rahman ibn Qasim, \"From where did Qasim stonethe\\n\\t\\t\\t\\tjamrat al-Aqaba?\"and he replied, \"From wherever it was\\n\\t\\t\\t\\tpossible.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether some one else\\n\\t\\t\\t\\tcould throw the stones for a child or a sick man and he\\n\\t\\t\\t\\tsaid, \"Yes, and a sick man should inquire as to when the\\n\\t\\t\\t\\tstones will be thrown for him and then say the takbir\\n\\t\\t\\t\\twhile he is in the place where he is staying, bleeding.\\n\\t\\t\\t\\tIf a sick man regains his health during the days of\\n\\t\\t\\t\\ttashriq, he should stone whatever stoning has been done\\n\\t\\t\\t\\tfor him and he must offer a sacrificial animal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not consider that someone who stones\\n\\t\\t\\t\\tthe jamras or does say between Safa and Marwa without\\n\\t\\t\\t\\tbeing in wudu has to repeat anything, but he should not\\n\\t\\t\\t\\tmake a general practice of it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "226",
    "sectionHeading": "Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"The jamras should not be stoned\\n\\t\\t\\t\\tduring the three days until after the sun has passed the\\n\\t\\t\\t\\tmeridian.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "227",
    "sectionHeading": "Indulgence with Respect to Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazm from his father that Abu'l-Baddah ibn Asim ibn\\n\\t\\t\\t\\tAdi told him from his father that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, allowed the\\n\\t\\t\\t\\tcamel-herders to spend the night outside of Mina, and\\n\\t\\t\\t\\tthey threw the stones (once) on the day of sacrifice, and\\n\\t\\t\\t\\t(once) for the following day and the day after that, and\\n\\t\\t\\t\\t(once) on the day when they left Mina.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "228",
    "sectionHeading": "Indulgence with Respect to Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya ibn Said heard Ata ibn Abi Rabah mentioning that\\n\\t\\t\\t\\tthe camel-herders were allowed to throw the stones at\\n\\t\\t\\t\\tnight, and saying that this was in the early period (of\\n\\t\\t\\t\\tIslam).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of the hadith where the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, allowed the camel-herders to delay the stoning of\\n\\t\\t\\t\\tthe jamras is, in our view, and Allah knows best, that\\n\\t\\t\\t\\tthey threw stones on the day of sacrifice, and then threw\\n\\t\\t\\t\\tagain two days later, which was the first possible day\\n\\t\\t\\t\\tfor leaving, and this throwing was for the day which had\\n\\t\\t\\t\\tpassed. They then threw again for the day itself, because\\n\\t\\t\\t\\tit is only possible for someone to make up for something\\n\\t\\t\\t\\twhich is obligatory for him, and when something\\n\\t\\t\\t\\tobligatory passes someone by (without him doing it) he\\n\\t\\t\\t\\tmust necessarily make it up afterwards (and not\\n\\t\\t\\t\\tbeforehand). So (in the case of the camel-herders), if it\\n\\t\\t\\t\\tseemed appropriate for them to leave that day, they would\\n\\t\\t\\t\\thave done all that they were supposed to do, and if they\\n\\t\\t\\t\\twere to stay until the following day, they would throw\\n\\t\\t\\t\\tstones with everybody else on the second and last day for\\n\\t\\t\\t\\tleaving, and then leave.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "229",
    "sectionHeading": "Indulgence with Respect to Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Bakr ibn Nafi\\n\\t\\t\\t\\tfrom his father that the daughter of one of Safiyya bint\\n\\t\\t\\t\\tAbi Ubayd's brothers was bleeding after she had given\\n\\t\\t\\t\\tbirth to a child at Muzdalifa. She and Safiyya were\\n\\t\\t\\t\\tdelayed and did not arrive at Mina until after the sun\\n\\t\\t\\t\\thad set on the day of sacrifice. Abdullah ibn Umar told\\n\\t\\t\\t\\tthem both to stone the jamra at the time they arrived and\\n\\t\\t\\t\\the did not think that they owed anything.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about some one who forgot\\n\\t\\t\\t\\tto stone one of the jamras on one of the days of Mina\\n\\t\\t\\t\\tuntil it was evening and he said, \"He should throw the\\n\\t\\t\\t\\tstones at whatever time of day or night he remembers,\\n\\t\\t\\t\\tjust as he would pray the prayer if he forgot it and then\\n\\t\\t\\t\\tremembered it at any time of day or night. If he\\n\\t\\t\\t\\tremembers (that he has not done the stoning) after he has\\n\\t\\t\\t\\treturned to Makka, or after he has left, he must\\n\\t\\t\\t\\tsacrifice an animal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "230",
    "sectionHeading": "Indulgence with Respect to Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi and Abdullah ibn\\n\\t\\t\\t\\tDinar from Abdullah ibn Umar that Umar ibn al-Khattab\\n\\t\\t\\t\\tgave a khutba to the people at Arafa and taught them the\\n\\t\\t\\t\\tconduct of the hajj, and one of the things he said to\\n\\t\\t\\t\\tthem in his speech was, \"When you get to Mina and have\\n\\t\\t\\t\\tstoned the jamra then whatever is haram for someone doing\\n\\t\\t\\t\\tthe hajj becomes halal, except women and scent. No-one\\n\\t\\t\\t\\tshould touch women or scent until he has done tawaf of\\n\\t\\t\\t\\tthe House.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "231",
    "sectionHeading": "Indulgence with Respect to Stoning the Jamras",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi and Abdullah ibn\\n\\t\\t\\t\\tDinar from Abdullah ibn Umar that Umar ibn al-Khattab\\n\\t\\t\\t\\tsaid, \"When someone has stoned the jamra and shaved his\\n\\t\\t\\t\\thead or cut off some of his hair and sacrificed an\\n\\t\\t\\t\\tanimal, whatever was haram for him becomes halal, except\\n\\t\\t\\t\\twomen and scent, (which remain haram for him) until he\\n\\t\\t\\t\\thas done tawaf of the House.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "232",
    "sectionHeading": "A Menstruating Woman's Entering Makka",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Abd ar-Rahman ibn al-Qasim, from\\n\\t\\t\\t\\this father that A'isha, umm al-muminin, said, \"We set out\\n\\t\\t\\t\\twith the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, in the year of the farewell hajj and we\\n\\t\\t\\t\\twent into ihram for umra. Afterwards, the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Whoever has a sacrificial animal with him should go into\\n\\t\\t\\t\\tihram for hajj and umra together, and he should not leave\\n\\t\\t\\t\\tihram without leaving ihram for both of them at the same\\n\\t\\t\\t\\ttime.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe continued \"I was menstruating when I got to Makka, so\\n\\t\\t\\t\\tI did not do tawaf of the House or say between Safa and\\n\\t\\t\\t\\tMarwa. I complained to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and he said, 'Undo your\\n\\t\\t\\t\\thair and comb it and leave the umra and go back into\\n\\t\\t\\t\\tihram for the hajj.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe said, \"I did so, and when we had completed the hajj,\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, sent me with Abd ar-Rahman ibn Abi Bakr as-Siddiq\\n\\t\\t\\t\\tto at-Tanim and I performed an umra and he said, 'This is\\n\\t\\t\\t\\tin place of your umra.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"Those who had entered ihram for the umra did tawaf of\\n\\t\\t\\t\\tthe House and say between Safa and Marwa, then left\\n\\t\\t\\t\\tihram. Then they did another tawaf after returning from\\n\\t\\t\\t\\tMina for their hajj, whereas those who entered ihram for\\n\\t\\t\\t\\tthe hajj or combined the hajj and the umra, only did one\\n\\t\\t\\t\\ttawaf.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related the same as that to me from Malik from Ibn\\n\\t\\t\\t\\tShihab from Urwa ibn az-Zubayr from A'isha.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "233",
    "sectionHeading": "A Menstruating Woman's Entering Makka",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that A'isha said, \"I came to\\n\\t\\t\\t\\tMakka at the time of my period so I did not do tawaf of\\n\\t\\t\\t\\tthe House or go between Safa and Marwa. I complained to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and he said, 'Do what the people doing hajj do\\n\\t\\t\\t\\texcept do not do tawaf of the House and go between Safa\\n\\t\\t\\t\\tand Marwa until you are pure.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning a woman who entered ihram for umra\\n\\t\\t\\t\\tat the time of hajj, and she arrived in Makka during her\\n\\t\\t\\t\\tperiod and so could not do tawaf of the House, \"When she\\n\\t\\t\\t\\tfears that the time (for hajj) is getting close, she gets\\n\\t\\t\\t\\tinto ihram for the hajj and sacrifices an animal. She is\\n\\t\\t\\t\\tlike someone who combines the hajj and the umra. One\\n\\t\\t\\t\\ttawaf is enough for her. If a women starts her period\\n\\t\\t\\t\\tafter she has already done tawaf of the House and prayed,\\n\\t\\t\\t\\tshe does say between Safa and Marwa and stops at Arafa\\n\\t\\t\\t\\tand Muzdalifa and stones the jamras but she does not do\\n\\t\\t\\t\\tthe tawaf al-ifada until she is pure and has finished her\\n\\t\\t\\t\\tmenses.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "234",
    "sectionHeading": "The Tawaf al-Ifada of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father from A'isha umm al-muminin that\\n\\t\\t\\t\\tSafiyya bint Huyy began menstruating and so she mentioned\\n\\t\\t\\t\\tit to the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and he asked, \"Will she delay us?\" and\\n\\t\\t\\t\\the was told, \"She has already done the tawaf al-ifada,\"\\n\\t\\t\\t\\tand he said, \"Then she will not delay us. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "235",
    "sectionHeading": "The Tawaf al-Ifada of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazm from his father from Amra bint Abd ar-Rahman\\n\\t\\t\\t\\tthat A'isha umm al-muminin said to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace,\\n\\t\\t\\t\\t\"Messenger of Allah, Safiyya bint Huyy has begun her\\n\\t\\t\\t\\tperiod,\" and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Perhaps she will delay us.\\n\\t\\t\\t\\tHas she done tawaf of the House with you?\" They said, \"Of\\n\\t\\t\\t\\tcourse.\" He said, \"So you are free to leave.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "236",
    "sectionHeading": "The Tawaf al-Ifada of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from AbuRijal Muhammad ibn\\n\\t\\t\\t\\tAbd ar-Rahman from Amra bint Abd ar-Rahman that when\\n\\t\\t\\t\\tA'isha umm al-muminin was doing hajj with women who were\\n\\t\\t\\t\\texpecting their periods, she would hurry them to do the\\n\\t\\t\\t\\ttawaf al-ifada on the Day of Sacrifice. If they started\\n\\t\\t\\t\\tto menstruate after the tawaf al-ifada she did not stop\\n\\t\\t\\t\\tfor them but left with them while they were menstruating.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "237",
    "sectionHeading": "The Tawaf al-Ifada of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from A'isha umm al-muminin that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tmentioned Safiyya bint Huyy and he was told that she had\\n\\t\\t\\t\\tstarted her period. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Perhaps she will\\n\\t\\t\\t\\tdelay us.\" They said, \"Messenger of Allah, she has done\\n\\t\\t\\t\\ttawaf,\" and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Then she will not delay us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Hisham said that Urwa said that A'isha\\n\\t\\t\\t\\tsaid, \"We have publicized that, so why do people make\\n\\t\\t\\t\\ttheir women stay on to their inconvenience? If it were as\\n\\t\\t\\t\\tthey say, more than six thousand menstruating women would\\n\\t\\t\\t\\tstill be in Mina in the morning, all of them having\\n\\t\\t\\t\\talready done the tawaf al-ifada.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "238",
    "sectionHeading": "The Tawaf al-Ifada of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom his father that Abu Salama ibn Abd ar-Rahman told\\n\\t\\t\\t\\thim that Umm Sulaym bint Milhan asked the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, for\\n\\t\\t\\t\\tadvice one time when she had begun menstruating, or had\\n\\t\\t\\t\\tgiven birth to a child after she had done tawaf al-ifada\\n\\t\\t\\t\\ton the Day of Sacrifice. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, gave her permission\\n\\t\\t\\t\\tto leave.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A woman menstruating at Mina stays until she\\n\\t\\t\\t\\thas done tawaf of the House. There is no escape from that\\n\\t\\t\\t\\tfor her. If she has already done the tawaf al-ifada and\\n\\t\\t\\t\\tshe starts to menstruate afterwards, she may leave for\\n\\t\\t\\t\\ther country, since permission for the menstruating women\\n\\t\\t\\t\\tto leave has been transmitted to us from the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe added, \"If a woman starts her period at Mina before\\n\\t\\t\\t\\tshe does the tawaf al-ifada, and the period lasts longer\\n\\t\\t\\t\\tthan usual, she has to stay longer than the time that\\n\\t\\t\\t\\tbleeding would usually detain women.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "239",
    "sectionHeading": "The Compensation (Fidya) for Killing Birds and Wild Animals in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr that\\n\\t\\t\\t\\tUmar ibn al-Khattab gave the judgement of a ram for a\\n\\t\\t\\t\\thyena, a female goat for a gazelle, a she-goat less than\\n\\t\\t\\t\\tone year old for a rabbit, and a four month old kid for a\\n\\t\\t\\t\\tjerboa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "240",
    "sectionHeading": "The Compensation (Fidya) for Killing Birds and Wild Animals in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd al-Malik ibn\\n\\t\\t\\t\\tQurayr from Muhammad ibn Sirin that a man came to Umar\\n\\t\\t\\t\\tibn al-Khattab and said, \"I was racing a friend on\\n\\t\\t\\t\\thorseback towards a narrow mountain trail and we killed a\\n\\t\\t\\t\\tgazelle accidently and we were in ihram. What is your\\n\\t\\t\\t\\topinion?\" Umar said to a man by his side, \"Come, so that\\n\\t\\t\\t\\tyou and I may make an assessment.\" They decided on a\\n\\t\\t\\t\\tfemale goat for him, and the man turned away saying,\\n\\t\\t\\t\\t\"This amir al-muminin cannot even make an assessment in\\n\\t\\t\\t\\tthe case of a gazelle until he calls a man to decide with\\n\\t\\t\\t\\thim.\" Umar overheard the man's words and called him and\\n\\t\\t\\t\\tasked him, \"Do you recite surat al-Ma'ida?\" and he said,\\n\\t\\t\\t\\t\"No.\" He said, \"Then do you recognize this man who has\\n\\t\\t\\t\\ttaken the decision with me?\" and he said, \"No.\" He said,\\n\\t\\t\\t\\t\"If you had told me that you did recite surat al-Ma'ida,\\n\\t\\t\\t\\tI would have dealt you a blow.\" Then he said, \"Allah the\\n\\t\\t\\t\\tBlessed, the Exalted says in His Book, 'as shall be\\n\\t\\t\\t\\tjudged by two men of justice among you, a sacrificial\\n\\t\\t\\t\\tanimal to reach the Kaba' (Sura 5 ayat 95), and this is\\n\\t\\t\\t\\tAbd ar-Rahman ibn Awf.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "241",
    "sectionHeading": "The Compensation (Fidya) for Killing Birds and Wild Animals in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to say, \"For the female of wild animals a\\n\\t\\t\\t\\tcow is given and for the female of gazelles a sheep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "242",
    "sectionHeading": "The Compensation (Fidya) for Killing Birds and Wild Animals in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to say, \"For the pigeon of\\n\\t\\t\\t\\tMakka, when it is killed, a sheep is due.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, that if a man of the people of Makka were to\\n\\t\\t\\t\\tenter ihram for hajj or umra and there was a flock of\\n\\t\\t\\t\\tMakkan pigeons in his house and they were shut in and\\n\\t\\t\\t\\tdied, \"I think that he should pay for that with a sheep\\n\\t\\t\\t\\tfor each bird.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "243",
    "sectionHeading": "The Compensation (Fidya) for Killing Birds and Wild Animals in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, I still hear that when a person in ihram\\n\\t\\t\\t\\tkills an ostrich, a camel is due.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I think that for an ostrich egg, one tenth\\n\\t\\t\\t\\tof the price of a camel is due in the same way that there\\n\\t\\t\\t\\tis a newly-born male or female slave for the unborn child\\n\\t\\t\\t\\tof a free woman. The value of the newly-born slave is\\n\\t\\t\\t\\tfifty dinars, and that is one-tenth of what the\\n\\t\\t\\t\\tblood-money for the mother would be.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"Birds from the eagle family, eagles or falcons or\\n\\t\\t\\t\\tvultures count as game for which a price is paid just as\\n\\t\\t\\t\\ta price is paid for any game which a person in ihram\\n\\t\\t\\t\\tkills. For everything for which a penalty is paid, the\\n\\t\\t\\t\\tassessment is the same, whether the animal is old or\\n\\t\\t\\t\\tyoung. The analogy of that is that the blood-money for\\n\\t\\t\\t\\tthe young and the old freeman, are considered to be the\\n\\t\\t\\t\\tsame.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "244",
    "sectionHeading": "The Fidya for Killing Locusts in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that a\\n\\t\\t\\t\\tman came to Umar ibn al-Khattab and said, \"Amir\\n\\t\\t\\t\\tal-muminin, I killed some locusts with my whip when I was\\n\\t\\t\\t\\tin ihram,\" and Umar said to him, \"Give a handful of\\n\\t\\t\\t\\tfood.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "245",
    "sectionHeading": "The Fidya for Killing Locusts in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that a\\n\\t\\t\\t\\tman came to Umar ibn al-Khattab and asked him about some\\n\\t\\t\\t\\tlocusts he had killed while he was in ihram. Umar said to\\n\\t\\t\\t\\tKab, \"Come, let's decide.\" Kab said, \"A dirham,\" and Umar\\n\\t\\t\\t\\tsaid to Kab, \"You can find dirhams. A date is better than\\n\\t\\t\\t\\ta locust.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "246",
    "sectionHeading": "The Fidya for Killing Locusts in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd al-Karim ibn\\n\\t\\t\\t\\tMalik al-Jazari from Abd ar-Rahman ibn Abi Layla from Kab\\n\\t\\t\\t\\tibn Ujra that one time he was with the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, in ihram,\\n\\t\\t\\t\\tand he was suffering from lice on his head. The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, told\\n\\t\\t\\t\\thim to shave his head, saying, \"Fast three days, or feed\\n\\t\\t\\t\\tsix poor people, two mudds for each person, or sacrifice\\n\\t\\t\\t\\ta sheep. If you do any of those it will be enough for\\n\\t\\t\\t\\tyou.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "247",
    "sectionHeading": "The Fidya for Killing Locusts in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd bin Qays from\\n\\t\\t\\t\\tMujahid Abu'l Hajjaj from Ibn Abi Layla from Kab ibn Ujra\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said to him, \"Perhaps your pests are\\n\\t\\t\\t\\ttroubling you?\" He replied that indeed they were, and the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Shave your head and fast three days or feed\\n\\t\\t\\t\\tsix poor men or sacrifice a sheep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "248",
    "sectionHeading": "The Fidya for Killing Locusts in Ihram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ata ibn Abdullah\\n\\t\\t\\t\\tal-Khurasani said that an old man from Suq al-Buram in\\n\\t\\t\\t\\tKufa had related to him that Kab ibn Ujra said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came to me while I was blowing under a cooking pot\\n\\t\\t\\t\\tbelonging to my companions and my head and beard were\\n\\t\\t\\t\\tfull of lice. He took my forehead and said, 'Shave your\\n\\t\\t\\t\\thair and fast three days or feed six poor people.'  The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was aware that I did not have anything with me to\\n\\t\\t\\t\\tsacrifice.'\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning paying compensation (fidya) for\\n\\t\\t\\t\\tthe relief of physical discomfort, \"The custom concerning\\n\\t\\t\\t\\tit is that no one pays compensation until he has done\\n\\t\\t\\t\\tsomething which makes it obligatory to pay compensation\\n\\t\\t\\t\\tjust as making amends (kaffara) is only done when it has\\n\\t\\t\\t\\tbecome obligatory for the one who owes it. The person can\\n\\t\\t\\t\\tpay the compensation wherever he wishes, regardless of\\n\\t\\t\\t\\twhether he has to sacrifice an animal or fast or give\\n\\t\\t\\t\\tsadaqa -- in Makka or in any other town.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not correct for a person in ihram to\\n\\t\\t\\t\\tpluck out any of his hair or to shave it or cut it until\\n\\t\\t\\t\\the has left ihram, unless he is suffering from an ailment\\n\\t\\t\\t\\tof the head, in which case he owes the compensation Allah\\n\\t\\t\\t\\tthe Exalted has ordered. It is not correct for a person\\n\\t\\t\\t\\tin ihram to cut his nails, or to kill his lice, or to\\n\\t\\t\\t\\tremove them from his head or from his skin or his garment\\n\\t\\t\\t\\tto the ground. If a person in ihram removes lice from his\\n\\t\\t\\t\\tskin or his garment, he must give away the quantity of\\n\\t\\t\\t\\tfood that he can scoop up with both hands. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said,\"Anyone who, while in ihram, plucks out hairs\\n\\t\\t\\t\\tfrom his nose or armpit or rubs his body with a\\n\\t\\t\\t\\tdepilatory agent or shaves the hair from around a head\\n\\t\\t\\t\\twound out of necessity or shaves his neck for the place\\n\\t\\t\\t\\tof the cupping glasses, regardless of whether it is in\\n\\t\\t\\t\\tforgetfulness or in ignorance, owes compensation in all\\n\\t\\t\\t\\tthese instances, and he must not shave the place of the\\n\\t\\t\\t\\tcupping glasses. Someone, who, out of ignorance, shaves\\n\\t\\t\\t\\this head before he stones the jamra. must also pay\\n\\t\\t\\t\\tcompensation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "249",
    "sectionHeading": "What to Do for Forgetfulness in the Rituals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Abi Tamima\\n\\t\\t\\t\\tas-Sakhtayani from Said ibn Jubayr that Abdullah ibn\\n\\t\\t\\t\\tAbbas said, \"If someone forgets anything of the rituals\\n\\t\\t\\t\\tor omits them intentionally, he must slaughter an\\n\\t\\t\\t\\tanimal.\" Ayyub added \"I do not know if he said 'Omits' or\\n\\t\\t\\t\\t'forgets'.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If it is a hady that has to be slaughtered\\n\\t\\t\\t\\tit may only be done in Makka, but if it is a sacrifice,\\n\\t\\t\\t\\tit may be slaughtered wherever the one who owes the\\n\\t\\t\\t\\tsacrifice prefers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "250",
    "sectionHeading": "Compensation (Fidya) in General",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, concerning someone who wishes to wear clothes\\n\\t\\t\\t\\tthat a person in ihram must not wear, or cut his hair, or\\n\\t\\t\\t\\ttouch perfume without necessity, because he finds it easy\\n\\t\\t\\t\\tto pay the compensation, \"No-one must do such things.\\n\\t\\t\\t\\tThey are only allowed in cases of necessity, and\\n\\t\\t\\t\\tcompensation is owed by whoever does them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether the culprit could choose for\\n\\t\\t\\t\\thimself the method of compensation he makes, and he was\\n\\t\\t\\t\\tasked what kind of animal was to be sacrificed, and how\\n\\t\\t\\t\\tmuch food was to be given, and how many days were to be\\n\\t\\t\\t\\tfasted, and whether the person could delay any of these,\\n\\t\\t\\t\\tor if they had to be done immediately. He answered,\\n\\t\\t\\t\\t'Whenever there are alternatives in the Book of Allah for\\n\\t\\t\\t\\tthe kaffara, the culprit can choose to do whichever of\\n\\t\\t\\t\\tthe alternatives he prefers. As for the sacrifice - a\\n\\t\\t\\t\\tsheep, and as for the fasting - three days. As for the\\n\\t\\t\\t\\tfood - feeding six poor men, for every poor man two\\n\\t\\t\\t\\tmudds, by the first mudd, the mudd of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard one of the people of knowledge\\n\\t\\t\\t\\tsaying, 'When a person in ihram throws something and hits\\n\\t\\t\\t\\tgame unintentionally and kills it, he must pay\\n\\t\\t\\t\\tcompensation. In the same way, someone outside the Haram\\n\\t\\t\\t\\twho throws anything into the Haram and hits game he did\\n\\t\\t\\t\\tnot intend to, killing it, has to pay compensation,\\n\\t\\t\\t\\tbecause the intentional and the mistaken are in the same\\n\\t\\t\\t\\tposition in this matter.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning people who kill game together\\n\\t\\t\\t\\twhile they are muhrim or in the Haram, \"I think that each\\n\\t\\t\\t\\tone of them owes a full share. If a sacrificial animal is\\n\\t\\t\\t\\tdecided for them, each one of them owes one, and if\\n\\t\\t\\t\\tfasting is decided for them, the full fasting is owed by\\n\\t\\t\\t\\teach one of them. The analogy of that is a group of\\n\\t\\t\\t\\tpeople who kill a man by mistake and the kaffara for that\\n\\t\\t\\t\\tis that each person among them must free a slave or fast\\n\\t\\t\\t\\ttwo consecutive months.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Anyone who stones or hunts game after\\n\\t\\t\\t\\tstoning the jamra and shaving his head but before he has\\n\\t\\t\\t\\tperformed the tawaf al-ifada, owes compensation for that\\n\\t\\t\\t\\tgame, because Allah the Blessed, the Exalted said, 'And\\n\\t\\t\\t\\twhen you leave ihram, then hunt,' and restrictions still\\n\\t\\t\\t\\tremain for someone who has not done the tawaf al-ifada\\n\\t\\t\\t\\tabout touching perfume and women.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The person in ihram does not owe anything\\n\\t\\t\\t\\tfor plants he cuts down in the Haram and it has not\\n\\t\\t\\t\\treached us that anyone has given a decision of anything\\n\\t\\t\\t\\tfor it, but O how wrong is what he has done! \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning some one who was ignorant of, or\\n\\t\\t\\t\\twho forgot the fast of three days in the hajj, or who was\\n\\t\\t\\t\\till during them and so did not fast them until he had\\n\\t\\t\\t\\treturned to his community, \"He must offer a sacrificial\\n\\t\\t\\t\\tanimal (hady) if he can find one and if not he must fast\\n\\t\\t\\t\\tthe three days among his people and the remaining seven\\n\\t\\t\\t\\tafter that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "251",
    "sectionHeading": "Compensation (Fidya) in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from clsa\\n\\t\\t\\t\\tibn Talha that Abdullah ibn Amr ibn al-As said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, stopped for the people at Mina, and they\\n\\t\\t\\t\\tquestioned him and a man came and said to him, 'Messenger\\n\\t\\t\\t\\tof Allah, I was unclear about what to do and I shaved\\n\\t\\t\\t\\tbefore sacrificing,' and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'Sacrifice,\\n\\t\\t\\t\\tand don't worry.' Then another came to him and said\\n\\t\\t\\t\\t'Messenger of Allah, I was unclear about what to do and I\\n\\t\\t\\t\\tsacrificed before throwing the stones.' He advised,\\n\\t\\t\\t\\t'Throw, and don't worry.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAmr continued, saying that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, was not asked about\\n\\t\\t\\t\\tanything done before or after without his saying, \"Do it,\\n\\t\\t\\t\\tand don't worry.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "252",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that when the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, returned from a military\\n\\t\\t\\t\\texpedition or a hajj or an umra, he used to say three\\n\\t\\t\\t\\ttakbirs on every elevated part of the land, and then he\\n\\t\\t\\t\\tused to say, \"There is no god but Allah, alone, without\\n\\t\\t\\t\\tpartner. To Him belongs the Kingdom and to Him belongs\\n\\t\\t\\t\\tthe praise and He has power over everything. Returning,\\n\\t\\t\\t\\tmaking tawba, serving, prostrating, praising our Lord.\\n\\t\\t\\t\\tAllah has promised truly and given His slave victory and\\n\\t\\t\\t\\tdefeated the tribes alone.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "253",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibrahim ibn Uqba from\\n\\t\\t\\t\\tKurayb the mawla of Abdullah ibn Abbas from Ibn Abbas\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, passed a woman in a litter and it was\\n\\t\\t\\t\\tsaid to her, \"This is the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace,\" and she took the forearms\\n\\t\\t\\t\\tof a young boy who was with her and said, \"Does this one\\n\\t\\t\\t\\thave a hajj, Messenger of Allah?\" and he said, \"Yes, and\\n\\t\\t\\t\\tyou have a reward.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "254",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibrahim ibn Abi Abla\\n\\t\\t\\t\\tfrom Talha ibn Ubaydullah ibn Kariyz that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Shaytan is not considered more abased or more cast out\\n\\t\\t\\t\\tor more contemptible or more angry on any day than on the\\n\\t\\t\\t\\tDay of Arafa. That is only because he sees the descent of\\n\\t\\t\\t\\tthe Mercy and Allah's disregard for great wrong actions.\\n\\t\\t\\t\\tThat is except from what he was shown on the Day of\\n\\t\\t\\t\\tBadr.\" Someone said, \"What was he shown on the Day of\\n\\t\\t\\t\\tBadr, Messenger of Allah?\" He said, \"Didn't he see Jibril\\n\\t\\t\\t\\tarranging the ranks of the angels?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "255",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zihad ibn Abi Ziyad\\n\\t\\t\\t\\tthe mawla of Abdullah ibn Ayyash ibn Abi Rabia from Talha\\n\\t\\t\\t\\tibn Ubaydullah ibn Kariyz that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"The most\\n\\t\\t\\t\\texcellent dua is the dua on the Day of Arafa, and the\\n\\t\\t\\t\\tbest of what I and the prophets before me have said, is\\n\\t\\t\\t\\t'There is no god but Allah, alone, without partner.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "256",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Anas\\n\\t\\t\\t\\tibn Malik that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, entered Makka, in the Year of\\n\\t\\t\\t\\tVictory, wearing a helmet, and when he took it off a man\\n\\t\\t\\t\\tcame to him and said, \"Messenger of Allah, Ibn Khatal is\\n\\t\\t\\t\\tclinging to the covers of the Kaba,'' and the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Kill him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was not in ihram at the time,\\n\\t\\t\\t\\tand Allah knows best.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "257",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar was coming from Makka and when he was at Qudayd,\\n\\t\\t\\t\\tnews came to him from Madina and he returned and entered\\n\\t\\t\\t\\tMakka without ihram.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related the same as that to me from Malik from Ibn\\n\\t\\t\\t\\tShihab.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "258",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Amr ibn\\n\\t\\t\\t\\tHalhala ad-Dili from Muhammad ibn lmran al-Ansari that\\n\\t\\t\\t\\this father said that Abdullah ibn Umar came upon him\\n\\t\\t\\t\\twhile he stopped for a rest under a tall tree on the road\\n\\t\\t\\t\\tto Makka, and he said, \"What has made you stop under this\\n\\t\\t\\t\\ttall tree?\" He replied that he sought it's shade.\\n\\t\\t\\t\\tAbdullah ibn Umar said, \"Anything besides that?\" and he\\n\\t\\t\\t\\tsaid, \"No, that was the only. reason he stopped for a\\n\\t\\t\\t\\trest,\" and Abdullah ibn Umar said, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'If\\n\\t\\t\\t\\tyou are between al-Akhshabayn (which are two mountains)\\n\\t\\t\\t\\tnear Mina,'  indicating the east with his outspread hand,\\n\\t\\t\\t\\t'you will find a valley called as-Surar with a tree in it\\n\\t\\t\\t\\tbeneath which the umbilical cords of seventy prophets\\n\\t\\t\\t\\thave been cut.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "259",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazm from Ibn\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbi Mulayka that Umar ibn al-Khattab passed a leprous\\n\\t\\t\\t\\twoman doing tawaf of the House, and he said to her,\\n\\t\\t\\t\\t\"Slave of Allah, do not make people uneasy. Better that\\n\\t\\t\\t\\tyou stay in your house,\" so she did so. A man passed by\\n\\t\\t\\t\\ther after that and said to her, \"The one who forbade you\\n\\t\\t\\t\\thas died, so come out,\" and she replied, \"I am not going\\n\\t\\t\\t\\tto obey him when he is alive and disobey him when he is\\n\\t\\t\\t\\tdead.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "260",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Abbas used to say that the area between the\\n\\t\\t\\t\\tcorner of the Black Stone and the door of the Kaba was\\n\\t\\t\\t\\tcalled al-Multazam.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "261",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said heard\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban mentioning that a certain\\n\\t\\t\\t\\tman passed Abu Dharr at ar-Rabadha (which was about 30\\n\\t\\t\\t\\tmiles from Madina) and Abu Dharr asked him, \"Where are\\n\\t\\t\\t\\tyou heading to?\" and he replied, \"I am intending to do\\n\\t\\t\\t\\thajj.\" Abu Dharr questioned, \"Has anything else brought\\n\\t\\t\\t\\tyou out?\" and he said, \"No,\" so Abu Dharr said \"Resume\\n\\t\\t\\t\\twhat you are doing wholeheartedly.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe man related, \"I went on till I came to Makka and I\\n\\t\\t\\t\\tstayed as long as Allah willed. Suddenly, one time, I was\\n\\t\\t\\t\\twith a crowd of people thronging about a man and I pushed\\n\\t\\t\\t\\tthrough the people to him and it was the old man that I\\n\\t\\t\\t\\thad come across at ar-Rabadha. When he saw me, he\\n\\t\\t\\t\\trecognized me and said, 'Ah, you have done what I told\\n\\t\\t\\t\\tyou.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "262",
    "sectionHeading": "The Hajj in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Ibn Shihab\\n\\t\\t\\t\\tabout making a condition in the hajj that one could leave\\n\\t\\t\\t\\tihram at any place where an obstacle befell one and he\\n\\t\\t\\t\\tsaid, \"Does anyone do that?' and disapproved of it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man could cut plants from the\\n\\t\\t\\t\\tHaram for his mount, and he said, \"No.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "263",
    "sectionHeading": "The Hajj of a Woman without a Mahram ",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, concerning a woman who had never been on\\n\\t\\t\\t\\thajj, \"If she doesn't have a mahram, or if she has, but\\n\\t\\t\\t\\the cannot come with her, she does not abandon Allah's\\n\\t\\t\\t\\tmaking of the hajj obligatory for her. Let her go in a\\n\\t\\t\\t\\tgroup of women.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "20",
    "hadithNumber": "264",
    "sectionHeading": "Fasting in at-Tamattu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr that A'isha umm al-muminin used to say,\\n\\t\\t\\t\\t\"Someone performing hajj at-tamattu who does not have a\\n\\t\\t\\t\\tsacrificial animal fasts (three days) from the time he\\n\\t\\t\\t\\tenters ihram for the hajj till the Day of Arafa, and if\\n\\t\\t\\t\\the does not fast then, he fasts the days of Mina.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Umar used to say the same\\n\\t\\t\\t\\tconcerning that, as the words of A'isha, may Allah the\\n\\t\\t\\t\\tExalted be pleased with her.\\n\\t\\t\\t</p>"
  }
]
